[
 [
  "79.225b",
  "མཛད་ནས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་ཆོས་ཀྱི་ཕུང་པོ་བརྒྱད་ཁྲི་བཞི་སྟོང་གང་ཡིན་པ་དང་། ཆོས་ཀྱི་རྣམ་གྲངས་འདི་གང་ཡིན་པ་དེ་དག་ནི་མཉམ་<span class='delete'>པའི་</span><span class='add'>པའི་</span>ཕྱིར་ཁྱོད་ཀྱིས་ཀུན་ནས་\nསྒོའི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཟུང་ཤིག །ཆོངས་ཤིག །ལྷོགས་ཤིག །ཀུན་<span class='delete'>ཆུག་</span><span class='add'>ཆུབ་</span>པར་གྱིས་ཤིག །གཞན་དག་ལ་ཡང་རྒྱ་ཆེར་ཡང་དག་པར་རབ་ཏུ་སྟོན་ཅིག །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཀུན་དགའ་བོ་དེ་བཞིན་གཤེགས་\nཔ་ནི་ཀུན་ནས་སྒོའི་ཆོས་ཀྱི་དབྱིངས་འདི་ལེགས་པར་ཐུགས་སུ་ཆུད་ནས་སེམས་ཅན་རྣམས་ལ་ཆོས་ཀྱི་ཕུང་པོ་བརྒྱད་ཁྲི་བཞི་སྟོང་སྟོན་པར་མཛད་པའི་ཕྱིར་རོ། །ཀུན་དགའ་བོ་དེ་ལྟ་བས་ན་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་\nལེགས་པར་བསྲུང་བ་དང་། ལེགས་པར་གཟུང་བ་དང་། ལེགས་པར་ཀུན་ཆུབ་<span class='delete'>པར་</span><span class='add'>པར་</span>གྱིས་ཤིག །བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དྲི་མ་མེད་པའི་\nསྙིང་པོ་དང་། འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་དང་། ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་དང་། ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དང་། དྲི་ཟར་བཅས་པའི་འཇིག་རྟེན་ཡི་རངས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་<span class='delete'>པར་</span><span class='add'>པར་</span>\nབསྟོད་དོ།། །།འཕགས་པ་དཀོན་མཆོག་བརྩེགས་པ་ཆེན་པོའི་ཆོས་ཀྱི་རྣམ་གྲངས་ལེའུ་སྟོང་ཕྲག་བརྒྱ་པ་ལས། ཀུན་ནས་སྒོའི་ལེའུ་ཞེས་བྱ་བ་སྟེ་ལེའུ་བཅུ་པ་རྫོགས་སོ། །།རྒྱ་གར་གྱི་མཁན་པོ་ཛི་ན་མི་ཏྲ་\nདང་། སུ་རེན་དྲ་བོ་དྷི་དང་། ཞུ་ཆེན་གྱི་ལོ་ཙྪ་བ་བན་དེ་ཡེ་ཤེས་སྡེས་བསྒྱུར་ཅིང་ཞུས་ཏེ་གཏན་ལ་ཕབ་པ།། །།ཡེ་<span class='delete'>དྷ་</span><span class='add'>དྷ</span>རྨཱ་ཧེ་ཧུ་པྲ་བྷ་བཱ་ཧེ་<span class='delete'>ཏུ་</span><span class='add'>ཏུ</span>ནྷེ་ཥཱ་ན་ཏ་ཐཱ་ག་<span class='delete'>ཏོ་་</span><span class='add'>ཏོ་ཧྱ་</span>བ་ད་ཏ། ཏེ་<span class='delete'>ཥཱཉྩྨ་</span><span class='add'>ཥཱཉྩ </span>ཡོ་ནི་རོ་དྷ་<span class='delete'>ཨེབྃ་</span><span class='add'>ཨེ་བྃ་</span>བཱ་དཱི་མ་ཧཱ་ཤྲ་མུ་ཎཿ །། \n༄། <span class='delete'>ཧ །</span><span class='add'>ཧ །</span>འཕགས་པ་དཀོན་མཆོག་བརྩེགས་པ་ཆེན་པོ་ཆོས་ཀྱི་རྣམ་གྲངས་ལེའུ་སྟོང་ཕྲག་བརྒྱ་པ་ལས་ལེའུ་བཅུ་གཅིག་པ་སྟེ། འོད་ཟེར་ཀུན་དུ་བཀྱེ་བ་བསྟན་པ། བམ་པོ་དང་པོ། རྒྱ་གར་སྐད་དུ།། <span class='delete'>ཨཱརྻ་</span><span class='add'>ཨཱརྱ་</span>རཤྨི་ས་མན་ཏ་"
 ],
 [
  "79.226b",
  "དང་། མཐའ་མ་མཆིས་པའི་འོད་ཟེར་དང་། ཤིན་དུ་མཐའ་མ་མཆིས་པའི་འོད་ཟེར་དང་། ཚད་མ་མཆིས་པའི་འོད་ཟེར་དང་། ཤིན་དུ་ཚད་མ་མཆིས་པའི་འོད་ཟེར་དང་། གྲངས་ཀྱི་ཚད་མ་མཆིས་པའི་འོད་ཟེར་དང་། \nཤིན་དུ་གྲངས་ཀྱི་ཚད་མ་མཆིས་པའི་འོད་ཟེར་དང་། མྱུར་བའི་འོད་ཟེར་དང་། ཤིན་དུ་མྱུར་བའི་འོད་ཟེར་དང་། གནས་པ་མ་མཆིས་པའི་འོད་ཟེར་དང་། གནས་མ་མཆིས་པའི་འོད་ཟེར་དང་། རབ་ཏུ་འབར་བའི་\nའོད་ཟེར་དང་། སྣང་བར་བགྱིད་པའི་འོད་ཟེར་དང་། མོས་པར་བགྱིད་པའི་འོད་ཟེར་དང་། ཕ་རོལ་དུ་ཕྱིན་པར་བགྱིད་པའི་འོད་ཟེར་དང་། ཐོགས་པ་མ་མཆིས་པའི་འོད་ཟེར་དང་། གཡོ་བ་མ་མཆིས་པའི་འོད་\nཟེར་དང་། <span class='delete'>དྲག་</span><span class='add'>དྲང་</span>པོའི་འོད་ཟེར་དང་། དཔག་ཏུ་མ་མཆིས་པ་ལ་གནས་པའི་འོད་ཟེར་དང་། གཟུགས་ཀྱི་མཚན་གྱི་འོད་ཟེར་དང་། གཟུགས་ཀྱི་མཚན་སྣ་ཚོགས་ཀྱི་འོད་ཟེར་དང་། གཟུགས་ཀྱི་མཚན་<span class='delete'>ཚང་</span><span class='add'>ཚད་</span>མ་མཆིས་\nཔའི་འོད་ཟེར་དང་། ཁ་དོག་སྔོན་པོ་དང་། སེར་པོ་དང་། དམར་པོ་དང་། དཀར་པོའི་མཚན་ཉིད་ཀྱི་འོད་ཟེར་དང་། ཁ་དོག་ལེ་བརྒན་གྱི་མཚན་ཉིད་ཀྱི་འོད་ཟེར་དང་། ཆུ་ཤེལ་གྱི་ཁ་དོག་གི་མཚན་ཉིད་ཀྱི་འོད་ཟེར་དང་། \nནམ་མཁའི་ཁ་དོག་གི་མཚན་ཉིད་ཀྱི་འོད་ཟེར་དང་། འདི་ལྟ་བུ་ལ་སོགས་པ་རྣམ་པ་སྣ་ཚོགས་ཀྱི་འོད་ཟེར་རེ་རེ་ཀུན་ཀྱང་ཁ་དོག་རྣམ་པ་ལྔའི་འོད་ཟེར་འདྲེས་པར་གྱུར་<span class='delete'>པ་</span><span class='add'>པ་</span>སྟོན་པར་མཛད་པ་ནས་ཁ་དོག་སྔོན་པོ་དང་། སེར་པོ་དང་། \nདམར་པོ་དང་། དཀར་པོའི་དངོས་པོ་རེ་རེ་ཀུན་ཀྱང་འོད་ཟེར་ཁ་དོག་རྣམ་པ་སྣ་ཚོགས་ཚད་མ་མཆིས་པ་དཔག་ཏུ་མ་མཆིས་པ་དག་དང་འདྲེས་པར་གྱུར་པ་རབ་ཏུ་སྟོན་པར་མཛད་པའི་བར་དུ་བརྙེས་པར་གྱུར་ལགས། དེ་ནས་བཅོམ་\nལྡན་འདས་ཀྱིས་ཟླ་འོད་གཞོན་ནུར་གྱུར་པ་ལ་ཚིགས་སུ་བཅད་དེ་བཀའ་སྩལ་པ། <span class='delete'>ད་</span><span class='add'>ང་</span>ནི་བསམ་གྱིས་མི་ཁྱབ་པའི། །དགེ་བའི་ལས་ཀྱི་རྒྱུ་རྐྱེན་གྱིས། །རྨོངས་པ་རྣམས་ནི་རབ་སྤངས་<span class='delete'>པས། </span><span class='add'>པས། །</span>འོད་ཟེར་སྣ་ཚོགས་གྲུབ་པ་ཡིན། །"
 ],
 [
  "79.228a",
  "སོ་སོར་རབ་འབྲིང་ཐ་མ་ཡང་། །རྗེས་སུ་ཡི་རང་ལས་སྐྱེས་ཡིན། །རེས་འགའ་དངོས་པོ་གཅིག་ལས་ནི། །ཁ་དོག་བྱེ་བ་གསུམ་སྟོན་པ། །སོ་སོར་རབ་འབྲིང་ཐ་མ་ཡང་། །ཤིན་དུ་སྦྱངས་ལས་སྐྱེས་\n<span class='delete'>བ་</span><span class='add'>པ་</span>ཡིན། །རེས་འགའ་དངོས་པོ་གཅིག་ལས་ནི། །ཁ་དོག་བྱེ་བ་བཞི་སྟོན་པ། །སོ་སོར་རབ་འབྲིང་ཐ་མ་ཡང་། །སངས་རྒྱས་གུས་ལས་སྐྱེས་པ་ཡིན། །རེས་འགའ་དངོས་པོ་གཅིག་ལས་ནི། །ཁ་དོག་བྱེ་བ་\nལྔ་སྟོན་པ། །སོ་སོར་རབ་འབྲིང་ཐ་མ་ཡང་། །ཆོས་ལ་གུས་ལས་སྐྱེས་པ་ཡིན། །རེས་འགའ་དངོས་པོ་གཅིག་ལས་ནི། །ཁ་དོག་བྱེ་བ་དྲུག་སྟོན་པ། །སོ་སོར་རབ་འབྲིང་ཐ་མ་ཡང་། །དགེ་འདུན་གུས་ལས་\nསྐྱེས་པ་ཡིན། །རེས་འགའ་དངོས་པོ་གཅིག་ལས་ནི། །ཁ་དོག་བྱེ་བ་བདུན་སྟོན་པ། །སོ་སོར་རབ་འབྲིང་ཐ་མ་ཡང་། །ཚུལ་ཁྲིམས་གུས་ལས་སྐྱེས་པ་ཡིན། །རེས་འགའ་དངོས་པོ་གཅིག་ལས་ནི། །ཁ་\nདོག་བྱེ་བ་བརྒྱད་སྟོན་པ། །སོ་སོར་རབ་འབྲིང་ཐ་མ་ཡང་། །ཏིང་འཛིན་གུས་ལས་སྐྱེས་པ་ཡིན། །རེས་འགའ་དངོས་པོ་གཅིག་ལས་ནི། །ཁ་དོག་བྱེ་བ་དགུ་སྟོན་པ། །སོ་སོར་རབ་འབྲིང་ཐ་མ་ཡང་། །ཀུན་བརྩེ་ལས་\nནི་སྐྱེས་པ་ཡིན། །རེས་འགའ་དངོས་པོ་གཅིག་ལས་ནི། །ཁ་དོག་བྱེ་བ་བཅུ་སྟོན་པ། །སོ་སོར་རབ་འབྲིང་ཐ་མ་ཡང་། །བག་ཡོད་ལས་ནི་སྐྱེས་པ་ཡིན། །གཞན་ཡང་སྤུ་ཁུང་གཅིག་ལས་ནི། །འོད་ཟེར་མང་པོ་\nགང་སྟོན་པ། །འོད་ཟེར་སྣ་ཚོགས་མིང་དེ་<span class='delete'>དག། །</span><span class='add'>དག །</span>དེང་འདིར་ཁྱོད་ལ་བཤད་པར་བྱ། །ང་ལ་འོད་ཟེར་གཅིག་ཡོད་དེ། །དེ་མིང་སྤྲིན་གཙང་སྣང་ཞེས་བྱ། །འོད་ཟེར་དེ་ནི་དགེ་བའི་རྩ། །དཔག་མེད་བསགས་ལས་སྐྱེས་\nཔ་ཡིན། །འདི་ལྟར་འདས་པའི་དུས་ཀྱི་ཚེ། །སེམས་ཅན་རྣམ་པ་ཇི་སྙེད་པ། །ནད་རྣམས་སྣ་ཚོགས་བཏབ་པ་ལས། །སྙིང་བརྩེའི་སེམས་ནི་རབ་བསྐྱེད་ནས། །སྨན་ནི་མང་པོ་རབ་བཏང་ཞིང་། །དེ་དག་སོས་"
 ],
 [
  "79.229a",
  "འདུན་ས་ཕྱགས་པས། །དེ་ཕྱིར་དེ་ལས་སྐྱེས་པ་ཡིན། །ང་ལ་འོད་ཟེར་ཡང་ཡོད་དེ། །དེ་མིང་རྣམ་དག་ཆུ་ཞེས་བྱ། ཆུ་མིག་ཁྲོན་པར་མཆོད་པས་ན། །དེ་ཕྱིར་དེ་ལས་སྐྱེས་པ་ཡིན། །ང་ལ་འོད་ཟེར་\nཡང་ཡོད་དེ། །དེ་མིང་རྣམ་དག་མེ་ཞེས་བྱ། །མེ་འཛིན་མཆོད་ཅིང་སྦྱིན་བཏང་པས། །དེ་ཕྱིར་དེ་ལས་སྐྱེས་པ་ཡིན། །ང་ལ་འོད་ཟེར་ཡང་ཡོད་དེ། །དེ་མིང་རྣམ་དག་རླུང་ཞེས་བྱ། །རླུང་ཡབ་ཐོགས་ནས་\nམཆོད་པས་ན། །དེ་ཕྱིར་དེ་ལས་སྐྱེས་པ་ཡིན། །ང་ལ་འོད་ཟེར་ཡང་ཡོད་དེ། །དེ་མིང་རྣམ་དག་ཕུང་ཞེས་བྱ། །ལུས་ཀྱིས་སངས་རྒྱས་མཆོད་པས་ན། །དེ་ཕྱིར་དེ་ལས་སྐྱེས་པ་ཡིན། །ང་ལ་འོད་ཟེར་ཡང་ཡོད་དེ། །\nདེ་མིང་རྣམ་དག་ཁམས་ཤེས་བྱ། །རྟག་ཏུ་བྱམས་པས་སེམས་བསྒོམས་པས། །དེ་ཕྱིར་དེ་ལས་སྐྱེས་པ་ཡིན། །ང་ལ་འོད་ཟེར་ཡང་ཡོད་དེ། །དེ་མིང་རྣམ་དག་བདེན་ཞེས་བྱ། །རྟག་ཏུ་བརྫུན་ནི་སྤངས་པས་ན། །དེ་ཕྱིར་དེ་\nལས་སྐྱེས་པ་ཡིན། །ང་ལ་འོད་ཟེར་ཡང་ཡོད་དེ། །དེ་མིང་རྣམ་དག་ཞི་ཞེས་བྱ། །རྟག་ཏུ་སྦྱིན་པ་བཏང་བས་ན། །དེ་ཕྱིར་དེ་ལས་སྐྱེས་པ་ཡིན། །ང་ལ་འོད་ཟེར་ཡང་ཡོད་དེ། །དེ་མིང་རྣམ་དག་སྒྲ་ཞེས་བྱ། །སངས་རྒྱས་\nརྣམས་ཀྱིས་བསྔགས་བརྗོད་པས། །དེ་ཕྱིར་དེ་ལས་སྐྱེས་པ་ཡིན། །ང་ལ་འོད་ཟེར་ཡང་ཡོད་དེ། །དེ་མིང་རྣམ་དག་དྲན་ཞེས་བྱ། །ཏིང་འཛིན་བསྔགས་པ་བརྗོད་པས་ན། །དེ་ཕྱིར་དེ་ལས་སྐྱེས་པ་ཡིན། །ང་ལ་འོད་ཟེར་\nཡང་ཡོད་དེ། །དེ་མིང་རྣམ་དག་སྤོབས་ཤེས་<span class='delete'>བྱ། </span><span class='add'>བྱ། །</span>ཀུན་འཛིན་བསྔགས་པ་བརྗོད་པས་ན། །དེ་ཕྱིར་དེ་ལས་སྐྱེས་པ་ཡིན། །ང་ལ་འོད་ཟེར་ཡང་ཡོད་དེ། །དེ་མིང་འཐུན་ཞེས་བྱ་བ་ཡིན། །རྩོད་པ་དག་ནི་བསྡུམས་\nཔས་ན། །དེ་ཕྱིར་དེ་ལས་སྐྱེས་པ་ཡིན། །ང་ལ་འོད་ཟེར་ཡང་ཡོད་དེ། །དེ་མིང་དོན་རབ་བསྟན་ཅེས་བྱ། །སྟོང་ཉིད་རབ་ཏུ་རྟོགས་པས་ན། །དེ་ཕྱིར་དེ་ལས་སྐྱེས་པ་ཡིན། །ང་ལ་འོད་ཟེར་ཡང་ཡོད་དེ། །དེ་མིང་ཁ་དོག་སྔོ་"
 ],
 [
  "79.226a",
  "<span class='delete'>མུཀ་</span><span class='add'>མུཀ་</span>ཏོ་ནིར་དེ་ཤ་ནཱ་མ་མཧཱ་ཡཱ་ན་སཱུ་ཏྲ།  བོད་སྐད་དུ།<span class='delete'>འཕགས་</span><span class='add'>  འཕགས་</span>པ་འོད་ཟེར་ཀུན་དུ་བཀྱེ་པ་བསྟན་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ། སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་\nའཚལ་ལོ། །འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན། བཅོམ་ལྡན་འདས་རྒྱལ་པོའི་ཁབ་ན་བྱ་རྒོད་ཕུང་པོའི་རི་ལ། དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་ཐམས་ཅད་ཀྱང་རང་དབང་ཆེན་པོ་ཐོབ་པ་ལྔ་བརྒྱ་དང་། \nགཞན་ཡང་ཚེ་གཅིག་གིས་ཐོགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པ་ལ་སོགས་པ་ཁྲག་ཁྲིག་ཕྲག་བརྒྱད་བཅུ་དང་། གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཇམ་དཔལ་\nགཞོན་ནུར་གྱུར་པ་ལ་སོགས་པ་ཁྲག་ཁྲིག་ཕྲག་བཞི་བཅུ་དང་ཐབས་གཅིག་ཏུ་བཞུགས་ཏེ། དེའི་ཚེ་འཁོར་འདུས་པ་དེ་ཉིད་དུ་ཟླ་འོད་གཞོན་ནུར་གྱུར་<span class='delete'>པ་</span><span class='add'>པ་</span>ཞེས་བྱ་བ་ཞིག་འདུས་པར་གྱུར་<span class='delete'>པ་</span><span class='add'>པ་</span>དེ་འདུག་པའི་སྟན་ལས་ལངས་ནས་\nབླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ཏེ་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བརྩུགས་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་བྱས་ཏེ། གུས་པས་ཐལ་མོ་སྦྱར་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་\nགསོལ་ཏོ། །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པས་སྔོན་ཕྲིན་ལས་ཅི་ཞིག་མཛད་ན་འདི་ལྟར་རྣམ་པར་ངེས་པའི་འོད་ཟེར་དང་། ཡོངས་སུ་སྡུད་པའི་འོད་ཟེར་དང་། ཀུན་ནས་སློང་<span class='delete'>པའི་</span><span class='add'>བའི་</span>འོད་ཟེར་དང་། རབ་ཏུ་སྟོན་\nཔའི་འོད་ཟེར་དང་། ཁ་དོག་སྣ་ཚོགས་ཀྱི་འོད་ཟེར་དང་། ཁ་དོག་འདྲེས་པ་མ་མཆིས་པའི་འོད་ཟེར་དང་། རྒྱ་ཆུང་ངུའི་འོད་ཟེར་དང་། རྒྱ་ཆེན་པོའི་འོད་ཟེར་དང་། རྣམ་པར་དག་པའི་འོད་ཟེར་དང་། ཤིན་དུ་རྣམ་པར་དག་པའི་འོད་\nཟེར་དང་། དྲི་མ་མ་མཆིས་པའི་འོད་ཟེར་དང་། ཤིན་དུ་དྲི་མ་མ་མཆིས་པའི་འོད་ཟེར་དང་། དྲི་མ་དང་བྲལ་བའི་འོད་ཟེར་དང་། རིགས་ཀྱིས་འཕེལ་བའི་འོད་ཟེར་དང་། གསལ་བའི་འོད་ཟེར་དང་། ཤིན་དུ་གསལ་བའི་འོད་ཟེར་"
 ],
 [
  "79.230b",
  "པས་ན། །དེ་ཕྱིར་དེ་ལས་སྐྱེས་པ་ཡིན། །ང་ལ་འོད་ཟེར་ཡང་ཡོད་དེ། །སངས་རྒྱས་ཆོས་འཕྲུལ་ཞེས་བྱའོ། །རྫུ་འཕྲུལ་མཐུ་<span class='delete'>ཡ་</span><span class='add'>ཡི་</span>བསྔགས་བརྗོད་པས། །དེ་ཕྱིར་དེ་ལས་སྐྱེས་པ་ཡིན། །ང་ལ་འོད་\nཟེར་ཡང་ཡོད་དེ། །དེ་མིང་གཟུགས་<span class='delete'>མད་</span><span class='add'>མེད་</span><span class='delete'>སྟོད་</span><span class='add'>སྟོན་</span><span class='delete'>ཅས་</span><span class='add'>ཅེས་</span>བྱ། །རྫུ་འཕྲུལ་རྐང་གི་བསྔགས་བརྗོད་པས། །དེ་ཕྱིར་དེ་ལས་སྐྱེས་པ་ཡིན། །ང་ལ་འོད་ཟེར་ཡང་ཡོད་དེ། །དགེ་བའི་གྲོགས་ལ་མོས་ཤེས་བྱ། །\nརྟོགས་པའི་རང་བཞིན་བསྔགས་བརྗོད་པས། །དེ་ཕྱིར་དེ་ལས་སྐྱེས་པ་ཡིན། །ང་ལ་འོད་ཟེར་ཡང་ཡོད་དེ། །མིག་གི་<span class='delete'>སྡོན་</span><span class='add'>སྔོན་</span>མཐའ་ཞེས་བྱའོ། །མིག་གི་སྔོན་མཐའ་བསྔགས་བརྗོད་པས། །དེ་ཕྱིར་དེ་\nལས་སྐྱེས་པ་ཡིན། །ང་ལ་འོད་ཟེར་ཡང་ཡོད་དེ། །མིག་གི་མཐའ་ཟད་ཅེས་བྱའོ། །མིག་ཟད་བསྔགས་པ་བརྗོད་པས་ན། །དེ་ཕྱིར་དེ་ལས་སྐྱེས་པ་ཡིན། །ང་ལ་འོད་ཟེར་ཡང་ཡོད་<span class='delete'>དེ། </span><span class='add'>དེ། །</span>དེ་མིང་སྲིད་པའི་\nམཐའ་ཞེས་བྱ། །སྲིད་མེད་བསྔགས་པ་བརྗོད་པས་ན། །དེ་ཕྱིར་དེ་ལས་སྐྱེས་པ་ཡིན། །ང་ལ་འོད་ཟེར་ཡང་ཡོད་<span class='delete'>དེ། </span><span class='add'>དེ། །</span>དེ་མིང་འཇིག་པ་མེད་ཅེས་བྱ། །འགོག་པ་མེད་ཀྱི་བསྔགས་བརྗོད་པས། །དེ་ཕྱིར་\nདེ་ལས་སྐྱེས་པ་ཡིན། །ང་ལ་འོད་ཟེར་ཡང་ཡོད་<span class='delete'>དེ། </span><span class='add'>དེ། །</span>དེ་མིང་མཐའ་མེད་ཅེས་བྱའོ། །མཐའ་མེད་བསྔགས་པ་བརྗོད་པས་ན། །དེ་ཕྱིར་དེ་ལས་སྐྱེས་པ་ཡིན། །ང་ལ་འོད་ཟེར་ཡང་ཡོད་<span class='delete'>དེ། </span><span class='add'>དེ། །</span>\nདེ་མིང་མཚན་མ་མེད་ཅེས་བྱ། །འདུས་མ་བྱས་ཀྱི་བསྔགས་བརྗོད་པས། །དེ་ཕྱིར་དེ་ལས་སྐྱེས་པ་ཡིན། །ང་ལ་འོད་ཟེར་ཡང་ཡོད་<span class='delete'>དེ། </span><span class='add'>དེ། །</span>དེ་མིང་འགྱུར་བ་མེད་ཅེས་བྱ། །ཁྱད་པར་མེད་པའི་བསྔགས་\nབརྗོད་པས། །དེ་ཕྱིར་དེ་ལས་སྐྱེས་པ་ཡིན། །ང་ལ་འོད་ཟེར་ཡང་ཡོད་<span class='delete'>དེ། </span><span class='add'>དེ། །</span>དེ་མིང་འགྱུར་བ་མེད་ཅེས་བྱ། །ཞེན་པ་མེད་པའི་བསྔགས་བརྗོད་པས། །དེ་ཕྱིར་དེ་ལས་སྐྱེས་པ་ཡིན། །"
 ],
 [
  "79.227a",
  "གཞན་ཡང་སྤྱོད་པ་སྣ་ཚོགས་ཀྱིས། །སངས་རྒྱས་ལམ་ལ་རབ་གནས་ཤིང་། །སྟོང་<span class='delete'>བ་</span><span class='add'>པ་</span>བྱེད་མེད་ཤེས་རབ་ཀྱིས། །འདྲེས་པའི་འོད་ཟེར་བསྟན་པ་ཡིན། །ཇི་ལྟར་ཕྱི་རོལ་ཆོས་དག་ལ། །མཚན་ཉིད་བྱེ་བྲག་སྣ་\nཚོགས་སྣང་། །དེ་ནི་སྟོང་ཞིང་བདག་ཀྱང་མེད། །བྱེད་པ་མེད་ཅིང་སེམས་ཡིད་མེད། །གཞན་ཡང་ཇི་ལྟར་ནང་གི་ལུས། །སྟོང་ཞིང་བདག་<span class='delete'>མིད་</span><span class='add'>མེད་</span>བྱེད་མེད་ཀྱང་། །དེ་ལས་རྣམ་པ་སྣ་ཚོགས་ཀྱི། །སྒྲ་སྐད་དག་ནི་རབ་ཏུ་སྟོན། དེ་ལྟར་<span class='delete'>བྱེར་</span><span class='add'>བྱེད་</span>མེད་\nདབང་གིས་ན། །ཁ་དོག་དཔག་མེད་འོད་བསྟན་ནས། །མོས་པ་དག་ནི་ཇི་བཞིན་དུ། །རེ་བ་དག་ནི་སྐོང་བར་མཛད། །རེས་འགའ་འོད་ཟེར་གཅིག་ལས་ནི། །ཁ་དོག་རྣམ་པ་གཉིས་བསྐྱེད་ནས། །སོ་སོར་རབ་འབྲིང་ཐ་མ་ཡི། །བྱེ་\nབྲག་ཡོད་པ་རབ་ཏུ་སྟོན། །རེས་འགའ་འོད་ཟེར་གཅིག་ལས་ནི། །ཁ་དོག་རྣམ་པ་གསུམ་བསྐྱེད་ནས། །སོ་སོར་རབ་འབྲིང་ཐ་མ་ཡི། །བྱེ་བྲག་ཡོད་པ་རབ་ཏུ་སྟོན། །རེས་འགའ་འོད་ཟེར་གཅིག་ལས་ནི། །ཁ་དོག་རྣམ་པ་བཞི་བསྐྱེད་ནས། །\nསོ་སོར་རབ་འབྲིང་ཐ་མ་ཡི། །བྱེ་བྲག་ཡོད་པ་རབ་ཏུ་སྟོན། །རེས་འགའ་འོད་ཟེར་གཅིག་ལས་ནི། །ཁ་དོག་རྣམ་པ་ལྔ་འབྱུང་བ། །སོ་སོར་རབ་འབྲིང་ཐ་མ་<span class='delete'>ཡང། །</span><span class='add'>ཡང་། །</span>ལས་གཙང་ལས་ནི་སྐྱེས་པ་ཡིན། །རེས་འགའ་འོད་ཟེར་གཅིག་ལས་ནི། །\nཁ་དོག་རྣམ་པ་དྲུག་འབྱུང་བ། །སོ་སོར་རབ་འབྲིང་ཐ་མ་ཡང་། །ཐབས་མཁས་ལས་ནི་སྐྱེས་པ་ཡིན། །རེས་འགའ་འོད་ཟེར་གཅིག་ལས་ནི། །ཁ་དོག་རྣམ་པ་བདུན་འབྱུང་བ། །སོ་སོར་རབ་འབྲིང་ཐ་མ་ཡང་། །ལས་དགེ་ལས་ནི་སྐྱེས་པ་ཡིན། །རེས་འགའ་\nའོད་ཟེར་གཅིག་ལས་ནི། །ཁ་དོག་རྣམ་པ་བརྒྱད་འབྱུང་བ། །སོ་སོར་རབ་འབྲིང་ཐ་མ་ཡང་། །དགེ་བའི་ཆོས་ལས་སྐྱེས་པ་ཡིན། །རེས་འགའ་འོད་ཟེར་གཅིག་ལས་ནི། །ཁ་དོག་རྣམ་པ་དགུ་འབྱུང་བ། །སོ་སོར་རབ་འབྲིང་ཐ་མ་ཡང་། །ཚོགས་དག་ལས་ནི་སྐྱེས་པ་ཡིན། །རེས་འགའ་\nའོད་ཟེར་གཅིག་ལས་ནི། །ཁ་དོག་རྣམ་པ་བཅུ་འབྱུང་བ། །སོ་སོར་རབ་འབྲིང་ཐ་མ་ཡང་། །སྦྱིན་པ་ལས་ནི་སྐྱེས་པ་ཡིན། །རེས་འགའ་དངོས་པོ་གཅིག་ལས་ནི། །ཁ་དོག་ཉི་ཤུ་གང་འབྱུང་བ། །སོ་སོར་རབ་འབྲིང་ཐ་མ་ཡང་། །"
 ],
 [
  "79.230a",
  "དེ་ཕྱིར་དེ་ལས་སྐྱེས་པ་ཡིན། །ང་ལ་འོད་ཟེར་ཡང་ཡོད་དེ། །དེ་མིང་སྐྱེས་པ་རྟོགས་ཤེས་བྱ། །སྐྱེས་པའི་མཚན་མ་སྤངས་པས་ན། །དེ་ཕྱིར་དེ་ལས་སྐྱེས་པ་ཡིན། །ང་ལ་འོད་ཟེར་ཡང་ཡོད་དེ། །\nདེ་མིང་རྡོ་རྗེ་སྟོབས་ཤེས་བྱ། །ལས་ཀྱི་ཤེས་པ་དག་པས་ན། །དེ་ཕྱིར་དེ་ལས་སྐྱེས་པ་ཡིན། །ང་ལ་འོད་ཟེར་ཡང་ཡོད་དེ། །དེ་མིང་སྟོང་པ་སྟོན་ཞེས་བྱ། འཇིག་རྟེན་རྣམ་སྨིན་སྟོན་པས་ན། །དེ་ཕྱིར་དེ་ལས་སྐྱེས་\nཔ་ཡིན། །ང་ལ་འོད་ཟེར་ཡང་ཡོད་དེ། །དེ་མིང་ཡང་དག་རྟོགས་ཤེས་བྱ། །ཕྱིན་ཅི་ལོག་ནི་སྤངས་པས་ན། །དེ་ཕྱིར་དེ་ལས་སྐྱེས་པ་ཡིན། །ང་ལ་འོད་ཟེར་ཡང་ཡོད་དེ། །སངས་རྒྱས་གསུང་ནི་སྟོན་ཞེས་བྱ། །\nཆོས་དབྱིངས་<span class='delete'>བ་</span><span class='add'>བ</span>སྔགས་པ་བརྗོད་པས་<span class='delete'>ནི། །</span><span class='add'>ན། །</span>དེ་ཕྱིར་དེ་ལས་སྐྱེས་པ་ཡིན། །ང་ལ་འོད་ཟེར་ཡང་ཡོད་དེ། །སྐྱོན་རྣམས་སྤངས་པ་ཞེས་བྱའོ། །མོས་པའི་བསྔགས་པ་བརྗོད་པས་ན། །དེ་ཕྱིར་དེ་ལས་\nསྐྱེས་པ་ཡིན། །ང་ལ་འོད་ཟེར་ཡང་ཡོད་<span class='delete'>དེ། </span><span class='add'>དེ། །</span>བཀོད་པ་ཀུན་ཏུ་སྣང་ཞེས་<span class='delete'>བྱ། །་</span><span class='add'>བྱ། །</span>མར་མེ་ཕུལ་བའི་བསྔགས་བརྗོད་<span class='delete'>པས་། །</span><span class='add'>པས། །</span>དེ་ཕྱིར་དེ་ལས་སྐྱེས་པ་ཡིན། །ང་ལ་འོད་ཟེར་ཡང་ཡོད་དེ། །དེ་མིང་སྲེད་པ་སྤངས་\nཤེས་བྱ། །ཏིང་འཛིན་ཤེས་རབ་བསྔགས་བརྗོད་<span class='delete'>པས་། </span><span class='add'>པས། །</span>དེ་ཕྱིར་དེ་ལས་སྐྱེས་པ་ཡིན། །ང་ལ་འོད་ཟེར་ཡང་ཡོད་དེ། །དེ་མིང་བག་ཆགས་སྤངས་ཤེས་བྱ། །སྔོན་མཐའི་ཤེས་པ་སྤངས་པས་ན། །དེ་ཕྱིར་\nདེ་ལས་སྐྱེས་པ་ཡིན། །ང་ལ་འོད་ཟེར་ཡང་ཡོད་དེ། །དེ་མིང་ཆགས་པ་སྤངས་ཤེས་བྱ། །མི་སྐྱེ་ཡེ་ཤེས་བསྔགས་པས་ན། །དེ་ཕྱིར་དེ་ལས་སྐྱེས་པ་ཡིན། །ང་ལ་འོད་ཟེར་ཡང་ཡོད་དེ། །འགྲོ་བ་\nརྣམས་ནི་སྤངས་ཤེས་བྱ། །ཟག་ཟད་ཡེ་ཤེས་བསྔགས་པས་ན། །དེ་ཕྱིར་དེ་ལས་སྐྱེས་པ་<span class='delete'>ཡིན། </span><span class='add'>ཡིན། །</span>ང་ལ་འོད་ཟེར་ཡང་ཡོད་དེ། །དེ་མིང་གནས་སྤངས་ཞེས་བྱ་སྟེ། །སྡུག་བསྔལ་ཤེས་པ་བསྔགས་"
 ],
 [
  "79.231b",
  "ང་ལ་འོད་ཟེར་རྣམ་གྲོལ་སྤྱོད་པ་ཡོད། །དེ་ཡི་མིང་འཛིན་འཆིང་བ་མེད་པར་འགྱུར། །ང་ལ་འོད་ཟེར་ལེགས་འདུལ་ཞེས་བྱ་ཡོད། །དེ་ཡི་མིང་འཛིན་གཉེན་ངེས་ཐོབ་པར་འགྱུར། །ང་ལ་འོད་ཟེར་མི་གཡོ་ཞེས་བྱ་\nཡོད། །དེ་ཡི་མིང་འཛིན་འདོད་ཆགས་ཞེན་སྤོང་འགྱུར། །ང་ལ་འོད་ཟེར་རབ་འདུལ་ཞེས་བྱ་ཡོད། །དེ་ཡི་མིང་འཛིན་ཚུལ་ཁྲིམས་རྫོགས་པར་འགྱུར། །ང་ལ་འོད་ཟེར་དགེ་མང་སྤྱོད་པ་ཡོད། །དེ་ཡི་མིང་འཛིན་གོས་པ་མེད་\nཔར་འགྱུར། །ང་ལ་འོད་ཟེར་ཕན་མང་བྱེད་པ་ཡོད། །གང་གིས་མིང་ཐོས་ཉེས་པ་རྣམ་སྤོང་འགྱུར། །ང་ལ་འོད་ཟེར་མཆོག་ཤེས་མཐོང་བ་ཡོད། །གང་གིས་མིང་ཐོས་རྨོངས་པ་མེད་པར་འགྱུར། །ང་ལ་འོད་ཟེར་\nཕན་ཚོལ་ཞེས་བྱ་ཡོད། །གང་གིས་མིང་ཐོས་ཞེ་སྡང་མེད་པར་འགྱུར། །ང་ལ་འོད་ཟེར་སེམས་དགའ་བྱེད་པ་ཡོད། །གང་གིས་མིང་ཐོས་བདེ་བ་ཐོབ་པར་འགྱུར། །ང་ལ་འོད་ཟེར་<span class='delete'>གདུད་</span><span class='add'>གདུང་</span>བ་མེད་པ་ཡོད། །གང་གིས་\nམིང་འཛིན་སྟོང་ཉིད་རྟོགས་པར་འགྱུར། །ང་ལ་འོད་ཟེར་ངོ་བོ་ཉིད་མེད་ཡོད། །གང་གིས་མིང་འཛིན་སྤྲོས་ལས་འདའ་བར་འགྱུར། །ང་ལ་འོད་ཟེར་རྟེན་པ་མེད་པ་ཡོད། །གང་གིས་མིང་འཛིན་གཡོ་བ་མེད་པར་\nའགྱུར། །ང་ལ་འོད་ཟེར་རྨོངས་དང་བྲལ་བ་ཡོད། །གང་གིས་མིང་འཛིན་སོམ་ཉི་མེད་པར་འགྱུར། །ང་ལ་འོད་ཟེར་གནས་མེད་ཅེས་བྱ་ཡོད། །གང་གིས་མིང་འཛིན་གཏི་མུག་མུན་པ་སྤོང་། །ང་ལ་འོད་ཟེར་\nནང་ལུས་སྐྱོ་བ་ཡོད། །གང་གིས་མིང་འཛིན་དེ་ནི་ལེན་མི་འགྱུར། །ང་ལ་འོད་ཟེར་འཛིན་མེད་ཅེས་བྱ་ཡོད། །གང་གིས་མིང་འཛིན་ཡི་གེ་ཚིག་འབྲུ་སྤོང་། །ང་ལ་འོད་ཟེར་རྨོངས་པ་མེད་པ་ཡོད། །གང་གིས་མིང་འཛིན་\nབརྗོད་དང་བྲལ་བར་འགྱུར། །ང་ལ་འོད་ཟེར་འགྲོ་མེད་ཅེས་བྱ་ཡོད། །གང་གིས་མིང་འཛིན་མ་འོངས་ཤེས་པར་འགྱུར། །ང་ལ་འོད་ཟེར་ཀུན་མཐའ་ཞེས་བྱ་ཡོད། །གང་གིས་མིང་འཛིན་འདས་པ་ཤེས་པར་འགྱུར། །"
 ],
 [
  "79.232a",
  "ང་ལ་འོད་ཟེར་མཚུངས་མེད་ཅེས་བྱ་ཡོད། །གང་གིས་མིང་འཛིན་ཟག་མེད་རྟོགས་པར་འགྱུར། །ང་ལ་འོད་ཟེར་འཕགས་ཐོབ་ཅེས་བྱ་ཡོད། །གང་གིས་མིང་འཛིན་མཆོག་གྱུར་ཤེས་པར་འགྱུར། །ང་ལ་འོད་ཟེར་\nདྲི་མ་མེད་པ་ཡོད། །གང་གིས་མིང་འཛིན་མངོན་<span class='delete'>པར་</span><span class='add'>པར་</span>ཞེན་པ་<span class='delete'>སྤོང། །</span><span class='add'>སྤོང་། །</span>ང་ལ་འོད་ཟེར་<span class='delete'>རྔུལ་</span><span class='add'>རྡུལ་</span>སྤོང་ཞེས་བྱ་ཡོད། །གང་གིས་མིང་འཛིན་མུན་པ་མེད་པར་འགྱུར། །ང་ལ་འོད་ཟེར་སྲེད་པ་མེད་པ་ཡོད། །གང་གིས་མིང་འཛིན་རྟེན་\nདག་སྤོང་བར་འགྱུར། །ང་ལ་འོད་ཟེར་མཆོག་རྒྱལ་ཞེས་བྱ་ཡོད། །གང་གིས་མིང་འཛིན་ཕ་རོལ་སྨྲ་བ་གནོན། །ང་ལ་འོད་ཟེར་དར་ལ་བབ་པ་ཡོད། །གང་གིས་མིང་འཛིན་སྤྱོད་པ་དྲུག་འགྲུབ་འགྱུར། །ང་ལ་འོད་ཟེར་མཆོག་\nབཙུན་ཞེས་བྱ་ཡོད། །གང་གིས་མིང་འཛིན་ཤེས་པ་ཐོགས་མེད་འགྱུར། །ང་ལ་འོད་ཟེར་མྱུར་བ་ཞེས་བྱ་ཡོད། །གང་གིས་མིང་འཛིན་དགེ་སློང་མཆོག་<span class='delete'>འགྲུབ་</span><span class='add'>འགྲུབ་</span>འགྱུར། །ང་ལ་འོད་ཟེར་མཚན་ལྡན་ཞེས་བྱ་ཡོད། །\nགང་གིས་མིང་འཛིན་ཆོས་ཟབ་རྟོགས་པར་འགྱུར། །ང་ལ་འོད་ཟེར་མཚན་མ་མེད་པ་ཡོད། །གང་གིས་མིང་འཛིན་ང་རྒྱལ་སྤོང་བར་འགྱུར། །ང་ལ་འོད་ཟེར་སྐྱེ་མེད་ཅེས་བྱ་ཡོད། །གང་གིས་མིང་འཛིན་འཐོབ་མེད་རྙེད་པར་\nའགྱུར། །ང་ལ་འོད་ཟེར་སངས་རྒྱས་དྲན་པ་ཡོད། །དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱིས་རབ་ཏུ་བསྔགས། །སངས་རྒྱས་མང་ལ་སྤྱོད་པ་རྣམས་བསྒྲུབས་པས། །འདི་ལྟ་བུ་ཡི་འོད་ཟེར་གྲུབ་པ་ཡིན། །\nསངས་རྒྱས་སྐུ་ལས་བྱུང་བའི་འོད་ཟེར་རྣམས། །རྡུལ་ཕྲན་གྲངས་ནི་བརྒྱ་སྟོང་བྱེ་སྙེད་མངའ། །དེ་བཞིན་ཞིང་ནི་ཚད་མེད་བྱེ་སྙེད་མངའ། །དེ་ཡི་གྲངས་ནི་རྒྱ་མཚོའི་བྱེ་མ་སྙེད། །རྡུལ་དེ་སྙེད་ཀྱི་འོད་ཟེར་རྣམས་ཀྱང་ནི། །སོ་\nསོ་ལ་ཡང་འཁོར་ནི་མང་པོ་ཡོད། །འོད་ཟེར་དེས་ནི་སངས་རྒྱས་མེད་ཞིང་དུ། །དེ་བཞིན་གཤེགས་པའི་རྣམ་དག་སྐུར་སྤྲུལ་ནས། །ཤིན་ཏུ་ཟབ་མོའི་ཆོས་ནི་སྟོན་མཛད་པས། །སེམས་ཅན་བཟོད་ལ་རབ་ཏུ་འགོད་<span class='delete'>པ</span><span class='add'>པར་</span>་"
 ],
 [
  "79.232b",
  "མཛད། །ང་ལ་འོད་ཟེར་སངས་རྒྱས་ཞེས་བྱ་ཡོད། །སེམས་ཅན་སངས་རྒྱས་ལམ་ལ་གནས་པར་མཛད། །ང་ལ་འོད་ཟེར་ཆོས་ཤེས་བྱ་བ་ཡོད། །ཤིན་དུ་རྣམ་དག་གསལ་བྱེད་དྲི་མ་མེད། །ང་ལ་འོད་ཟེར་དགེ་འདུན་\nཞེས་བྱ་ཡོད། །དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱིས་རབ་ཏུ་བསྔགས། །ང་ལ་འོད་ཟེར་རྣམ་དག་ཅེས་བྱ་ཡོད། །འོད་ཟེར་དེ་ནི་ཁྱད་འཕགས་རྙེད་པར་དཀའ། །ང་ལ་འོད་ཟེར་པད་མ་ཞེས་བྱ་ཡོད། །སེམས་ཅན་ཕན་\nའདོགས་ཡོངས་སུ་སྨིན་པར་བྱེད། །ང་ལ་འོད་ཟེར་ཚངས་པ་ཞེས་བྱ་ཡོད། །ཁ་ཅིག་བརྒྱ་བྱིན་ཡང་ན་ལྷ་ཞེས་བྱ། །ཟླ་བ་ཀླུ་དང་གནོད་སྦྱིན་ཞེས་ཀྱང་བྱ། །ལྷ་མ་ཡིན་དང་ནམ་མཁའ་ལྡིང་ཞེས་བྱ། །ཁ་ཅིག་རྒྱལ་པོ་\nབུད་མེད་ཞེས་ཀྱང་བྱ། །ཁ་ཅིག་བུ་མོ་ཁ་ཅིག་ཁྱེའུ་ཞེས་བྱའོ། །དེ་ལྟར་འོད་ཟེར་སྣ་ཚོགས་མང་པོ་རྣམས། །སོ་སོར་དགེ་ཆོས་དག་གིས་སྐལ་མཚུངས་འདུལ། །འཁོར་ནི་ཚད་མེད་བྱེ་བ་སྙེད་དག་ཀྱང་། །ཐམས་\nཅད་བྱང་ཆུབ་ཡོངས་སུ་སྨིན་པར་བྱེད། །ང་ལ་འོད་ཟེར་ཤེས་རབ་ཅེས་བྱ་ཡོད། །ཁ་ཅིག་ཚུལ་ཁྲིམས་ཁ་ཅིག་མིང་བྱམས་པ། །ཁ་ཅིག་སྙིང་རྗེ་དགའ་དང་སྒྲོན་ཞེས་བྱ། །ཁ་ཅིག་བྱུག་སྤོས་ཁ་ཅིག་རོལ་མོ་སྒྲ། །\nའདི་ལྟ་བུ་ལ་སོགས་པའི་འོད་ཟེར་རྣམས། །སྔོན་གྱི་<span class='delete'>སྦྱོང་</span><span class='add'>སྤྱོད་</span>པའི་རྗེས་སུ་འཐུན་<span class='delete'>པར་</span><span class='add'>པར་</span>ནི། །སྐྱེ་དགུའི་རྣམ་པ་ཚད་མེད་ཡོངས་བསྡུས་པས། །དེས་ན་འོད་ཟེར་འདི་དག་རྫོགས་པ་ཡིན། །ང་ལ་འོད་ཟེར་གཙོ་བོ་\nཞེས་བྱ་ཡོད། །དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱིས་རབ་ཏུ་བསྔགས། །སངས་རྒྱས་བསྟན་པ་རྣམས་ལ་རྟག་གུས་པས། །དེས་ན་འོད་ཟེར་འདི་ནི་རྫོགས་པ་ཡིན། །སངས་རྒྱས་སྤྱན་གྱིས་སེམས་ཅན་\nགྲངས་གཟིགས་ནས། །སྤུ་ཁུང་ཀུན་ནས་འོད་ཟེར་སྣ་ཚོགས་གཏོང་། །འོད་ཟེར་མང་པོ་དེ་དག་རེ་རེ་ཡང་། །སོ་སོར་འཁོར་མང་དག་གིས་རབ་ཏུ་བསྐོར། །སེམས་ཅན་རྣམས་ཀྱི་མོས་པ་ཇི་བཞིན་དུ། །སངས་རྒྱས་"
 ],
 [
  "79.233a",
  "འོད་ཟེར་གཏོང་ཞིང་སྨྱིན་པར་མཛད། །གང་གིས་འོད་ཟེར་བསྟན་པ་འདི་ཐོས་ནས། །རབ་ཏུ་དགའ་ཞིང་མོས་པར་གང་བྱེད་པ། །དེ་སྔོན་སངས་རྒྱས་མང་པོ་དག་ལས་ནི། །མདོ་སྡེ་འདི་ནི་ཐོས་པར་གྱུར་\nཔ་ཡིན། །ང་ལ་འོད་ཟེར་ཁྱད་པར་འཕགས་པ་ཡོད། །འཁོར་ནི་བྱེ་བ་བརྒྱད་བཅུ་གྲངས་སྙེད་ཡོད། །སྔོན་གྱི་སངས་རྒྱས་དག་ལ་ཚིགས་བཅད་<span class='delete'>གཅིག། །</span><span class='add'>གཅིག །</span>བསྔགས་པས་དེ་ཕྱིར་འོད་ཟེར་འདི་གྲུབ་པོ། །ང་ལ་འོད་ཟེར་\nམྱ་ངན་མེད་པ་ཡོད། །འཁོར་ནི་ཁྲག་ཁྲིག་བརྒྱད་བཅུ་སྙེད་ཡོད་དེ། །དེ་བཞིན་གཤེགས་པའི་བསྟན་པ་གཅིག་བཟུང་བས། །དེ་ཕྱིར་འོད་ཟེར་འདི་ནི་གྲུབ་པ་ཡིན། །ང་ལ་འོད་ཟེར་རྣམ་དག་མཆོག་ཡོད་དེ། །འཁོར་ནི་བྱེ་བ་\nབརྒྱད་བཅུ་གྲངས་སྙེད་ཡོད། །ཏིང་འཛིན་གཅིག་ནི་ཡོངས་སུ་བཟུང་བས་ན། །དེ་ཕྱིར་འོད་ཟེར་འདི་ནི་གྲུབ་པ་ཡིན། །འདས་པའི་དུས་ཀྱི་སངས་རྒྱས་མཚན། །ཁྱད་པར་འཕགས་པ་ཞེས་བྱ་<span class='delete'>བྱུང། །</span><span class='add'>བྱུང་། །</span>སངས་རྒྱས་དེས་ནི་འཇིག་\nརྟེན་ན། །སྐུ་ཚེའི་ཚད་ནི་མེད་པར་བཞུགས། །དང་པོ་མངོན་<span class='delete'>པར་</span><span class='add'>པར་</span>སངས་རྒྱས་ཚེ། །ཆོས་བསྟན་འཁོར་དུ་འདུས་པ་ཡི། །གྲངས་ནི་ཁྲག་ཁྲིག་བརྒྱད་བཅུ་སྙེད། །དེ་ཉིད་དུ་ནི་འདུས་པར་གྱུར། །དེ་ཡི་ཚེ་ན་འཛམ་བུ་ཡི། །གླིང་ཆེན་དག་\nནི་འདི་དག་ཏུ། །ཡུལ་གྱི་རྒྱལ་པོ་དེ་ཡི་མིང་། །སྒྲ་ལ་མོས་ཤེས་བྱ་བ་<span class='delete'>བྱུང། །</span><span class='add'>བྱུང་། །</span>རྒྱལ་པོ་ཆེན་པོ་དེ་ལ་ནི། །བུ་ཕོ་དག་ནི་ལྔ་བརྒྱ་ཡོད། །<span class='delete'>བྱད་</span><span class='add'>བྱེད་</span>བཞིན་དག་ནི་སྡུག་མཛེས་པས། །མཐོང་བ་དག་ནི་དགའ་བར་འགྱུར། །དེ་ཡི་ཚེ་ན་རྒྱལ་པོའི་ཡབ། །\nགཟི་བྱིན་རང་དབང་རབ་ལྡན་ཞིང། །དཀོན་མཆོག་དག་ནི་གསུམ་པོ་ལ། །ཤིན་<span class='delete'>དུ་</span><span class='add'>དུ་</span>དང་བ་སྐྱེས་པར་གྱུར། །རྒྱལ་པོ་དེ་ལ་བསྐྱེད་མོས་ཚལ། །མཆོག་ཏུ་གྱུར་པ་ཇི་སྙེད་པ། །དེ་དག་ཐམས་ཅད་གུས་པས་ནི། །བཅོམ་ལྡན་དེ་ལ་རབ་ཏུ་\nཕུལ། །བསྐྱེད་མོས་ཚལ་ནི་དེ་དག་ཏུ། །འཆག་ས་དག་ནི་ཇི་སྙེད་པ། །དེ་དག་ཐམས་ཅད་ཀུན་ཏུ་ནི། །ལྗོན་ཤིང་ཙམ་པ་ཀ་དག་དང་། །ལྗོན་ཤིང་ནྱ་གྲོ་དྷ་དག་དང་། །ལྗོན་ཤིང་ཀྱེན་ཤུ་ཀ་དང་ནི། །ལྗོན་ཤིང་ཨུ་དུམ་<span class='delete'>པ་</span><span class='add'>བ་</span>ར་དང་།།"
 ],
 [
  "79.234a",
  "སེང་གེ་རིན་ཆེན་ཆུན་འཕྱང་ནི། །བྱེ་བ་ཕྲག་ནི་བརྒྱད་བཅུ་དང་། །གསེར་སྐུད་རིན་ཆེན་ཕྲེང་བ་ཡང་། །བྱེ་བ་ཕྲག་ནི་བརྒྱད་བཅུ་དག །ངོས་བཞི་དག་ནི་རབ་ཏུ་བརྒྱན། །གཞན་ཡང་རིན་ཆེན་དམ་པ་ནི། །འདི་ལྟར་རྣམ་\nཔ་སྣ་ཚོགས་ཀྱིས། །མུ་ཏིག་རིན་ཆེན་དྲ་<span class='delete'>པ་</span><span class='add'>བ་</span>དག །སྤེལ་མ་དག་ཏུ་རྣམ་པར་བརྒྱན། །འདི་ལྟ་བུ་ཡི་གདུགས་དག་གིས། །བསྐྱེད་མོས་ཚལ་ནི་ཀུན་ཏུ་གཡོགས། །དེ་ཡི་སྟེང་དུ་གཞན་ཡང་ནི། །པད་མ་སུ་མ་ན་དང་ནི། །\nཔད་མ་ཨ་ཏི་མུག་ཏ་<span class='delete'>ཀ། །</span><span class='add'>ཀ །</span>བཏང་བཟུང་ཞེས་ནི་བྱ་བ་དང་། །པད་མ་ཨུ་དུམ་<span class='delete'>པ་</span><span class='add'>བ་</span>ར་དང་། །པད་མ་སྔོན་པོ་ལ་སོགས་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>དེ་བཞིན་རྣམ་པ་སྣ་ཚོགས་ཀྱི། །པད་མའི་གདུགས་ནི་ཚད་མེད་པ། །རེ་རེ་ཐམས་ཅད་ཀུན་ཀྱང་ནི། །\nརིན་ཆེན་དྲ་བ་འཚམ་<span class='delete'>པར་</span><span class='add'>པར་</span>བྱས། །གཞན་ཡང་གསེར་གྱི་སྐུད་པ་ལས། །བྱས་པའི་གོས་དག་གིས་ཀྱང་ནི། །བླ་རེ་དག་ཏུ་རབ་བྱས་ནས། །དེ་ཡི་སྟེང་དུ་ཁྱབ་པར་གཡོགས། །གཞན་ཡང་ཙན་དན་རིན་ཆེན་ཁྲི། །གསེར་དག་\nལས་ནི་རྐང་བྱས་པ། །དེ་ཡི་གྲངས་ཀྱང་བྱེ་བ་ཕྲག །བརྒྱད་བཅུ་སྙེད་ནི་རབ་ཏུ་བཤམས། །རིན་ཆེན་ཁྲི་ནི་དེ་དག་ལ། །ཟབ་<span class='delete'>དང་</span><span class='add'>དར་</span>དག་ལས་བྱས་པ་ཡི། །སྟན་ནི་བྱེ་བ་ཕྲག་བརྒྱད་བཅུ། །དེ་ཡི་སྟེང་དུ་རབ་བརྒྱན་ཏོ། །\nདེ་ཡི་ཚེ་ན་སེམས་ཅན་གྱི། །རྣམ་པ་དག་ནི་ཇི་སྙེད་པ། །སྲིད་པའི་རྩེ་མོ་མན་ཆད་ཀྱང་། །ཐམས་ཅད་དེར་ནི་འདུས་གྱུར་ནས། །དེ་བཞིན་གཤེགས་པ་དེ་ལས་ནི། །མདོ་སྡེ་འདི་ནི་རབ་ཏུ་མཉན། །ལྷ་དང་ཀླུ་དང་གནོད་སྦྱིན་དང་། །དྲི་ཟ་\nཡི་ནི་རྒྱལ་པོ་དང་། །ལྟོ་འཕྱེ་ཆེན་པོ་ལྷ་མ་ཡིན། །དེ་དག་མདོ་སྡེ་འདི་ཐོས་ནས། །རབ་ཏུ་དགའ་བའི་སེམས་སྐྱེས་པས། །ཚིགས་སུ་བཅད་པ་བརྒྱད་སྟོང་གིས། །དེ་བཞིན་གཤེགས་པའི་བསྔགས་བརྗོད་ནས། །དེ་དག་\nཐམས་ཅད་ཀུན་གྱིས་<span class='delete'>ཀྱང། །</span><span class='add'>ཀྱང་། །</span>བྱང་ཆུབ་ཆེན་པོར་སྨོན་ལམ་བཏབ། །ལྷ་དང་ཀླུ་དང་ལྷ་མ་ཡིན། །དེ་ལ་སོགས་པ་ཐམས་ཅད་ཀྱང་། །ཡོངས་སུ་དང་བའི་སེམས་ཀྱིས་ནི། །མེ་ཏོག་མན་དཱ་ར་བ་དང་། །མུ་ཏིག་རིན་ཆེན་ལ་སོགས་"
 ],
 [
  "79.234b",
  "པའི། །ཆར་ཕབ་མཆོད་པ་རབ་ཏུ་བྱས། །དེ་ཡི་ཚེ་ན་གཞན་ཡང་ནི། །ལྷ་ཆེན་མཐུ་དང་གཟི་ལྡན་<span class='delete'>པ། །</span><span class='add'>པ། །</span>བྱེ་བ་ཕྲག་ནི་བརྒྱད་བཅུ་སྙེད། །མདོ་སྡེ་འདི་ནི་ཐོས་པས་ན། །རབ་ཏུ་དགའ་བའི་སེམས་བསྐྱེད་ནས། །བྱང་ཆུབ་\nཆེན་པོར་སྨོན་ལམ་བཏབ། །མ་འོངས་པ་ཡི་དུས་ཀྱི་ཚེ། །འོད་ཟེར་འདི་འདྲ་ཐོབ་པར་ཤོག །དེ་བཞིན་གཤེགས་པས་དེ་ཡི་ཚེ། །དེ་ཡི་བསམ་པ་ཐུགས་<span class='delete'>ཆུང་</span><span class='add'>ཆུད་</span>པས། །མ་འོངས་སངས་རྒྱས་འགྲུབ་འགྱུར་ཞེས། །བྱང་\nཆུབ་ཏུ་ནི་ལུང་ཡང་བསྟན། །དེ་ཡི་ཚེ་ན་གཞན་ཡང་ནི། །བརྒྱ་བྱིན་ལྷ་ཡི་དབང་པོ་དང་། །ཚངས་པ་འཁོར་དང་བཅས་པ་ཡང་། །བྱེ་བ་ཕྲག་ནི་བརྒྱད་བཅུ་སྙེད། །འོད་ཟེར་རབ་ཏུ་སྟོན་པ་ཡི། །མདོ་སྡེ་འདི་ནི་ཐོས་\nཔས་ན། །རབ་ཏུ་དགའ་བའི་སེམས་བསྐྱེད་ནས། །བྱང་ཆུབ་ཏུ་ནི་སེམས་ཀྱང་བསྐྱེད། །མ་འོངས་སངས་རྒྱས་འགྲུབ་འགྱུར་ཞེས། །བྱང་ཆུབ་ཏུ་ནི་ལུང་ཡང་བསྟན། །དེ་ཡི་ཚེ་ན་གཞན་ཡང་ནི། །ཀླུ་ནི་བྱེ་བ་\nཁྲག་ཁྲིག་ཕྲག །བརྒྱད་བཅུ་སྙེད་ནི་འདུས་པ་<span class='delete'>དག། །</span><span class='add'>དག །</span>མདོ་སྡེ་འདི་ནི་ཐོས་པས་ན། །བྱང་ཆུབ་ཏུ་<span class='delete'>ན་</span><span class='add'>ནི་</span>སེམས་བསྐྱེད་པས། །ལུང་བསྟན་པ་ཡང་ཐོབ་པར་གྱུར། །དེ་ཡི་ཚེ་ན་གཞན་ཡང་ནི། །གསེར་འདབ་\nརྒྱལ་པོ་བྱེ་བ་ཕྲག །བརྒྱད་བཅུ་སྙེད་ནི་འདུས་པ་དག །མདོ་སྡེ་འདི་ནི་ཐོས་པས་ན། །སྡོམ་པ་ལྔ་ནི་རབ་བསྲུངས་ཏེ། །ལུང་བསྟན་པ་ཡང་ཐོབ་པར་གྱུར། །དེ་ཡི་ཚེ་ན་གཞན་ཡང་ནི། དྲི་ཟའི་རྒྱལ་པོ་བྱེ་བ་\n<span class='delete'>ཕྲག། །</span><span class='add'>ཕྲག །</span>བརྒྱད་བཅུ་སྙེད་ནི་འདུས་པ་<span class='delete'>དག། །</span><span class='add'>དག །</span>མདོ་སྡེ་འདི་ནི་ཐོས་པས་ན། །རོལ་མོ་བརྒྱ་སྟོང་རྣམས་བྱས་ཏེ། །སྒྲ་སྙན་དག་ནི་རབ་ཕྱུང་ནས། །བཅོམ་ལྡན་དེ་ལ་མཆོད་བྱས་པས། །ལུང་བསྟན་པ་ཡང་ཐོབ་པར་\nགྱུར། །དེ་ཡི་ཚེ་ན་གཞན་ཡང་ནི། །གནོད་སྦྱིན་རྒྱལ་པོ་ཁྲག་ཁྲིག་སྙེད། །མདོ་སྡེ་འདི་ནི་ཐོས་པས་ན། །སངས་རྒྱས་ཡེ་ཤེས་དག་ལས་ནི། །ཤིན་དུ་དད་པ་སྐྱེས་པར་གྱུར། །དེ་དག་ཐམས་ཅད་ཀུན་གྱིས་ཀྱང་།།"
 ],
 [
  "79.231a",
  "ང་ལ་འོད་ཟེར་ཡང་ཡོད་<span class='delete'>དེ། </span><span class='add'>དེ། །</span>དེ་མིང་འབྱུང་བ་མེད་ཅེས་བྱ། །སྐྱེ་བ་མེད་པའི་བསྔགས་བརྗོད་པས། །དེ་ཕྱིར་དེ་ལས་སྐྱེས་པ་ཡིན། །ང་ལ་འོད་ཟེར་ཡང་ཡོད་<span class='delete'>དེ། </span><span class='add'>དེ། །</span>དེ་མིང་<span class='delete'>སྐྱེད་</span><span class='add'>སྐྱེ་</span>བ་མེད་ཅེས་བྱ། །\nའབྱུང་བ་མེད་པའི་བསྔགས་བརྗོད་པས། །དེ་ཕྱིར་དེ་ལས་སྐྱེས་པ་ཡིན། །ང་ལ་འོད་ཟེར་བསྟན་མེད་ཅེས་བྱ་ཡོད། །སྐྱེ་དགུ་རྣམས་ནི་ཡོངས་སུ་སྨིན་པར་བྱེད། །ང་ལ་འོད་ཟེར་ཆོས་ཉིད་ཅེས་བྱ་ཡོད། །\nསངས་རྒྱས་ཞིང་ནི་བྱེ་བ་གཡོ་བར་བྱེད། །ང་ལ་འོད་ཟེར་བདུད་འདུལ་ཞེས་བྱ་ཡོད། །འོད་ཟེར་དེ་ཡི་གཟིས་ནི་བདུད་སྐྲག་བྱེད། །ང་ལ་འོད་ཟེར་བསོད་ནམས་རྒྱལ་མཚན་ཡོད། །དེ་ཡི་མིང་འཛིན་དག་ནི་གནོད་པ་སྤོང། །\nང་ལ་འོད་ཟེར་སྟོབས་ལྡན་རྒྱལ་མཚན་ཡོད། །དེ་ཡི་མིང་འཛིན་དག་ནི་དགྲ་རབ་སྤོང་། །ང་ལ་འོད་ཟེར་རབ་ཞི་རྒྱལ་མཚན་ཡོད། །དེ་ཡི་མིང་འཛིན་དག་ནི་འདོད་ཆགས་སྤོང་། །ང་ལ་འོད་ཟེར་བསམ་གཏན་རྒྱལ་\nམཚན་ཡོད། །དེ་ཡི་མིང་འཛིན་དག་ནི་ལོག་སྤྱོད་སྤོང་། །ང་ལ་འོད་ཟེར་གྲགས་པའི་རྒྱལ་མཚན་ཡོད། །དེ་ཡི་མིང་འཛིན་དག་ནི་གྲགས་པ་འཐོབ། །ང་ལ་འོད་ཟེར་ཡིད་དགའ་རྒྱལ་མཚན་ཡོད། །དེ་ཡི་མིང་\nའཛིན་དག་ནི་མྱ་ངན་མེད། །ང་ལ་འོད་ཟེར་སྡོམ་གཙང་རྒྱལ་མཚན་ཡོད། །དེ་ཡི་མིང་འཛིན་ཚུལ་ཁྲིམས་འཆལ་པ་སྤོང་། །ང་ལ་འོད་ཟེར་སྤོས་མཆོག་རྒྱལ་མཚན་ཡོད། །དེ་ཡི་མིང་འཛིན་མི་གཙང་མེད་པར་\nའགྱུར། །ང་ལ་འོད་ཟེར་ཆོས་ཟབ་ཅེས་བྱ་ཡོད། །དེ་ཡི་མིང་འཛིན་ཐེ་ཚོམ་མེད་པར་འགྱུར། །ང་ལ་འོད་ཟེར་གནས་པ་མེད་པ་ཡོད། །དེ་ཡི་མིང་འཛིན་སྲེད་པ་སྤོང་བར་འགྱུར། །ང་ལ་འོད་ཟེར་རྟོག་བྲལ་ཞེས་བྱ་\nཡོད། །དེ་ཡི་མིང་འཛིན་འཛིན་པ་མེད་པར་འགྱུར། །ང་ལ་འོད་ཟེར་རི་རབ་ཅེས་བྱ་ཡོད། །དེ་ཡི་མིང་འཛིན་གཡོ་བ་མེད་པར་འགྱུར། །ང་ལ་འོད་ཟེར་གསང་བའི་སྤྱོད་པ་ཡོད། །དེ་ཡི་མིང་འཛིན་མངོན་<span class='delete'>པར་</span><span class='add'>པར་</span>ཞེན་པ་མེད། །"
 ],
 [
  "79.235a",
  "བྱང་ཆུབ་ལུང་བསྟན་ཐོབ་པར་གྱུར། །ཟླ་འོད་འདི་ལྟར་ཤེས་པར་གྱིས། །དེ་ཚེ་རྒྱལ་པོ་སྒྲ་མོས་པས། །མཆོད་པ་རྣམ་པ་སྣ་ཚོགས་ཀྱིས། །བཅོམ་ལྡན་དེ་ལ་མཆོད་བྱས་པ། །གཞན་ཡིན་སྙམ་\nདུ་མི་བལྟ་སྟེ། །དེ་ནི་ཁྱོད་བདག་ཉིད་ཡིན་ནོ། །ཁྱོད་ནི་སྔོན་འདས་དུས་ཀྱི་ཚེ། །མདོ་སྡེ་འདི་ནི་ཐོས་པའི་རྒྱུས། །དེ་ལྟ་བས་ན་དེང་འདིར་ཡང་། །འདི་ཉིད་སླར་ཡང་ཞུས་པ་ཡིན། །ང་ནི་མྱ་ངན་འདས་པའི་འོག །གང་ཡང་\nརུང་བ་སུ་ཞིག་གིས། །དམ་པའི་ཆོས་ཀྱི་འཁོར་ལོ་དག །རྣམ་པར་འཇིག་པའི་དུས་ཀྱི་ཚེ། །ཆོས་ཀྱི་བསྟན་པ་འདི་དག་ནི། །དང་<span class='delete'>པའི་</span><span class='add'>བའི་</span>སེམས་ནི་གང་བསྐྱེད་པ། །འདི་ལྟ་བུ་ཡི་མདོ་སྡེ་དག །རྒྱ་<span class='delete'>ཆེད་</span><span class='add'>ཆེར་</span>ཡང་དག་སྟོན་པར་\nནུས། །མ་འོངས་མདོ་སྡེ་འདི་ནི་གང་སྟོན་པ། །དེས་ནི་ང་ཡི་ཆོས་འཛིན་སྲུང་བར་བྱེད། །དེ་ནི་འདྲོན་མང་<span class='delete'>དེང་</span><span class='add'>དེད་</span>པའི་<span class='delete'>དེང་</span><span class='add'>དེད་</span>དཔོན་འདྲ། །རིན་ཆེན་གཏེར་འཛིན་སྲུང་<span class='delete'>པ་</span><span class='add'>བ་</span>ཞེས་ཀྱང་བྱ། །མ་འོངས་དུས་ཚེ་མདོ་འདི་གང་ཐོས་ནས། །\nསྐད་ཅིག་ཙམ་དུ་མོས་པ་སྐྱེད་བྱེད་པ། །དེ་ནི་སངས་རྒྱས་བྱིན་གྱིས་<span class='delete'>བརླགས་</span><span class='add'>བརླབས་</span>པ་ཡིན། །འཇམ་དཔལ་བྱིན་གྱིས་<span class='delete'>བརླགས་</span><span class='add'>བརླབས་</span>པར་རིག་པར་བྱ། །དེས་ནི་སངས་རྒྱས་མང་པོ་མཐོང་འགྱུར་<span class='delete'>པས། །</span><span class='add'>བས། །</span>གསང་<span class='delete'>པའི་</span><span class='add'>བའི་</span>ཆོས་<span class='delete'>གཏང་</span><span class='add'>གཏད་</span>ཤེས་\nརབ་རྣོ་བར་འགྱུར། །སེམས་ཅན་གང་དག་སེམས་དྲང་མཉེན་དེས་ཤིང་། །རྟག་ཏུ་སངས་རྒྱས་རིམ་གྲོ་བྱེད་<span class='delete'>པ་</span><span class='add'>ལ་</span>བརྩོན། །བདག་མེད་སྒོམ་ཞིང་བྱམས་དང་བཟོད་སྐྱེད་པ། །དེས་ནི་མདོ་སྡེ་འདི་ལ་མོས་པར་འགྱུར། །གང་\nཞིག་རྟག་ཏུ་མི་དགེའི་སེམས་འཆང་ཞིང་། །རྙེད་ལ་གདུ་ཞིང་ཆོག་མི་ཤེས་པ་དང་། །རབ་དབེན་རྣམས་ལ་མོས་པར་མི་འགྱུར་བ། །དེས་ནི་མདོ་སྡེ་འདི་ལ་མོས་མི་འགྱུར། །གང་ཞིག་དེ་བཞིན་གཤེགས་པ་རྣམས་\nམཆོད་དང་། །དམ་ཆོས་ཟབ་མོ་ལེགས་པར་རྟོགས་པ་དང་། །སངས་རྒྱས་ཡང་དག་ཡེ་ཤེས་ཡིད་ཆེས་<span class='delete'>པ། །</span><span class='add'>པ། །</span>དེས་ནི་མདོ་སྡེ་འདི་ལ་མོས་པར་འགྱུར། །གང་ཞིག་སེམས་གཡེང་དང་བའི་སེམས་མེད་ཅིང་། །རྟག་"
 ],
 [
  "79.235b",
  "ཏུ་སྲོག་གཅོད་གདུལ་བར་རབ་དཀའ་དང་། །འདོད་པའི་ཡུལ་རྣམས་ཀུན་གྱི་བྲན་བྱེད་པ། །དེས་ནི་མདོ་སྡེའི་འདི་ལ་མོས་མི་འགྱུར། །གང་ཞིག་རྟག་ཏུ་དགོན་གནས་རབ་མོས་ཤིང་། །གཅིག་པུ་དབེན་<span class='delete'>པར་</span><span class='add'>པར་</span>འདུག་ཅིང་\nསེམས་ཞི་དང་། །རྙེད་དང་གཉེན་ལ་མངོན་<span class='delete'>པར་</span><span class='add'>པར་</span>ཞེན་མེད་པ། །དེས་ནི་མདོ་སྡེ་འདི་ལ་མོས་པར་འགྱུར། །གང་ཞིག་གྲོགས་<span class='delete'>དན་</span><span class='add'>ངན་</span>དག་གི་རྗེས་འབྲང་<span class='delete'>ཞིང། །</span><span class='add'>ཞིང་། །</span>བདག་དང་གཞན་གྱི་དགེ་བ་འཇིག་བྱེད་དང་། །ཚུལ་ཁྲིམས་ཏིང་འཛིན་དག་\nནི་ཆེར་ཉམས་པ། །དེས་ནི་མདོ་སྡེ་འདི་ལ་མོས་མི་འགྱུར། །གང་ཞིག་ཡིད་མོས་ཤིན་དུ་རྣམ་དག་ཅིང་། །རྟག་ཏུ་ཤེས་རབ་ཆོས་རྣམས་རབ་འབྱེད་དང་། །དགེ་བའི་བཤེས་གཉེན་དག་གིས་རབ་བསྲུངས་པ། །དེས་ནི་མདོ་སྡེ་འདི་\nལ་མོས་པར་འགྱུར། །གང་ཞིག་གཉེན་གྱི་ཁྱིམ་ལ་རབ་ཆགས་ཤིང་། །མེ་ཏོག་འབྲས་བུ་བྱིན་ནས་དགའ་བྱེད་དང་། །སེམས་ལ་དྲང་པོ་མེད་ཅིང་སྒྱུ་འཆང་<span class='delete'>པ། །</span><span class='add'>བ། །</span>དེས་ནི་མདོ་སྡེ་འདི་ལ་མོས་མི་འགྱུར། །གང་ཞིག་རྟག་ཏུ་\nསངས་རྒྱས་དྲིན་དྲན་ཞིང་། །དགེ་བའི་རྩ་བ་མཆོག་ལ་མོས་པ་དང་། །བྱང་ཆུབ་བསྔོ་ཞིང་གཡོ་སྒྱུ་མེད་གྱུར་པ། །དེས་ནི་མདོ་སྡེ་འདི་ལ་མོས་པར་འགྱུར། །གང་ཞིག་ཆུང་མ་བུ་མོ་སྲེད་ཆགས་ཤིང་། །<span class='delete'>འགོས་</span><span class='add'>གོས་</span>\nམཆོག་སྣ་ཚོགས་དག་གིས་རབ་བརྒྱན་ནས། །རྟག་ཏུ་དེ་དང་ལྷན་ཅིག་རྩེ་སྨོན་པ། །དེས་ནི་མདོ་སྡེ་འདི་ལ་མོས་མི་འགྱུར། །གང་ཞིག་སེམས་ཟབ་གནས་པ་མེད་གྱུར་ཅིང་། །འདོད་པའི་ཡུལ་གྱིས་གོས་\nཔ་མེད་པ་དང་། །ཟས་སྐོམ་དག་གིས་གཡོ་སྒྱུ་མི་སྐྱེད་པ། །དེས་ནི་མདོ་སྡེ་འདི་ལ་མོས་པར་འགྱུར། །གང་ཞིག་སྐྱེ་དགུ་རྣམས་ལ་འདི་སྐད་དུ། །འདོད་ཆགས་སྤྱད་ཀྱང་ཉེས་མེད་གང་ཟེར་བ། །དུས་གསུམ་\nསངས་རྒྱས་རྣམས་ལ་སྐུར་བ་ཡིན། །དེས་ནི་མདོ་སྡེ་འདི་ལ་མོས་མི་འགྱུར། །གང་ཞིག་ཡིད་ཆེས་རྟག་ཏུ་རབ་བརྟན་<span class='delete'>ཞིང། །</span><span class='add'>ཞིང་། །</span>ནན་ཏན་བསྐྱེད་ནས་ཆོས་རྣམས་ཚོལ་བ་ལ། །སྐྱོ་བ་མེད་ཅིང་བརྙས་<span class='delete'>པར་</span><span class='add'>པར་</span>མི་"
 ],
 [
  "79.236a",
  "བྱེད་པ། །དེས་ནི་མདོ་སྡེ་འདི་ལ་མོས་པར་འགྱུར། །གང་ཞིག་ཆུང་མ་བུ་མོ་མངོན་ཞེན་ཅིང་། །རྟག་ཏུ་འདོད་པའི་ཡུལ་ནི་རྗེས་དྲན་དང་། །ཤེས་རབ་མི་སྒོམ་རྒྱ་ཆེར་ཕན་མི་འདོགས། །དེས་\nནི་མདོ་སྡེ་འདི་ལ་མོས་མི་འགྱུར། །གང་ཞིག་རི་དང་ནགས་ཁྲོད་རབ་གནས་ཤིང་། །ཤེས་རབ་བསྒོམས་ནས་ཤིན་དུ་དག་འགྱུར་དང་། །འཚོ་བའི་ཡོ་བྱད་དག་ལ་འདོད་མེད་པ། །དེས་ནི་མདོ་སྡེ་འདི་ལ་མོས་\nཔར་འགྱུར། །གང་ཞིག་མིག་གི་སྔོན་དང་ཕྱི་མའི་མཐའ། །རྟག་ཏུ་རྨོངས་དང་མི་རྟོགས་གང་ཡིན་པ། །དེ་ནི་གཏི་མུག་བདུད་ཀྱིས་བཅིངས་པས་ན། །དེས་ནི་མདོ་སྡེ་འདི་ལ་མོས་མི་འགྱུར། །གང་ཞིག་མིག་\nགི་སྔོན་དང་ཕྱི་མའི་མཐའ། །རྟག་ཏུ་རྟོགས་ཤིང་རྨོངས་པ་མེད་གྱུར་པ། །དེ་ནི་བདུད་ཀྱིས་བཅིངས་ལས་གྲོལ་བས་ན། །དེས་ནི་མདོ་སྡེ་འདི་ལ་མོས་<span class='delete'>པར་</span><span class='add'>པར་</span>འགྱུར། །གང་ཞིག་མིག་མཐའ་ཡོད་དང་མེད་པ་ལ། །རྟག་\nཏུ་རྨོངས་ནས་ཁོང་དུ་མ་ཆུད་པ། །དེ་ནི་གཏི་མུག་བདུད་ཀྱིས་བཅིངས་པས་ན། །དེས་ནི་མདོ་སྡེ་འདི་ལ་མོས་མི་འགྱུར། །གང་ཞིག་མིག་མཐའ་ཡོད་དང་མེད་པ་དག །རྟག་ཏུ་རྟོགས་ཤིང་རྨོངས་པ་མེད་གྱུར་\nཔ། །དེ་ནི་བདུད་ཀྱིས་བཅིངས་ལས་གྲོལ་བས་ན། །དེས་ནི་མདོ་སྡེ་འདི་ལ་མོས་པར་འགྱུར། །གང་ཞིག་མི་གནས་འཇིག་པའི་མཚན་ཉིད་ལ། །རྟག་ཏུ་རྨོངས་ཤིང་ཁོང་དུ་མི་ཆུད་པ། །དེ་ནི་གཏི་མུག་བདུད་ཀྱིས་\nབཅིངས་པས་ན། །དེས་ནི་མདོ་སྡེ་འདི་ལ་མོས་མི་འགྱུར། །གང་ཞིག་མི་གནས་འཇིག་པའི་མཚན་ཉིད་<span class='delete'>དག། །</span><span class='add'>དག །</span>རྟག་ཏུ་ཁོང་དུ་ཆུད་ཅིང་རྨོངས་མེད་པ། །དེ་ནི་བདུད་ཀྱིས་བཅིངས་ལས་གྲོལ་བས་ན། །དེས་ནི་མདོ་སྡེ་\nའདི་ལ་མོས་པར་འགྱུར། །རྣ་བ་སྣ་དང་ལྕེ་ལུས་ཡིད་དག་དང་། །གཟུགས་སྒྲ་དྲི་རོ་རེག་བྱ་ཆོས་རྣམས་དང་། །ས་ཆུ་མེ་རླུང་ངོ་བོ་ཉིད་དག་དང་། །དངོས་པོ་སེམས་ཅན་སྡུག་བསྔལ་ཕུང་པོ་དང་། །ཁམས་དང་"
 ],
 [
  "79.237a",
  "བྲལ་བས་ན། །དེས་ནི་མདོ་སྡེ་འདི་ལ་མོས་<span class='delete'>པར་</span><span class='add'>པར་</span>འགྱུར། །གང་ཞིག་མིག་ལ་བདག་མེད་མ་རྟོགས་ནས། །བཟོད་པའི་གནས་ལ་རྟག་ཏུ་རྨོངས་གྱུར་པ། །དེ་ནི་སྐྱེ་བོའི་སྤྱོད་པར་ལྷུང་བས་ན། །\nདེས་ནི་མདོ་སྡེ་འདི་ལ་མོས་མི་འགྱུར། །གང་ཞིག་མིག་ལ་བདག་མེད་རབ་རྟོགས་ནས། །བཟོད་པའི་གནས་ནི་རྟག་ཏུ་རྟོགས་གྱུར་པ། །དེ་ནི་སྐྱེ་བོའི་སྤྱོད་དང་བྲལ་བས་ན། །དེས་ནི་མདོ་སྡེ་འདི་ལ་མོས་པར་\nའགྱུར། །གང་ཞིག་མིག་ཟད་ངོ་བོ་མ་རྟོགས་པ། །དེ་ནི་མི་གནས་ཚུལ་ཁྲིམས་བསྒྲུབ་མི་ནུས། །མི་གནས་ཚུལ་ཁྲིམས་མངོན་<span class='delete'>པར་</span><span class='add'>པར་</span>མི་བསྒྲུབ་པས། །དེས་ནི་མདོ་སྡེ་འདི་ལ་མོས་མི་འགྱུར། །གང་ཞིག་མིག་ཟད་\nངོ་བོ་རབ་རྟོགས་པ། །དེས་ནི་མི་གནས་ཚུལ་ཁྲིམས་བསྒྲུབ་པར་ནུས། །མི་གནས་ཚུལ་ཁྲིམས་མངོན་<span class='delete'>པར་</span><span class='add'>པར་</span>བསྒྲུབ་པས་ན། །དེས་ནི་མདོ་སྡེ་འདི་ལ་མོས་པར་འགྱུར། །གང་ཞིག་མིག་ཟད་ངོ་བོ་མ་རྟོགས་པ། །དེས་ནི་ཟག་མེད་\nཚུལ་ཁྲིམས་བསྒྲུབ་མི་ནུས། །ཟག་མེད་ཚུལ་ཁྲིམས་མངོན་<span class='delete'>པར་</span><span class='add'>པར་</span>མི་བསྒྲུབ་པས། །དེས་ནི་མདོ་སྡེ་འདི་ལ་མོས་མི་འགྱུར། །གང་ཞིག་མིག་ཟད་ངོ་བོ་རབ་རྟོགས་པ། །དེས་ནི་ཟག་མེད་ཚུལ་ཁྲིམས་བསྒྲུབ་པར་ནུས། །ཟག་མེད་\nཚུལ་ཁྲིམས་མངོན་<span class='delete'>པར་</span><span class='add'>པར་</span><span class='delete'>བསྒྲུབ་</span><span class='add'>བསྒྲུབས་</span>པས་ན། །དེས་ནི་མདོ་སྡེ་འདི་ལ་མོས་པར་འགྱུར། །གང་ཞིག་མིག་ཟད་ངོ་བོ་མ་རྟོགས་པ། །དེས་ནི་ཟག་མེད་ཤེས་རབ་བསྒྲུབ་མི་ནུས། །ཟག་མེད་ཤེས་རབ་མངོན་<span class='delete'>པར་</span><span class='add'>པར་</span>མི་བསྒྲུབ་པས། །\nདེས་ནི་མདོ་སྡེ་འདི་ལ་མོས་མི་འགྱུར། །གང་ཞིག་མིག་ཟད་ངོ་བོ་རབ་རྟོགས་པ། །དེས་ནི་ཟག་མེད་ཤེས་རབ་བསྒྲུབ་པར་ནུས། །ཟག་མེད་ཤེས་རབ་མངོན་<span class='delete'>པར་</span><span class='add'>པར་</span><span class='delete'>བསྒྲུབ་</span><span class='add'>བསྒྲུབས་</span>པས་ན། །དེས་ནི་མདོ་སྡེ་འདི་ལ་མོས་མི་འགྱུར། །\nགང་ཞིག་མིག་ཟད་ངོ་བོ་མ་རྟོགས་པ། །མིག་<span class='delete'>སོད་</span><span class='add'>སྟོང་</span>ཉིད་ལ་རྟག་ཏུ་རྨོངས་པར་འགྱུར། །དེས་ནི་ཀུན་འཛིན་ཡེ་ཤེས་མི་སྐྱེད་<span class='delete'>པས། །</span><span class='add'>པས། །</span>མདོ་སྡེ་འདི་ལ་རབ་ཏུ་མོས་མིན་འགྱུར། །གང་ཞིག་མིག་ཟད་ངོ་བོ་རབ་རྟོགས་<span class='delete'>པ</span><span class='add'>པ།  །</span>་"
 ],
 [
  "79.233b",
  "<span class='delete'>ལྡོན་</span><span class='add'>ལྗོན་</span>ཤིང་<span class='delete'>པ་</span><span class='add'>པ་</span>ལ་ས་ཏྲ་དང་། །ལྗོན་ཤིང་ཤི་རི་ཤ་དག་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>ལྗོན་ཤིང་མྱ་ངན་ཚངས་ལ་སོགས། །དེ་དག་གྲངས་ནི་སོ་སོར་ཡང་། །བྱེ་བ་ཕྲག་ནི་བརྒྱད་བཅུ་ཡོད། །ལྗོན་ཤིང་མང་པོ་དེ་དག་<span class='delete'>ཀྱང། །</span><span class='add'>ཀྱང་། །</span>དབྱར་དང་\nདགུན་ནི་འདྲ་བར་<span class='delete'>ཡང། །</span><span class='add'>ཡང་། །</span>མེ་ཏོག་འབྲས་བུ་ཡལ་ག་དག །ཁ་དོག་དག་ནི་གསལ་ཞིང་རྒྱས། །དྲི་མཆོག་དག་པ་རབ་འབྱུང་ཞིང་། །དེ་བཞིན་གཤེགས་པའི་སྐུ་ལ་འཐུལ། །དགེ་སློང་དག་ནི་ཇི་སྙེད་པ། །ལུས་ཀྱི་ཁ་\nདོག་གསེར་དང་འདྲ། །དེ་དག་ཐམས་ཅད་ཀུན་ཀྱང་ནི། །ལྗོན་ཤིང་དག་ནི་དེ་དྲུང་དུ། །འདུག་ནས་རབ་ཏུ་བརྩོན་<span class='delete'>པས་</span><span class='add'>པས་</span>ན། །གཟུངས་ནི་རབ་ཏུ་ཐོབ་པར་གྱུར། །དེ་ཚེ་དེ་བཞིན་གཤེགས་པ་དེ། །རྒྱལ་པོ་ཡབ་དང་སྲས་རྣམས་\nདང་། །གཞན་ཡང་འཁོར་ནི་མང་པོ་ལ། །ཤིན་དུ་ཐུགས་ནི་བརྩེ་བའི་ཕྱིར། །རྣམ་པར་ངེས་པའི་འོད་ཟེར་<span class='delete'>མོད། །</span><span class='add'>མདོ། །</span>དེ་དག་ལ་ནི་རབ་ཏུ་བསྟན། །རྒྱལ་པོ་དེས་ནི་ཐོས་གྱུར་ནས། །སེམས་ནི་རབ་ཏུ་དགའ་བར་གྱུར། །ཚིགས་སུ་བཅད་\nཔ་ཚད་མེད་པས། །དེ་བཞིན་གཤེགས་པའི་བསྔགས་པ་བརྗོད། །གཞན་ཡང་རྒྱལ་པོ་ཆེན་པོ་དེས། །རིན་པོ་ཆེ་ཡི་གདུགས་དམ་པ། །བྱེ་བ་ཕྲག་ནི་བརྒྱད་བཅུ་སྙེད། །བཅོམ་ལྡན་དེ་ལ་རབ་ཏུ་ཕུལ། །རིན་ཆེན་གདུགས་\nནི་རེ་རེ་ལ། །ཡིད་བཞིན་ནོར་བུའི་དྲ་བ་དག །མཐའ་མ་འཁོར་བར་རབ་ཏུ་བརྒྱན། །ཡིད་བཞིན་ནོར་བུ་རིན་པོ་ཆེ། །དེ་དག་རེ་རེའི་རིན་ཐང་ཡང་། <span class='delete'>འཇམ་</span><span class='add'>འཛམ་</span>བུའི་གསེར་ནི་<span class='delete'>བཅོ་</span><span class='add'>བཙོ་</span>མ་དག། །<span class='delete'>སྲད་</span><span class='add'>སྲང་</span>ནི་བྱེ་བ་བརྒྱད་བཅུ་<span class='delete'>ནི། །</span><span class='add'>རི། །</span>རིན་ཆེན་གདུགས་\nནི་རེ་རེ་ཡང་། །ཡིད་བཞིན་ནོར་བུ་རིན་པོ་ཆེ། །བྱེ་བ་ཕྲག་ནི་བརྒྱད་བཅུ་སྙེད། །ཕྲེང་<span class='delete'>པ་</span><span class='add'>བ་</span>དག་ཏུ་བྱས་པར་གྱུར། །ཡིད་བཞིན་རིན་ཆེན་དེ་དག་<span class='delete'>ཀྱང། །</span><span class='add'>ཀྱང་། །</span>ཁ་དོག་དག་ནི་རབ་གསལ་<span class='delete'>པས། །</span><span class='add'>བས། །</span>ཉིན་མཚན་དག་ནི་མེད་པར་<span class='delete'>ཡང། །</span><span class='add'>ཡང་། །</span>\nརྟག་ཏུ་འོད་ཟེར་རབ་ཏུ་གཏོད། །འོད་ཟེར་དེ་དག་རེ་རེས་ཀྱང་། །དཔག་ཚད་བརྒྱ་ནི་སྣང་བར་བྱེད། །འོད་ཟེར་དེ་དག་རབ་གསལ་བས། །ཉི་ཟླ་དག་ནི་ཟིལ་གྱིས་གནོན། །གཞན་ཡང་རིན་ཆེན་གདུགས་དེ་<span class='delete'>དག  །  །</span><span class='add'>དག  །</span>"
 ],
 [
  "79.236b",
  "འཇིག་རྟེན་སྐྱེ་སྒྲ་མི་བདེན་དང་། །འདོད་ཆགས་ཞེ་སྡང་གཏི་མུག་ང་རྒྱལ་སྲིད། །འཆབ་རྒྱགས་སེར་སྣ་ཕྲག་དོག་གཡོ་སྒྱུ་དང་། །ཁྲོ་སོགས་པར་ཡང་དེ་བཞིན་<span class='delete'>དིག་</span><span class='add'>རིག་</span>པར་གྱིས། །གཞན་ཞིག་མི་ཟད་མཐའ་ནི་དེ་དག་ལ། །\nརྟག་ཏུ་རྨོངས་ཤིང་ཁོང་དུ་མི་<span class='delete'>ཆུང་</span><span class='add'>ཆུད་</span>པ། །དེ་ནི་སྐྱེ་བོའི་སྤྱོད་པར་ལྷུང་བས་ན། །དེ་ནི་མདོ་སྡེ་འདི་ལ་མོས་མི་འགྱུར། །གང་ཞིག་མི་ཟད་མཐའ་ནི་དེ་དག་ལ། །རྟག་པར་ཁོང་དུ་<span class='delete'>ཆུང་</span><span class='add'>ཆུད་</span>ཅིང་རྨོངས་མེད་པ། །དེ་ནི་སྐྱེ་བོའི་སྤྱོད་དང་བྲལ་\nབས་ན། །དེས་ནི་མདོ་སྡེ་འདི་ལ་མོས་པར་འགྱུར། །གང་ཞིག་མིག་གི་འཇིག་པ་དེ་དག་ལ། །རྟག་ཏུ་རྨོངས་ཤིང་ཁོང་དུ་མ་ཆུད་པ། །དེ་ནི་སྐྱེ་བོའི་སྤྱོད་པར་ལྷུང་བས་ན། །དེས་ནི་མདོ་སྡེ་འདི་ལ་མོས་མི་འགྱུར། །གང་ཞིག་མིག་\nགི་འཇིག་པ་དེ་དག་ལ། །རྟག་པར་ཁོང་དུ་ཆུད་ཅིང་རྨོངས་མེད་པ། །དེ་ནི་སྐྱེ་བོའི་སྤྱོད་དང་བྲལ་བས་ན། །དེ་ནི་མདོ་སྡེ་འདི་ལ་མོས་པར་འགྱུར། །གང་ཞིག་མིག་གི་རབ་དབེན་དེ་དག་ལ། །རྟག་ཏུ་རྨོངས་ཤིང་ཁོང་\nདུ་མ་ཆུད་པ། །དེ་ནི་སྐྱེ་བོའི་སྤྱོད་པར་ལྷུང་བས་ན། །དེས་ནི་མདོ་སྡེ་འདི་ལ་མོས་མི་འགྱུར། །གང་ཞིག་མིག་གི་རབ་དབེན་དེ་དག་ལ། །རྟག་པར་ཁོང་དུ་ཆུད་ཅིང་རྨོངས་མེད་པ། །དེ་ནི་སྐྱེ་བོའི་སྤྱོད་དང་བྲལ་བས་ན། །\nདེས་ནི་མདོ་སྡེ་འདི་ལ་མོས་པར་འགྱུར། །གང་ཞིག་མིག་གི་འགྲོ་འོང་མེད་པ་ལ། །རྟག་ཏུ་རྨོངས་ཤིང་ཁོང་དུ་མ་ཆུད་པ། །དེ་ནི་སྐྱེ་བོའི་སྤྱོད་པར་ལྷུང་བས་ན། །དེས་ནི་མདོ་སྡེ་འདི་ལ་མོས་མི་འགྱུར། །གང་ཞིག་མིག་གི་འགྲོ་\n<span class='delete'>འོད་</span><span class='add'>འོང་</span>མེད་པ་<span class='delete'>དག། །</span><span class='add'>དག །</span>རྟག་ཏུ་ཁོང་དུ་ཆུད་ཅིང་རྨོངས་མེད་པ། །དེ་ནི་སྐྱེ་བོའི་སྤྱོད་དང་བྲལ་བས་ན། །དེས་ནི་མདོ་སྡེ་འདི་ལ་མོས་པར་འགྱུར། །གང་ཞིག་མིག་ལ་བདག་མེད་མ་རྟོགས་ནས། །མི་ཟད་ངོ་བོ་ཉིད་ལ་རྟག་\nརྨོངས་པ། །དེ་ནི་སྐྱེ་བོའི་སྤྱོད་པར་ལྷུང་བས་ན། །དེས་ནི་མདོ་སྡེ་འདི་ལ་མོས་མི་འགྱུར། །གང་ཞིག་མིག་ལ་བདག་མེད་རབ་རྟོགས་ནས། །མི་ཟད་ངོ་བོ་རྟག་ཏུ་རྟོགས་གྱུར་པ། །དེ་ནི་སྐྱེ་བོའི་སྤྱོད་དང་"
 ],
 [
  "79.237b",
  "མིག་སྟོང་ཉིད་ནི་རྟག་པར་རྟོགས་པར་འགྱུར། །དེས་ནི་ཀུན་འཛིན་ཡེ་ཤེས་རབ་བསྐྱེད་པས། །མདོ་སྡེ་འདི་ལ་རབ་ཏུ་མོས་པར་འགྱུར། །གང་ཞིག་མིག་ཟད་ངོ་བོ་ཉིད་རྟོགས་པ། །དེས་ནི་ཀུན་འཛིན་ཡེ་ཤེས་བསྒྲུབ་པ་ན། །\nབླ་མེད་མ་ཆགས་ཡེ་ཤེས་རབ་བསྒྲུབས་པས། །མདོ་སྡེ་འདི་ལ་རབ་ཏུ་མོས་པར་འགྱུར། །གང་ཞིག་མདོ་སྡེ་འདི་ལ་མ་མོས་པ། །མིག་ཟད་ངོ་བོ་ཉིད་ལ་རྟག་<span class='delete'>ཏ་</span><span class='add'>ཏུ་</span>རྨོངས། །དེ་ནི་ཏིང་འཛིན་རྣམས་ལས་ཉམས་པས་ན། །\nབླ་མེད་ཡེ་ཤེས་ཐོབ་པར་ཤིན་ཏུ་དཀའ། །གང་ཞིག་མདོ་སྡེ་འདི་ལ་རབ་མོས་ཤིང་། །མིག་ཟད་ངོ་བོ་ཉིད་ནི་མངོན་རྟོགས་པ། །དེས་ནི་ཏིང་འཛིན་མངོན་<span class='delete'>པར་</span><span class='add'>པར་</span>བསྒྲུབས་པས་ན། །བླ་མེད་ཡེ་ཤེས་མངོན་བྱེད་དཀའ་བ་མེད། །\nགང་ཞིག་མིག་ཟད་ངོ་བོ་ཉིད་རྟོགས་ཤིང་། །བདག་མེད་པ་ཡི་མཚན་ཉིད་རབ་ཤེས་པ། །དེས་ནི་རྟག་ཏུ་ཆོས་འདི་ཐོས་པས་ན། །མངོན་<span class='delete'>པར་</span><span class='add'>པར་</span>ཡིད་ཆེས་ཐེ་ཙོམ་མེད་པ་འཐོབ། །གང་ཞིག་མིག་ཟད་ངོ་བོ་ཉིད་སེམས་\nཤིང་། །ཉིན་མཚན་རབ་བརྩོན་ལེ་ལོ་མེད་གྱུར་པ། །དེས་ནི་ཀུན་འཛིན་སྤོབས་པ་མངོན་བསྒྲུབས་ནས། །མདོ་སྡེ་འདི་ནི་<span class='delete'>རྟོག་</span><span class='add'>རྟག་</span>ཏུ་སྟོན་པར་འགྱུར། །གང་ཞིག་མདོ་སྡེ་འདི་ནི་སེམས་བྱེད་པ། །འོད་ཟེར་འབྱིན་\nཔའི་ཡེ་ཤེས་རྫོགས་པར་འགྱུར། །དེས་ནི་དེ་བཞིན་གཤེགས་པ་རབ་སྟོན་<span class='delete'>ཅིང། །</span><span class='add'>ཅིང་། །</span>མིག་སྟོང་ཉིད་ནི་རབ་ཏུ་རྟོགས་པར་འགྱུར། །གང་ཞིག་མཆོད་རྟེན་བརྒྱ་སྟོང་རབ་བྱས་<span class='delete'>ཤིང། །</span><span class='add'>ཤིང་། །</span>སངས་རྒྱས་ཐམས་ཅད་མཆོད་\nཔ་བྱས་པ་བས། །གང་ཞིག་མདོ་སྡེ་འདི་ནི་སེམས་བྱེད་ན། །འདི་ཡི་ཡོན་ཏན་དེ་བས་ཁྱད་པར་འཕགས། །གང་གིས་རོལ་མོ་བརྒྱ་སྟོང་རབ་བྱས་ནས། །དེ་བཞིན་གཤེགས་པའི་རིང་སྲེལ་མཆོད་པ་བྱས། །\nགང་ཞིག་མདོ་སྡེ་འདི་ནི་ཐོས་གྱུར་ན། །འདི་ཡི་ཡོན་ཏན་དེ་བས་ཁྱད་པར་འཕགས། །སངས་རྒྱས་སྤྱན་གྱིས་གཟིགས་པའི་སེམས་ཅན་རྣམས། །བསྐལ་པ་དག་ནི་བྱེ་བ་ཚད་མེད་པར། །དེ་བཞིན་གཤེགས་དང་"
 ],
 [
  "79.239a",
  "པ་རབ་བསྒོམས་པས། །ཐ་ན་ཆུང་མ་དག་ལ་ཡང་། །འདོད་པའི་སེར་སྣ་ཡོང་མ་བསྐྱེད། །ང་སྔོན་མདོ་སྡེ་འདི་ཡི་ཕྱིར། །དབུལ་ཕོངས་དག་ནི་ཐམས་ཅད་ཀུན། །བདེ་བ་དག་ནི་ཐོབ་བྱའི་ཕྱིར། །\nནོར་དག་གིས་ནི་ཕྱུག་པོར་བྱས། །ང་སྔོན་མདོ་སྡེ་འདི་ཡི་ཕྱིར། །དགེ་སྦྱོང་དང་ནི་བྲམ་ཟེ་དང་། །སྐྱེ་དགུ་རྣམ་པ་སྣ་ཚོགས་ཀུན། །ཐམས་ཅད་དག་ནི་རབ་ཏུ་བསྡུས། །ང་སྔོན་མདོ་སྡེ་འདི་ཡི་ཕྱིར། །ཐམས་\nཅད་ཀུན་ལ་ཕན་གདགས་ཕྱིར། །རྟག་ཏུ་སྦྱིན་བདག་ཆེར་བྱས་ནས། །སློང་བ་དག་ལ་ཡོངས་སུ་<span class='delete'>བཏང་། </span><span class='add'>བཏང་། །</span>རེས་འགའ་མེ་ཏོག་འབྲས་བུ་<span class='delete'>དག། །</span><span class='add'>དག །</span>གཞན་དག་གཅོད་དུ་མི་གཞུག་པར། །སེམས་ཅན་རྣམས་ལ་\nཡོངས་བཏང་ཞིང་། །ཡིད་བཞིན་དུ་ནི་ཚིམ་<span class='delete'>པར་</span><span class='add'>པར་</span>བྱས། །ང་སྔོན་སྦྱིན་པ་བཏང་བའི་ཚེ། །སེམས་ནི་རྟག་ཏུ་སྙོམས་པས་ན། །ཚུལ་ཁྲིམས་ཡོན་ཏན་ལྡན་པ་དང་། །ཚུལ་ཁྲིམས་འཆལ་དང་ངོ་ཚ་མེད། །རྫུ་འཕྲུལ་ཆེན་པོ་\nཐོབ་པ་ནས། །སོ་སོའི་སྐྱེ་བོའི་བར་དག་ལ། །ངོ་མཚར་སྙམ་པའི་སེམས་བསྐྱེད་ནས། །གུས་པས་ཀུན་ལ་སྦྱིན་<span class='delete'>པ་</span><span class='add'>པ་</span>བཏང་། །ང་སྔོན་སྦྱིན་པ་གཏོང་བའི་ཚེ། །སེམས་ལ་མཐོ་དམའ་མེད་པས་ན། །སྡུག་བསྔལ་\nའགྲོ་བ་མི་ཚོལ་ཞིང་། །མདོ་སྡེ་འདི་ལ་རྩེ་གཅིག་མོས། །རེས་འགའ་ཡུལ་ཁམས་དག་ཏུ་ནི། །ཕྱིར་རྒོལ་ཐམས་ཅད་མེད་བྱས་ཤིང་། །ཀླུ་རྣམས་ཀུན་ནི་རབ་བཏུལ་ནས། །དུས་བཞིན་ཆར་ནི་རབ་ཏུ་ཕབ། །\nཟླ་འོད་ཁྱོད་ཀྱིས་ཤེས་པར་གྱིས། །ངས་ནི་ཚེ་རབས་དཔག་མེད་ནས། །མདོ་སྡེ་འདི་ནི་གཉེར་བའི་ཕྱིར། །དཀའ་བ་རྣམས་ནི་རབ་ཏུ་སྤྱད། །བསྐལ་པ་བརྒྱ་སྟོང་སྙེད་དུ་ནི། །བརྗོད་ཀྱང་མཐར་ཐུག་མི་འགྱུར་རོ། །\nཡིད་ཆེས་<span class='delete'>པ་</span><span class='add'>པ་</span>ལ་ཁྱོད་གནས་ནས། །མ་འོངས་ཐ་མ་དུས་ཀྱི་ཚེ། །ཡང་དག་དྲན་པའི་སེམས་སྐྱེད་ལ། །མདོ་སྡེ་འདི་ནི་བཤད་པར་གྱིས། །ངས་ནི་སངས་རྒྱས་སྤྱན་དག་གིས། །མ་འོངས་དུས་ནི་གསལ་གཟིགས་"
 ],
 [
  "79.238b",
  "དགའ་བར་བྱས། །ང་སྔོན་མདོ་སྡེ་འདི་ཡི་ཕྱིར། །གཞལ་མེད་ཁང་ཆེན་རྣམས་ལ་ནི། །རིན་ཆེན་དྲ་བས་རབ་བརྒྱན་ནས། །སངས་རྒྱས་རྣམས་ལ་ཡོངས་སུ་ཕུལ། །ང་སྔོན་མདོ་སྡེ་འདི་ཡི་ཕྱིར། །རིན་ཆེན་རྣམ་པ་\nསྣ་<span class='delete'>ཆོགས་</span><span class='add'>ཚོགས་</span>དང་། །ཡིད་བཞིན་ནོར་བུ་རིན་པོ་ཆེས། །སངས་རྒྱས་རྣམས་ལ་མཆོད་པ་བྱས། །ང་སྔོན་མདོ་སྡེ་འདི་ཡི་ཕྱིར། །དྲིན་ཡོད་རྣམས་ལ་རྟག་དྲན་<span class='delete'>པས། །</span><span class='add'>པས། །</span>ཐ་ན་ཚིགས་བཅད་གཅིག་མཉན་པ། །\nདེ་ལ་ཡང་ནི་བཀུར་སྟི་བྱས། །ང་སྔོན་མདོ་སྡེ་འདི་ཡི་ཕྱིར། །ཚུལ་ཁྲིམས་ལྡན་ལ་རབ་བཀུར་བས། །ཐ་ན་འཆག་པའི་ཚེ་ན་ཡང་། །དེ་ལ་རྟག་ཏུ་གུས་པ་བསྐྱེད། །ང་སྔོན་མདོ་སྡེ་འདི་ཡི་ཕྱིར། །འཁོར་བ་\nདག་ན་འཁོར་བའི་ཚེ། །དྲིན་ནི་ཅུང་ཟད་ཡོད་པ་ལ་འང་། །དེ་ལ་རྟག་ཏུ་དྲིན་དུ་གཟོས། །ང་སྔོན་མདོ་སྡེ་འདི་ཡི་ཕྱིར། །རྙེད་པ་མ་བཙལ་ཆོས་མ་སྐུར། །ཉེ་བཤེས་སེམས་ཅན་རྣམས་ལ་ནི། །སྙིང་བརྩེ་དག་ནི་རབ་\nཏུ་བསྐྱེད། །ང་སྔོན་མདོ་སྡེ་འདི་ཡི་ཕྱིར། །མང་ཐོས་ལེགས་བཤད་ལྡན་<span class='delete'>པས་</span><span class='add'>པས་</span>ན། །ཆོས་ལ་མངོན་<span class='delete'>པར་</span><span class='add'>པར་</span>ཞེན་བྱེད་ཅིང་། །བཤེས་པའི་ཁྱིམ་ལ་སེར་སྣ་མེད། །ང་སྔོན་མདོ་སྡེ་འདི་ཡི་ཕྱིར། །མི་དགེའི་\nསེམས་ནི་སྐྱེས་གྱུར་ན། །མྱུར་བ་ཉིད་དུ་རབ་བཤགས་པས། །འཕེལ་བར་ཡང་ནི་ཡོད་མ་བྱས། །ང་སྔོན་མདོ་སྡེ་འདི་ཡི་ཕྱིར། །རྒྱལ་པོའི་བུར་ནི་གྱུར་<span class='delete'>བ་</span><span class='add'>པ་</span>ན། །རིན་པོ་ཆེ་དང་བྱུག་སྤོས་དང་། །སྤོས་ཀྱི་\nཕྱེ་མ་ཇི་སྙེད་པ། །དད་པའི་སེམས་ནི་ངས་བསྐྱེད་ནས། །སངས་རྒྱས་རྣམས་ལ་བསྔོས་ཤིང་ཕུལ། །ང་སྔོན་མདོ་སྡེ་འདི་ཡི་ཕྱིར། །ཁྲི་མོན་བཙོན་ལ་སྙིང་བརྩེ་བས། །སྡུག་བསྔལ་སྣ་ཚོགས་གང་མྱོང་བ། །ལུས་\nཀྱི་སྐྱིན་པར་དང་དུ་བླངས། །ང་སྔོན་མདོ་སྡེ་འདི་ཡི་ཕྱིར། །འདོད་པའི་ཡོན་ཏན་ལྔ་སྤངས་ནས། །རྟག་ཏུ་དུས་དྲུག་དག་གི་ཚེ། །སྡོམ་པ་དག་ནི་རབ་ཏུ་བླངས། །ང་སྔོན་མདོ་སྡེ་འདི་ཡི་ཕྱིར། །རྟག་ཏུ་བཟོད་"
 ],
 [
  "79.239b",
  "པས། །སྤྱོད་པ་སྣ་ཚོགས་ཇི་ལྟ་བ། །ཐམས་ཅད་རབ་ཏུ་མཁྱེན་པ་ཡིན། །དགེ་སློང་དག་ནི་གང་ཞིག་གིས། །བླ་མེད་ཡེ་ཤེས་བཙལ་བའི་ཕྱིར། །ཤིན་དུ་དང་བའི་སེམས་ཀྱིས་ནི། །མདོ་སྡེ་འདི་ནི་གང་སྟོན་\nཔ། །གང་ཟག་དེ་དང་ཕྱོགས་རྣམས་ཀྱང་། །ཐམས་ཅད་མ་ལུས་ཐུགས་སུ་ཆུད། །མ་འོངས་ཐ་མ་དུས་ཀྱི་ཚེ། །མདོ་འདི་ཐོས་ནས་གང་མོས་པ། །བསམ་པ་དང་ནི་ཐབས་རྣམས་ཀྱང་། །ཐམས་ཅད་མ་ལུས་ཐུགས་སུ་\nཆུད། །དམན་པ་དག་ནི་གང་ཞིག་གིས། །མདོ་སྡེ་འདི་ནི་མ་ཐོས་པས། །ཆོས་བསྟན་པ་<span class='delete'>ལ་</span><span class='add'>ལ་སྐུར་</span><span class='delete'>༈ །༈ །</span><span class='add'></span><span class='delete'>༈ །</span><span class='add'></span>འདེབས་པ། །ཐམས་ཅད་མ་ལུས་ཐུགས་སུ་ཆུད། །དགེ་སློང་རྣམས་ནི་གང་ཞིག་དང་། །དགེ་སློང་མ་ནི་གང་ཞིག་གིས། །མདོ་\nསྡེ་འདི་ནི་ཐོས་གྱུར་ནས། །ཤིན་དུ་གདུང་བས་<span class='delete'>ངུ་</span><span class='add'>དུ་</span>བྱེད་པ། །དེ་ཀུན་<span class='delete'>དས་</span><span class='add'>ངས་</span>ནི་ལུང་བསྟན་ནས། །རྒྱལ་བ་གཙོ་བོ་མཐོང་བར་འགྱུར། །ཟླ་འོད་ཁྱོད་ཀྱིས་ཤེས་པར་གྱིས། །སངས་རྒྱས་རྫུ་འཕྲུལ་སྟོབས་ཀྱིས་ནི། །གང་དག་\nཡིད་ནི་དག་པ་དང་། །གང་དག་གི་ནི་མ་དག་དང་། །ཐ་ན་མོས་པ་གང་ཡིན་པ། །ཐམས་ཅད་མ་ལུས་ཐུགས་སུ་ཆུད། །སེམས་ཅན་དག་ནི་གང་ཞིག་གིས། །རབ་ཞི་དབེན་ལ་རྟག་མོས་ཤིང་། །ཏིང་འཛིན་\nརྣམས་ལ་རབ་གནས་ནས། །འཁོར་བ་དག་ལ་མ་ཆགས་པས། །ཐ་ན་བག་ཆགས་རྣམས་ཀྱང་ནི། །གཏན་ནས་རབ་ཏུ་གང་སྤངས་དང་། །དེ་ལ་སོགས་པའི་ཡོན་ཏན་རྣམས། །སེམས་ཅན་དག་ནི་གང་\nཞིག་གིས། །མི་བདེན་ཆོས་ལ་ཞེན་པ་དང་། །སེམས་ཅན་དག་ནི་གང་ཞིག་གིས། །སངས་རྒྱས་ལ་ནི་རབ་མོས་པ། །མ་འོངས་དངོས་པོ་འདི་ལྟ་བུ། །ཐམས་ཅད་མ་ལུས་ཐུགས་སུ་ཆུད། །སེམས་ཅན་དག་\nནི་གང་ཞིག་གིས། །འཇིག་རྟེན་བདེ་ལ་རབ་ཆགས་པས། །སངས་རྒྱས་བྱང་ཆུབ་ས་བོན་<span class='delete'>དག། །</span><span class='add'>དག །</span>ལེགས་པ་ཉིད་དུ་མི་སྐྱེད་<span class='delete'>པ། །</span><span class='add'>པ། །</span>རྒྱུ་དང་རྐྱེན་ནི་དེ་ཡི་ཕྱིར། །སྦྱོར་བ་རྣམས་ནི་ཉམས་པར་འགྱུར། །སུ་ཡང་རུང་བ་གང་"
 ],
 [
  "79.238a",
  "<span class='delete'>ཚུངས་</span><span class='add'></span><span class='delete'>པར་</span><span class='add'>མཚུངས་པར་</span>མཆོད་པ་<span class='delete'>པས། །</span><span class='add'>པས། །</span>མདོ་སྡེ་འདི་བཟུང་བསོད་ནམས་ཁྱད་པར་འཕགས། །གང་ཞིག་མདོ་སྡེ་འདི་ལ་ཚིག་བཞི་པའི། །ཚིགས་བཅད་གཅིག་ཙམ་འཛིན་ཅིང་སྟོན་བྱེད་ན། །དེ་ལ་རྒྱལ་བ་ཐུགས་རྗེས་\nཆེན་པོ་ཡི། །གཙོ་ལྟར་གུས་པ་རབ་ཏུ་བསྐྱེད་<span class='delete'>པར་</span><span class='add'>པར་</span>བྱ། །<span class='delete'>ད་</span><span class='add'>ང་</span>ནི་འདས་པའི་བསྐལ་པ་བརྒྱ་སྟོང་དུ། །སྲིད་པ་གསུམ་དུ་འཁོར་བར་གྱུར་པའི་ཚེ། །སངས་རྒྱས་དག་ནི་ཚད་མེད་པ་རྣམས་ལ། །མདོ་སྡེ་འདི་ཡི་<span class='delete'>ཕྱིར་</span><span class='add'>ཕྱིར་ནི་</span>རིམ་གྲོ་\nབྱས། །རེས་འགའ་མར་མེ་བརྒྱ་སྟོང་ཚད་མེད་པ། །སྙིང་པོ་རེ་རེའི་ཚད་ཀྱང་དཔག་ཚད་ཙམ། །སྤར་ནས་མདོ་སྡེ་འདི་ལ་རང་དབང་དག །འཐོབ་པར་བྱ་ཕྱིར་འདྲེན་པ་རྣམས་ལ་མཆོད། །རེས་འགའ་མེ་ཏོག་ཙམ་པ་\nཀ་དང་ནི། །སུ་མ་ན་དང་མྱ་ངན་མེད་པ་ཡི། །ཕྲེང་བ་རྒྱལ་མཚན་གདུགས་ནི་སྣ་ཚོགས་ཀྱིས། །དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་མཆོད་པ་བྱས། །<span class='delete'>ད་</span><span class='add'>ང་</span>སྔོན་འཁོར་བའི་འཁོར་བར་གྱུར་པའི་ཚེ། །སློང་དུ་འོངས་པ་དག་\nལ་སྦྱིན་བཏང་སྟེ། །རེས་འགའ་མེ་ཏོག་འབྲས་བུ་དག་ཀྱང་བཏང་། །རེས་འགའ་ཟག་པ་ཁྲོན་པ་ཆུ་མི་བཏང་། །རེས་འགའ་གླང་པོ་ཆེ་དང་བཞོན་པ་<span class='delete'>བཏང། །</span><span class='add'>བཏང་། །</span>རེས་འགའ་རིན་ཆེན་རྟ་དང་ཆུང་མ་<span class='delete'>བཏང། །</span><span class='add'>བཏང་། །</span>རེས་འགའ་གསེར་གྱི་ཁྲི་\nདང་རིན་ཆེན་གུར། །རེས་འགའ་སེ་མོ་དོ་དང་ཕྲེང་བ་བཏང་། །དེ་བཞིན་བསྐལ་པ་བརྒྱ་སྟོང་རྫོགས་པར་ནི། །མདོ་སྡེ་འདི་ཕྱིར་སེམས་ལ་སེར་སྣ་མེད།། །།བམ་པོ་གཉིས་པ། ང་སྔོན་མདོ་སྡེ་\nའདི་ཡི་<span class='delete'>ཕྱིར་། །</span><span class='add'>ཕྱིར། །</span>ཚུལ་ཁྲིམས་<span class='delete'>ཡོང་</span><span class='add'>ཡོངས་</span>སུ་དག་པར་བསྲུངས། །ཏིང་འཛིན་ཤེས་རབ་རྟག་ཏུ་བསྒོམས། །སེམས་ཅན་རྣམས་ལ་སྦྱིན་པ་<span class='delete'>བཏང། །</span><span class='add'>བཏང་། །</span>ང་སྔོན་མདོ་སྡེ་འདི་ཡི་ཕྱིར། །གཏུམ་པོ་དག་གིས་བརྒྱད་བཀག་\nཀྱང་། །དེ་ཚེ་ད་ནི་སྙིང་བརྩེ་བས། །དེ་ལ་གནོད་པ་<span class='delete'>ཡོད་</span><span class='add'>ཡོང་</span>མ་བྱས། །ང་སྔོན་མདོ་སྡེ་འདི་ཡི་ཕྱིར། །<span class='delete'>སློད་</span><span class='add'>སློང་</span>དུ་འོངས་པ་དག་ལ་ནི། །ཇི་ལྟར་མོས་བཞིན་རབ་གཏང་བས། །ཐམས་ཅད་རབ་ཏུ་"
 ],
 [
  "79.241a",
  "ཟེར་འབྱུང་བ་སྒྲུབ་པར་ནི། །ངས་སྔོན་མ་ཐོས་མ་མཐོང་ངོ་། །ཡང་དག་ཡེ་ཤེས་རབ་བསྒྲུབས་ནས། །སྒྲིབ་པའི་གནོད་པ་གཏན་སྤོང་ཞིང་། །སྤྱོད་པ་འདི་རྗེས་གང་འབྲང་བ། །འོད་ཟེར་འགྱེད་པ་\nཐོབ་པར་འགྱུར། །རྒྱལ་བའི་སྤྱོད་པ་ཡོངས་ཚོལ་ཞིང་། །མདོ་སྡེ་འདི་ལ་བསླབ་བྱས་ནས། །དེ་བཞིན་གཤེགས་ལ་གང་མཆོད་པ། །ཡང་དག་ཡེ་ཤེས་ཐབས་ཐོབ་འགྱུར། །ཡང་དག་ཡེ་ཤེས་གང་བསྒྲུབས་\nཔ། །སངས་རྒྱས་རྣམས་ལ་མཆོད་པར་གྱིས། །འོད་ཟེར་འགྱེད་པ་རྫོགས་པར་འགྱུར། །ལག་མཐིལ་འབྲས་བུ་ཇི་བཞིན་ནོ། །མིག་ལ་བདག་མེད་གང་རྨོངས་པ། །དགེ་སྦྱོང་ཆོས་ནི་ཉམས་པར་འགྱུར། །གང་\nཟག་དེ་ཡིས་དེ་ལྟ་བུའི། །འོད་ཟེར་འགྱེད་པ་ཐོབ་མི་འགྱུར། །མིག་ལ་བདག་མེད་གང་རྟོགས་པ། །དགེ་སློང་ཆོས་ནི་སྒྲུབ་པར་འགྱུར། །གང་ཟག་དེ་ཡིས་དེ་ལྟ་བུའི། །འོད་ཟེར་འགྱེད་པ་ཐོབ་པར་<span class='delete'>འགྱུར།། </span><span class='add'>འགྱུར། །</span>\nམིག་གི་མཐའ་ཟད་གང་རྟོགས་པ། །རྣ་བ་སྐྱེ་བའི་མཐའ་ཡང་རྟོགས། །རྣ་བ་སྐྱེ་བའི་མཐའ་རྟོགས་པས། །དགེ་སྦྱོང་ཆེན་པོའི་ཆོས་ཤེས་བྱ། །གལ་ཏེ་མིག་གི་ངོ་བོ་ཉིད། །མཐའ་ནི་ཡོངས་སུ་མ་ཤེས་ན། །མིག་\nནི་སྐྱེ་བའི་མཐའ་དག་ཀྱང་། །ཡོངས་སུ་ཤེས་པར་<span class='delete'>མྱི་</span><span class='add'>མི་</span>འགྱུར་བས། །གང་ཟག་དེ་ཡིས་དེ་ལྟ་བུའི། །འོད་ཟེར་འགྱེད་པ་ཐོབ་མི་འགྱུར། །གལ་ཏེ་མིག་གི་ངོ་བོ་ཉིད། །མཐའ་ནི་ཡོངས་སུ་ཤེས་གྱུར་ན། །མིག་ནི་སྐྱེ་\nབའི་མཐའ་དག་ཀྱང་། །ཡོངས་སུ་ཤེས་པ་ཉིད་དུ་འགྱུར། །གང་ཟག་དེ་ཡིས་དེ་ལྟ་བུའི། །འོད་ཟེར་འགྱེད་པ་ཐོབ་པར་འགྱུར། །གལ་ཏེ་མིག་གི་ངོ་བོ་ཉིད། །མཐའ་ནི་ལེགས་པར་མ་ཤེས་ན། །མིག་<span class='delete'>གི་</span><span class='add'>ནི་</span>སྐྱེ་བའི་\nམཐའ་དག་ཀྱང་། །ལེགས་པ་ཉིད་དུ་མི་ཤེས་པས། །གང་ཟག་དེ་ཡིས་དེ་ལྟ་བུའི། །འོད་ཟེར་འགྱེད་པ་ཐོབ་མི་འགྱུར། །གལ་ཏེ་མིག་གི་ངོ་བོ་ཉིད། །མཐའ་ནི་ལེགས་པར་ཤེས་གྱུར་ན། །མིག་ནི་སྐྱེ་བའི་མཐའ་དག་"
 ],
 [
  "79.241b",
  "ཀྱང་། །<span class='delete'>ལགས་</span><span class='add'>ལེགས་</span>པ་ཉིད་དུ་ཤེས་འགྱུར་<span class='delete'>པས། །</span><span class='add'>བས། །</span>གང་ཟག་དེ་ཡིས་དེ་ལྟ་བུའི། །འོད་ཟེར་འགྱེད་པ་ཐོབ་པར་འགྱུར། །གལ་ཏེ་མིག་གི་ངོ་བོ་ཉིད། །མཐའ་ནི་མངོན་སུམ་མ་ཤེས་ན། །མིག་ནི་སྐྱེ་བའི་མཐའ་དག་ཀྱང་། །\nམངོན་སུམ་ཉིད་དུ་མི་ཤེས་པས། །གང་ཟག་དེ་ཡིས་དེ་ལྟ་བུའི། །འོད་ཟེར་འགྱེད་པ་ཐོབ་མི་འགྱུར། །གལ་ཏེ་མིག་གི་ངོ་བོ་ཉིད། །མཐའ་ནི་མངོན་སུམ་ཤེས་གྱུར་ན། །མིག་ནི་སྐྱེ་བའི་མཐའ་དག་ཀྱང་། །མངོན་སུམ་\nཉིད་དུ་རབ་ཤེས་པས། །གང་ཟག་དེ་ཡིས་དེ་ལྟ་བུའི། །འོད་ཟེར་འགྱེད་པ་ཐོབ་པར་འགྱུར། །གལ་ཏེ་མིག་གི་ངོ་བོ་ཉིད། །མཐའ་ནི་ལེགས་པར་མ་ཤེས་ན། །མིག་ནི་སྐྱེ་བའི་མཐའ་དག་ཀྱང་། །ཡོངས་སུ་ཤེས་\nཔར་མི་འགྱུར་བས། །གང་ཟག་དེ་ཡིས་དེ་ལྟ་བུའི། །འོད་ཟེར་འགྱེད་པ་ཐོབ་མི་འགྱུར། གལ་ཏེ་མིག་གི་ངོ་བོ་ཉིད། །མཐའ་ནི་ལེགས་པར་ཤེས་གྱུར་ན། །མིག་ནི་སྐྱེ་བའི་མཐའ་དག་ཀྱང་། །མངོན་སུམ་ཉིད་དུ་ཤེས་\nའགྱུར་བས། །གང་ཟག་དེ་ཡིས་དེ་ལྟ་བུའི། །འོད་ཟེར་འགྱེད་པ་ཐོབ་པར་འགྱུར། །གལ་ཏེ་མིག་གི་ངོ་བོ་ཉིད། །རྣམ་དག་ལེགས་པར་མ་ཤེས་ན། །རྣ་བའི་ངོ་བོ་རྣམ་དག་པ། །ལེགས་པ་ཉིད་དུ་མི་ཤེས་<span class='delete'>བས།། </span><span class='add'>པས། །</span>\nགང་ཟག་དེ་ཡིས་དེ་ལྟ་བུའི། །འོད་ཟེར་འགྱེད་པ་ཐོབ་མི་འགྱུར། །གལ་ཏེ་མིག་གི་ངོ་བོ་ཉིད། །རྣམ་དག་ལེགས་པར་ཤེས་གྱུར་ན། །རྣ་བའི་ངོ་བོ་རྣམ་དག་པ། །ལེགས་པ་ཉིད་དུ་རྟོགས་འགྱུར་བས། །གང་ཟག་དེ་\nཡིས་དེ་ལྟ་བུའི། །འོད་ཟེར་འགྱེད་པ་ཐོབ་པར་འགྱུར། །དེ་བཞིན་སྣ་དང་ལྕེ་དང་ལུས། །ཡིད་དང་གཟུགས་སྒྲ་དྲི་རོ་དང་། །རེག་བྱ་ཆོས་དང་ས་ཆུ་དང་། །མེ་རླུང་དག་གི་དངོས་པོ་དང་། །འཇིག་རྟེན་སྡུག་བསྔལ་ཕུང་པོ་དང་། \nཁམས་དང་འཇིག་རྟེན་སྐྱེ་བ་དང་། །སྒྲ་དང་མིང་ལ་སོགས་པ་ཡང་། །ཐམས་ཅད་དེ་བཞིན་རིག་པར་གྱིས། །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཟླ་འོད་གཞོན་ནུར་གྱུར་པ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །རིགས་ཀྱི་བུ་"
 ],
 [
  "79.240a",
  "ཞིག་གིས། །བྱང་ཆུབ་ས་བོན་རྟོགས་གྱུར་ན། །གང་ཟག་དེ་ཡིས་ངེས་པར་ནི། །རྣམ་དག་འོད་ཟེར་དཔག་མེད་ཐོབ། །ཟླ་འོད་ཁྱོད་ཀྱིས་འདི་ལྟ་བུར། །འོད་ཟེར་འདི་ལ་སོགས་པ་ཡི། །རྒྱུ་དང་རྐྱེན་ནི་རེ་རེ་ཀུན། །\nསོ་སོ་ཐ་དད་ཉིད་དུ་ལྟོས། །ཁྱོད་ཀྱིས་ཤེས་རབ་སྟོབས་ཀྱིས་ནི། །ཐམས་ཅད་དེ་ལྟར་རིག་པར་གྱིས། །གང་ཞིག་མི་དགེ་གྲོགས་སྤངས་ཏེ། །དགེ་བའི་བཤེས་གཉེན་ལ་བསྟེན་བྱས། །ཚུལ་ཁྲིམས་རྣམ་དག་གང་སྲུང་བ། །\nསངས་རྒྱས་འོད་ཟེར་སྒྲུབ་པར་འགྱུར། །ཁྱོད་ཀྱིས་དབང་པོ་རབ་<span class='delete'>སྲུངས་</span><span class='add'>བསྲུངས་</span>ལ། །ངོ་ཚ་ཁྲེལ་མེད་རབ་ཏུ་སྤོངས། །དགེ་བའི་ཆོས་ནི་རབ་སྒོམས་ལ། །སེམས་ཅན་རྣམས་ནི་བསྲུང་བར་གྱིས། །ཁྱོད་ཀྱིས་རྩོད་པ་རབ་སྤོངས་ལ། །\nསྟོང་ཉིད་དག་ནི་རྟོགས་པར་གྱིས། །རྙེད་པ་དག་ལ་མ་གདུ་བར། །མང་ཐོས་ལེགས་བཤད་ལྡན་<span class='delete'>པར་</span><span class='add'>པར་</span>གྱིས། །ཁྱོད་ཀྱིས་རྙེད་པ་དག་ལ་ནི། །མི་<span class='delete'>གཅང་</span><span class='add'>གཙང་</span>ལྟ་བུར་བལྟ་བར་གྱིས། །རྙེད་པའི་དྲི་མ་དག་གིས་ནི། །རྣམ་དག་\nསེམས་ནི་<span class='delete'>སྦགས་</span><span class='add'>སྤགས་</span>མ་བྱེད། །རྣམ་པར་གྲོལ་བ་བཙལ་བར་བྱོས། །བླ་མེད་རྙེད་པ་ཐོབ་པར་འགྱུར། །ཁྱོད་ཀྱིས་སངས་རྒྱས་ལམ་བསྒྲུབས་ལ། །སངས་རྒྱས་ཆོས་ཉིད་འདྲ་བར་ལྟོས། །ཆོས་ཀྱི་སྒྲོན་ཆེན་རྟག་<span class='delete'>སྤར་</span><span class='add'>སྦར་</span>ལ། །\nའཇིག་རྟེན་ཀུན་ནི་སྣང་བར་གྱིས། །ཁྱོད་ཀྱི་སེམས་ནི་རི་རྒྱལ་ལྟར། །མི་གཡོ་ཉིད་དུ་རབ་ཏུ་བྱོས། །ཁ་ངན་དང་ནི་བརྡེགས་པ་ཡང་། །ཐམས་ཅད་བཟོད་པ་དང་དུ་ལོང་། །ཁྱོད་ནི་སེམས་ཅན་རྣམས་ཀྱི་ཕྱིར། །དགེ་\nབཤེས་ཡང་དག་རབ་ཏུ་བྱོས། །དམན་པའི་སེམས་ནི་ཡོངས་སྤོངས་ལ། །རྣམ་དག་ལས་ནི་རྟག་ཏུ་བསྒྲུབས། །ཁྱོད་ཀྱི་སེམས་ནི་བརྟན་བྱོས་ལ། །བླ་མེད་ཆོས་ནི་རབ་ཏུ་<span class='delete'>སྙོན། །</span><span class='add'>སྟོན། །</span>མདོ་སྡེ་དམ་པ་འདི་ལྟ་བུ། །བརྩེ་བ་ཅན་ལ་\nསྦྱིན་<span class='delete'>པར་</span><span class='add'>པར་</span>གྱིས། །བླ་མེད་ཡེ་ཤེས་གང་ཚོལ་བ། །འཁོར་བ་དག་ལ་འཇིགས་མ་བྱེད། །དེས་ནི་སྡིག་པ་རྣམ་སྤངས་ནས། །ཕན་ཡོན་མཆོག་ནི་ཐོབ་པར་འགྱུར། །དཔེར་ན་བློ་དང་ལྡན་པ་<span class='delete'>དག། །</span><span class='add'>དག །</span>མེ་ལ་སྤྱོད་པར་མཁས་པ་གང་། །"
 ],
 [
  "79.240b",
  "རོ་རྣམས་སྣ་ཚོགས་སྦྱིན་བྱེད་ཀྱང་། །མེས་ནི་སྲེག་པར་<span class='delete'>ཡོང་</span><span class='add'>ཡོད་</span><span class='delete'>མྱི་</span><span class='add'>མི་</span>འགྱུར། །གང་ཞིག་བློ་དང་<span class='delete'>མྱི་</span><span class='add'>མི་</span>ལྡན་པ། །ཐབས་དག་ལ་ནི་མི་མཁས་པས། །མེ་ཁྱེར་ལག་མཐིལ་གང་བཞག་པ། །མེས་ནི་རབ་ཏུ་སྲེག་པར་འགྱུར། །\nཇི་ལྟར་མི་ཞིག་དུག་དག་གིས། །སེམས་ནི་འཁྲུགས་ནས་མྱོས་པ་གང་། །མེ་ལ་རབ་ཏུ་བསྲོས་ན་ནི། །དེ་ཡི་རྒྱུ་ཡིས་སོས་<span class='delete'>པར་</span><span class='add'>པར་</span>འགྱུར། ཟླ་འོད་ཁྱོད་ཀྱིས་ཤེས་པར་གྱིས། །བློ་དང་ལྡན་པའང་དེ་བཞིན་དུ། །ཡིད་\nབརྟེན་ཡིད་ནི་སྟོང་པར་<span class='delete'>རིག། །</span><span class='add'>རིག །</span>དེ་ཕྱིར་འཁོར་བར་གནས་ཀྱང་ནི། །མིག་བརྟེན་མིག་ནི་སྟོང་རིག་པས། །མིག་ལ་མངོན་<span class='delete'>པར་</span><span class='add'>པར་</span>ཞེན་པ་མེད། །གལ་ཏེ་དེ་ལྟར་རབ་ཤེས་ན། །མིག་ལ་གནས་ཀྱང་ཉོན་མོངས་མེད། །གལ་\nཏེ་<span class='delete'>མི་</span><span class='add'>མི</span><span class='delete'>གཉིད་</span><span class='add'>ག་ཉིད་</span>སྟོང་རིག་ན། །ཡང་དག་ཡེ་ཤེས་སྒྲུབ་པར་འགྱུར། །ཡང་དག་ཡེ་ཤེས་ཐོབ་པའི་ཕྱིར། །འོད་ཟེར་དག་ནི་འབྱུང་བར་འགྱུར། །གལ་ཏེ་<span class='delete'>མིག་</span><span class='add'>མིག་</span><span class='delete'>ཉིད་</span><span class='add'>ཉིད་</span>སྟོང་རིག་ན། །འདོད་ཆགས་དག་ནི་གཏན་ནས་སྤོང་། །\nའདོད་ཆགས་དག་ནི་མེད་པའི་ཕྱིར། །འོད་ཟེར་དག་ནི་འབྱུང་བར་འགྱུར། །དེ་བཞིན་ཞེ་སྡང་གཏི་མུག་དང་། །ངར་འཛིན་འཆབ་དང་ཁྲོ་བ་དང་། །སེར་སྣ་ཕྲག་དོག་ངོ་ཚ་མེད། །མི་བཟོད་སེམས་ནི་མཐོ་བ་དང་། །རྒྱགས་\nདང་མངོན་<span class='delete'>པའི་</span><span class='add'>པའི་</span>ང་རྒྱལ་དང་། །གཡོ་སྒྱུ་དང་ནི་བག་མེད་དང་། །གྱ་གྱུ་ལ་སོགས་བར་དུ་ཡང་། །ཐམས་ཅད་འདོད་ཆགས་བཞིན་དུ་བཤད། །ཡང་དག་ཡེ་ཤེས་ཐོབ་གྱུར་ན། །མིག་ནི་ཞི་བ་ཉིད་དུ་རྟོགས། །ཞི་བ་ཉིད་དུ་རྟོགས་\nཔའི་ཕྱིར། །འོད་ཟེར་དག་ནི་འབྱུང་བར་འགྱུར། །ཡང་དག་ཡེ་ཤེས་ཐོབ་གྱུར་ན། །སངས་རྒྱས་ཚུལ་ལ་རབ་ཏུ་གནས། །ཚུལ་ལ་རབ་ཏུ་གནས་པའི་ཕྱིར། །འོད་ཟེར་དག་ནི་འབྱུང་བར་འགྱུར། །ཡང་དག་ཡེ་ཤེས་\nཐོབ་གྱུར་ན། །སངས་རྒྱས་ཐབས་ལ་གནས་པར་འགྱུར། །ཐབས་ལ་རབ་ཏུ་གནས་པའི་ཕྱིར། །འོད་ཟེར་དག་ནི་འབྱུང་བར་འགྱུར། །ཡང་དག་ཡེ་ཤེས་མ་བསྒྲུབས་པར། །སྒྲིབ་པ་དག་ནི་གཏན་སྤོང་ཞིང་། །འོད་"
 ],
 [
  "79.242b",
  "བདེན་པ་ལ་མཁས་པ་དང་། ས་རྣམས་ཀྱི་རང་གི་མཚན་ཉིད་རབ་ཏུ་རྟོགས་པ་དང་། གཟུངས་ཟད་མི་ཤེས་པ་ཡོངས་སུ་ཚོལ་བ་དང་། ལུས་དང་སྲོག་ལ་ཕངས་པ་མེད་པ་དང་། འཁོར་བཞི་པོ་དག་ལ་རྗེས་སུ་\nསྟོན་པར་བྱེད་པ་དང་། འཇིག་རྟེན་པའི་བསམ་པ་ཡོངས་སུ་བཅད་པ་དང་། འཇིག་རྟེན་ཕྱི་མའི་ཆོས་མེད་དོ་ཞེས་ཟེར་བའི་ལོག་པར་ལྟ་བ་རྣམས་སྤངས་པ་<span class='delete'>དང་། །</span><span class='add'>དང་། </span>ད་དུང་མ་བསླབས་པ་དག་ལ་གྱ་གྱུའི་མཚན་\nམ་མི་སྟོན་པ་དང་། གང་བསླབ་པར་འདོད་པ་དག་ལ་ཅི་ནུས་ཀྱིས་རྣམ་པར་<span class='delete'>ཕྱི་</span><span class='add'>ཕྱེ་</span>ནས་རབ་ཏུ་སྟོན་པ་དང་། གླུ་དང་རོལ་མོའི་སྒྲ་དག་གི་བསྔགས་པ་མི་བརྗོད་པ་<span class='delete'>དད། </span><span class='add'>དང་།                       </span>རྒྱན་དང་ཡོ་བྱད་ཀྱི་བསྔགས་པ་མི་བརྗོད་པ་དང་། \nབདེན་པ་རྣམས་ལ་ཡང་དག་པར་ཞུགས་པ་དང་། མང་དུ་ཐོས་པ་ཕུན་སུམ་ཚོགས་པ་དང་། གཉིད་རབ་ཏུ་སྤངས་པ་དང་། ཡང་དག་པའི་ཆོས་ཡོངས་སུ་ཚོལ་བ་ལ་རབ་ཏུ་བརྩོན་པ་དང་། སངས་རྒྱས་ལ་གུས་པ་དང་། \nབྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་དང་། འཇིག་རྟེན་པའི་ལས་ཡོངས་སུ་སྤངས་པ་དང་། བསླབ་པའི་གནས་རྣམས་ལ་ཡང་དག་པར་བརྩོན་པ་དང་། ཆོས་ལ་སྲེད་པའི་ཕྱིར་གྲོགས་ཁྱད་པར་ཅན་ལ་རྟེན་པར་\nབྱེད་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>དགེ་བའི་རྩ་བ་རྣམས་ཡོངས་སུ་ཚོལ་བ་ལ་སྐྱོ་བ་མེད་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>རབ་ཏུ་འབྱུང་བ་ལ་ཤིན་དུ་མོས་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>སངས་རྒྱས་ཀྱི་ཆོས་སྲུང་ཞིང་ཡོངས་སུ་འཛིན་པར་བྱེད་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>སྡིག་པའི་ལས་མི་སློང་བ་<span class='delete'>དང། </span><span class='add'>དང་། </span>\nབསྟན་པ་རྣམས་ལ་ཐེ་ཚོམ་མེད་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>དཔེས་སྟོན་པ་ལ་རབ་ཏུ་མཁས་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>གསང་བ་རྣམས་རྣམ་པར་ཕྱེ་ནས་སྟོན་པར་བྱེད་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>བྱང་ཆུབ་ཆེན་པོ་ཡོངས་སུ་ཚོལ་བ་ལ་ངལ་བ་མེད་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>མདོ་\nསྡེ་ཡང་དག་པར་བཟུང་བ་རྣམས་བརྗེད་པར་མི་བྱེད་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>རང་གི་བསླབ་པ་མི་སྤོང་བ་<span class='delete'>དང། </span><span class='add'>དང་། </span>ཕ་རོལ་གྱི་སྨྲ་བ་རྣམས་<span class='delete'>ཚད་</span><span class='add'>ཚར་</span>གཅོད་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span><span class='delete'>དེས་</span><span class='add'>ངེས་</span>པར་འབྱུང་བའི་ལམ་ཡོངས་སུ་ཚོལ་བ་<span class='delete'>དང། </span><span class='add'>དང་། </span>སྤྱོད་པ་ཚད་མེད་པ་རྣམས"
 ],
 [
  "79.243b",
  "རྣམ་པར་གྲོལ་བ་ལེགས་པར་ཡོངས་སུ་རྫོགས་པར་བྱེད་པའོ། །རྣམ་པར་བརྒྱད་བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། སྦྱིན་པའི་ཚོགས་<span class='delete'>དང། </span><span class='add'>དང་། </span>ཤེས་རབ་རྒྱ་ཆེན་པོར་གྱུར་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>ཚུལ་ཁྲིམས་རྣམ་པར་དག་\nཔ་ཡོངས་སུ་སྒྲུབ་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span><span class='delete'>ཉིན་</span><span class='add'>ཉོན་</span>མོངས་པའི་གདུང་བ་དང་བྲལ་བ་<span class='delete'>དང། </span><span class='add'>དང་། </span>ང་རྒྱལ་རབ་ཏུ་བཅོམ་<span class='delete'>བ་</span><span class='add'>པ་</span><span class='delete'>དང། </span><span class='add'>དང་། </span>ཚིག་མཉེན་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>དངོས་པོ་སྣ་ཚོགས་རབ་ཏུ་ཤེས་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>དགེ་བའི་གྲོགས་པོ་ཡོངས་སུ་ཤེས་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>\nཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་གཞོལ་<span class='delete'>པ་</span><span class='add'>བ་</span><span class='delete'>དང། </span><span class='add'>དང་། </span>བརྩོན་<span class='delete'>འགྲུབ་</span><span class='add'>འགྲུས་</span>ཀྱི་གོ་ཆ་བགོས་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>སྤྱོད་ལམ་གྱིས་སེམས་ཅན་འདུལ་བ་<span class='delete'>དང། </span><span class='add'>དང་། </span>ཉོན་མོངས་པར་<span class='delete'>ལྷུང་</span><span class='add'>ལྟུང་</span>བ་རྣམས་ཀྱི་ཐེ་ཚོམ་རབ་ཏུ་གཅོད་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>མི་དགེ་བ་\nརྣམས་ལ་སྨོད་ཅིང་ཆོས་དཀར་པོ་རྣམས་མངོན་<span class='delete'>པར་</span><span class='add'>པར་</span>བསྒྲུབ་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>མི་དགེ་བའི་གྲོགས་པོ་དང་མི་འགྲོགས་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>དགེ་བའི་རྩ་བ་རྣམས་བསྐྱེད་པ་ལ་ཡོངས་སུ་<span class='delete'>སྐྱོབ་</span><span class='add'>སྐྱོ་བ་</span>མེད་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>བྱང་ཆུབ་ཏུ་སེམས་\nབསྐྱེད་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>བརྩོན་འགྲུས་རབ་ཏུ་རྩོམ་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>བདུད་ཀྱི་དངོས་པོ་རབ་ཏུ་རྟོགས་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>བདེན་པ་རྣམས་མངོན་དུ་གྱུར་<span class='delete'>པ་</span><span class='add'>པ་</span><span class='delete'>དང། </span><span class='add'>དང་། </span>ཡང་དག་པ་ཁོ་ནར་མཆོད་པ་བྱེད་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>ཐེ་ཚོམ་ཡོངས་སུ་གཅོད་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>\nསེམས་ཀྱིས་རྟག་ཏུ་སེམས་ཅན་ཡོངས་སུ་བཟླ་བར་སེམས་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>སྲིད་པ་རྣམས་ལ་མངོན་<span class='delete'>བར་</span><span class='add'>པར་</span>ཞེན་པ་མེད་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>སེམས་རྒྱ་ཆེན་པོ་ཡོངས་སུ་བསྐྱེད་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>སེམས་ཅན་མི་དགེ་བ་རྣམས་ལ་ཉེས་དམིགས་\nཡང་དག་པར་སྟོན་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>འདོད་ཆགས་<span class='delete'>དང། </span><span class='add'>དང་། </span>ཞེ་སྡང་<span class='delete'>དང། </span><span class='add'>དང་། </span>གཏི་མུག་རབ་ཏུ་སྤོང་བ་<span class='delete'>དང། </span><span class='add'>དང་། </span>འདོད་པའི་ཕན་པ་ཡོངས་སུ་མི་ཚོལ་བ་<span class='delete'>དང། </span><span class='add'>དང་། </span>སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>དེ་བཞིན་གཤེགས་པའི་\nམཆོད་རྟེན་འཆོས་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>འཕགས་པ་རྣམས་ལ་གུས་པ་སྐྱེད་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>ཐེག་པ་ཆེན་པོ་ལ་གནས་པ་དག་ལ་རྟེན་ཅིང་རིམ་གྲོ་བྱེད་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>ཐེག་པ་དམན་པ་དག་གི་བསྔགས་པ་མི་བརྗོད་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>ཉན་ཐོས་ཀྱི་ཐེག་"
 ],
 [
  "79.243a",
  "མངོན་<span class='delete'>བར་</span><span class='add'>པར་</span>སྒྲུབ་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>ཆོས་ཀྱི་ཡེ་ཤེས་དེ་དག་ལ་སེམས་ངེས་པར་གྱུར་<span class='delete'>པ་</span><span class='add'>པ་</span><span class='delete'>དང། </span><span class='add'>དང་། </span>རྒྱུ་དང་འབྲས་བུ་གསལ་བར་མཐོང་ཞིང་འཁོར་བའི་རྒྱུན་མི་གཅོད་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>སྲིད་པ་གསུམ་པོ་དག་ལ་ཆགས་པ་མེད་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>\nམངོན་<span class='delete'>བའི་</span><span class='add'>པའི་</span>ང་རྒྱལ་སྤངས་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>མངོན་<span class='delete'>བར་</span><span class='add'>པར་</span>ཡིད་ཆེས་པ་དག་ལ་མཉེན་པོ་རྣམ་པར་གཞག་པ་དག་སྟོན་པར་བྱེད་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>མ་འོངས་པའི་<span class='delete'>འབྲུས་</span><span class='add'>འབྲས་</span>བུ་རྣམ་པར་སྨིན་པའི་བྱེ་བྲག་རྟོགས་པར་ཁོང་དུ་ཆུད་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>\nསྔོན་གྱི་མཐའ་ཡོངས་སུ་ལེགས་པར་ཤེས་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>གཞན་གྱི་དྲིང་ལ་མི་ལྟོས་<span class='delete'>བ་</span><span class='add'>པ་</span><span class='delete'>དང། </span><span class='add'>དང་། </span>ཡོངས་སུ་སྤོང་བའི་སྤྱོད་པ་དག་ལ་བརྩོན་<span class='delete'>འགྲུབ་</span><span class='add'>འགྲུས་</span>ཀྱིས་གྲུབ་པར་བྱེད་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>སངས་རྒྱས་ཀྱི་མཚན་དང་དཔེ་བྱད་\nཀྱི་བཀོད་པ་དག་ཕུན་སུམ་ཚོགས་པར་བྱེད་པ་གང་ཡིན་པ་འདི་ནི་རྣམ་པ་བརྒྱད་བཅུ་ཞེས་བྱའོ། །གཞན་ཡང་ཟླ་འོད་གཞོན་ནུ་ཆོས་བརྒྱད་བཅུ་པོ་འདི་དག་ནི་ཆོས་ལྔའི་ནང་དུ་འཇུག་པར་འགྱུར་རོ། །\nཆོས་ལྔ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། འཁོར་བ་ཤེས་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>མྱ་ངན་ལས་འདས་པ་ཤེས་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>ཉོན་མོངས་པ་ཟད་པ་ཤེས་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>མཆོག་ཏུ་གྱུར་པ་ཤེས་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>བསོད་ནམས་ཀྱི་འབྲས་བུ་ཤེས་པ་གང་ཡིན་\n<span class='delete'>བའོ། །</span><span class='add'>པའོ། །</span>གཞན་ཡང་ཟླ་འོད་གཞོན་ནུ་ཆོས་ལྔ་པོ་དེ་དག་ནི་ཆོས་གཉིས་ཀྱི་ནང་དུ་འཇུག་པར་འགྱུར་རོ། །གཉིས་གང་ཞེ་ན། འདི་ལྟ་སྟེ། སེམས་ཡོངས་སུ་དག་པས་རབ་ཏུ་བརྒྱན་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>གཟུགས་ཡོངས་སུ་དག་\nཔས་རབ་ཏུ་བརྒྱན་པ་གང་ཡིན་<span class='delete'>བའོ། །</span><span class='add'>པའོ། །</span>གཞན་ཡང་ཟླ་འོད་གཞོན་ནུ་ཆོས་གཉིས་པོ་དེ་དག་ནི་ཆོས་གཅིག་གི་ནང་དུ་འཇུག་པར་འགྱུར་རོ། །གཅིག་གང་ཞེ་ན། འདི་ལྟ་སྟེ། དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་ཐོགས་པ་མི་\nམངའ་བའི་རྣམ་པར་གྲོལ་བ་མངོན་<span class='delete'>པར་</span><span class='add'>པར་</span>གྲུབ་པ་གང་ཡིན་པའོ། །གཞན་ཡང་ཟླ་འོད་གཞོན་ནུ་ཡང་ཆོས་རྣམ་པ་བརྒྱད་བཅུ་ཡོད་དེ། དེ་དག་གིས་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་ཐོགས་པ་མི་མངའ་བའི་"
 ],
 [
  "79.242a",
  "སེམས་ཅན་གང་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་གཞོལ་ཞིང་འོད་ཟེར་འགྱེད་པ་དེ་ལྟ་བུ་ཡོངས་སུ་རྫོགས་པར་བྱ་བར་འདོད་པ་དེས་དགེ་བའི་རྩ་བའི་ཚོགས་རྣམ་པ་བརྒྱད་བཅུ་པོ་འདི་དག་མངོན་\n<span class='delete'>པར་</span><span class='add'>པར་</span>བསྒྲུབ་པར་བྱའོ། །རྣམ་པ་བརྒྱད་བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། སེམས་ཅན་ཡོངས་སུ་སྲུང་ཞིང་རྗེས་སུ་དྲན་པ་དང་། གནོད་སེམས་མེད་པ་<span class='delete'>དང་། །</span><span class='add'>དང་། </span>ཚུལ་ཁྲིམས་ཡོངས་སུ་དག་པ་སྲུང་ཞིང་ཉམས་པར་མི་\nབྱེད་པ་<span class='delete'>དང་། །</span><span class='add'>དང་། </span>སེམས་ཤིན་ཏུ་མཉམ་པ་<span class='delete'>དང་། །</span><span class='add'>དང་། </span>གཡོ་རྒྱུ་མེད་པ་དང་། སེར་སྣ་མེད་པ་<span class='delete'>དང་། །</span><span class='add'>དང་། </span>ཕྲག་དོག་མེད་པ་དང་། འདོད་ཆགས་ཀྱི་བསམ་པ་མེད་པ་དང་། བསླུ་བའི་བསམ་པ་མེད་པ་<span class='delete'>དང་། །</span><span class='add'>དང་། </span>ཐེག་པ་\nཆེན་པོའི་མདོ་སྡེ་དམ་པ་དག་ལ་མངོན་<span class='delete'>པར་</span><span class='add'>པར་</span>ཡིད་ཆེས་པ་<span class='delete'>དང་། །</span><span class='add'>དང་། </span>དབང་ཕྱུགས་དང་། རྒྱགས་པ་ལ་ཞེན་ཅིང་སྲེད་པ་མེད་པ་<span class='delete'>དང་། །</span><span class='add'>དང་། </span>བཟོད་པའི་སྟོབས་ཕུན་སུམ་ཚོགས་པ་<span class='delete'>དང་། །</span><span class='add'>དང་། </span>སྨོན་ལམ་ལས་ཕྱིར་མི་ལྡོག་པ་དང་། \nབསམ་པ་ཤིན་ཏུ་རྣམ་པར་<span class='delete'>དང་</span><span class='add'>དག་</span>པར་གྱུར་པ་དང་། དགོན་པ་ན་གནས་པ་དང་། འཁོར་རྣམས་ལ་མི་རྟེན་པ་དང་། རྙེད་པ་ལ་མི་རྟེན་པ་<span class='delete'>དང་། །</span><span class='add'>དང་། </span>གྲགས་པ་ལ་མི་རྟེན་པ་དང་། བསམ་གཏན་རྣམས་ལ་རབ་ཏུ་གནས་པ་དང་། \nའོད་ཟེར་གྱི་ཏིང་ངེ་འཛིན་རབ་ཏུ་སྟོན་པ་དང་། ཚུལ་ཁྲིམས་དང་ལྡན་པ་དག་ལ་སྒྱུ་མེད་པར་རིམ་གྲོ་བྱེད་པ་དང་། ཚངས་པ་མཚུངས་པར་སྤྱོད་པ་དག་ལ་མཆོག་གི་བསམ་པ་སྐྱེད་པ་དང་། ཆོས་ལ་གུས་པའི་ཕྱིར་\nམཁན་པོ་དང་སློབ་དཔོན་དག་ལ་ཤིན་ཏུ་བཀུར་བ་<span class='delete'>དང་། །</span><span class='add'>དང་། </span>མདོ་སྡེའི་དོན་རབ་ཏུ་རྟོགས་པ་དང་། ཡང་དག་པར་བསྟན་པ་ལ་རབ་ཏུ་མཁས་པ་དང་། ཚིག་སྨྲས་པ་དག་ལ་མི་བདེན་པ་མེད་པ་དང་། ཡང་དག་པའི་བསམ་\nཔ་ལ་གནས་པ་དང་། དགེ་བའི་རྩ་བ་བསྐྱེད་པ་དང་། བརྩོན་པ་དང་། རྟག་ཏུ་སྦྱིན་པ་གཏོང་བ་དང་། བདུད་ཀྱི་ལས་རབ་ཏུ་རྟོགས་པ་དང་། དབང་པོ་རྣམས་དམ་དུ་སྲུང་བ་དང་། ཚིག་རབ་ཏུ་བརྟགས་པ་དང་། དོན་དམ་པའི་"
 ],
 [
  "79.244a",
  "པ་པ་དག་ཐག་རིང་དུ་སྤོང་<span class='delete'>པ་</span><span class='add'>བ་</span><span class='delete'>དང། </span><span class='add'>དང་། </span>ཕྱིར་རྒོལ་བ་རྣམས་ཚར་གཅོད་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>སངས་རྒྱས་བཅོམ་ལྡན་རྣམས་ལ་མཆོད་པ་རྒྱ་ཆེན་པོ་བཤམས་ནས་ཁྱད་པར་དུ་འཕགས་པའི་སེམས་ཀྱིས་\nདབུལ་བར་བྱེད་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>ཐོགས་པ་མེད་པའི་ཡེ་ཤེས་ཐོབ་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span><span class='delete'>སྤོངས་</span><span class='add'>སྤོབས་</span>པ་ཕུན་སུམ་ཚོགས་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>དཔེ་སྣ་ཚོགས་ཀྱིས་ཡང་དག་པའི་ཆོས་རབ་ཏུ་སྟོན་པར་བྱེད་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>སྟོན་པའི་ངོ་བོ་ཉིད་དང་འགལ་\nབར་མི་བྱེད་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>ཆོས་ཡོངས་སུ་ཚོལ་བ་ལ་ལེ་ལོ་མེད་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>དོན་ཟབ་མོ་ཡང་དག་པར་སྟོན་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>གཟུངས་ཆེན་པོ་དང་ལྡན་<span class='delete'>བ་</span><span class='add'>པ་</span><span class='delete'>དང། </span><span class='add'>དང་། </span>ཆོས་ཡང་དག་པར་སྟོན་པར་བྱེད་ཀྱང་མངོན་<span class='delete'>བར་</span><span class='add'>པར་</span>ཞེན་པ་མེད་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>\nཆོས་རྒྱ་ཆེར་སྤེལ་བར་བྱེད་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>ཡོངས་སུ་འདྲེན་པ་ལ་ཆོག་ཤེས་པ་མེད་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>སྤྱོད་པ་རྣམས་ཡོངས་སུ་རྫོགས་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>གཟི་བྱིན་ཆེན་པོ་དང་ལྡན་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>སྤོབས་པ་ཐོགས་པ་མེད་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>མང་དུ་ཐོས་\nཔ་ཕུན་སུམ་ཚོགས་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>མི་དགེ་བ་རྣམས་ཀྱི་བསྔགས་པ་མི་རྗོད་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>དགེ་བའི་ལས་ཡང་དག་པར་སྒྲུབ་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>ཕུང་པོ་རྣམས་ཁོང་དུ་ཆུད་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>ལྟ་བ་རྣམས་རབ་ཏུ་སྤངས་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>\nརྒྱུའི་ངོ་བོ་ཉིད་རབ་ཏུ་རྟོགས་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>སྤྱོད་ཡུལ་ལས་ཡང་དག་པར་འདས་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>སྤྱོད་ཡུལ་མ་ཡིན་པ་ཡོངས་སུ་སྤངས་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>ཡོངས་སུ་དང་བ་སྐྱེད་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>ཡང་དག་པའི་ལམ་ལ་གནས་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>\nཐེག་པ་ཆེན་པོ་ལ་རབ་ཏུ་དགའ་བ་<span class='delete'>དང། </span><span class='add'>དང་། </span>མཉམ་<span class='delete'>བ་</span><span class='add'>པ་</span>ཉིད་དུ་ཡོངས་སུ་སྡུད་པར་བྱེད་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>བདག་མེད་པ་ལ་མངོན་<span class='delete'>བར་</span><span class='add'>པར་</span>མ་ཆགས་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>འཁོར་བ་ལ་ཡོངས་སུ་སྐྱོ་བ་མེད་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>མྱ་ངན་ལས་འདས་པ་ཡོངས་\nསུ་ཚོལ་བ་ལ་མོས་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>འདོད་པ་ཆུང་བའི་ཕྱིར་དགོན་པ་ལ་གནས་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>རྟག་ཏུ་བསོད་སྙོམས་སློང་ཞིང་ལེ་ལོ་མེད་པར་གྱུར་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>ཇི་ཙམ་རྙེད་པ་དེ་ཉིད་ཀྱིས་ཆོག་པར་འཛིན་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>ངོ་ཚ་མེད་པ་<span class='delete'>ད</span><span class='add'>དང་།</span>ང།"
 ],
 [
  "79.244b",
  "ཁྲེལ་མེད་པ་སྤངས་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>སངས་རྒྱས་རྣམས་ལ་བསྙེན་པར་བྱེད་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>དགེ་བའི་གྲོགས་པོ་དང་ལྷན་ཅིག་གནས་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>བདག་གི་ཟླ་མ་ཡིན་<span class='delete'>བ་</span><span class='add'>པ་</span>རྣམས་རབ་ཏུ་སྤོང་བ་<span class='delete'>དང། </span><span class='add'>དང་། </span>སོ་སོའི་སྐྱེ་བོ་རྣམས་ལ་སྙིང་\nབརྩེ་བ་<span class='delete'>དང། </span><span class='add'>དང་། </span>སེམས་ཅན་གྱི་སྤྱོད་པ་དང་མཐུན་པར་བྱེད་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>སངས་རྒྱས་ལ་ཤིན་དུ་དང་བ་<span class='delete'>དང། </span><span class='add'>དང་། </span>སྣོད་མ་ཡིན་པ་ཡོངས་སུ་སྤོང་<span class='delete'>པ་</span><span class='add'>བ་</span><span class='delete'>དང། </span><span class='add'>དང་། </span>མི་མཐུན་<span class='delete'>བ་</span><span class='add'>པ་</span>རྣམས་ལ་ཚིག་སྦྱིན་<span class='delete'>བར་</span><span class='add'>པར་</span>མི་བྱེད་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>གསོལ་\nབ་མི་འདེབས་པ་དག་ལ་ཡང་དག་པར་སྟོན་པར་མི་བྱེད་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>གསོལ་བ་འདེབས་པ་ཞིག་འོངས་ནས་ཅི་རིགས་པར་སྟོན་པར་བྱེད་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>ཟས་ལ་སྙོམས་པར་གྱུར་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>རྟག་ཏུ་གཏོང་ཞིང་མཉམ་<span class='delete'>བ་</span><span class='add'>པ་</span>\nཉིད་དུ་<span class='delete'>གཏོད་</span><span class='add'>གཏོང་</span><span class='delete'>པ་</span><span class='add'>བ་</span><span class='delete'>དང། </span><span class='add'>དང་། </span>སྒོ་ཆེན་པོ་ཕྱེ་ནས་གཏོང་བར་བྱེད་པ་གང་ཡིན་པ་དེ་དག་ནི་གཞོན་ནུ་ཆོས་རྣམ་པ་བརྒྱད་བཅུ་ཞེས་བྱ་སྟེ། འདི་དག་གིས་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་ཐོགས་པ་མི་མངའ་བའི་རྣམ་པར་\nགྲོལ་<span class='delete'>པ་</span><span class='add'>བ་</span>ཐོབ་པར་བྱེད་<span class='delete'>དོ། </span><span class='add'>དོ། །</span>དེའི་ཚེ་ཟླ་འོད་གཞོན་ནུར་གྱུར་པས་ཆོས་དེ་ལྟ་བུ་ཐོས་པས་རབ་ཏུ་དགའ་བར་གྱུར་ནས་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་ཚིགས་སུ་བཅད་དེ་མངོན་<span class='delete'>པར་</span><span class='add'>པར་</span>བསྟོད་པ། དེ་བཞིན་གཤེགས་\nཔ་མི་ཟད་མཐའ་མཁྱེན་པས། །དེ་སླད་རྣམ་དག་ཡེ་ཤེས་སྟོན་མཛད་ལགས། །རྣམ་དག་ཡེ་ཤེས་སྟོན་པར་མཛད་པས་ན། རྣམ་དག་འོད་ཟེར་ཕུན་སུམ་ཚོགས་པ་ལགས། དེ་བཞིན་གཤེགས་པས་མིག་\n<span class='delete'>ཐ་</span><span class='add'>བ</span>དག་མེད་མཁྱེན་པས། དེ་སླད་རྣམ་དག་དབྱངས་ནི་སྟོན་མཛད་ལགས། །རྣམ་དག་དབྱངས་ནི་སྟོན་པར་མཛད་པས་ན། །ཚངས་དབྱངས་མཚན་ཉིད་ཕུན་སུམ་ཚོགས་པ་ལགས། །བཅོམ་ལྡན་སྔོན་ནི་སེམས་\nཅན་ཕན་བཏགས་པས། །དེ་སླད་རྣམ་དག་གསུང་ནི་རྫོགས་པ་ལགས། །རྣམ་དག་གསུང་ནི་ཡོངས་སུ་རྫོགས་པས་ན། །འཇིག་རྟེན་ཚད་མེད་རྣམས་ལ་ཕན་འདོགས་མཛད། །དེ་བཞིན་གཤེགས་པས་མིག་"
 ],
 [
  "79.245b",
  "པོར་མི་ཐོགས་དེ་བཞིན་<span class='delete'>ཤོག། །</span><span class='add'>ཤོག །</span>ཐུགས་རྗེ་ཆེན་པོ་རྐང་གཉིས་མཆོག་གྱུར་པ། །བཟོད་པའི་ཕ་རོལ་བྱོན་པ་ཕུན་སུམ་ཚོགས། །ཇི་ལྟར་བཅོམ་ལྡན་བཟོད་པའི་ཕ་རོལ་བྱོན། །བདག་ཀྱང་རིང་པོར་\nམི་ཐོགས་དེ་བཞིན་<span class='delete'>ཤོག། །</span><span class='add'>ཤོག །</span>ཐུགས་རྗེ་ཆེན་པོ་རྐང་གཉིས་མཆོག་གྱུར་པ། །བརྩོན་འགྲུས་ཕ་རོལ་བྱོན་པ་ཕུན་སུམ་ཚོགས། ཇི་ལྟར་བཅོམ་ལྡན་བརྩོན་འགྲུས་ཕ་རོལ་བྱོན། །བདག་ཀྱང་རིང་པོར་མི་ཐོགས་\nདེ་བཞིན་<span class='delete'>ཤོག། །</span><span class='add'>ཤོག །</span>ཐུགས་རྗེ་ཆེན་པོ་རྐང་གཉིས་མཆོག་གྱུར་པ། །བསམ་གཏན་ཕ་རོལ་བྱོན་པ་ཕུན་སུམ་ཚོགས། །ཇི་ལྟར་བཅོམ་ལྡན་བསམ་གཏན་ཕ་རོལ་བྱོན། །བདག་ཀྱང་རིང་པོར་མི་ཐོགས་དེ་\nབཞིན་<span class='delete'>ཤོག། །</span><span class='add'>ཤོག །</span>ཐུགས་རྗེ་ཆེན་པོ་རྐང་གཉིས་མཆོག་གྱུར་པ། །ཤེས་རབ་ཕ་རོལ་བྱོན་པ་ཕུན་སུམ་ཚོགས། །ཇི་ལྟར་བཅོམ་ལྡན་ཤེས་རབ་ཕ་རོལ་བྱོན། །བདག་ཀྱང་རིང་པོར་མི་ཐོགས་དེ་བཞིན་\n<span class='delete'>ཤོག། །</span><span class='add'>ཤོག །</span>ཐུགས་རྗེ་ཆེན་པོ་རྐང་གཉིས་མཆོག་གྱུར་པ། །ཆོས་སྐུའི་ཕ་རོལ་བྱོན་པ་ཕུན་སུམ་ཚོགས། །ཇི་ལྟར་བཅོམ་ལྡན་ཆོས་སྐུའི་ཕ་རོལ་བྱོན། །བདག་ཀྱང་རིང་པོར་མི་ཐོགས་དེ་བཞིན་<span class='delete'>ཤོག། །</span><span class='add'>ཤོག །</span>\nཐུགས་རྗེ་ཆེན་པོ་རྐང་གཉིས་མཆོག་གྱུར་པ། །རྣམ་དག་གཟུགས་ནི་དཔག་མེད་ཕུན་སུམ་ཚོགས། །ཇི་ལྟར་བཅོམ་ལྡན་རྣམ་དག་གཟུགས་ལྡན་པ། །བདག་ཀྱང་རིང་པོར་མི་ཐོགས་དེ་བཞིན་<span class='delete'>ཤོག། །</span><span class='add'>ཤོག །</span>\nཐུགས་རྗེ་ཆེན་པོ་རྐང་གཉིས་མཆོག་གྱུར་པ། །རྣམ་དག་ཡིད་ནི་དཔག་མེད་ཕུན་སུམ་ཚོགས། །ཇི་ལྟར་བཅོམ་ལྡན་རྣམ་དག་ཡིད་ལྡན་པ། །བདག་ཀྱང་རིང་པོར་མི་ཐོགས་དེ་བཞིན་<span class='delete'>ཤོག། །</span><span class='add'>ཤོག །</span>ཐུགས་\nརྗེ་ཆེན་པོ་རྐང་གཉིས་མཆོག་གྱུར་པ། །ཡོན་ཏན་མཆོག་ནི་དཔག་མེད་ཕུན་སུམ་ཚོགས། །ཇི་ལྟར་བཅོམ་ལྡན་ཡོན་ཏན་མཆོག་ལྡན་པ། །བདག་ཀྱང་རིང་པོར་མི་ཐོགས་དེ་བཞིན་<span class='delete'>ཤོག། །</span><span class='add'>ཤོག །</span>"
 ],
 [
  "79.246a",
  "ཐུགས་རྗེ་ཆེན་པོ་རྐང་གཉིས་མཆོག་གྱུར་པ། །གཟུགས་ཀྱི་མཚན་ནི་དཔག་མེད་ཕུན་སུམ་ཚོགས། །ཇི་ལྟར་བཅོམ་ལྡན་གཟུགས་ཀྱི་མཚན་ལྡན་པ། །བདག་ཀྱང་རིང་པོར་མི་\nཐོགས་དེ་བཞིན་<span class='delete'>ཤོག། །</span><span class='add'>ཤོག །</span>ཐུགས་རྗེ་ཆེན་པོ་རྐང་གཉིས་མཆོག་གྱུར་པ། །རྣམ་དག་སྒྲ་ནི་དཔག་མེད་ཕུན་སུམ་ཚོགས། །ཇི་ལྟར་བཅོམ་ལྡན་རྣམ་དག་སྒྲ་ལྡན་པ། །བདག་ཀྱང་རིང་པོར་མི་ཐོགས་\nདེ་བཞིན་<span class='delete'>ཤོག། །</span><span class='add'>ཤོག །</span>ཐུགས་རྗེ་ཆེན་པོ་རྐང་གཉིས་མཆོག་གྱུར་པ། །རྫུ་འཕྲུལ་ཆེན་པོ་དཔག་མེད་ཕུན་སུམ་ཚོགས། །ཇི་ལྟར་བཅོམ་ལྡན་རྫུ་འཕྲུལ་མཆོག་ལྡན་པ། །བདག་ཀྱང་རིང་པོར་མི་ཐོགས་\nདེ་བཞིན་<span class='delete'>ཤོག། །</span><span class='add'>ཤོག །</span>ཐུགས་རྗེ་ཆེན་པོ་རྐང་གཉིས་མཆོག་གྱུར་པ། །སེམས་ཅན་གདུལ་སླད་སྲིད་པ་གསུམ་ན་བཞུགས། །ཇི་ལྟར་བཅོམ་ལྡན་སེམས་ཅན་གདུལ་མཛད་པ། །བདག་ཀྱང་རིང་པོར་མི་ཐོགས་དེ་\nབཞིན་<span class='delete'>ཤོག། །</span><span class='add'>ཤོག །</span>ཐུགས་རྗེ་ཆེན་པོ་རྐང་གཉིས་མཆོག་གྱུར་པ། །འཁོར་བའི་སྤྱོད་པ་དཔག་མེད་དག་ལས་འདས། ཇི་ལྟར་བཅོམ་ལྡན་འཁོར་བའི་སྤྱོད་འདས་པ། །བདག་ཀྱང་རིང་པོར་མི་ཐོགས་དེ་བཞིན་\n<span class='delete'>ཤོག། །</span><span class='add'>ཤོག །</span>ཐུགས་རྗེ་ཆེན་པོ་རྐང་གཉིས་མཆོག་གྱུར་པ། །འདོད་ཆགས་སྤྱོད་པ་དཔག་མེད་དག་ལས་འདས། །ཇི་ལྟར་བཅོམ་ལྡན་འདོད་ཆགས་སྤྱོད་འདས་པ། །བདག་ཀྱང་རིང་པོར་མི་ཐོགས་དེ་བཞིན་\n<span class='delete'>ཤོག། །</span><span class='add'>ཤོག །</span>ཐུགས་རྗེ་ཆེན་པོ་རྐང་གཉིས་མཆོག་གྱུར་པ། །ཞེ་སྡང་སྤྱོད་པ་དཔག་མེད་དག་ལས་འདས། །ཇི་ལྟར་བཅོམ་ལྡན་ཞེ་སྡང་སྤྱོད་འདས་པ། །བདག་ཀྱང་རིང་པོར་མི་ཐོགས་དེ་བཞིན་<span class='delete'>ཤོག། །</span><span class='add'>ཤོག །</span>\nཐུགས་རྗེ་ཆེན་པོ་རྐང་གཉིས་མཆོག་གྱུར་པ། །གཏི་མུག་སྤྱོད་པ་དཔག་མེད་དག་ལས་འདས། །ཇི་ལྟར་བཅོམ་ལྡན་གཏི་མུག་སྤྱོད་འདས་པ། །བདག་ཀྱང་རིང་པོར་མི་ཐོགས་དེ་བཞིན་<span class='delete'>ཤོག།</span><span class='add'>ཤོག །</span>"
 ],
 [
  "79.247b",
  "ཟད་མཐའ་མཁྱེན། །སྐྱེ་དགུ་ཐམས་ཅད་ལ་ནི་ཕན་འདོགས་མཛད། །བདག་ཀྱང་དེ་འདྲའི་ཡེ་ཤེས་གྲུབ་གྱུར་ནས། །སྡུག་བསྔལ་ཟད་ལ་ཐེ་ཚོམ་མ་མཆིས་<span class='delete'>ཤོག། །</span><span class='add'>ཤོག །</span>དེ་བཞིན་གཤེགས་པས་རྒྱུ་ཟད་\nམཐའ་མཁྱེན་པས། །སྐྱེ་དགུ་ཐམས་ཅད་ལ་ནི་ཕན་འདོགས་མཛད། །བདག་ཀྱང་དེ་འདྲའི་གྲུབ་གྱུར་ནས། །རྒྱུ་ཟད་དེ་ལ་ཐེ་ཚོམ་མ་མཆིས་<span class='delete'>ཤོག། །</span><span class='add'>ཤོག །</span>དེ་བཞིན་གཤེགས་པ་མཁྱེན་པ་མཆོག་ལྡན་<span class='delete'>པས། །</span><span class='add'>པས། །</span>\nའཇིག་རྟེན་སྤྱོད་པ་དག་ནི་རབ་ཏུ་མཁྱེན། །བདག་ཀྱང་དེ་འདྲའི་ཡེ་ཤེས་གྲུབ་གྱུར་ནས། །འཇིག་རྟེན་སྤྱོད་ལ་ཐེ་ཚོམ་མ་མཆིས་<span class='delete'>ཤོག། །</span><span class='add'>ཤོག །</span>དེ་བཞིན་གཤེགས་པ་<span class='delete'>མཁྱེན་</span><span class='add'>མཁྱེན་པ་</span>མཆོག་ལྡན་<span class='delete'>པས། །</span><span class='add'>པས། །</span>འཇིག་རྟེན་གནས་\nདང་གནས་མེད་རབ་ཏུ་མཁྱེན། བདག་ཀྱང་དེ་འདྲའི་ཡེ་ཤེས་གྲུབ་གྱུར་ནས། །འཇིག་རྟེན་ཐམས་ཅད་ལ་ནི་ཕན་བགྱིད་<span class='delete'>ཤོག། །</span><span class='add'>ཤོག །</span>དེ་བཞིན་གཤེགས་པ་མཁྱེན་པ་མཆོག་ལྡན་<span class='delete'>པས། །</span><span class='add'>པས། །</span>འཇིག་རྟེན་ལས་དང་\nའབྲས་བུ་རབ་ཏུ་མཁྱེན། །བདག་ཀྱང་དེ་འདྲའི་ཡེ་ཤེས་གྲུབ་གྱུར་ནས། །འཇིག་རྟེན་ཐམས་ཅད་ལ་ནི་ཕན་བགྱིད་<span class='delete'>ཤོག། །</span><span class='add'>ཤོག །</span>དེ་བཞིན་གཤེགས་པ་མཁྱེན་པ་མཆོག་ལྡན་<span class='delete'>པས། །</span><span class='add'>པས། །</span>འཇིག་རྟེན་རང་བཞིན་སྣ་ཚོགས་\nརབ་ཏུ་མཁྱེན། །བདག་ཀྱང་དེ་འདྲའི་ཡེ་ཤེས་གྲུབ་གྱུར་ནས། །འཇིག་རྟེན་ཐམས་ཅད་ལ་ནི་ཕན་བགྱིད་<span class='delete'>ཤོག། །</span><span class='add'>ཤོག །</span>དེ་བཞིན་གཤེགས་པ་མཁྱེན་<span class='delete'>པས་</span><span class='add'>པ་</span>མཆོག་ལྡན་<span class='delete'>པས། །</span><span class='add'>པས། །</span>ཐམས་ཅད་ཀུན་དུ་འགྲོ་བའི་སྤྱོད་པ་མཁྱེན། །\nབདག་ཀྱང་དེ་འདྲའི་ཡེ་ཤེས་གྲུབ་གྱུར་ནས། །འཇིག་རྟེན་ཐམས་ཅད་ལ་ནི་ཕན་བགྱིད་<span class='delete'>ཤོག། །</span><span class='add'>ཤོག །</span>དེ་བཞིན་གཤེགས་པ་མཁྱེན་པ་མཆོག་ལྡན་<span class='delete'>པས། །</span><span class='add'>པས། །</span>འཇིག་རྟེན་མོས་པ་སྣ་ཚོགས་རབ་ཏུ་མཁྱེན། །བདག་\nཀྱང་དེ་འདྲའི་ཡེ་ཤེས་གྲུབ་གྱུར་ནས། །འཇིག་རྟེན་ཐམས་ཅད་ལ་ནི་ཕན་བགྱིད་<span class='delete'>ཤོག། །</span><span class='add'>ཤོག །</span>དེ་བཞིན་གཤེགས་པ་མཁྱེན་པ་མཆོག་ལྡན་<span class='delete'>པས། །</span><span class='add'>པས། །</span>དབང་པོ་རྣམས་ཀྱི་རང་བཞིན་ཐམས་ཅད་མཁྱེན། །བདག་"
 ],
 [
  "79.247a",
  "འདོགས་མཛད། །ཇི་ལྟར་བཅོམ་ལྡན་འཇིག་རྟེན་ཕན་འདོགས་པ། །བདག་ཀྱང་དེ་འདྲའི་ཡེ་ཤེས་གྲུབ་པར་<span class='delete'>ཤོག། །</span><span class='add'>ཤོག །</span>འདྲེན་པ་འདོད་ཆགས་གཏི་མུག་སྤྱོད་འདས་པས། །འཇིག་རྟེན་ཀུན་ལས་\nཤིན་དུ་ཕན་འདོགས་མཛད། །ཇི་ལྟར་བཅོམ་ལྡན་འཇིག་རྟེན་ཕན་འདོགས་པ། །བདག་ཀྱང་དེ་འདྲའི་ཡེ་ཤེས་གྲུབ་པར་<span class='delete'>ཤོག། །</span><span class='add'>ཤོག །</span>འདྲེན་པ་ཆགས་སྡང་གཏི་མུག་སྤྱོད་འདས་པས། །འཇིག་རྟེན་ཀུན་ལས་\nཤིན་དུ་ཕན་འདོགས་མཛད། །ཇི་ལྟར་བཅོམ་ལྡན་འཇིག་རྟེན་ཕན་འདོགས་པ། །བདག་ཀྱང་དེ་འདྲའི་ཡེ་ཤེས་གྲུབ་པར་<span class='delete'>ཤོག། །</span><span class='add'>ཤོག །</span>དེ་བཞིན་གཤེགས་པ་མཁྱེན་པ་མཆོག་ལྡན་<span class='delete'>པས། །</span><span class='add'>པས། །</span>ལྷ་ཚོགས་མང་\nཔོ་ཐམས་ཅད་འདུལ་<span class='delete'>པར་</span><span class='add'>བར་</span>མཛད། །བདག་ཀྱང་དེ་འདྲའི་ཡེ་ཤེས་གྲུབ་གྱུར་ནས། །ལྷ་མི་ཁ་ལོ་སྒྱུར་བའི་སྟོན་པར་<span class='delete'>ཤོག། །</span><span class='add'>ཤོག །</span>དེ་བཞིན་གཤེགས་པ་མཁྱེན་པ་མཆོག་ལྡན་<span class='delete'>པས། །</span><span class='add'>པས། །</span>ཀླུ་ཚོགས་མང་པོ་ཐམས་\nཅད་འདུལ་བར་མཛད། །བདག་ཀྱང་དེ་འདྲའི་ཡེ་ཤེས་གྲུབ་གྱུར་ནས། །ལྷ་མི་ཁ་ལོ་སྒྱུར་བའི་སྟོན་པར་<span class='delete'>ཤོག། །</span><span class='add'>ཤོག །</span>དེ་བཞིན་གཤེགས་པ་མཁྱེན་པ་མཆོག་ལྡན་<span class='delete'>པས། །</span><span class='add'>པས། །</span>གནོད་སྦྱིན་མང་པོ་ཐམས་ཅད་\nའདུལ་བར་མཛད། །བདག་ཀྱང་དེ་འདྲའི་ཡེ་ཤེས་གྲུབ་གྱུར་ནས། །ལྷ་མི་ཁ་ལོ་སྒྱུར་བའི་སྟོན་པར་<span class='delete'>ཤོག། །</span><span class='add'>ཤོག །</span>དེ་བཞིན་གཤེགས་པ་མཁྱེན་པ་མཆོག་ལྡན་<span class='delete'>པས། །</span><span class='add'>པས། །</span>དྲི་ཟ་ཐམས་ཅད་རབ་ཏུ་འདུལ་མཛད་<span class='delete'>ཅིང། །</span><span class='add'>ཅིང་། །</span>\nདེ་བཞིན་གྲུལ་བུམ་དཔག་ཏུ་མ་<span class='delete'>མཆིག་</span><span class='add'>མཆིས་</span>པ། །འཁོར་བཅས་ཇི་སྙེད་རབ་ཏུ་འདུལ་བར་མཛད། །བདག་ཀྱང་དེ་འདྲའི་ཡེ་ཤེས་གྲུབ་གྱུར་ནས། །ལྷ་མི་ཁ་ལོ་སྒྱུར་བའི་སྟོན་པར་<span class='delete'>ཤོག། །</span><span class='add'>ཤོག །</span>དེ་བཞིན་གཤེགས་\nཔ་མཁྱེན་པ་མཆོག་ལྡན་<span class='delete'>པས། །</span><span class='add'>པས། །</span>ཆོས་རྣམས་ཡང་དག་དོན་ནི་རབ་ཏུ་མཁྱེན། །བདག་ཀྱང་དེ་འདྲའི་ཡེ་ཤེས་གྲུབ་གྱུར་ནས། །ཡང་དག་དེ་ལ་ཐེ་ཚོམ་མ་མཆིས་<span class='delete'>ཤོག། །</span><span class='add'>ཤོག །</span>དེ་བཞིན་གཤེགས་པ་སྡུག་བསྔལ་"
 ],
 [
  "79.246b",
  "ཐུགས་རྗེ་ཆེན་པོ་རྐང་གཉིས་མཆོག་གྱུར་པ། །འདོད་ཆགས་ཞེ་སྡང་སྤྱོད་པ་དཔག་མེད་འདས། །ཇི་ལྟར་བཅོམ་ལྡན་འདོད་སྡང་སྤྱོད་འདས་པ། །བདག་ཀྱང་རིང་པོར་མི་ཐོགས་དེ་བཞིན་<span class='delete'>ཤོག། །</span><span class='add'>ཤོག །</span>ཐུགས་རྗེ་\nཆེན་པོ་རྐང་གཉིས་མཆོག་གྱུར་པ། །ཞེ་སྡང་གཏི་མུག་སྤྱོད་པ་དཔག་མེད་འདས། །ཇི་ལྟར་བཅོམ་ལྡན་སྡང་རྨོངས་སྤྱོད་འདས་པ། །བདག་ཀྱང་རིང་པོར་མི་ཐོགས་དེ་བཞིན་<span class='delete'>ཤོག། །</span><span class='add'>ཤོག །</span>ཐུགས་རྗེ་ཆེན་པོ་\nརྐང་གཉིས་མཆོག་གྱུར་པ། །འདོད་ཆགས་གཏི་མུག་སྤྱོད་པ་དཔག་མེད་འདས། །ཇི་ལྟར་བཅོམ་ལྡན་འདོད་རྨོངས་སྤྱོད་འདས་པ། །བདག་ཀྱང་རིང་པོར་མི་ཐོགས་དེ་བཞིན་<span class='delete'>ཤོག། །</span><span class='add'>ཤོག །</span>ཐུགས་རྗེ་ཆེན་པོ་རྐང་གཉིས་\nམཆོག་གྱུར་པ། །ཆ་མཉམ་སྤྱོད་པ་དཔག་མེད་ཡང་དག་འདས། །ཇི་ལྟར་བཅོམ་ལྡན་ཆ་མཉམ་སྤྱོད་འདས་པ། །བདག་ཀྱང་རིང་པོར་མི་ཐོགས་དེ་བཞིན་<span class='delete'>ཤོག། །</span><span class='add'>ཤོག །</span>འདྲེན་པ་འདོད་ཆགས་དག་ལས་ཡོངས་\nའདས་པས། །འཇིག་རྟེན་ཀུན་ལ་ཤིན་ཏུ་ཕན་འདོགས་མཛད། །ཇི་ལྟར་བཅོམ་ལྡན་འཇིག་རྟེན་ཕན་འདོགས་པ། །བདག་ཀྱང་དེ་<span class='delete'>འདྲེའི་</span><span class='add'>འདྲའི་</span>ཡེ་ཤེས་གྲུབ་པར་<span class='delete'>ཤོག། །</span><span class='add'>ཤོག །</span>འདྲེན་པ་ཞེ་སྡང་དག་ལས་ཡོངས་འདས་པས། །\nའཇིག་རྟེན་ཀུན་ལ་ཤིན་དུ་ཕན་འདོགས་མཛད། །ཇི་ལྟར་བཅོམ་ལྡན་འཇིག་རྟེན་ཕན་འདོགས་པ། །བདག་ཀྱང་དེ་འདྲའི་ཡེ་ཤེས་གྲུབ་པར་<span class='delete'>ཤོག། །</span><span class='add'>ཤོག །</span>འདྲེན་པ་གཏི་མུག་སྤྱོད་ལས་ཡོངས་འདས་པས། །འཇིག་\nརྟེན་ཀུན་ལ་ཤིན་དུ་ཕན་འདོགས་མཛད། །ཇི་ལྟར་བཅོམ་ལྡན་འཇིག་རྟེན་ཕན་འདོགས་པ། །བདག་ཀྱང་དེ་<span class='delete'>འདྲེའི་</span><span class='add'>འདྲའི་</span>ཡེ་ཤེས་གྲུབ་པར་<span class='delete'>ཤོག། །</span><span class='add'>ཤོག །</span>འདྲེན་པ་འདོད་ཆགས་ཞེ་སྡང་སྤྱོད་འདས་པས། །འཇིག་རྟེན་ཀུན་\nལ་ཤིན་དུ་ཕན་འདོགས་མཛད། །ཇི་ལྟར་བཅོམ་ལྡན་འཇིག་རྟེན་ཕན་འདོགས་པ། །བདག་ཀྱང་དེ་འདྲའི་ཡེ་ཤེས་གྲུབ་པར་<span class='delete'>ཤོག། །</span><span class='add'>ཤོག །</span>འདྲེན་པ་ཞེ་སྡང་གཏི་མུག་སྤྱོད་འདས་པས། །འཇིག་རྟེན་ཀུན་ལས་ཤིན་ཏུ་ཕན་"
 ],
 [
  "79.245a",
  "ཉིད་སྟོང་མཁྱེན་པས། །དེ་སླད་ཀུན་འཛིན་མཁྱེན་པ་རྫོགས་པ་ལགས། །ཀུན་འཛིན་མཁྱེན་པ་ཡོངས་སུ་རྫོགས་པས་ན། །དེ་བཞིན་གཤེགས་པའི་འོད་ཟེར་དཔག་མེད་སྟོན། །དེ་བཞིན་\nགཤེགས་པས་མིག་གི་ཁྱད་པར་མཁྱེན། །མིག་གི་ཁྱད་པར་དག་ཀྱང་མཐའ་མ་མཆིས། །མཁྱེན་པའི་མིང་ནི་དཔག་ཏུ་མ་མཆིས་པས། །དེ་བཞིན་གཤེགས་པའི་འོད་ཟེར་དཔག་མེད་སྟོན། །སངས་རྒྱས་ཡི་གེ་\nཁྱད་པར་སྒོ་མཁྱེན་པས། །མིག་སྟོང་ཡི་གེ་བྲལ་བར་རབ་ཏུ་མཁྱེན། །མིག་སྟོན་ཡི་གེ་བྲལ་བར་མཁྱེན་པས་ན། །དེ་བཞིན་གཤེགས་པའི་འོད་ཟེར་དཔག་མེད་སྟོན། །གང་ཞིག་མིག་ལ་བདག་མེད་\nརབ་སེམས་པ། །སངས་རྒྱས་གསུང་ནི་བདེན་པ་ཉིད་དུ་རྟོགས། །དེ་བཞིན་གཤེགས་པའི་འོད་ཟེར་ངེས་པ་སྟོན། །བཅོམ་ལྡན་རྫུ་འཕྲུལ་མཆོག་ནི་ཡོངས་རྫོགས་པས། །མིག་གི་འཇིག་པ་དཔག་མེད་\nཐུགས་སུ་ཆུད། །མིག་གིས་འཇིག་པ་རབ་ཏུ་མཁྱེན་པས་ན། །འཇིག་རྟེན་ཐམས་ཅད་ལ་ནི་ཕན་འདོགས་མཛད། །ཐུགས་རྗེ་ཆེན་པོ་རྐང་གཉིས་མཆོག་གྱུར་པ། །མིག་གི་སྐྱེ་བ་དཔག་མེད་རབ་ཏུ་མཁྱེན། །ཇི་\nལྟར་བཅོམ་ལྡན་མིག་གི་སྐྱེ་མཁྱེན་པ། །བདག་ཀྱང་རིང་<span class='delete'>པོ་</span><span class='add'>པོར་</span>མི་ཐོགས་དེ་བཞིན་<span class='delete'>ཤོག། །</span><span class='add'>ཤོག །</span>དེ་བཞིན་རྣ་བ་སྣ་དང་ལྕེ་ལུས་ཡིད། །གཟུགས་སྒྲ་དྲི་རོ་རེག་བྱ་དག་དང་ཆོས། །འཇིག་རྟེན་སྐྱེ་དང་སྒྲ་དང་མིང་ལ་\nསོགས། །ཐམས་ཅད་ལ་ཡང་དེ་བཞིན་རབ་ཏུ་མཁྱེན། ཐུགས་རྗེ་ཆེན་པོ་རྐང་གཉིས་མཆོག་གྱུར་པ། །སྦྱིན་<span class='delete'>བའི་</span><span class='add'>པའི་</span>ཕ་རོལ་<span class='delete'>བྱིན་</span><span class='add'>བྱོན་</span>པ་ཕུན་སུམ་ཚོགས། །ཇི་ལྟར་བཅོམ་ལྡན་སྦྱིན་པའི་ཕ་རོལ་བྱོན། །བདག་\nཀྱང་རིང་པོར་མི་ཐོགས་དེ་བཞིན་<span class='delete'>ཤོག། །</span><span class='add'>ཤོག །</span>ཐུགས་རྗེ་ཆེན་པོ་རྐང་གཉིས་མཆོག་གྱུར་པ། །ཚུལ་ཁྲིམས་རྣམ་དག་ཕ་རོལ་བྱོན་<span class='delete'>དག་</span><span class='add'>དང་</span>ལྡན། །ཇི་ལྟར་བཅོམ་ལྡན་ཚུལ་ཁྲིམས་ཕ་རོལ་བྱོན། །བདག་ཀྱང་རིང་"
 ],
 [
  "79.249a",
  "ལ་ནི་ཕན་བགྱིད་<span class='delete'>ཤོག། །</span><span class='add'>ཤོག །</span>དེ་བཞིན་གཤེགས་པ་སྤོབས་པ་མཆོག་ལྡན་<span class='delete'>པས། །</span><span class='add'>པས། །</span>དམ་ཆོས་ཟབ་མོ་དག་ནི་སྟོན་པར་མཛད། །བདག་ཀྱང་དེ་འདྲའི་ཡེ་ཤེས་གྲུབ་གྱུར་ནས། །འཇིག་རྟེན་ཐམས་ཅད་ལ་\nནི་ཕན་བགྱིད་<span class='delete'>ཤོག། །</span><span class='add'>ཤོག །</span>དེ་བཞིན་གཤེགས་པ་སྐུ་གསུང་ཐུགས་དུལ་<span class='delete'>པས། །</span><span class='add'>བས། །</span>ཐམས་ཅད་ཡེ་ཤེས་རྗེས་སུ་འབྲང་བར་མཛད། །བདག་ཀྱང་དེ་འདྲའི་ཡེ་ཤེས་གྲུབ་གྱུར་ནས། །འཇིག་རྟེན་ཐམས་ཅད་ལ་ནི་ཕན་\nབགྱིད་<span class='delete'>ཤོག། །</span><span class='add'>ཤོག །</span>དེ་བཞིན་གཤེགས་པས་དུས་གསུམ་རབ་མཁྱེན་པས། །འཛིན་དང་ཆགས་པ་མི་མངའ་ཐོགས་མི་མངའ། །བདག་ཀྱང་དེ་འདྲའི་ཡེ་ཤེས་གྲུབ་གྱུར་ནས། །འཇིག་རྟེན་ཐམས་ཅད་ལ་ནི་ཕན་བགྱིད་<span class='delete'>ཤོག། །</span><span class='add'>ཤོག །</span>\nདེ་བཞིན་གཤེགས་པས་ཚུལ་ཁྲིམས་ཏིང་འཛིན་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>ཤེས་རབ་བསྒྲུབས་པས་དེ་ལ་ལྡོག་མི་འགྱུར། །བདག་ཀྱང་དེ་འདྲའི་ཡེ་ཤེས་གྲུབ་གྱུར་ནས། །ཁམས་གསུམ་ཐུགས་རྗེ་ཆེན་པོའི་གཙོར་གྱུར་\n<span class='delete'>ཅིག། །</span><span class='add'>ཅིག །</span>དེ་བཞིན་གཤེགས་པས་རྣམ་གྲོལ་རབ་བསྒྲུབས་པས། །རྣམ་གྲོལ་མཁྱེན་དང་གཟིགས་པ་ལྡོག་མི་མངའ། །བདག་ཀྱང་དེ་འདྲའི་ཡེ་ཤེས་གྲུབ་གྱུར་ནས། །ཁམས་གསུམ་ཐུགས་རྗེ་\nཆེན་པོའི་གཙོར་གྱུར་<span class='delete'>ཅིག། །</span><span class='add'>ཅིག །</span>དེ་བཞིན་གཤེགས་པས་ཞི་གནས་ལྷག་མཐོང་བསྒྲུབས། །ལྷ་མི་འཇིག་རྟེན་དག་ན་མཚུངས་མ་མཆིས། །བདག་ཀྱང་དེ་འདྲའི་ཡེ་ཤེས་གྲུབ་གྱུར་ནས། །ཁམས་\nགསུམ་ཐུགས་རྗེ་ཆེན་པོའི་གཙོར་གྱུར་<span class='delete'>ཅིག། །</span><span class='add'>ཅིག །</span>དེ་བཞིན་གཤེགས་པ་མཁྱེན་པ་མཆོག་ལྡན་<span class='delete'>པས། །</span><span class='add'>པས། །</span>འཇིག་རྟེན་ཆོས་རྣམས་ལ་ནི་ཞེན་མི་མངའ། །བདག་ཀྱང་དེ་འདྲའི་ཡེ་ཤེས་གྲུབ་གྱུར་ནས། །ཁམས་\nགསུམ་ཐུགས་རྗེ་ཆེན་པོའི་གཙོར་གྱུར་<span class='delete'>ཅིག། །</span><span class='add'>ཅིག །</span>དེ་བཞིན་གཤེགས་པས་འཇིག་རྟེན་མཁྱེན་ལྡན་<span class='delete'>བས། །</span><span class='add'>པས། །</span>འགྲོ་བ་སྣ་ཚོགས་དག་ནི་གསལ་བར་གཟིགས། །བདག་ཀྱང་དེ་འདྲའི་ཡེ་ཤེས་གྲུབ་"
 ],
 [
  "79.248b",
  "དེ་འདྲའི་ཡེ་ཤེས་གྲུབ་གྱུར་ནས། །འཇིག་རྟེན་ཐམས་ཅད་ལ་ནི་ཕན་བགྱིད་<span class='delete'>ཤོག། །</span><span class='add'>ཤོག །</span><span class='delete'>དེ་</span><span class='add'>དེ་</span>བཞིན་གཤེགས་པ་མཁྱེན་པ་མཆོག་ལྡན་<span class='delete'>པས། །</span><span class='add'>པས། །</span>འཆི་འཕོ་སྐྱེ་བ་དཔག་མེད་རབ་ཏུ་མཁྱེན། །བདག་ཀྱང་དེ་འདྲའི་\nཡེ་ཤེས་གྲུབ་གྱུར་ནས། །འཇིག་རྟེན་ཐམས་ཅད་ལ་ནི་ཕན་བགྱིད་<span class='delete'>ཤོག། །</span><span class='add'>ཤོག །</span>དེ་བཞིན་གཤེགས་པ་མཁྱེན་པ་མཆོག་ལྡན་<span class='delete'>པས། །</span><span class='add'>པས། །</span>ཉོན་མོངས་ཟད་པ་ཐམས་ཅད་རབ་ཏུ་མཁྱེན། །བདག་ཀྱང་དེ་འདྲའི་\nཡེ་ཤེས་གྲུབ་གྱུར་ནས། །འཇིག་རྟེན་ཐམས་ཅད་ལ་ནི་ཕན་བགྱིད་<span class='delete'>ཤོག། །</span><span class='add'>ཤོག །</span>དེ་བཞིན་གཤེགས་པ་མཁྱེན་པ་མཆོག་ལྡན་<span class='delete'>པས། །</span><span class='add'>པས། །</span>བླ་མེད་བྱང་ཆུབ་ཡང་དག་མངོན་སངས་རྒྱས། །བདག་ཀྱང་དེ་འདྲའི་\nཡེ་ཤེས་གྲུབ་གྱུར་ནས། །འཇིག་རྟེན་ཐམས་ཅད་ལ་ནི་ཕན་བགྱིད་<span class='delete'>ཤོག། །</span><span class='add'>ཤོག །</span>དེ་བཞིན་གཤེགས་པ་མཁྱེན་པ་མཆོག་ལྡན་<span class='delete'>པས། །</span><span class='add'>པས། །</span>ཉོན་མོངས་བག་ཆགས་དག་ནི་རབ་ཏུ་སྤངས། །བདག་ཀྱང་དེ་འདྲའི་\nཡེ་ཤེས་གྲུབ་གྱུར་ནས། །འཇིག་རྟེན་ཐམས་ཅད་ལ་ནི་ཕན་བགྱིད་<span class='delete'>ཤོག། །</span><span class='add'>ཤོག །</span>དེ་བཞིན་གཤེགས་པ་མཁྱེན་པ་མཆོག་ལྡན་<span class='delete'>པས། །</span><span class='add'>པས། །</span>འཁོར་བ་ངེས་འབྱུང་ཆོས་ནི་རབ་ཏུ་<span class='delete'>མཁྱེན་། །</span><span class='add'>མཁྱེན། །</span>བདག་ཀྱང་དེ་འདྲའི་ཡེ་ཤེས་\nགྲུབ་གྱུར་ནས། །འཇིག་རྟེན་ཐམས་ཅད་ལ་ནི་ཕན་བགྱིད་<span class='delete'>ཤོག། །</span><span class='add'>ཤོག །</span>དེ་བཞིན་གཤེགས་པ་ཆོས་དོན་རབ་མཁྱེན་པས། །སེམས་ཅན་དཔག་མེད་རྣམས་ནི་གོ་བར་མཛད། །བདག་ཀྱང་དེ་འདྲའི་ཡེ་ཤེས་གྲུབ་\nགྱུར་ནས། །འཇིག་རྟེན་ཐམས་ཅད་ལ་ནི་ཕན་བགྱིད་<span class='delete'>ཤོག། །</span><span class='add'>ཤོག །</span>དེ་བཞིན་གཤེགས་པས་ཆོས་ཉིད་སྒྱུ་མ་དང་། །རྨི་ལམ་སྨིག་རྒྱུ་ལྟ་བུར་རབ་ཏུ་མཁྱེན། །བདག་ཀྱང་དེ་འདྲའི་ཡེ་ཤེས་གྲུབ་གྱུར་ནས། །འཇིག་\nརྟེན་ཐམས་ཅད་ལ་ནི་ཕན་བགྱིད་<span class='delete'>ཤོག། །</span><span class='add'>ཤོག །</span>དེ་བཞིན་གཤེགས་པས་འཇིག་རྟེན་ཐམས་ཅད་ཀྱི། །ཡི་གེ་དག་དང་བརྗོད་པ་རབ་ཏུ་མཁྱེན། །བདག་ཀྱང་དེ་འདྲའི་ཡེ་ཤེས་གྲུབ་གྱུར་ནས། །འཇིག་རྟེན་ཐམས་ཅད་"
 ],
 [
  "79.250a",
  "གཤེགས་པས་དེ་ནི་རབ་མཁྱེན་པས། །དེ་སླད་འདོད་པ་དག་ལ་ཞེན་མི་མངའ། །གང་ཞིག་ཟད་དང་མི་ཟད་མ་རྟོགས་པ། །དེས་ནི་འདོད་པ་དག་ལ་ཞེན་པ་སྐྱེད། །དེ་བཞིན་གཤེགས་པས་དེ་ནི་རབ་མཁྱེན་\nཔས། །དེ་སླད་འདོད་པ་དག་ལ་ཞེན་མི་མངའ། །གང་ཞིག་འཇུག་དང་མི་འཇུག་མ་རྟོགས་པ། །དེས་ནི་འདོད་པ་དག་ལ་ཞེན་པ་སྐྱེད། །དེ་བཞིན་གཤེགས་པས་དེ་ནི་རབ་མཁྱེན་པས། །དེ་སླད་འདོད་པ་དག་\nལ་ཞེན་མི་མངའ། །ཞེ་སྡང་གཏི་མུག་ཁོང་ཁྲོ་འཆབ་པ་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>གཡོ་སྒྱུ་ཕྲག་དོག་ང་རྒྱལ་ཁེངས་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>སྦྱིན་དང་ཚུལ་ཁྲིམས་<span class='delete'>བཟོད་</span><span class='add'>བཟོད་དང་</span>བརྩོན་འགྲུས་དང་། །བསམ་གཏན་ཤེས་རབ་དག་ཀྱང་དེ་བཞིན་ནོ། །དེ་ནས་\nབཅོམ་ལྡན་འདས་ཀྱིས་ཟླ་འོད་གཞོན་ནུར་གྱུར་པའི་སེམས་ཀྱི་རྟོག་པ་ཐུགས་ཀྱིས་མཁྱེན་ནས་འཛུམ་<span class='delete'>པ་</span><span class='add'>པ་</span>མཛད་<span class='delete'>དེ། །</span><span class='add'>དེ། </span>འོད་ཟེར་གསེར་གྱི་ཁ་དོག་ལྟ་བུ་རབ་ཏུ་<span class='delete'>བཀྱེ་</span><span class='add'>བཀྱེ</span>འོ། །འོད་ཟེར་དེས་ཀྱང་སངས་རྒྱས་\nཀྱི་ཞིང་ཚད་མེད་དཔག་ཏུ་མེད་པ་རྣམས་སྣང་བར་བྱས་<span class='delete'>ཏེ། །</span><span class='add'>ཏེ། </span>འཇིག་རྟེན་གྱི་ཁམས་དེ་དག་ཏུ་ཕན་བ་དག་བྱས་<span class='delete'>ནས། །</span><span class='add'>ནས། </span>བཅོམ་ལྡན་འདས་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་<span class='delete'>ཏེ། །</span><span class='add'>ཏེ། </span>དེ་བཞིན་གཤེགས་པའི་\nགཙུག་ཏོར་ཉིད་དུ་ཐིམ་པར་གྱུར་ཏོ། །དེ་ནས་དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པ་འདུག་པའི་སྟན་ལས་ལངས་<span class='delete'>ནས། །</span><span class='add'>ནས། </span>བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ཏེ། པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་\nབཙུགས་<span class='delete'>ནས། །</span><span class='add'>ནས། </span>བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་<span class='delete'>པོས་</span><span class='add'>བོས་</span>ཕྱག་བྱས་ཏེ། གུས་པས་ཐལ་མོ་སྦྱར་ནས། ཚིགས་སུ་བཅད་པ་འདི་དག་གིས་མངོན་<span class='delete'>བར་</span><span class='add'>པར་</span>བསྟོད་དེ། བཅོམ་ལྡན་འདས་ལ་ཞུ་བ་ཞུས་<span class='delete'>པ་</span><span class='add'>པ།   </span>\nའབྲུག་དང་སེང་གེའི་སྒྲ་སྒྲོགས་ཤིང་། །ཀ་ལ་<span class='delete'>བིང་</span><span class='add'>པིང་</span>ཀའི་སྒྲ་ཕྱུང་བས། །ཆོས་རྔ་ཆེན་<span class='delete'>མོའི་</span><span class='add'>པོའི་</span>སྒྲ་འབྱིན་པ། །ཅི་ཡི་སླད་དུ་འཛུམ་པ་མཛད། །ཉི་མ་སྟོང་བས་ཁྱད་པར་འཕགས། །རྣམ་པར་སྒྲ་རབ་དག་དང་ལྡན། །"
 ],
 [
  "79.250b",
  "ཡོན་ཏན་ངོ་མཚར་རབ་མངའ་བ། །ཅི་སླད་འོད་ཟེར་བཀྱེ་བ་མཛད། །སྦྱིན་དང་ཚུལ་ཁྲིམས་བཟོད་བརྩོན་འགྲུས། །བསམ་གཏན་ཤེས་རབ་རབ་བརྒྱན་པས། །ཐམས་ཅད་དག་ནི་ཡོངས་རྫོགས་\nཔས། །ཅི་སླད་འོད་ཟེར་བཀྱེ་བ་མཛད། །དེ་བཞིན་གཤེགས་པ་དབྱངས་མཉེན་<span class='delete'>བས། །</span><span class='add'>པས། །</span><span class='delete'>དག་</span><span class='add'>ངག་</span>རྩུབ་རྣམས་ནི་རྟག་ཏུ་སྤངས། །སེམས་ཅན་ནད་ནི་ལེགས་<span class='delete'>གོས་</span><span class='add'>གསོ་</span><span class='delete'>པ། །</span><span class='add'>བ། །</span>ཅི་སླད་འོད་ཟེར་བཀྱེ་བར་མཛད། །\nཐུགས་རྗེ་ཆེན་པོ་རྐང་གཉིས་གཙོ། །མིག་ནི་རྟག་ཏུ་སྟོང་དབེན་མཁྱེན། །རྣམ་དག་ཚངས་པའི་དབྱངས་མངའ་བས། །སེམས་ཅན་རྣམས་ལ་ཆོས་སྟོན་མཛད། །རྣ་བ་སྣ་ལྕེ་ལུས་དང་ཡིད། །སྒྲ་དང་མིང་\nལ་སོགས་པ་ནས། །ཀུན་འབྱུང་འགོག་པ་ལམ་དག་དང་། །ཡེ་ཤེས་བཟོད་པའི་བར་དེ་བཞིན། །ཐུགས་རྗེ་ཆེན་པོ་རྐང་གཉིས་གཙོ། །མིག་ཟད་སྐྱེ་བའི་མཐའ་དག་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>རབ་ཞི་དག་ནི་འཁོར་བ་<span class='delete'>དག། །</span><span class='add'>དག །</span>\nཐམས་ཅད་སྟོང་དབེན་ཉིད་དུ་མཁྱེན། །རྣ་བ་སྣ་ལྕེ་ལུས་དང་ཡིད། །གཟུགས་སྒྲ་དྲི་རོ་རེག་བྱ་ནས། །སྒྲ་དང་མིང་ལ་སོགས་པའི་བར། །ཐམས་ཅད་ཀྱང་ནི་དེ་བཞིན་ནོ། །གཞན་ཡང་རྟེན་ཅིང་འབྲེལ་\nའབྱུང་ཆོས། །ཆད་དང་རྟག་པ་ཡོངས་བྲལ་ནས། །བདག་དང་གཞན་གྱིས་བྱས་མིན་པས། །རྐྱེན་མེད་ལས་བྱུང་<span class='delete'>ཉིང་</span><span class='add'>ཉིད་</span>དུ་<span class='delete'>གསུང། །</span><span class='add'>གསུང་། །</span>རེས་འགའ་རྣམ་གྲངས་སྣ་ཚོགས་ཀྱིས། །སྡུག་བསྔལ་གཞི་ནི་སྟོན་པར་\nམཛད། །རེས་འགའ་དོན་ནི་སྣ་ཚོགས་ཀྱིས། །སངས་རྒྱས་འོད་ཟེར་བསྔགས་པར་མཛད། །རེས་འགའ་ཚིག་ནི་ཚད་མེད་ཀྱིས། །རབ་དབེན་ཆོས་ནི་སྟོན་མཛད་<span class='delete'>ཅིང། །</span><span class='add'>ཅིང་། །</span>གང་ཟག་སྲོག་དང་བདག་མེད་<span class='delete'>དང། </span><span class='add'>དང་། </span>\nསེམས་ཅན་མེད་པ་ཉིད་དུ་སྟོན། །འདས་པའི་སངས་རྒྱས་ཚད་མེད་<span class='delete'>ཀྱང། །</span><span class='add'>ཀྱང་། །</span>བསམ་གྱིས་མི་ཁྱབ་པ་དག་<span class='delete'>གི། །</span><span class='add'>གིས། །</span>ཚིགས་སུ་བཅད་པ་བརྒྱ་སྟོང་གིས། །དེ་འདྲའི་ཆོས་ནི་སྟོན་པར་མཛད། །དེ་བཞིན་གཤེགས་པས་"
 ],
 [
  "79.251b",
  "སྐྱེ་མཐའ་དག་ནི་རང་བཞིན་གྱིས། །རྟག་ཏུ་སྟོང་ཞིང་དབེན་<span class='delete'>པ་</span><span class='add'>པ་</span>དང་། །འགྲོ་འོང་མེད་པར་རབ་ཏུ་མཁྱེན། །བཞུགས་དང་གནས་ནི་མི་མངའ་བས། །ཡང་དག་མཐའ་ལ་རབ་ཏུ་བཞུགས། །བཅོམ་ལྡན་སྤྱན་\nནི་ཐོགས་མི་མངའ། །དེ་སླད་<span class='delete'>དེད་</span><span class='add'>དེང་</span>བདག་ཞུ་བ་ལགས། །དེ་བཞིན་གཤེགས་པས་མིག་ཉིད་ཀྱི། །སྔོན་དང་ཕྱི་མའི་མཐའ་དག་དང་། །ཟད་དང་མ་ཟད་འཁོར་བ་ནི། །རང་བཞིན་སྟོང་དབེན་རབ་མཁྱེན་པས། །ཆོས་ཀྱི་\nདོན་རྣམས་རབ་ཕྱེ་ནས། །འཇིག་རྟེན་རྣམས་ནི་དགའ་བར་མཛད། །ཐུབ་པ་དབྱངས་སྙན་རབ་མངའ་བས། །ཅི་སླད་འཛུམ་<span class='delete'>པ་</span><span class='add'>པ་</span>སྟན་པར་མཛད། །བཅོམ་ལྡན་སྔོན་དང་ཕྱི་མཐའ་དང་། །མིག་ཉིད་སྟོང་དབེན་རབ་མཁྱེན་\nཅིང་། །རྣམ་རྟོག་ཚིག་དང་བྲལ་ལགས་ན། །ཅི་སླད་འཛུམ་<span class='delete'>པ་</span><span class='add'>པ་</span>སྟོན་པར་མཛད། །བཅོམ་ལྡན་མིག་ནི་དཔག་མེད་དང་། །བརྗོད་པ་སྣ་ཚོགས་རང་བཞིན་གྱིས། །རྟག་ཏུ་སྟོང་དབེན་མཁྱེན་ལགས་ན། །ཅི་སླད་འཛུམ་<span class='delete'>\n</span><span class='add'></span><span class='delete'>པ་</span><span class='add'>པ་</span>སྟོན་པར་མཛད། །བཅོམ་ལྡན་ཟད་དང་སྐྱེ་མཐའ་དང་། །མིག་ཉིད་སྟོང་དབེན་རབ་མཁྱེན་ཅིང་། །ཉོན་མོངས་རྣམས་ནི་ཡོངས་སྤངས་པས། །སངས་རྒྱས་བྱང་ཆུབ་མཁྱེན་པ་བརྙེས། །གྲགས་པ་\nམཆོག་ནི་ཕུན་སུམ་ཚོགས། །ཅི་སླད་འཛུམ་<span class='delete'>པ་</span><span class='add'>པ་</span>སྟོན་པར་མཛད། །བཅོམ་ལྡན་ཡུན་རིང་བསྒོམ་བསླབས་པས། །བསམ་གྱིས་མི་ཁྱབ་སྟོན་པར་མཛད། །མིག་ཉིད་སྟོང་པ་ཉིད་དུ་མཁྱེན། །དྲི་བྲལ་རྟག་\nཏུ་རྣམ་པར་<span class='delete'>དག། །</span><span class='add'>དག །</span>སེམས་ཀྱི་སྤྱོད་པ་ཚད་མེད་རྣམས། །དགོངས་པ་གཅིག་གིས་ཐམས་ཅད་མཁྱེན། །འོད་ཟེར་འཇིག་རྟེན་སྣང་མཛད་པ། །འདི་ནི་གང་གི་སྔ་རྟགས་ལགས། །དྲང་སྲོང་ཆེན་པོ་མངོན་སངས་\nརྒྱས། །རྐང་གཉིས་གཙོ་བོ་ཁྱད་པར་འཕགས། །ཉོན་མོངས་དག་ནི་རབ་བསལ་<span class='delete'>པས། །</span><span class='add'>བས། །</span>ཐུགས་ནི་རྟག་ཏུ་ཞི་ཞིང་དབེན། །དེ་བཞིན་གཤེགས་པ་མཁྱེན་མཆོག་གིས། །མིག་ཟད་མཐའ་ནི་རབ་ཏུ་རྟོགས། །"
 ],
 [
  "79.249b",
  "གྱུར་ནས། །འགྲོ་བ་དེ་ལ་ཐེ་ཚོམ་མ་མཆིས་<span class='delete'>ཤོག། །</span><span class='add'>ཤོག །</span>དེ་བཞིན་གཤེགས་པ་སྐྱེ་ཟད་མཐའ་མཁྱེན་པས། །དེ་སླད་དེ་ལ་རྨོངས་པ་<span class='delete'>ཡོད་</span><span class='add'>ཡོང་</span>མི་མངའ། །བདག་ཀྱང་དེ་འདྲའི་ཡེ་ཤེས་གྲུབ་གྱུར་ནས། །སྐྱེ་ཟད་ཉིད་\nལ་ཐེ་ཚོམ་མ་མཆིས་<span class='delete'>ཤོག། །</span><span class='add'>ཤོག །</span>དེ་བཞིན་གཤེགས་པས་རབ་ཞི་མཐའ་མཁྱེན་པས། །དེ་སླད་དེ་ལ་རྨོངས་པ་ཡོང་མི་མངའ། །བདག་ཀྱང་དེ་འདྲའི་ཡེ་ཤེས་གྲུབ་གྱུར་ནས། །རབ་ཞི་དེ་ལ་ཐེ་ཚོམ་མ་མཆིས་\n<span class='delete'>ཤོག། །</span><span class='add'>ཤོག །</span>དེ་བཞིན་གཤེགས་པ་འཁོར་བའི་མཐའ་མཁྱེན་པས། །དེ་སླད་དེ་ལ་རྨོངས་པ་ཡོང་མི་མངའ། །བདག་ཀྱང་དེ་འདྲའི་ཡེ་ཤེས་གྲུབ་གྱུར་ནས། །འཁོར་བ་དེ་ལ་ཐེ་ཚོམ་མ་མཆིས་<span class='delete'>ཤོག། །</span><span class='add'>ཤོག །</span>དེ་བཞིན་\nགཤེགས་པས་<span class='delete'>སྡོན་</span><span class='add'>སྔོན་</span>དང་ཕྱི་མཐའ་མཁྱེན། །དེ་སླད་སློབ་དཔོན་མ་མཆིས་མཁྱེན་དང་ལྡན། །བདག་ཀྱང་དེ་འདྲའི་ཡེ་ཤེས་གྲུབ་གྱུར་ནས། །སྔ་ཕྱིའི་མཐའ་ལ་ཐེ་ཚོམ་མ་མཆིས་<span class='delete'>ཤོག། །</span><span class='add'>ཤོག །</span>དེ་བཞིན་གཤེགས་\nཔས་སྐྱོན་ཟློག་མཐའ་རབ་མཁྱེན། །དེ་སླད་སློབ་དཔོན་མ་མཆིས་མཁྱེན་དང་ལྡན། །བདག་ཀྱང་དེ་འདྲའི་ཡེ་ཤེས་གྲུབ་གྱུར་ནས། །སྐྱོན་ཟློག་དེ་ལ་ཐེ་ཚོམ་མ་མཆིས་<span class='delete'>ཤོག། །</span><span class='add'>ཤོག །</span>དེ་བཞིན་གཤེགས་པས་<span class='delete'>སྡོན་</span><span class='add'>སྔོན་</span>\nདང་ཕྱི་མཐའ་མཁྱེན། །མིག་གི་རྟག་ཆད་དག་ལ་འཛིན་མི་མངའ། །བདག་ཀྱང་དེ་འདྲའི་ཡེ་ཤེས་གྲུབ་གྱུར་ནས། །སྔ་ཕྱི་མཐའ་ལ་ཐེ་ཚོམ་མ་མཆིས་<span class='delete'>ཤོག། །</span><span class='add'>ཤོག །</span>དེ་བཞིན་གཤེགས་པས་སྐྱེ་ཟད་མཐའ་མཁྱེན་པས། །\nམིག་གི་རྟག་ཆད་དག་ལས་འཛིན་མི་མངའ། །བདག་ཀྱང་དེ་འདྲའི་ཡེ་ཤེས་གྲུབ་གྱུར་ནས། །སྐྱེ་ཟད་ཉིད་ལ་ཐེ་ཚོམ་མ་མཆིས་<span class='delete'>ཤོག། །</span><span class='add'>ཤོག །</span>གང་ཞིག་སྔོན་དང་ཕྱི་མཐའ་མ་རྟོགས་པས། །དེས་ནི་འདོད་པ་དག་\nལ་ཞེན་པ་སྐྱེད། །དེ་བཞིན་གཤེགས་པས་དེ་ནི་རབ་མཁྱེན་པས། །དེ་སླད་འདོད་པ་<span class='delete'>དགལ་</span><span class='add'>དག་ལ་</span>ཞེན་མི་མངའ། །གང་ཞིག་ཡོད་མེད་མཐའ་ནི་མ་རྟོགས་པ། །དེས་ནི་འདོད་པ་དག་ལ་ཞེན་པ་སྐྱེད། །དེ་བཞིན་"
 ],
 [
  "79.251a",
  "ཡོན་ཏན་ཆོས། །ཡང་དག་ཉིད་ནི་སྟོན་མཛད་ཀྱང་། །རྗོད་དང་བརྗོད་བྱ་མི་མངའ་བས། །བརྗོད་མཛད་ཆོས་ཀྱང་<span class='delete'>ཡོད་</span><span class='add'>ཡོང་</span>མི་མངའ། །བཅོམ་ལྡན་ཡང་དག་ཆོས་སྲུང་ཞིང་། །སྐྱེ་དགུ་རྣམས་\nནི་གོ་མཛད་པས། །ལྷ་རྣམས་དང་ནི་གནོད་སྦྱིན་<span class='delete'>དག། །</span><span class='add'>དག །</span>གང་ཐོས་དེ་དག་རྟོགས་པར་འགྱུར། །ལྷ་མ་ཡིན་ནི་ཐམས་ཅད་ཀྱང་། །མོས་པ་དག་ནི་རྣམ་པར་<span class='delete'>དག། །</span><span class='add'>དག །</span>མི་ནི་མང་པོ་ཚད་མེད་ཀྱང་། །ཐེ་\nཚོམ་དྲ་བ་<span class='delete'>ཆང་</span><span class='add'>ཆད་</span>པར་གྱུར། །འདོད་ཆགས་རང་བཞིན་རབ་ཏུ་རྟོགས། །ཞེ་སྡང་གཏི་མུག་རྣམ་པར་<span class='delete'>བཤིག། །</span><span class='add'>བཤིག །</span>སྲེད་དང་ང་རྒྱལ་མ་རིག་དང་། །གཡོ་སྒྱུ་ཕྲག་དོག་སྤྲོས་པ་ནས། །སྡུག་བསྔལ་ཕུང་པོ་ལ་སོགས་\nཔར། །ཐམས་ཅད་ཀྱང་ནི་ཡོངས་སུ་སྤངས། །འདི་ལ་སོགས་པའི་ཚིག་གི་དོན། །མཐར་ནི་ཀུན་ཀྱང་རྣམ་པར་<span class='delete'>དག། །</span><span class='add'>དག །</span>དེ་བཞིན་གཤེགས་པས་ཆོས་གཅིག་ལ། །སྣ་ཚོགས་མིང་ནི་རབ་མཁྱེན་པས། །གྲངས་ནི་བརྒྱ་\nསྟོང་མང་པོ་རྣམས། །བསམ་གྱིས་མི་ཁྱབ་རབ་ཏུ་སྟོན། །སངས་རྒྱས་ཚད་མེད་མང་པོ་ལས། །དེ་འདྲའི་ཆོས་ནི་ལེགས་བསླབས་པས། །ཆོས་ཀྱི་དངོས་པོ་གཅིག་ལ་ཡང་། །བརྗོད་པ་ཐུག་པ་མེད་པ་སྟོན། །དེ་བཞིན་\nགཤེགས་པས་ཆོས་རྣམས་ཀྱི། །རྣམ་གྲངས་སྣ་ཚོགས་རབ་མཁྱེན་པས། །མིང་ཚིག་དང་པོ་བར་མ་དང་། །ཐ་མ་རྣམ་འབྱེད་རབ་ཏུ་མཁྱེན། །ཐ་དད་ཚིག་ནི་སྣ་ཚོགས་<span class='delete'>དག། །</span><span class='add'>དག །</span>ཐམས་ཅད་རབ་ཏུ་བསླབས་\nཔས་ན། །དོན་མཆོག་དག་ནི་གྱ་ནོམ་པ། །སྟོན་པ་དག་ནི་རབ་ཏུ་མཁྱེན། །དེ་འདྲའི་དབྱངས་ནི་རྣམ་དག་པ། །རྒྱུ་རྐྱེན་ཚོགས་པ་ལས་བྱུང་བས། །ལྕེ་འབའ་ཞིག་ལ་རྟེན་པ་ནས། །ལུས་སེམས་བར་ལ་\nརྟེན་པའང་མིན། །ས་ནི་རྣམ་པ་དྲུག་ཏུ་གཡོས། །ཕྱོགས་བཅུའི་འཁོར་ནི་ཡོངས་འདུས་ནས། །ཐལ་སྦྱར་བཅོམ་ལྡན་ཞལ་ལྟ་ན། །ཐེ་ཚོམ་དག་ནི་བསལ་དུ་གསོལ། །དེ་བཞིན་གཤེགས་པས་མི་བཟད་དང་། །"
 ],
 [
  "79.248a",
  "ཀྱང་དེ་འདྲའི་ཡེ་ཤེས་གྲུབ་གྱུར་ནས། །འཇིག་རྟེན་ཐམས་ཅད་ལ་ནི་ཕན་བགྱིད་<span class='delete'>ཤོག། །</span><span class='add'>ཤོག །</span>དེ་བཞིན་གཤེགས་པ་མཁྱེན་པ་མཆོག་ལྡན་<span class='delete'>པས། །</span><span class='add'>པས། །</span>བསམ་གཏན་སྤྱོད་པ་དག་ནི་རབ་ཏུ་མཁྱེན། །\nབདག་ཀྱང་དེ་འདྲའི་ཡེ་ཤེས་གྲུབ་གྱུར་ནས། །འཇིག་རྟེན་ཐམས་ཅད་ལ་ནི་ཕན་བགྱིད་<span class='delete'>ཤོག། །</span><span class='add'>ཤོག །</span>དེ་བཞིན་གཤེགས་པ་མཁྱེན་པ་མཆོག་ལྡན་<span class='delete'>པས། །</span><span class='add'>པས། །</span>རྣམ་པར་ཐར་པའི་སྤྱོད་པ་རབ་ཏུ་མཁྱེན། །\nབདག་ཀྱང་དེ་འདྲའི་ཡེ་ཤེས་གྲུབ་གྱུར་ནས། །འཇིག་རྟེན་ཐམས་ཅད་ལ་ནི་ཕན་བགྱིད་<span class='delete'>ཤོག། །</span><span class='add'>ཤོག །</span>དེ་བཞིན་གཤེགས་པ་མཁྱེན་པ་མཆོག་ལྡན་<span class='delete'>པས། །</span><span class='add'>པས། །</span>ཆ་མཉམ་སྤྱོད་པ་དག་ནི་རབ་ཏུ་མཁྱེན། །\nབདག་ཀྱང་དེ་འདྲའི་ཡེ་ཤེས་གྲུབ་གྱུར་ནས། །འཇིག་རྟེན་ཐམས་ཅད་ལ་ནི་ཕན་བགྱིད་<span class='delete'>ཤོག། །</span><span class='add'>ཤོག །</span>དེ་བཞིན་གཤེགས་པ་མཁྱེན་པ་མཆོག་ལྡན་<span class='delete'>པས། །</span><span class='add'>པས། །</span>སྙོམས་འཇུག་སྤྱོད་པ་དག་ནི་རབ་ཏུ་མཁྱེན། །\nབདག་ཀྱང་དེ་འདྲའི་ཡེ་ཤེས་གྲུབ་གྱུར་ནས། །འཇིག་རྟེན་ཐམས་ཅད་ལ་ནི་ཕན་བགྱིད་<span class='delete'>ཤོག། །</span><span class='add'>ཤོག །</span>དེ་བཞིན་གཤེགས་པ་འཁོར་བ་རབ་མཁྱེན་པས། །འཁོར་བ་ཉོན་མོངས་རྒྱུ་ལས་སྐྱེས་པར་མཁྱེན། །\nབདག་ཀྱང་དེ་འདྲའི་ཡེ་ཤེས་གྲུབ་གྱུར་ནས། །འཇིག་རྟེན་ཐམས་ཅད་ལ་ནི་ཕན་བགྱིད་<span class='delete'>ཤོག། །</span><span class='add'>ཤོག །</span>དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་རབ་མཁྱེན་པས། །འཇིག་རྟེན་ཕན་འདོགས་དཔེ་ཟླ་ཡོངས་མ་\nམཆིས། །བདག་ཀྱང་དེ་འདྲའི་ཡེ་ཤེས་གྲུབ་གྱུར་ནས། །འཇིག་རྟེན་ཐམས་ཅད་ལ་ནི་ཕན་བགྱིད་<span class='delete'>ཤོག། །</span><span class='add'>ཤོག །</span>དེ་བཞིན་གཤེགས་པ་ཏིང་འཛིན་རབ་གནས་པས། །ཁྱད་པར་ཐབས་ཀྱི་ཡེ་ཤེས་སྐྱེད་པར་མཛད། །\nབདག་ཀྱང་དེ་འདྲའི་ཡེ་ཤེས་གྲུབ་གྱུར་ནས། །འཇིག་རྟེན་ཐམས་ཅད་ལ་ནི་ཕན་བགྱིད་<span class='delete'>ཤོག། །</span><span class='add'>ཤོག །</span>དེ་བཞིན་གཤེགས་པ་མཁྱེན་པ་མཆོག་ལྡན་<span class='delete'>པས། །</span><span class='add'>པས། །</span>སྔོན་གྱི་གནས་ཀྱི་སྤྱོད་པ་དཔག་མེད་<span class='delete'>མཁྱེན། </span><span class='add'>མཁྱེན། །</span>བདག་ཀྱང་"
 ],
 [
  "79.252b",
  "ཅི་སླད་འཛུམ་<span class='delete'>པ་</span><span class='add'>པ་</span>སྟོན་པར་མཛད། །བཅོམ་ལྡན་རང་བཞིན་རང་བཞིན་མེད། །བདག་དང་བདག་མེད་པ་ཡང་མཁྱེན། །མོས་པ་སྟོང་པར་རབ་མཁྱེན་ན། །ཅི་སླད་འཛུམ་<span class='delete'>པ་</span><span class='add'>པ་</span>སྟོན་པར་མཛད། །འཁོར་བ་\nབདག་མེད་ཉིད་དུ་གཟིགས། །རྟག་དང་མི་རྟག་པ་ཡང་མཁྱེན། །མྱ་ངན་འདས་པ་སྟོང་མཁྱེན་ན། །ཅི་སླད་འཛུམ་<span class='delete'>པ་</span><span class='add'>པ་</span>སྟོན་པར་མཛད། །དེ་བཞིན་གཤེགས་པ་ཐུགས་རྣམ་གྲོལ། །གྲགས་པ་ཁམས་\nགསུམ་ཀུན་དུ་<span class='delete'>གང། །</span><span class='add'>གང་། །</span>བརྒྱ་བྱིན་མི་ཡི་དབང་པོ་དང་། །ཀླུ་རྣམས་ལ་སོགས་ཀུན་གྱིས་མཆོད། །དེ་བཞིན་གཤེགས་པས་མིག་ཟད་དང་། །སྐྱེ་མཐའ་རབ་དབེན་མཁྱེན་ལགས་ན། །ཅི་སླད་འཛུམ་<span class='delete'>པ་</span><span class='add'>པ་</span>\n<span class='delete'>སྟོང་</span><span class='add'>སྟོན་</span>པར་མཛད། །སངས་རྒྱས་སྲས་ནི་ཚད་མེད་པ། །འཁོར་འདིར་ཐམས་ཅད་རབ་ཏུ་འདུས། །སངས་རྒྱས་གསུང་ལས་སྐྱེས་པ་དང་། །ཆོས་ལས་སྤྲུལ་ཏེ་གང་བྱུང་བ། །ཐམས་ཅད་བཅོམ་ལྡན་སྤྱན་\nསྔར་མཆིས། །གུས་པས་ཐལ་མོ་རབ་སྦྱར་ལགས། །འཁོར་འདུས་དེ་དག་སླད་དུ་ནི། །འོད་ཟེར་རྒྱུ་རྐྱེན་འདི་ཞུ་ལགས། །དེ་བཞིན་གཤེགས་པས་མིག་ཉིད་ནི། །སྟོང་ཞིང་བདག་མེད་མཁྱེན་པས་ན། །ཁྱིམ་ན་\nགནས་པའི་རྣལ་འབྱོར་པ། །ཐམས་ཅད་ལས་ནི་ཡང་དག་འདས། །དེ་བཞིན་གཤེགས་པས་ཆོས་རྣམས་ནི། །བྱེ་བྲག་མེད་ཅིང་མཉམ་མཁྱེན་པས། །བཅོམ་ལྡན་དགོངས་པ་རབ་མཁྱེན་གྱི། །རྫུ་འཕྲུལ་\nདག་གིས་གཟིགས་མ་ལགས། །བཅོམ་ལྡན་མིག་ལ་བདག་མེད་མཁྱེན། །ངོ་བོ་ཉིད་སྟོང་འགྲོ་<span class='delete'>འོད་</span><span class='add'>འོང་</span>མེད། །རྣམ་དག་མཁྱེན་པ་ཚད་མ་མཆིས། །ཅི་སླད་འཛུམ་པ་སྟོན་པར་མཛད།། །།བམ་པོ་གསུམ་པ།། \nདེ་བཞིན་གཤེགས་པ་སྐྱེ་མཐའ་རབ་ཟད་པ། །ཐུགས་རྗེ་ཆེན་པོས་འཇིག་རྟེན་ཀུན་སྐྱོབ་མཛད། །ཆོས་རྗེ་མཆོག་གྱུར་མི་ཡི་གཙོར་གྱུར་པ། །ཅི་སླད་འཛུམ་<span class='delete'>པ་</span><span class='add'>པ་</span>སྟན་མཛད་བཤད་དུ་གསོལ། །བྱང་ཆུབ་སེམས་"
 ],
 [
  "79.253b",
  "བཞིན་དུ་ནི་རིག་པར་བགྱི། །རྡོ་རྗེ་རྟག་པའི་སྐུ་དང་མི་འཇིག་སྐུ། །མཚན་མཆོག་བརྒྱ་སྟོང་དག་ནི་ཕུན་སུམ་ཚོགས། །སྐུ་ལ་འཁྲུལ་འཁོར་མི་མངའ་གཡོ་མཛད་པ། །རྒྱུ་རྐྱེན་གང་སླད་འཛུམ་<span class='delete'>པ་</span><span class='add'>པ་</span>བཤད་དུ་གསོལ། །\nབྱིན་པ་ཟླུམ་ཞིང་ཞབས་ཀྱི་རྟིང་པ་རིང་། །ཕྱལ་གྱི་མཚན་མ་མི་གདའ་སེང་གེ་འདྲ། །ལྟེ་བ་ཤིན་དུ་ཟབ་ཅིང་རྐེད་རྒྱས་པ། །རྒྱུ་རྐྱེན་གང་སླད་འཛུམ་མཛད་བཤད་དུ་གསོལ། །གསེར་སྐུ་རྣམ་དག་རྡུལ་དང་དྲི་མ་སྤངས། །\nབ་སྤུ་རེ་རེ་ཁ་དོག་མཐོན་མཐིང་ལྡན། །གཡས་སུ་འཁྱིལ་ཅིང་སྤོས་ཀྱི་<span class='delete'>དང་</span><span class='add'>ངད་</span>ལྡང་བ། །རྒྱུ་རྐྱེན་གང་སླད་འཛུམ་མཛད་བཤད་དུ་གསོལ། །སྐུ་མཆོག་དམ་པ་ཡོངས་རྫོགས་རྟག་གནས་པ། །དཔེར་ན་ནྱ་གྲོ་དྷ་ཡི་ཤིང་རྒྱལ་\nབཞིན། །ཡོན་ཏན་ཐམས་ཅད་ཀྱིས་ནི་རབ་ཏུ་བརྒྱན། །གསུང་དབྱངས་དག་གིས་འཁོར་ནི་དགའ་བར་མཛད། །དཔུང་པ་ཟླུམ་ཞིང་ཕྲག་པ་སྟུག་ལ་མཛེས། །གཙུག་ཏོར་ཡོངས་རྫོགས་གཡས་སུ་འཁྱིལ་<span class='delete'>པར་</span><span class='add'>བར་</span>གདའ། །\nཞིང་ནི་བརྒྱ་སྟོང་དཔག་མེད་རྒྱུ་བར་མཛད། །སེམས་ཅན་ལོག་དང་ཡང་དག་ལམ་སྟོན་མཛད། །ཚེམས་དཀར་དྲི་མི་མངའ་བས་དུང་དང་འདྲ། །ལྗགས་མཚན་སྲིད་རིད་ཞལ་ནི་ཀུན་དུ་ཁེབས། །འགྲམ་པ་སེང་གེ་\nའདྲ་ཞིང་ཤངས་ནི་མཐོ། །ཐམས་ཅད་ཐབས་དང་རྣམ་དག་ཐུགས་ལས་སྐྱེས། །ཨུད་པ་ལ་ཡི་བསུང་ནི་ཞལ་ནས་འབྱུང་། །ཙན་དན་དྲི་དག་སྐུ་ནི་ཀུན་དུ་ཁྱབ། །སྔོན་ནི་བྱམས་པ་རྒྱ་ཆེར་བསྒོམས་པས་ན། །རྣམ་\nདག་མོས་པ་རྟག་ཏུ་རྒྱུན་མི་འཆད། །དེ་བཞིན་གཤེགས་པས་ཞབས་མཐིལ་ཤིན་དུ་མཉམ། །ས་ལ་རེག་ཀྱང་རྡུལ་ནི་གོས་མི་འགྱུར། །གོམ་པ་སེང་གེ་གླང་པོ་ཆེ་འདྲ་བས། །འཇིག་རྟེན་ཐམས་ཅད་ལ་ནི་ཡང་དག་\nའདས། །འཁོར་ལོ་རྩིབས་སྟོང་མཚན་གྱིས་མཛེས་པར་བརྒྱན། །ཁྱད་འཕགས་འོད་ཟེར་དག་ནི་རབ་ཏུ་གསལ། །དགེ་བ་དག་གིས་སྐྱེ་དགུ་ཕན་འདོགས་པས། །གང་གིས་མཐོང་བ་དང་བ་རབ་ཏུ་སྐྱེ། །སོར་གཅིག་"
 ],
 [
  "79.254a",
  "འོད་ཟེར་བརྒྱ་སྟོང་རབ་བཀྱེ་ནས། །སངས་རྒྱས་ཞིང་ནི་དཔག་མེད་སྣང་བར་མཛད། །སྔོན་ནི་དགེ་སྦྱོང་མང་པོ་རབ་བསྒྲུབས་པས། །མཚན་གྱི་བཀོད་པ་སྣ་ཚོགས་འདི་བརྙེས་ལགས། །གཟུགས་སྐུ་ཡོངས་\nརྫོགས་དཔེ་ཟླ་<span class='delete'>ཡོད་</span><span class='add'>ཡོང་</span>མ་མཆིས། །ཞལ་མཚན་རབ་མཛེས་ཤིན་དུ་ཁྱད་པར་འཕགས། །རྫུ་འཕྲུལ་དག་གིས་འཇིག་རྟེན་ཕན་འདོགས་པ། །ཅི་སླད་འཛུམ་<span class='delete'>པ་</span><span class='add'>པ་</span>བསྟན་མཛད་བཤད་དུ་གསོལ། །བྱིན་པ་<span class='delete'>དི་</span><span class='add'>རི་</span>དགས་ཨེ་ན་ཡ་དང་\nའདྲ། །སྐུ་དབྱིབས་མི་རྒུ་སེང་གེ་ཇི་ལྟ་བཞིན། །འཇིག་རྟེན་བྱུང་ནས་འཇིག་རྟེན་སྣང་མཛད་པ། །ཅི་སླད་འཛུམ་<span class='delete'>པ་</span><span class='add'>པ་</span>བསྟན་མཛད་བཤད་དུ་གསོལ། །ཅང་ཤེས་བཞིན་དུ་མཚན་སྦས་རྡུལ་མི་མངའ། །ཕྱག་མཐིལ་མཉམ་རྒྱས་\nཕྱག་ནི་པུས་མོ་འདས། །མི་ཡི་སེང་གེ་ངོ་མཚར་ཁྱད་པར་འཕགས། །ཅི་སླད་འཛུམ་<span class='delete'>པ་</span><span class='add'>པ་</span>བསྟན་མཛད་བཤད་དུ་གསོལ། །སྐུ་ལས་འོད་ཟེར་དཔག་མེད་རབ་འགྱེད་<span class='delete'>ཅིང་། </span><span class='add'>ཅིང་། །</span>ཁ་དོག་གྱ་ནོམ་རབ་ཞི་རྟག་གསལ་བ། །རྣམ་དག་\nཐུགས་ནི་རྟག་ཏུ་རྒྱུན་མི་འཆད། །མདོ་སྡེ་ཚད་མེད་པ་དག་སྟོན་པར་མཛད། །རྟག་དང་ཆད་པ་དག་ལ་གནས་པ་ཡིས། །དེ་འདྲའི་ཆོས་ནི་སྒྲུབ་པར་འགྱུར་མ་ལགས། །གང་གིས་མཐར་ལྟ་རྣམས་ནི་རབ་སྤངས་ན། །བཅོམ་\nལྡན་རྣམ་དག་སྐུ་ནི་མྱུར་ཐོབ་འགྱུར། །ལྷ་རྔ་འབྲུག་སྒྲ་གསུང་ནི་ཀུན་གྲགས་ཤིང་། །ཀ་ལན་འདའ་ཀའི་དབྱངས་སྙན་རབ་ཏུ་གསལ། །ལྷ་ཡི་གླུ་སྒྲ་བརྒྱ་སྟོང་མང་ལྡན་<span class='delete'>བ། །</span><span class='add'>པ། །</span>ཅི་སླད་འོད་ཟེར་བཀྱེ་བ་བཤད་དུ་གསོལ། །\nའདྲེན་པས་གསུང་གཅིག་ཏུ་ནི་ཆོས་བསྟན་པས། །འཆལ་<span class='delete'>པའི་</span><span class='add'>བའི་</span>ཚུལ་ཁྲིམས་ཅན་དག་རྒྱུན་ཡང་བཅད། །དེ་བཞིན་གཤེགས་པས་དབྱངས་རབ་གང་གསུངས་པ། །དེ་ཀུན་ཟབ་ཅིང་ངོ་མཚར་ཆོས་ལགས་སོ། །ཁྱུ་མཆོག་\nསྨིན་མཚམས་འོད་ཟེར་རབ་བཀྱེ་བས། །སངས་རྒྱས་ཞིང་ནི་བརྒྱ་སྟོང་གསལ་བར་མཛད། །སྤྱན་མཆོག་དག་ནི་ཁ་དོག་མཐོན་མཐིང་འདྲ། །གཙུག་ཏོར་མཚན་ནི་མཁའ་ཡི་ལྷས་མི་<span class='delete'>མཐོང། །</span><span class='add'>མཐོང་། །</span>ཚེམས་དཀར་གཏམས་"
 ],
 [
  "79.254b",
  "པ་བཞི་བཅུ་དག་དང་ལྡན། །དཔེར་ན་རིན་ཆེན་ཆུ་ཤེལ་དག་དང་མཚུངས། །དགེ་བའི་ཕྲིན་ལས་ཚད་མེད་དག་ལས་སྐྱེས། །ཅི་སླད་འཛུམ་<span class='delete'>པ་</span><span class='add'>པ་</span>བསྟན་མཛད་བཤད་དུ་གསོལ། །དེ་བཞིན་གཤེགས་པ་ཡོན་ཏན་\nརྫོགས་པའི་སྐུ། །ཁ་དོག་དམ་པ་དཔག་མེད་ཕུན་<span class='delete'>ཆོགས་</span><span class='add'>ཚོགས་</span><span class='delete'>ཤིང། །</span><span class='add'>ཤིང་། །</span>འོད་ཟེར་རྣམ་དག་ངོ་མཚར་རབ་བཀྱེ་བ། །<span class='delete'>ཙ་</span><span class='add'>ཅི་</span>སླད་འཛུམ་<span class='delete'>པ་</span><span class='add'>པ་</span>བསྟན་མཛད་བཤད་དུ་གསོལ། །ཐུགས་རྗེ་ཆེན་པོ་མཆོག་རྒྱལ་རྐང་གཉིས་གཙོ། །སེམས་\nཅན་ཡང་དག་བསམ་པ་ཐུགས་སུ་ཆུད། །ཐོགས་པ་མ་མཆིས་སྤོབས་པ་མཆོག་བརྙེས་པ། །ཅི་སླད་འཛུམ་<span class='delete'>པ་</span><span class='add'>པ་</span>བསྟན་མཛད་བཤད་དུ་གསོལ། །དེ་བཞིན་གཤེགས་པས་ཕ་རོལ་རབ་བྱོན་པས། །རིག་པ་གསུམ་དང་མངོན་ཤེས་\nདྲུག་ཕུན་ཚོགས། །རྣམ་དག་འོད་ཟེར་དཔག་མེད་སྟོན་མཛད་པ། །ཅི་སླད་འཛུམ་<span class='delete'>པ་</span><span class='add'>པ་</span>བསྟན་མཛད་བཤད་དུ་གསོལ། །བཅོམ་ལྡན་<span class='delete'>སྡོན་</span><span class='add'>སྔོན་</span>ནི་བསྐལ་པ་དཔག་མེད་སྙེད། །བཅོམ་ལྡན་བརྒྱ་སྟོང་སྙེད་<span class='delete'>འི་</span><span class='add'>ལ་</span>མཆོད་པ་མཛད། །དེ་འདྲའི་\nརྒྱུ་འབྲས་ཆབ་ནི་མི་འཚལ་བ། །ཅི་སླད་འཛུམ་<span class='delete'>པ་</span><span class='add'>པ་</span>བསྟན་མཛད་བཤད་དུ་གསོལ། །བཅོམ་ལྡན་<span class='delete'>སྡོན་</span><span class='add'>སྔོན་</span>ནི་བསྐལ་པ་དཔག་མེད་སྙེད། །ཏིང་འཛིན་མཆོག་རྣམས་ལ་ནི་རབ་བཞུགས་པས། །མིག་གི་སྐྱེ་མཐའ་ཟད་པའི་\nམཐའ་མཁྱེན་ན། །ཅི་སླད་འཛུམ་<span class='delete'>པ་</span><span class='add'>པ་</span>བསྟན་མཛད་བཤད་དུ་གསོལ། །འདས་པ་དང་ནི་མ་འོངས་ད་ལྟར་དུས། །འདྲེན་པས་དེ་དག་ཀུན་ནི་རབ་ཏུ་མཁྱེན། །རྣམ་དག་མཁྱེན་པ་ཐོགས་མེད་བསམ་མི་ཁྱབ། །ཅི་སླད་འཛུམ་<span class='delete'>པ་</span><span class='add'>པ་</span>བསྟན་\nམཛད་བཤད་དུ་གསོལ། །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་འཁོར་མང་པོའི་མདུན་དུ་ཕྱག་གསེར་གྱི་ཁ་དོག་ལྟ་བུ་བརྐྱང་སྟེ། ཟླ་འོད་གཞོན་ནུར་གྱུར་པའི་སྤྱི་བོ་ལ་བཞག་ནས་ཚིགས་སུ་བཅད་དེ་བཀའ་སྩལ་<span class='delete'>པ། །</span><span class='add'>པ། </span>གཞོན་\nནུ་ཤིན་དུ་ལེགས་པར་ཉོན། །<span class='delete'>དས་</span><span class='add'>ངས་</span>ནི་དེང་འདིར་བྱང་ཆུབ་ཆོས། །འོད་ཟེར་རབ་ཏུ་སྟོན་པའི་མདོ། །ཁྱོད་ལ་ཤིན་དུ་ཡོངས་<span class='delete'>གཏང་</span><span class='add'>གཏད་</span>ཀྱིས། །མ་འོངས་ཐ་མ་དུས་ངན་ཚེ། །ཆོས་ནི་རྣམ་པར་འཇིག་པ་ན། །ཁྱོད་ཀྱིས་སེམས་ཅན་"
 ],
 [
  "79.253a",
  "དཔའ་ཆེན་པོ་ཚད་མ་མཆིས། །གཞན་ཡང་ལྷ་ཚོགས་གཟི་བྱིན་ཆེ་བ་རྣམས། །མཁའ་ལ་གདུགས་ནི་དམ་པ་དག་ཀྱང་ཐོགས། །ས་ཆེན་འདི་ནི་རབ་ཏུ་གཡོས་<span class='delete'>པར་</span><span class='add'>པར་</span>གྱུར། །གང་ཞིག་སྔོན་\nནི་དེ་བཞིན་གཤེགས་པ་ལས། །ཡུན་རིང་དགེ་བའི་ཆོས་ནི་གང་བསྒྲུབས་པ། །མཉམ་པར་དགའ་<span class='delete'>འཛད་</span><span class='add'>མཛད་</span>ཐུགས་རྗེ་ཆེན་པོའི་གཙོ། །ཅི་སླད་འཛུམ་<span class='delete'>པ་</span><span class='add'>པ་</span>བསྟན་མཛད་བཤད་དུ་གསོལ། །\nགང་ཞིག་སྔོན་ནི་སངས་རྒྱས་རབ་མཆོད་ནས། །ཆོས་འདི་ཐོས་ནས་དགའ་བ་རབ་སྐྱེས་པས། །འདྲེན་པ་རབ་མཆོག་མི་ཡི་གཙོར་གྱུར་པ། །ཅི་སླད་འཛུམ་<span class='delete'>པ་</span><span class='add'>པ་</span>བསྟན་མཛད་བཤད་དུ་གསོལ། །བཅོམ་ལྡན་\nགསུང་ནི་མང་པོ་དགའ་མཛད་པས། །བྱ་རྒྱལ་དད་པ་ཤིན་དུ་དབྱངས་རབ་སྙན། །སྒྲ་སྙན་ཚད་མེད་རང་གི་ངང་གིས་འབྱུང་། །ཅི་སླད་འོད་ཟེར་འདི་བཀྱེ་བཤད་དུ་གསོལ། །ཚིགས་བཅད་བྱེ་བ་ཚད་མ་མཆིས་\nཔ་ཡིས། །རྗེས་འཐུན་གསུང་གི་བསྔགས་པ་བརྗོད་གྱུར་<span class='delete'>ཅིང། །</span><span class='add'>ཅིང་། །</span>ཀུ་ཙི་ར་ཡི་སྒྲ་སྐད་མཆོག་ལྡན་པ། །ཅི་སླད་འོད་ཟེར་བཀྱེ་བ་བཤད་དུ་གསོལ། །འབྲུག་སྒྲ་ཟབ་མོས་ཆོས་ནི་བསྟན་པའི་སྒྲ། །འཇིག་\nརྟེན་བརྒྱ་སྟོང་དཔག་མེད་གྲགས་གྱུར་པ། །ཐུགས་རྗེས་ཚིག་རྩུབ་ཡང་ན་འཇམ་སྟོན་པ། །ཅི་སླད་འོད་ཟེར་གསེར་གྱི་ཁ་དོག་བཀྱེ། །སྐྱེ་དང་མི་སྐྱེ་ཟད་དང་མི་ཟད་མཁྱེན། །མིག་ཉིད་བྲལ་ཞིང་འགྲོ་<span class='delete'>འོད་</span><span class='add'>འོང་</span>མེད་\nཔར་རྟོགས། །འཇིག་རྟེན་སྣང་མཛད་བདུད་རྩིའི་མཆོག་གྱུར་པ། །ཅི་སླད་འོད་ཟེར་གསེར་གྱི་ཁ་དོག་བཀྱེ། །མིག་<span class='delete'>མི་</span><span class='add'>གི་</span>བྱུང་བ་རྟག་ཏུ་སྟོང་དབེན་དང་། །འགྲོ་<span class='delete'>འོད་</span><span class='add'>འོང་</span>མ་མཆིས་གནས་པ་མ་མཆིས་དང་། །སྨིག་རྒྱུ་ཆུ་བུར་ལྟ་\nབུར་རབ་མཁྱེན་པ། །རྒྱུ་རྐྱེན་གང་གི་སླད་དུ་འཛུམ་བསྟན་ལགས། །དེ་བཞིན་རྣ་བ་སྣ་ལྕེ་ལུས་དང་ཡིད། །གཟུགས་སྒྲ་དྲི་རོ་རེག་བྱ་ཆོས་རྣམས་ནས། །སྒྲ་དང་མིང་ལ་སོགས་པའི་བར་དུ་ཡང་། །ཐམས་ཅད་དེ་"
 ],
 [
  "79.252a",
  "རྒྱུ་དང་རྐྱེན་ནི་གང་ནི་སླད། །དེང་འདིར་འཛུམ་<span class='delete'>པ་</span><span class='add'>པ་</span>སྟོན་པར་མཛད། །རྣ་བ་སྣ་ལྕེ་ལུས་དང་ཡིད། །ཡུལ་དྲུག་དང་ནི་འབྱུང་ཆེན་བཞི། །སྒྲ་དང་མིང་ལ་སོགས་པའི་བར། །ཐམས་ཅད་ཀྱང་ནི་དེ་བཞིན་<span class='delete'>ནོ། </span><span class='add'>ནོ། །</span>\nབཅོམ་ལྡན་མིག་ལ་བདག་མེད་མཁྱེན། །རྣ་བ་མི་རྟག་ཉིད་དུ་རྟོགས། །སྣ་ཉིད་སྟོང་པར་རབ་མཁྱེན་ན། །ཅི་སླད་འཛུམ་<span class='delete'>པ་</span><span class='add'>པ་</span>སྟོན་པར་མཛད། །བཅོམ་ལྡན་ལྕེ་ལ་བདག་མེད་མཁྱེན། །ལུས་ཀྱང་མི་རྟག་ཉིད་\nདུ་རྟོགས། །སེམས་ཡིད་སྟོང་པར་རབ་མཁྱེན་ན། །ཅི་སླད་འཛུམ་<span class='delete'>པ་</span><span class='add'>པ་</span>སྟོན་པར་མཛད། །བཅོམ་ལྡན་གཟུགས་ལ་བདག་མེད་མཁྱེན། །སྒྲ་ཡང་མི་རྟག་ཉིད་དུ་རྟོག། །དྲི་ཉིད་སྟོང་པར་རབ་མཁྱེན་ན། །\nཅི་སླད་འཛུམ་<span class='delete'>པ་</span><span class='add'>པ་</span>སྟོན་པར་མཛད། །བཅོམ་ལྡན་རོ་ལ་བདག་མེད་མཁྱེན། །རེག་བྱ་མི་རྟག་ཉིད་དུ་རྟོགས། །ཆོས་ཉིད་སྟོང་པར་རབ་མཁྱེན་ན། །ཅི་སླད་འཛུམ་<span class='delete'>པ་</span><span class='add'>པ་</span>སྟོན་པར་མཛད། །བཅོམ་ལྡན་ས་ལ་བདག་མེད་\nམཁྱེན། །ཆུ་ཡང་མི་རྟག་ཉིད་དུ་རྟོགས། །མེ་ཉིད་སྟོང་པར་རབ་མཁྱེན་ན། །ཅི་སླད་འཛུམ་<span class='delete'>པ་</span><span class='add'>པ་</span>སྟོན་པར་མཛད། །བཅོམ་ལྡན་རླུང་ལ་བདག་མེད་མཁྱེན། །ངོ་བོ་མི་རྟག་ཉིད་དུ་རྟོགས། །དངོས་ཉིད་སྟོང་པར་\nརབ་མཁྱེན་ན། །ཅི་སླད་འཛུམ་<span class='delete'>པ་</span><span class='add'>པ་</span>སྟོན་པར་མཛད། །བཅོམ་ལྡན་འཇིག་རྟེན་བདག་མེད་མཁྱེན། །སྡུག་བསྔལ་མི་རྟག་ཉིད་དུ་རྟོགས། །ཕུང་པོ་སྟོང་པར་རབ་མཁྱེན་ན། །ཅི་སླད་འཛུམ་<span class='delete'>པ་</span><span class='add'>པ་</span>སྟོན་པར་མཛད། །\nབཅོམ་ལྡན་ཁམས་ལ་བདག་མེད་མཁྱེན། །འཇིག་རྟེན་མི་རྟག་ཉིད་དུ་རྟོགས། །སྐྱེ་ཉིད་སྟོང་པར་རབ་མཁྱེན་ན། །ཅི་སླད་འཛུམ་<span class='delete'>པ་</span><span class='add'>པ་</span>སྟོན་པར་མཛད། །བཅོམ་ལྡན་སྒྲ་ལ་བདག་མེད་མཁྱེན། །མིང་ཡང་མི་\nརྟག་ཉིད་དུ་རྟོགས། །ལམ་ཉིད་སྟོང་པར་རབ་མཁྱེན་ན། །ཅི་སླད་འཛུམ་<span class='delete'>པ་</span><span class='add'>པ་</span>སྟོན་པར་མཛད། །བཅོམ་ལྡན་ཡེ་ཤེས་བདག་མེད་མཁྱེན། །རབ་དབེན་མི་རྟག་ཉིད་དུ་རྟོགས། །སེམས་ཅན་སྟོང་པར་རབ་མཁྱེན་ན། །"
 ],
 [
  "79.255b",
  "ཁོ་ནར་<span class='delete'>ནི། </span><span class='add'>ནི། །</span>བླ་མེད་བྱང་ཆུབ་ཐོབ་པར་<span class='delete'>འགྱུར། </span><span class='add'>འགྱུར། །</span>སྐྱེས་བུ་བླུན་པོ་གང་དག་<span class='delete'>ཅིག། </span><span class='add'>ཅིག །</span>ལྟ་བ་ངན་པས་རབ་སྨས་ནས། །ཤེས་རབ་སྲོག་ནི་གཅོད་བྱེད་<span class='delete'>པ། </span><span class='add'>པ། །</span>བྱང་ཆུབ་ཡོངས་སུ་སྤོང་བར་<span class='delete'>འགྱུར། </span><span class='add'>འགྱུར། །</span>དེ་ལྟ་བས་ན་མི་དགེ་<span class='delete'>བའི། </span><span class='add'>བའི། །</span>\nབཤེས་གཉེན་དག་ནི་རབ་སྤངས་<span class='delete'>ནས། </span><span class='add'>ནས། །</span>བློ་ལྡན་མཁས་པ་དག་ལ་<span class='delete'>ནི། </span><span class='add'>ནི། །</span>བསྟེན་ཅིང་གུས་པ་བསྐྱེད་པར་བྱ། །འཇིག་རྟེན་དག་ནི་ཐམས་ཅད་ན། །ཉེས་དམིགས་ཚད་མེད་གང་ཡོད་<span class='delete'>དང་། </span><span class='add'>དང་། །</span>སེམས་ཅན་ངན་སོང་གསུམ་པོར་<span class='delete'>ནི། </span><span class='add'>ནི། །</span>\nརྟག་ཏུ་བྱིང་བར་གང་བྱེད་པ། །ཐམས་ཅད་གཏི་མུག་རྨོངས་པ་<span class='delete'>ཡི། </span><span class='add'>ཡི། །</span>རྒྱུ་དང་རྐྱེན་ལས་བྱུང་བས་<span class='delete'>ན། </span><span class='add'>ན། །</span>ཉོན་མོངས་རྗེས་སུ་འཇུག་བྱེད་<span class='delete'>ཅིང། །</span><span class='add'>ཅིང་། །</span>རང་དབང་དག་ནི་འཐོབ་མི་<span class='delete'>འགྱུར། </span><span class='add'>འགྱུར། །</span>ཡང་དག་ཆོས་ནི་སྤོང་བྱེད་<span class='delete'>ཅིང་། </span><span class='add'>ཅིང་། །</span>ཆོས་མ་\nཡིན་པ་སྤྱོད་པར་<span class='delete'>བྱེད། </span><span class='add'>བྱེད། །</span>དེ་ལྟ་བས་ན་རྨོངས་པ་ཡི། །སྐྱེས་བུ་དམན་པ་སྤང་བར་བྱ། །ཇི་ལྟར་ཁ་ལོ་སྒྱུར་<span class='delete'>པ་</span><span class='add'>བ་</span>ཡིས། །རང་གི་སྲོག་ཤིང་བཅག་པ་<span class='delete'>བཞིན། </span><span class='add'>བཞིན། །</span>མི་དགེ་ལས་ནི་བྱས་པས་<span class='delete'>ན། </span><span class='add'>ན། །</span>སེམས་ཅན་དམྱལ་བར་སྐྱེ་\nབར་འགྱུར། །ཁ་ནས་ཚིག་ངན་ཕྱུང་ནས་ནི། །རྟག་ཏུ་བདག་ལ་གནོད་བྱེད་<span class='delete'>པ། </span><span class='add'>པ། །</span>ཇི་ལྟར་སྟ་རེ་རྣོ་ཐོགས་ནས། །རང་གི་ལུས་ནི་གཅོད་བྱེད་<span class='delete'>འདྲ། </span><span class='add'>འདྲ། །</span>ཆོས་རྣམས་རྒྱུ་དང་རྐྱེན་དག་<span class='delete'>གིས། </span><span class='add'>གིས། །</span>བྱས་པའི་ལས་ཀྱི་རྗེས་སུ་ནི། །\nརྣམ་སྨིན་མྱོང་བ་སྐྱབས་མེད་<span class='delete'>པར། </span><span class='add'>པར། །</span>དེ་ལྟར་ཁོང་དུ་མ་ཆུད་པས། །འཇིག་རྟེན་དྲང་སྲོང་ལ་བསྟེན་ནས། །དགེ་བའི་གྲོགས་པོ་ཡིན་སྙམ་<span class='delete'>སེམས། </span><span class='add'>སེམས། །</span>དེ་ནས་རང་ཉིད་འདི་སྙམ་དུ། །སྟོང་པ་ཉིད་ནི་གང་བསྒོམ་<span class='delete'>པ། </span><span class='add'>པ། །</span>\nའདུས་མ་བྱས་ནི་རྟོགས་སྙམ་ནས། །ཆད་པར་ལྟ་བ་སྐྱེད་པར་བྱེད། །ལུས་ནི་སྣོད་ཆག་པ་དང་འདྲ། །སེམས་ཀྱང་རྗེས་སུ་འགག་གྱུར་ཞེས། །ཕལ་ཆེར་ཀྱལ་བའི་ཚིག་དག་<span class='delete'>ལ། </span><span class='add'>ལ། །</span>མོས་པ་ཉིད་དུ་རབ་འགྱུར་<span class='delete'>ཞིང། </span><span class='add'>ཞིང་། །</span>\nའདི་ལ་མངོན་<span class='delete'>པར་</span><span class='add'>པར་</span>ཞེན་པས་<span class='delete'>ན། </span><span class='add'>ན། །</span>ཕན་<span class='delete'>བའི་</span><span class='add'>པའི་</span>དོན་ནི་ཅི་ཡང་<span class='delete'>མེད། </span><span class='add'>མེད། །</span>གལ་ཏེ་<span class='delete'>སྤྲུལ་</span><span class='add'>སྦྲུལ་</span>ནི་གདུག་པ་<span class='delete'>ཡིས། </span><span class='add'>ཡིས། །</span>གནོད་པ་དག་ནི་རབ་བྱས་<span class='delete'>ཀྱང། </span><span class='add'>ཀྱང་། </span>ནམ་ཡང་སྐྱེ་དགུ་མང་པོ་<span class='delete'>རྣམས། </span><span class='add'>རྣམས། །</span>ངན་འགྲོ་དག་ཏུ་ལྟུང་མི་<span class='delete'>བྱེད། </span><span class='add'>བྱེད། །</span>བླུན་པོ་གང་"
 ],
 [
  "79.256a",
  "ཞིག་ཆོས་སྟོན་པ། །དགེ་བའི་རྩ་བ་འཇིག་བྱེད་པས། །སྐྱེ་དགུ་མང་པོ་ཚད་མེད་སྙེད། །སེམས་ཅན་དམྱལ་བར་ལྟུང་བར་བྱེད། །ཁྱེད་ལ་སོགས་པ་འཁོར་འདུས་པ། །འདི་ལྟ་བུར་ནི་ལྟ་བར་གྱིས། །དེང་\nའདིར་ང་ཡི་སྤྱན་སྔར་ནི། །ཟླ་འོད་གཞོན་ནུ་གང་འདུག་པ། །འདིས་ནི་སྔོན་ཆད་འདས་པ་ཡི། །སངས་རྒྱས་དག་ནི་བཅོམ་ལྡན་འདས། །ཚད་མེད་གང་གཱའི་ཀླུང་བྱེ་སྙེད། །མཆོད་པ་རིམ་གྲོ་རབ་བྱས་<span class='delete'>ཤིང་། </span><span class='add'>ཤིང་། །</span>\nཤིན་དུ་བསྟན་<span class='delete'>བར་</span><span class='add'>པར་</span>ཡོངས་བསྒོམས་ནས། །བླ་མེད་ཡེ་ཤེས་བཙལ་<span class='delete'>པས་</span><span class='add'>བས་</span>ན། །སྲིད་པ་དག་ནི་ཐམས་ཅད་ལ། །སེམས་ཀྱིས་གནས་པ་ཅི་ཡང་མེད། །མིག་གི་སྐྱེ་མཐའ་གཏན་དུ་ནི། །རྣམ་པར་དག་པར་ཤེས་པས་\nན། །སྤྲོས་པ་དག་ནི་ཡོངས་སྤངས་ནས། །མངོན་<span class='delete'>པར་</span><span class='add'>པར་</span>ཞེན་པ་ཅི་ཡང་མེད། །སེམས་ཅན་དག་ནི་ཚད་མེད་ལ། །ཕན་པ་དག་ནི་བྱ་བའི་ཕྱིར། །བླ་མེད་འོད་ཟེར་སྟོན་པ་ཡི། །མདོ་སྡེ་དག་ནི་སྟོན་པར་བྱེད། །སྐྱེས་\nབུ་བླུན་པོ་གང་ཡིན་<span class='delete'>པ། །</span><span class='add'>པ། །</span>ཆོས་འདི་སློབ་པར་མི་ནུས་པས། །རྣལ་འབྱོར་བསྒོམ་པ་དག་ལ་ནི། །སྐྱོན་ཉིད་དུ་ཡང་ལྟ་བར་བྱེད། །དེ་ལྟ་བས་ན་བླུན་པོ་<span class='delete'>དག། །</span><span class='add'>དག །</span>ཐག་རིང་པོར་ནི་ཡོངས་སྤངས་ནས། །དེ་དག་ལ་ནི་\nབསྟེན་མི་བྱ། །དེ་ཡི་ཆོས་ཀྱང་མི་བསླབ་བོ། །སྐྱེས་བུ་བླུན་པོ་གང་ཡིན་པ། །རྩོད་པའི་སྨྲ་ལ་མོས་པས་ན། །རྩོད་སྨྲ་མེད་པའི་སྤྱོད་པ་ལ། །ནན་ཏན་བསྒྲུབ་པར་མི་ནུས་པས། །སྐྱེས་བུ་དེ་དག་རྣམས་ལ་ནི། །\nཚུལ་བཞིན་སེམས་ནི་ཅི་ཡང་མེད། །དེ་ལྟ་བས་ན་དེ་དག་ལ། །བསྙེན་བཀུར་མི་བྱ་བསྔགས་མི་བརྗོད། །སྐྱེས་བུ་བླུན་པོ་གང་ཡིན་པ། །ལེ་ལོ་སྙོམས་ལས་ལ་གནས་པས། །རྟག་ཏུ་ལུས་དང་ངག་ཡིད་ཀྱི། །\nམི་དགེ་ལས་ནི་སྤྱོད་པས་ན། །དེ་ལ་ཚུལ་ཁྲིམས་དག་པ་དང་། །ཤེས་རབ་མང་ཐོས་ཅི་ཡང་མེད། །རྟག་ཏུ་འདོད་པའི་ཡུལ་སེམས་ཤིང་། །འདུ་འཛི་དག་ལ་མོས་པར་བྱེད། །ཁྱེད་ཀྱིས་འདི་ལྟར་བླུན་པོ་དེ། །"
 ],
 [
  "79.256b",
  "རིགས་དང་རུས་དང་ལུས་ཀྱང་ནི། །དམན་པ་ཡིན་པར་རབ་ཏུ་ལྟོས། །ཁོང་ཁྲོ་བཀའ་བློ་མི་བདེ་ཞིང་། །བྱད་བཞིན་དག་ནི་མི་སྡུག་ལ། །གང་ཏེ་དགེ་བའི་གནས་སྐྱེས་ཀྱང་། །ལུས་ནི་རྟག་ཏུ་མ་རབས་འགྱུར། །\nབདག་ཏུ་འདུ་ཤེས་ལ་ཞེན་པས། །ཡང་དག་དོན་ལ་རྨོངས་པར་འགྱུར། །བློ་གྲོས་དག་དང་མི་ལྡན་<span class='delete'>པས། །</span><span class='add'>པས། །</span>ཚིག་གི་བྱེ་བྲག་འབྱེད་མི་ནུས། །རང་བཞིན་སྟོང་པའི་ཆོས་ཐོས་ཀྱང་། །དེ་ལ་མོས་པ་སྐྱེད་མི་འགྱུར། །\nདེ་བཞིན་གཤེགས་པ་བཅོམ་ལྡན་འདས། །ཡུན་རིང་པོ་ནས་འཇིག་རྟེན་པའི། །ཚིག་གི་སྤྲོས་པ་གང་ཡིན་པ། །ཐམས་ཅད་རབ་ཏུ་སྤངས་པ་ཡིན། །སོ་སོའི་སྐྱེ་བོས་འདི་དག་ལ། །ཤིན་དུ་ཞེན་ཅིང་ཆགས་\nཔས་ན། །ཇི་སྲིད་འཚོ་བའི་<span class='delete'>རབ་</span><span class='add'>བར་</span>དུ་ཡང་། །རྟོགས་ཤིང་ཁོང་དུ་ཆུད་མི་འགྱུར། །ཚུལ་ཁྲིམས་བསྔགས་པ་རྗོད་བྱེད་ཀྱང་། །ཚངས་པར་སྤྱོད་པ་སྒྲུབ་མི་བྱེད། །ཁ་ནས་ཆོས་ནི་སྟོན་བྱེད་<span class='delete'>ཀྱང། །</span><span class='add'>ཀྱང་། །</span>ལུས་ཀྱིས་ཆོས་མིན་\nསྤྱོད་པར་བྱེད། །རང་གིས་འདུལ་བ་སྟོན་བྱེད་ཀྱང་། །རྟག་ཏུ་འདུལ་མིན་སྤྱོད་པར་བྱེད། །སངས་རྒྱས་སློབ་མ་དག་ལ་ནི། །ཁ་དོག་སྒྱུར་<span class='delete'>པའི་</span><span class='add'>བའི་</span>གོས་གྱོན་གསུངས། །འཆལ་བའི་ཚུལ་ཁྲིམས་ཅན་དག་གིས། །གོས་\nའདི་རབ་ཏུ་བགོས་གྱུར་ཀྱང་། །ང་རྒྱལ་དང་ནི་བག་མེད་པའི། །སེམས་ནི་རབ་ཏུ་འཕེལ་བར་བྱེད། །དད་པས་བྱིན་པ་ཅི་ཟོས་པ། །ཐུ་ལུམ་འབར་བ་མེད་པ་འདྲ། །དེ་ལྟར་ཁྱིམ་གྱི་གནས་སྤངས་ནས། །འདོད་པ་ལྔ་ཡི་\nབདེ་བའང་མེད། །གཞན་ཡང་སངས་རྒྱས་ཆོས་དག་ལ། །མཆོག་གི་བདེ་བ་མ་ཐོབ་ནས། །སྤྱོད་པ་འདྲེན་མ་མོས་བྱེད་པས། །མཐའ་གཉིས་དག་ནི་སྤོང་མི་འགྱུར། །ཡིད་ཀྱི་མོས་པ་ཇི་སྙེད་པ། །ཐམས་ཅད་ཀྱང་\nནི་དག་མི་འགྱུར། །དེ་འདྲའི་གང་ཟག་བླུན་པོ་ནི། །འཁོར་མང་ནང་དུ་གནས་གྱུར་ཀྱང་། །དཔེར་ན་ཇི་ལྟར་<span class='delete'>ལྦ་</span><span class='add'>ཝ་</span>སྐྱེས་<span class='delete'>དག། །</span><span class='add'>དག །</span>སེང་གེའི་ཁྱུར་ནི་ཞུགས་པ་བཞིན། །དེ་ལྟར་རབ་ཏུ་ཞི་བ་ཡི། །ཆོས་ནི་ཡང་དག་བསྟན་"
 ],
 [
  "79.255a",
  "རྣམས་ལ་<span class='delete'>ནི། </span><span class='add'>ནི། །</span>རབ་ཏུ་ཕྱི་ནས་བཤད་པར་གྱིས། <span class='delete'>དེས་</span><span class='add'>།ངས་ནི་</span><span class='delete'>ན་</span><span class='add'></span>སངས་རྒྱས་སྤྱན་དག་གིས། །མ་འོངས་ཐ་མ་དུས་ཀྱི་ཚེ། །ཤིན་དུ་ཟབ་ཅིང་གྱ་ནོམ་པའི། མདོ་སྡེ་དམ་པ་འདི་དག་ལ། །<span class='delete'>གད་</span><span class='add'>གང་</span>མོས་<span class='delete'>གད་</span><span class='add'>གང་</span>ནི་མི་མོས་\nཔ། །ཐམས་ཅད་ཀུན་ཀྱང་གཟིགས་ཤིང་མཁྱེན། །སེམས་ཅན་དག་ནི་གང་ཞིག་གིས། །བྱང་ཆུབ་ལམ་ནི་རབ་ཚོལ་བ། །རྟག་ཏུ་སངས་རྒྱས་རྗེས་དྲན་<span class='delete'>ཞིང། །</span><span class='add'>ཞིང་། །</span>མདོ་སྡེ་འདི་ནི་གཟུང་བར་གྱིས། །གང་ཞིག་དད་པ་རབ་\nའཇིག་ཅིང་། འདུ་འཛི་ལ་ནི་མོས་འགྱུར་དང་། །ཉིན་མཚན་གཉིད་ལ་གང་དགའ་བ། །མདོ་སྡེ་འདི་ལ་མོས་མི་<span class='delete'>འགྱུར། </span><span class='add'>འགྱུར། །</span>ང་ཡི་བསྟན་པ་དག་ལས་ནི། །རབ་ཏུ་བྱུང་བར་གྱུར་ནས་ཀྱང་། །མྱ་ངན་འདས་པའི་ཆོས་དག་\n<span class='delete'>ལ། </span><span class='add'>ལ། །</span>མོས་པ་དག་ནི་མི་སྐྱེ་<span class='delete'>བ། </span><span class='add'>བ། །</span>སྐྱེས་བུ་བླུན་པོ་དེ་དག་ནི། །དད་པས་བྱིན་པ་ཆུད་གཟོན་<span class='delete'>འགྱུར། </span><span class='add'>འགྱུར། །</span>འདུས་བྱས་རྣམས་ཀྱི་ཆོས་དག་ལ། །ཉེས་དམིགས་མང་བར་ཐོས་ཀྱང་<span class='delete'>ནི། </span><span class='add'>ནི། །</span>འཇིག་རྟེན་དག་ལ་མངོན་ཞེན་<span class='delete'>ནས། </span><span class='add'>ནས། །</span>\nའཇིགས་པ་དག་ནི་མི་སྐྱེ་<span class='delete'>བ། </span><span class='add'>བ། །</span>སྐྱེས་བུ་བླུན་པོ་དེ་དག་<span class='delete'>ནི། </span><span class='add'>ནི། །</span>མཁས་པ་རྣམས་ཀྱིས་སྨོད་པར་<span class='delete'>འགྱུར། </span><span class='add'>འགྱུར། །</span>ཆོས་གོས་དག་ནི་བགོས་གྱུར་ཀྱང་། །དེ་ལ་ཤེས་རབ་ཅི་ཡང་<span class='delete'>མེད། </span><span class='add'>མེད། །</span>ཐུབ་པས་ལེགས་པར་གསུངས་པ་<span class='delete'>ཡི། </span><span class='add'>ཡི། །</span>ཡང་དག་\nབཀའ་ནི་གང་ཡིན་<span class='delete'>པ། </span><span class='add'>པ། །</span>ཤེས་པ་མེད་པས་ཐོས་གྱུར་<span class='delete'>ན། </span><span class='add'>ན། །</span>ཡིད་ཆེས་ལེན་པར་མི་འགྱུར་<span class='delete'>ཏེ། </span><span class='add'>ཏེ། །</span>སྐྱེས་བུ་བླུན་པོ་དེ་དག་<span class='delete'>དང་། </span><span class='add'>དང་། །</span>ལྷན་ཅིག་གནས་པར་མི་<span class='delete'>བྱའོ། </span><span class='add'>བྱའོ། །</span>ཁྱད་པར་འཕགས་པའི་ཆོས་འདི་<span class='delete'>དག། </span><span class='add'>དག །</span>གལ་ཏེ་ཐོས་པར་\nགྱུར་ནས་<span class='delete'>ཀྱང་། </span><span class='add'>ཀྱང་། །</span>རབ་ཏུ་དགའ་ཞིང་མོས་པ་ཡི། །སེམས་ཀྱང་སྐྱེ་བར་མི་འགྱུར་<span class='delete'>པ། </span><span class='add'>བ། །</span>དེ་འདྲའི་གང་ཟག་དག་ལ་ནི། <span class='delete'>དས་</span><span class='add'>།ངས་</span>ནི་རབ་ཏུ་སྨོད་པར་<span class='delete'>བྱེད། </span><span class='add'>བྱེད། །</span>མི་ལུས་ཐོབ་པར་གྱུར་མོད་<span class='delete'>ཀྱང་། </span><span class='add'>ཀྱང་། །</span>དེ་ནི་དོན་མེད་ཆུད་ཟོས་<span class='delete'>ཡིན། </span><span class='add'>ཡིན། །</span>གལ་\nཏེ་ཤིན་དུ་ཟབ་པའི་<span class='delete'>ཆོས། </span><span class='add'>ཆོས། །</span>འདི་དག་ཐོས་པར་གྱུར་ནས་<span class='delete'>ནི། </span><span class='add'>ནི། །</span>རབ་ཏུ་དགའ་ཞིང་མོས་པ་<span class='delete'>ཡི། </span><span class='add'>ཡི། །</span>སེམས་ནི་རབ་ཏུ་སྐྱེ་འགྱུར་<span class='delete'>པ། </span><span class='add'>བ། །</span>དེ་འདྲའི་གང་ཟག་དེ་དག་<span class='delete'>ནི། </span><span class='add'>ནི། །</span>སྔོན་ཆད་སངས་རྒྱས་ཕྲད་པས་<span class='delete'>ན། </span><span class='add'>ན། །</span>གདོན་མི་ཟ་བ་"
 ],
 [
  "79.257a",
  "བྱས་ཀྱང་། །དེ་བཞིན་ཉིད་དང་སྟོང་པའི་དོན། །རྟོགས་ཤིང་ཁོང་དུ་མ་<span class='delete'>ཆུང་</span><span class='add'>ཆུད་</span>པས། །འཁོར་མང་དག་ལ་བསྟན་བསྔགས་<span class='delete'>ཀྱང། །</span><span class='add'>ཀྱང་། །</span>ཁེངས་པའི་སེམས་ནི་སྐྱེད་པར་བྱེད། །སྟོན་པ་ཆེན་པོ་མི་དྲན་<span class='delete'>བས། །</span><span class='add'>པས། །</span>ངོ་ཚ་\nདམན་<span class='delete'>བའི་</span><span class='add'>པའི་</span>སེམས་ཀྱང་མེད། །མི་གཙང་དངོས་པོ་ལེན་བྱེད་ཀྱང་། །ཡིད་བཞིན་ནོར་བུ་ཐོབ་པ་བཞིན། །ཤིན་དུ་དགའ་<span class='delete'>པས་</span><span class='add'>བས་</span>འཛིན་བྱེད་པས། །སེམས་ཀྱིས་ཆུང་ཟད་སྟོང་མི་བྱེད། །འདི་ལྟ་བུ་ཡི་མ་རབས་\nདག །ཁྱིམ་ནས་རབ་ཏུ་བྱུང་ནས་ནི། །སྤྱོད་ལམ་དག་ཀྱང་སྲུང་བ་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>ཆོས་གོས་ལྷུང་བཟེད་འཛིན་བྱེད་<span class='delete'>ཀྱང། །</span><span class='add'>ཀྱང་། །</span>ཆ་བྱད་ཙམ་དང་ལྡན་<span class='delete'>བས་</span><span class='add'>པས་</span>ན། །ཡང་དག་ཤེས་རབ་ཅི་ཡང་མེད། །ཁ་སྤུ་དག་ནི་བྲེགས་གྱུར་\nཀྱང་། སྡིག་པའི་སེམས་ནི་མི་སྤོང་ཞིང་། །དགེ་སྦྱོང་མ་ཡིན་པ་ཡི་ཆོས། །ལོག་ལྟ་དག་ཏུ་ལྷུང་གྱུར་ན། །རབ་དབེན་མྱ་ངན་འདས་པའི་ལམ། །དེ་དག་རབ་ཏུ་ཉམས་པར་འགྱུར། །དགེ་སྦྱོང་སྔོན་དུ་བྱ་བ་ཡི། །\nའབྲས་བུ་དག་ཀྱང་འཐོབ་མི་འགྱུར། །མ་རིག་ཉོན་མོངས་རྣམས་ཀྱང་ནི། །རྡུལ་ཙམ་ཉམས་པར་མི་འགྱུར་རོ། །གྲོང་ཁྱེར་དག་ཏུ་རྣམ་རྒྱུ་ཞིང་། །རང་ཉིད་དབེན་པའི་བསྔགས་བརྗོད་ཀྱང་། །སྐྱེས་བུ་བློན་པོ་\nབློ་མེད་པས། །ཡང་དག་བགྲོད་པ་ཤེས་མི་འགྱུར། །སེམས་ཀྱི་འདུན་<span class='delete'>བ་</span><span class='add'>པ་</span>ཅི་ཡོད་པ། །དེ་དག་ཐམས་ཅད་མི་དགེ་ཡིན། །རྙེད་པ་འདོད་པའི་རྒྱུ་ཡི་ཕྱིར། །དགོན་པ་དག་ན་གནས་བྱེད་ཀྱི། །མྱ་ངན་འདས་པའི་ཡང་དག་\nརྒྱུ། །བསྒྲུབ་པའི་ཕྱིར་ནི་མ་ཡིན་ནོ། །རྨུགས་དང་གཉིད་ལ་རབ་ཏུ་དགའ། །ལུས་ནི་ཇི་ལྟར་བདེ་སྙམ་ནས། །རྟག་ཏུ་དེ་ལྟའི་དངོས་པོ་<span class='delete'>དག། །</span><span class='add'>དག །</span>སྒྲུབ་པ་ལ་ནི་མོས་པར་བྱེད། །དགོན་པའི་གནས་ནི་དེ་དག་ཏུ། །ལོ་ནི་\nམང་པོར་གནས་བྱེད་<span class='delete'>ཀྱང། །</span><span class='add'>ཀྱང་། །</span>ཕྱིན་ལོག་ལྟ་བར་གྱུར་པའི་ཕྱིར། །མྱ་ངན་འདས་ལམ་སྟོང་བས་ན། །ནམས་ཀྱང་དགེ་སྦྱོང་ལམ་དག་གི །འབྲས་བུ་དག་ནི་ཐོབ་མི་འགྱུར། །ཡང་དག་ལྟ་བ་རབ་ཉམས་ཤིང་། །"
 ],
 [
  "79.258a",
  "སྣ་ཚོགས་སྦྱར་ནས་མཆོད་པར་བྱེད། །བཙུན་<span class='delete'>བས་</span><span class='add'>པས་</span>ཐུགས་རྗེར་རབ་དགོངས་<span class='delete'>ཤིང། །</span><span class='add'>ཤིང་། །</span>བདག་ཅག་ཐད་དུ་ཡང་གཤེགས་ཟེར། །རོ་ཞིམ་དག་ལ་ཞེན་ཆགས་<span class='delete'>ཤིང། །</span><span class='add'>ཤིང་། །</span><span class='delete'>ཉིད་</span><span class='add'>ཉེས་</span>དམིགས་རྣམས་ནི་མི་ཤེས་པས། །<span class='delete'>བདུང་</span><span class='add'>བདུད་</span>ཀྱིས་\nགླགས་ཀྱང་རྙེད་འགྱུར་ཏེ། །རུ་སྦལ་རྒྱ་མོས་ཟིན་པ་འདྲ། །དགོན་པར་གནས་པ་དག་ལ་<span class='delete'>ཡང། །</span><span class='add'>ཡང་། །</span>རྙེད་པ་དག་གིས་སྙེམས་པར་བྱེད། །དགེ་སློང་བརྩོན་འགྲུས་ཅན་དག་ལ། །བརྙས་ཤིང་སྐུར་པ་འདེབས་པར་བྱེད། །རྙེད་དང་གྲགས་པས་\nསེམས་རྨོངས་པས། །ཡང་ནས་ཡང་དུ་ཞེན་པ་སྐྱེད། །ལུས་ནི་ཡོངས་སུ་<span class='delete'>གོས་</span><span class='add'>གསོ་</span>བའི་ཕྱིར། །རྟག་ཏུ་གཡོ་སྒྱུ་སྤྱོད་པས་ན། །ལུས་དང་ངག་གི་མི་དགེ་ལས། །ཡང་ནས་ཡང་དུ་འཕེལ་བར་བྱེད། །གལ་ཏེ་སྦྱིན་དག་དད་པ་ཡིས། །དང་\nབའི་སེམས་ཀྱིས་མཆོད་ན་<span class='delete'>ཡང། །</span><span class='add'>ཡང་། །</span>ལེ་ལོ་སྙོམས་ལས་དབང་གིས་ནི། །དེ་ཡི་བསོད་ནམས་འབྲི་བར་བྱེད། །སྐྱེས་བུ་བླུན་པོ་དེ་དག་ནི། །རྟག་ཏུ་མི་དགེ་འདོད་བསྐྱེད་པས། །སྟོང་པ་ཉིད་ཀྱི་ཆོས་འདི་ལ། །རྗེས་འཐུན་བཟོད་སེམས་\nའཐོབ་མི་འགྱུར། །གང་དག་ང་ཡི་བསྟན་པ་ལས། །ཉེས་དམིགས་དེ་དག་རབ་སྤངས་ནས། །ནན་ཏན་བག་ཡོད་སྒྲུབ་བྱེད་ན། །ཆོས་འདི་ཐོས་པར་དཀའ་མི་འགྱུར། །རྙེད་པ་དང་ནི་མི་རྙེད་དང་། །བསྟོད་སྨད་སྡུག་བསྔལ་བདེ་ལ་སོགས། །\nའཇིག་རྟེན་ཆོས་ཀྱིས་མི་གཡོས་པ། །ཆོས་འདི་ཐོབ་པར་དཀའ་མི་འགྱུར། །ལུས་ལ་མི་གཙང་འདུ་ཤེས་དང་། །ཕུང་པོ་རྨ་ཡི་འདུ་ཤེས་དང་། །ཟས་ནི་རྨ་བསྐུས་འདུ་ཤེས་པ། །ཆོས་འདི་ཐོབ་པར་དཀའ་མི་འགྱུར། །གོས་<span class='delete'>བཟང་</span><span class='add'>བཟངས་</span>དག་ནི་\nཐོབ་གྱུར་ཀྱང་། །དྲེགས་པ་དག་ནི་མི་སྐྱེད་ཅིང་། །ངོ་ཚ་དགབ་པའི་ཕྱིར་གྱོན་པ། །ཆོས་འདི་ཐོབ་པར་དཀའ་མི་འགྱུར། །གཟུགས་དང་སྟོབས་ནི་མི་སྙེམས་ཤིང་། །ཟས་ལ་ཆགས་པ་མེད་པ་དང་། །སྲོག་གནས་ཕྱིར་ནི་གང་ཟ་བ། །ཆོས་འདི་\nཐོབ་པར་དཀའ་མི་འགྱུར། །སྲེད་པ་རྣམས་ནི་སྟོང་ཤེས་ནས། །འདོད་པ་དག་ལ་བླང་དོར་མེད། །རྟག་ཏུ་སྟོང་དབེན་གང་སྤྱོད་པ། །ཆོས་འདི་ཐོབ་པར་དཀའ་མི་འགྱུར། །དཔག་ཚད་གཅིག་འདས་རི་ཁྲོད་དུ། །གཅིག་པུ་འདུག་གནས་མཉམ་བཞག་"
 ],
 [
  "79.257b",
  "ཚུལ་ཁྲིམས་དག་དང་འགལ་བྱས་<span class='delete'>བས། །</span><span class='add'>པས། །</span>གོས་བཟང་དག་གིས་ལུས་བརྒྱན་པ། །དེ་ལ་ཤིན་དུ་སྲེད་པར་འགྱུར། །འདོད་པའི་བདེ་བ་རྣམས་ལ་ནི། །རྟག་ཏུ་སྲེད་པ་སྐྱེད་པར་བྱེད། །གལ་ཏེ་གྲོང་ཁྱེར་ཞུགས་ན་ཡང་། །ང་རྒྱལ་\nམཚན་མ་སྟོན་བྱེད་<span class='delete'>ཅིང། །</span><span class='add'>ཅིང་། །</span>ལུས་ཀྱི་ལས་ནི་མི་སྲུང་བས། །སྤྱོད་ལམ་དག་ལ་གནས་མི་བྱེད། །རེས་འགའ་གྲོང་ཁྱེར་ཞུགས་ནས་ནི། །རྒྱུ་ཚེ་རང་ཉིད་འདི་སྐད་དུ། །དགོན་པའི་གནས་ནི་དེ་དག་ན། །རི་ཕུག་དག་ནི་གང་ཡོད་\nཔ། །ཁྱེད་རྣམས་འདི་ལྟར་ཤེས་པར་གྱིས། །དེ་ནི་བདག་གི་གནས་ཡིན་ཏེ། །མཐོ་དམའ་རན་པར་ལྟ་བ་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>འགྲོ་<span class='delete'>གོ་</span><span class='add'>གོ</span><span class='delete'>མཚུལ་</span><span class='add'>མ་ཚུལ་</span>ལ་གནས་སོ་ཞེས། །ཐ་དད་མཚན་མའི་ཚིག་བརྗོད་དེ། །དགྲ་བཅོམ་པ་ཡི་རྟགས་བསྟན་པས། །\nཁྱིམ་པ་དག་ནི་ཇི་སྙེད་པ། །ཕན་ཚུན་དུ་ནི་འདི་སྐད་དུ། །དགོན་པའི་དགེ་སློང་གང་ཡིན་པ། །ཡང་དག་འཕགས་པ་ཡིན་ཞེས་ཟེར། །རེས་འགའ་དགོན་པ་དེ་དག་ན། །གནས་པར་གྱུར་པ་དེ་ཡི་ཚེ། །གལ་ཏེ་གཞན་དག་\nའོངས་གྱུར་ན། །འདི་ལྟ་བུར་ནི་སྟོན་པར་བྱེད། །བདག་ནི་དགོན་གནས་འདི་དག་ཏུ། །ཉིན་མཚན་འཆག་པར་བྱེད་ཅེ་འམ། །ཡང་ན་རྩྭ་འཇམ་བཏིང་ནས་<span class='delete'>ན། །</span><span class='add'>ནི། །</span>འདིར་ནི་འདུག་པར་བྱེད་ཅེས་ཟེར། །རེས་འགའ་གྲོང་ཁྱེར་\nཞུགས་གྱུར་ནས། །ཁྱིམ་པའི་དེར་ནི་ཕྱིན་པའི་ཚེ། །གཡོ་སྒྱུས་ནན་ཏན་འདི་སྐད་དུ། །བདེ་འམ་ཞེས་ནི་འདྲི་<span class='delete'>པར་</span><span class='add'>བར་</span>བྱེད། །འཇིག་རྟེན་པ་ཡི་འདུ་འཛིའི་གཏམ། །རྒྱལ་པོ་ཆོས་རྐུན་ལ་སོགས་པའི། །སྣ་ཚོགས་དག་ནི་རྗོད་པར་བྱེད། །\nརེས་འགའ་ཆགས་པའི་སེམས་དག་གིས། །བུད་མེད་རྣམས་ཀྱི་མདུན་དག་ཏུ། །ཐབས་ནི་རྣམ་པ་སྣ་ཚོགས་ཀྱིས། །རང་གི་ཡོན་ཏན་རྗོད་པར་བྱེད། །བདག་ནི་འཇིག་རྟེན་ཐམས་ཅད་ཀྱི། །བསོད་ནམས་ཞིང་ནི་ཆེན་པོ་བྱེད། །\nབདག་ནི་རྒྱལ་ཐབས་རབ་སྤངས་ནས། །རབ་ཏུ་བྱུང་ནས་ལམ་སྒོམ་ཡིན། །བཙུན་མོ་དང་ནི་སླས་རྣམས་ཀྱང་། །མཐོ་རིས་སྐྱེས་པར་གྱུར་ཅེས་ཟེར། །དེ་དག་དེ་སྐད་ཐོས་ནས་ནི། །ཤིན་དུ་གུས་པ་རབ་བསྐྱེད་དེ། །གོས་ཟས་དང་ནི་བཏུང་<span class='delete'>བ</span><span class='add'>བ་དག །</span>དག། །"
 ],
 [
  "79.258b",
  "ཅིང་། །འདུས་བྱས་བདག་མེད་གང་རྟོགས་པ། །ཆོས་འདི་ཐོབ་པར་དཀའ་མི་འགྱུར། །མི་ཟད་སྐྱེ་བའི་མཐའ་དག་དང་། མིག་འཇུག་མཚན་ཉིད་རྟོགས་བྱེད་ཅིང་། །མིག་གཙང་ལམ་ནི་རབ་སྒྲུབ་པ། །ཆོས་འདི་ཐོབ་པར་དཀའ་མི་\nའགྱུར། །རྣ་བ་སྣ་ལྕེ་ལུས་དང་ཡིད། །གཟུགས་སྒྲ་དྲི་རོ་རེག་བྱ་ནས། །སྒྲ་དང་མིང་གི་བར་དུ་ཡང་། །ཐམས་ཅད་ཀུན་ཀྱང་དེ་བཞིན་ནོ། །དེ་བཞིན་མ་འོངས་དུས་ཀྱི་ཚེ། །དགེ་སློང་དག་ནི་ཚད་མེད་སྙེད། །བརྩོན་<span class='delete'>བ་</span><span class='add'>པ་</span>དང་ནི་ལེ་ལོ་ཅན། །ཐམས་\nཅད་དེ་བཞིན་ཤེས་པར་གྱིས། །དགེ་དང་མི་དགེའི་གྲོགས་པོ་<span class='delete'>དག། །</span><span class='add'>དག །</span>སྒྲུབ་པ་དང་ནི་མི་སྒྲུབ་པ། །ཡིད་ཆེས་པ་དང་ཡིད་མི་ཆེས། །ཐམས་ཅད་དེ་བཞིན་ཤེས་པར་གྱིས། །དགེ་དང་མི་དགེའི་གྲོགས་པོ་<span class='delete'>དག། །</span><span class='add'>དག །</span>མིག་ཟད་ལམ་ནི་གང་ཡིན་པ། །སྒྲུབ་\nཔ་དང་ནི་མི་སྒྲུབ་པ། །ཐམས་ཅད་དེ་བཞིན་ཤེས་པར་གྱིས། །གང་ཞིག་བྱང་ཆུབ་རབ་མོས་ཤིང་། །ཟླ་གཅིག་གཉིས་གསུམ་འདས་ནས་ནི། །དུས་གཞན་ཕྱིར་ནི་གང་ལྡོག་པ། །ཐམས་ཅད་དེ་བཞིན་ཤེས་པར་གྱིས། །གང་ཞིག་ཆོས་འདི་\nཐོས་གྱུར་ནས། །མོས་པའི་སེམས་ནི་གང་རྙེད་པ། །གལ་ཏེ་ཉམས་པར་གྱུར་ན་ཡང་། །སླར་ནི་<span class='delete'>དད་</span><span class='add'>དང་</span><span class='delete'>པ་</span><span class='add'>བ་</span>ཐོབ་པར་འགྱུར། །གང་ཞིག་ཆོས་འདི་ཐོས་གྱུར་ནས། །བག་མེད་སྤོང་<span class='delete'>པར་</span><span class='add'>བར་</span>མི་བྱེད་པ། །མདོ་འདི་སངས་རྒྱས་བཀའ་མ་ཡིན། །དེ་སྙམ་དུ་ནི་\nསེམས་པར་འགྱུར། །གང་ཞིག་ཆོས་འདི་ཐོས་གྱུར་ནས། །བདུད་ཀྱིས་ཡོངས་སུ་གང་བཟུང་བ། །དང་པོ་དད་པ་སྐྱེས་གྱུར་ཀྱང་། །ཕྱིས་ནི་རབ་ཏུ་སྤོང་བར་འགྱུར། །གང་ཞིག་ཆོས་ལ་མ་མོས་པ། །མི་བདེན་གྲགས་དང་རྙེད་པ་ཚོལ། །གྲོང་\nཁྱེར་གྲོང་རྡལ་རབ་རྒྱུ་ཞིང་། །གཟུངས་རྣམས་དང་ནི་ཏིང་འཛིན་དང་། །ཀུན་འཛིན་འོད་ཟེར་བསྔགས་བརྗོད་ཀྱང་། །དེ་ཡིས་ཡང་དག་རྟོགས་མི་འགྱུར། །འདོད་པ་ལྔ་པོས་བཅིངས་པ་དང་། །འཇིག་རྟེན་ལས་ནི་འདོད་ཚོལ་བ། །བརྗོད་པ་\nདག་ནི་རྟོགས་བྱེད་པས། །སྟོང་ཉིད་སྒོམ་ལ་སྐུར་<span class='delete'>པ་</span><span class='add'>པ་</span>འདེབས། །དྲན་དང་ཤེས་རབ་སེམས་མེད་པས། །ཚེ་ཚད་རབ་ཏུ་དོན་མེད་འདས། །བླུན་པོ་སྟོང་པའི་ཆོས་སྤོང་བ། །དེ་ནི་ཚུལ་ཁྲིམས་བགེགས་བྱས་པས། །མནར་མེད་དག་ཏུ་ལྟུང་བར་"
 ],
 [
  "79.260a",
  "འཇིགས་རུང་བ། །སངས་རྒྱས་མཐོང་ན་དགའ་བ་<span class='delete'>ཡང། །</span><span class='add'>ཡང་། །</span>ཐམས་ཅད་བཟོད་མཆོག་སྟོབས་ལས་<span class='delete'>བྱུང། །</span><span class='add'>བྱུང་། །</span>སྲིན་པོ་གནོད་སྦྱིན་ལ་སོགས་པས། །མེ་ཏོག་ཕྲེང་བ་བརྒྱ་སྟོང་ཐོགས། །འོངས་ནས་ང་ལ་མཆོད་བྱེད་པ། །ཐམས་ཅད་\nབཟོད་མཆོག་སྟོབས་ལས་<span class='delete'>བྱུང། །</span><span class='add'>བྱུང་། །</span>ཞིང་ནི་བརྒྱ་སྟོང་ཚད་མེད་པར། །བཞུགས་པའི་དེ་བཞིན་གཤེགས་པ་རྣམས། །ང་ཡི་ཡོན་ཏན་བསྔགས་པ་<span class='delete'>ཡང། །</span><span class='add'>ཡང་། །</span>ཐམས་ཅད་བཟོད་མཆོག་སྟོབས་ལས་<span class='delete'>བྱུང། །</span><span class='add'>བྱུང་། །</span>ལྟོ་འཕྱེ་དང་ནི་ལུས་སྲུལ་པོ། །\nབརྒྱ་སྟོང་དག་ནི་འདུས་གྱུར་ནས། །མེ་ཏོག་གཏོར་ནས་ང་མཆོད་པ། །ཐམས་ཅད་བཟོད་མཆོག་སྟོབས་ལས་<span class='delete'>བྱུང། །</span><span class='add'>བྱུང་། །</span>གནོད་སྦྱིན་རྒྱལ་པོ་ལ་སོགས་པ། །བྱེ་བ་བརྒྱ་ཕྲག་དྲུག་བཅུ་རྣམས། །འོངས་ནས་ང་ལ་གང་མཆོད་པ། །\nཐམས་ཅད་བཟོད་མཆོག་སྟོབས་ལས་<span class='delete'>བྱུང། །</span><span class='add'>བྱུང་། །</span>གཞན་ཡང་ཀླུ་ཡི་རྒྱལ་པོ་ནི། །མ་ན་བ་ག་ལ་སོགས་པས། །མུ་ཏིག་དམར་པོས་ང་མཆོད་པ། །ཐམས་ཅད་བཟོད་མཆོག་སྟོབས་ལས་<span class='delete'>བྱུང། །</span><span class='add'>བྱུང་། །</span>དུ་མུ་རུ་དང་ཤི་ཁྱི་བའི། །བརྒྱ་སྟོང་\nསྙེད་ནི་འདུས་གྱུར་ནས། །རོལ་མོ་དག་གིས་ང་མཆོད་པ། །ཐམས་ཅད་བཟོད་མཆོག་སྟོབས་ལས་<span class='delete'>བྱུང། །</span><span class='add'>བྱུང་། །</span>ལྟོ་འཕྱེ་དང་ནི་ལུས་སྲུལ་པོ། །བརྒྱ་སྟོང་སྙེད་ནི་འདུས་གྱུར་ནས། །མེ་ཏོག་སྤོས་ཀྱིས་ང་མཆོད་པ། །ཐམས་ཅད་བཟོད་\nམཆོག་སྟོབས་ལས་<span class='delete'>བྱུང། །</span><span class='add'>བྱུང་། །</span>ས་ཆེན་འཛིན་པ་ཀླུ་ཡི་རྒྱལ། །ལུས་ཕྱེད་དག་ནི་རབ་བསྟན་ནས། །ཐལ་སྦྱར་ང་ལ་གུས་པ་<span class='delete'>ཡང། །</span><span class='add'>ཡང་། །</span>ཐམས་ཅད་བཟོད་མཆོག་སྟོབས་ལས་<span class='delete'>བྱུང། །</span><span class='add'>བྱུང་། །</span>ལུས་མེད་སྒྲ་གཅན་ཟིན་ལ་སོགས། །བྱེ་བ་ཕྲག་ནི་བརྒྱ་\nསྟོང་རྣམས། །<span class='delete'>དད་</span><span class='add'>དང་</span><span class='delete'>པའི་</span><span class='add'>བའི་</span>སེམས་ཀྱིས་ང་མཆོད་པ། །ཐམས་ཅད་བཟོད་མཆོག་སྟོབས་ལས་<span class='delete'>བྱུང། །</span><span class='add'>བྱུང་། །</span>གཞོན་ནུ་ཁྱོད་ཀྱིས་འདི་ལྟར་ལྟོས། །སངས་རྒྱས་འོད་ཟེར་གང་རེག་པ། །སྡུག་བསྔལ་བྲལ་ནས་བདེ་ཐོབ་པ། །ཐམས་ཅད་བཟོད་\nམཆོག་སྟོབས་ལས་<span class='delete'>བྱུང། །</span><span class='add'>བྱུང་། །</span>ས་མུ་ཏ་དང་རླུང་གི་ལྷ། །བརྒྱ་སྟོང་ནམ་མཁའ་གང་བར་ནི། །སྤོས་ཀྱི་ཆར་ཕབ་ང་མཆོད་པ། །ཐམས་ཅད་བཟོད་མཆོག་སྟོབས་ལས་<span class='delete'>བྱུང། </span><span class='add'>བྱུང་། </span>ལྷ་ཡི་འཁོར་ནི་བརྒྱ་སྟོང་དག །ལྷ་ཡི་མེ་ཏོག་གཏོར་"
 ],
 [
  "79.260b",
  "མཆོད་དེ། །སྲེད་སྤངས་སངས་རྒྱས་སྟེན་བྱེད་པ། །ཐམས་ཅད་བཟོད་མཆོག་སྟོབས་ལས་<span class='delete'>བྱུང། །</span><span class='add'>བྱུང་། །</span>ཁྱེད་ཀྱིས་སངས་རྒྱས་རྫུ་འཕྲུལ་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>སྦྱིན་དང་ཚུལ་ཁྲིམས་སྒྲ་བསྒྲགས་ནས། །ཐམས་ཅད་ཀུན་དུ་ཐོས་མཛད་པ། །\nབཟོད་མཆོག་སྟོབས་ལས་བྱུང་བར་ལྟོས། །ཕུང་པོ་ཁམས་ཀྱི་སྒྲ་དག་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>བདེན་པ་བཞི་ཡི་སྒྲ་དག་གིས། །ཐམས་ཅད་ཀུན་ནི་གོ་མཛད་པ། །ཐམས་ཅད་བཟོད་མཆོག་སྟོབས་ལས་<span class='delete'>བྱུང། །</span><span class='add'>བྱུང་། །</span>ང་ཡི་རྫུ་འཕྲུལ་སྟོབས་ཀྱིས་ནི། །\nམཁའ་ལས་མིག་ཟད་མཐའ་དག་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>རབ་ཞིའི་སྒྲ་ནི་ཐོས་གྱུར་ཏེ། །སྐྱེ་བའི་མཐའ་ཡང་དེ་བཞིན་ནོ། །ང་ཡི་རྫུ་འཕྲུལ་སྟོབས་ཀྱིས་ནི། །མཁའ་ལས་མིག་ནི་རྒྱུ་དང་རྐྱེན། །དེ་ལས་སྐྱེ་ཡང་འགྲོ་འོང་མེད། །དེ་སྐད་དུ་ནི་ཐོས་པར་འགྱུར། །\nང་ཡི་རྫུ་འཕྲུལ་སྟོབས་ཀྱིས་ནི། །མཁའ་ལས་མིག་ཞི་རྟོགས་བྱེད་ན། །སངས་རྒྱས་རྣམས་ཀྱང་དེ་ལས་སྐྱེས། །དེ་སྐད་དུ་ནི་ཐོས་པར་འགྱུར། །ང་ཡི་རྫུ་འཕྲུལ་སྟོབས་ཀྱིས་ནི། །མཁའ་ལས་མིག་ཟད་མཐའ་ཞི་<span class='delete'>པས། །</span><span class='add'>བས། །</span>སངས་\nརྒྱས་རྣམས་ནི་དེ་ལས་སྐྱེས། །དེ་སྐད་དུ་ནི་ཐོས་པར་འགྱུར། །ང་ཡི་རྫུ་འཕྲུལ་སྟོབས་ཀྱིས་ནི། །མཁའ་ལས་མིག་མཐའ་རབ་ཞི་<span class='delete'>པས། །</span><span class='add'>བས། །</span>སངས་རྒྱས་རྣམས་ནི་དེ་ལས་སྐྱེས། །དེ་སྐད་དུ་ནི་ཐོས་པར་འགྱུར། །ང་ཡི་རྫུ་\nའཕྲུལ་སྟོབས་ཀྱིས་ནི། །མཁའ་ལས་མིག་སྐྱེ་མཐའ་ཞི་<span class='delete'>པས། །</span><span class='add'>བས། །</span>སངས་རྒྱས་རྣམས་ནི་དེ་ལས་སྐྱེས། །དེ་སྐད་དུ་ནི་ཐོས་པར་འགྱུར། །ང་ཡི་རྫུ་འཕྲུལ་སྟོབས་ཀྱིས་ནི། །མཁའ་ལས་མིག་འཇུག་རབ་ཞི་ན། །སངས་རྒྱས་\nརྣམས་ནི་དེ་ལས་སྐྱེས། །དེ་སྐད་དུ་ནི་ཐོས་པར་འགྱུར། །ང་ཡི་རྫུ་འཕྲུལ་སྟོབས་ཀྱིས་ནི། །མཁའ་ལས་མིག་ནི་སྐྱེ་ཞི་<span class='delete'>པས། །</span><span class='add'>བས། །</span>སངས་རྒྱས་རྣམས་ནི་དེ་ལས་སྐྱེས། །དེ་སྐད་དུ་ནི་ཐོས་པར་འགྱུར། །ང་ཡི་རྫུ་འཕྲུལ་སྟོབས་ཀྱིས་ནི། །མཁའ་ལས་མིག་\nདབེན་རབ་ཞི་<span class='delete'>པས། །</span><span class='add'>བས། །</span>སངས་རྒྱས་རྣམས་ནི་དེ་ལས་སྐྱེས། །དེ་སྐད་དུ་ནི་ཐོས་པར་འགྱུར། །རྣ་བ་སྣ་ལྕེ་ལུས་དང་ཡིད། །གཟུགས་སྒྲ་དྲི་རོ་རེག་བྱ་ནས། །སྒྲ་དང་མིང་ལ་སོགས་པའི་བར། །ཐམས་ཅད་ཀུན་ཀྱང་དེ་བཞིན་<span class='delete'>ན</span><span class='add'>ནོ།  །</span>ོ།"
 ],
 [
  "79.261a",
  "འདོད་སྡང་གཏི་མུག་ཁོང་ཁྲོ་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>འཆབ་དང་ཕྲག་དོག་གཡོ་སྒྱུ་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>ཁེངས་དང་ང་རྒྱལ་ལ་སོགས་པ། །རྒྱ་ཆེར་བཤད་པ་འང་དེ་བཞིན་ནོ། །དེ་ནས་ཟླ་འོད་གཞོན་ནུར་གྱུར་པས་དེ་ལྟ་བུའི་ཆོས་ཁྱད་པར་དུ་\nའཕགས་པ་ཐོས་པས་རབ་ཏུ་དགའ་བར་གྱུར་ནས་ཐལ་མོ་སྦྱར་<span class='delete'>ཏེ། །</span><span class='add'>ཏེ། </span>བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་སང་གི་གདུགས་ལ་བདག་དེ་བཞིན་གཤེགས་པ་<span class='delete'>དང། །</span><span class='add'>དང་། </span>འཁོར་མང་པོ་དང་བཅས་པར་\nགདུགས་ཚོད་ལ་སྤྱན་འདྲེན་ན། ཐུགས་བརྩེ་བར་དགོངས་ཏེ་བདག་གིས་སྦྱར་བའི་གདུགས་ཚོད་གསོལ་བར་ཅི་<span class='delete'>གནང། །</span><span class='add'>གནང་། </span>དེ་སྐད་ཅེས་གསོལ་པ་དང་། དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་གཞོན་ནུ་དེའི་བསམ་པ་རྣམ་པར་དག་\nཔ་<span class='delete'>དང། </span><span class='add'>དང་། </span>སེམས་ཅན་ཚད་མེད་པ་རྣམས་ལ་ཡང་ཕན་པ་མཛད་པར་འགྱུར་<span class='delete'>པར་</span><span class='add'>བར་</span>ཐུགས་ཀྱིས་མཁྱེན་ནས་ཐུགས་བརྩེ་བར་དགོངས་ཏེ་ཅང་མི་གསུང་བས་གནང་<span class='delete'>ངོ། །</span><span class='add'>ངོ་། །</span>དེ་ནས་ཟླ་འོད་གཞོན་ནུར་གྱུར་པ་སྟན་ལས་ལངས་ནས། \nབཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་བྱས་<span class='delete'>ཏེ། །</span><span class='add'>ཏེ། </span>ལན་གསུམ་བསྐོར་བ་བྱས་<span class='delete'>ནས། །</span><span class='add'>ནས། </span>རབ་ཏུ་དགའ་བས་རང་གི་ཁྱིམ་དུ་སོང་སྟེ། རང་གི་འཁོར་དང་བཅས་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>ལྷ་<span class='delete'>དང། </span><span class='add'>དང་། </span>ཀླུ་དང་། གནོད་སྦྱིན་<span class='delete'>དང། </span><span class='add'>དང་། </span>སྲིན་པོ་དང་། \nལྟོ་འཕྱེ་ཆེན་པོ་ལ་སོགས་པས་རྒྱལ་པོའི་ཁབ་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོའི་བཞི་མདོར་དར་གྱི་ལྡིང་ཁང་བྲེས་ཏེ་ལྡིང་ཁང་དེ་ཡང་ཤིན་དུ་མཐོ་ཞིང་རྒྱ་ཆེ་ལ་ཐམས་ཅད་ཀུན་དུ་ཁྱབ་པ། གསེར་གྱི་ཙོང་ཙོང་དྲ་བར་<span class='delete'>བྱེས་</span><span class='add'>བྲེས་</span>པ། །ནོར་\nབུ་རིན་པོ་ཆེའི་ཕྲེང་བ་<span class='delete'>སྦྱངས་</span><span class='add'>སྤྱངས་</span>པ། སེང་གེའི་བ་དན་<span class='delete'>དང། </span><span class='add'>དང་། </span>གསེར་གྱི་ཕྲེང་བ་ལུ་གུ་རྒྱུད་ཅན་འབུམ་ཕྲག་བརྒྱ་སྟོང་སྣ་ཚོགས་ཀྱིས་བརྒྱན་པ། གཞན་ཡང་རིན་པོ་ཆེའི་མེ་ཏོག་ཁ་དོག་ཁྱད་པར་དུ་འཕགས་པའི་ཕྲེང་བའི་\nཕུང་པོ་དག་གཅལ་དུ་བཀྲམ་མོ། །མེ་ཏོག་ཙམ་པ་ཀ་དང་ཨ་ཏི་<span class='delete'>མུ་</span><span class='add'>མུ</span>ག་ཏ་ལ་སོགས་པ་རྣམ་པ་སྣ་ཚོགས་ཀྱི་ཕྲེང་བ་ཚད་མེད་གྲངས་མེད་པ་ཡང་རིན་པོ་ཆེའི་ལྡིང་ཁང་གི་ནང་ཐམས་ཅད་<span class='delete'>དང། </span><span class='add'>དང་། </span>འཁོར་འདུས་པ་ཐམས་ཅད་ཀུན་དུ་"
 ],
 [
  "79.259a",
  "<span class='delete'>འགྱུར། །</span><span class='add'>འགྱུར། །ནམ་</span><span class='delete'>ཡང་</span><span class='add'>ཡང་</span>མཐོ་རིས་<span class='delete'>ཡོང་</span><span class='add'>ཡོང་</span>མི་སྐྱེ། །གང་གིས་སྐད་ཅིག་གཅིག་ལ་ནི། །མཆོད་རྟེན་སྟོང་ནི་བྱས་པ་བས། །གང་གིས་མདོ་སྡེ་འདི་ཐོས་ནས། །ཚིག་བཞི་ཚིགས་བཅད་གཅིག་འཛིན་འཕགས། །མེ་ཏོག་ཕྲེང་བ་བརྒྱ་\nསྟོང་<span class='delete'>དག། །</span><span class='add'>དག །</span>སངས་རྒྱས་མཆོད་རྟེན་མཆོད་པ་བས། །གང་གིས་མདོ་སྡེ་འདི་ཐོས་ནས། །ཚིག་བཞི་ཚིགས་བཅད་སེམས་པ་འཕགས། །གང་གིས་རིན་ཆེན་མཆོད་རྟེན་<span class='delete'>དག། །</span><span class='add'>དག །</span>གང་གཱའི་བྱེ་སྙེད་བྱས་པ་བས། །གང་གིས་ཐ་ན་སྐད་\nཅིག་ཙམ། །མདོ་སྡེ་འདི་སེམས་ཁྱད་པར་འཕགས། །སངས་རྒྱས་<span class='delete'>ཞིག་</span><span class='add'>ཞིང་</span>ནི་འབུམ་ཕྲག་བརྒྱ། །མེ་ཏོག་གཏོར་ནས་མཆོད་པ་བས། །གང་གིས་ཐ་ན་སྐད་ཅིག་ཙམ། །མདོ་སྡེ་འདི་སེམས་ཁྱད་པར་འཕགས། །ཆོས་གོས་འབུམ་\nཕྲག་བརྒྱ་མང་པོ། །སངས་རྒྱས་རྣམས་ལ་ཕུལ་བ་ལས། །གང་གིས་ཐ་ན་སྐད་ཅིག་ཙམ། །མདོ་སྡེ་འདི་སེམས་ཁྱད་པར་འཕགས། །སངས་རྒྱས་སྤྱན་ནི་རྣམ་དག་འཕགས། །མི་མཁྱེན་མི་གཟིགས་གང་ཡང་མེད། །གང་གིས་མདོ་\nསྡེ་འདི་མོས་ན། །སངས་རྒྱས་སྤྱན་ནི་ཐོབ་པར་འགྱུར། །འདས་པའི་བསྐལ་པ་གྲངས་མེད་ཚེ། །སངས་རྒྱས་མར་མེ་མཛད་པ་བྱུང་། །ང་ནི་བྲམ་ཟེའི་ཁྱེ་འུར་གྱུར། །མེ་ཏོག་ཐོགས་ནས་མཆོད་པ་བྱས། །ཤཱག་ཀྱ་ཐུབ་པ་ཞེས་བྱ་བ། །\nབྱང་ཆུབ་སྙིང་པོ་ལ་འདུག་ནས། །མདོ་སྡེ་འདི་ནི་སྟོན་འགྱུར་ཞེས། །ང་ལ་བྱང་ཆུབ་ལུང་ཡང་བསྟན། །ཁྱོད་ནི་དེ་ཚེ་གཞོན་ནུར་གྱུར། །ང་ལུང་བསྟན་པ་ཐོས་གྱུར་ནས། །དགའ་ཞིང་དད་པའི་སེམས་བསྐྱེད་དེ། །ཐལ་མོ་སྦྱར་ནས་འདི་སྐད་དུ། །\nགལ་ཏེ་བྲམ་ཟེའི་ཁྱེའུ་འདི་ནི། །མངོན་<span class='delete'>པར་</span><span class='add'>པར་</span>རྫོགས་པར་སངས་རྒྱས་ཚེ། །བདག་ནི་དེ་ཡི་གྲོགས་གྱུར་ནས། །མྱ་ངན་འདས་པའི་འོག་ཏུ་ཡང་། །ཆོས་ཀྱི་སྡེ་སྣོད་རབ་འཛིན་ཅིང་། །སྲུང་བར་ཤོག་ཅེས་སྨོན་ལམ་བཏབ། །སངས་རྒྱས་མར་མེ་མཛད་དེ་ཡིས། །\nའོད་ཟེར་སྟོན་པའི་མདོ་འདི་ནི། །ཇི་སྐད་གསུངས་བཞིན་དེ་ཡི་ཚེ། །བྲམ་ཟེའི་ཁྱེའུ་དང་གཞོན་ནུ་གཉིས། །ལེགས་པར་མཉན་ཅིང་ཡོངས་སུ་<span class='delete'>བཟུང། །</span><span class='add'>བཟུང་། །</span>ང་སྔོན་འདས་པའི་དུས་ཀྱི་ཚེ། །མེ་ཏོག་ཨུད་པ་ལ་དག་གིས། །སངས་རྒྱས་དེ་ལ་མཆོད་པ་བྱས། །"
 ],
 [
  "79.262a",
  "མེད་པ་རྣམས་ནི་ཉེ་བཤེས་དང་ལྡན་པར་གྱུར། ལུས་ཀྱི་རྒྱན་ཐམས་ཅད་ཀྱིས་ཕོངས་པ་རྣམས་ནི་ལུས་ཀྱི་རྒྱན་ཐམས་ཅད་དང་ལྡན་པར་གྱུར་ཏོ། །གཞན་ཡང་<span class='delete'>དད་</span><span class='add'>ངང་</span>པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>ཁྲུང་ཁྲུང་<span class='delete'>དང། </span><span class='add'>དང་། </span>ནེ་ཙོ་<span class='delete'>དང། </span><span class='add'>དང་། </span>རྨ་བྱ་<span class='delete'>དང། </span><span class='add'>དང་། </span>\nཀ་རི་ཀ་ལ་སོགས་པ་བྱའི་ཚོགས་མང་པོ་རྣམས་དེ་བཞིན་གཤེགས་པ་མཐོང་བ་<span class='delete'>དང། </span><span class='add'>དང་། </span>རབ་ཏུ་དགའ་བའི་སེམས་བསྐྱེད་ནས་སྒྲ་སྙན་ཅིང་ཡིད་དུ་འོང་བ་མཆོག་དམ་པ་ཕྱུང་སྟེ། གང་གིས་སྒྲ་དེ་དག་ཐོས་པ་ཡང་\nཡིད་ཤིན་དུ་བདེ་བར་གྱུར་ཏོ། །གཞན་ཡང་དེ་བཞིན་གཤེགས་པས་རྫུ་འཕྲུལ་གྱི་སྟོབས་ཀྱིས་ཙམ་པ་ཀའི་ལྗོན་ཤིང་ཚད་མེད་པ་སྙེད་མངོན་<span class='delete'>པར་</span><span class='add'>པར་</span>སྤྲུལ་པས། སེམས་ཅན་བརྒྱ་སྟོང་མང་པོ་རྣམས་མེ་ཏོག་ཡོངས་སུ་དག་\nཔ་དེ་དག་<span class='delete'>དང། </span><span class='add'>དང་། </span>གཞན་ཡང་སྤོས་མཆོག་དམ་པ་ཐོགས་ནས་བཅོམ་ལྡན་འདས་ལ་མངོན་<span class='delete'>པར་</span><span class='add'>པར་</span>གཏོར་ཏེ་མཆོད་པ་བྱས་སོ། །གཞན་ཡང་ལྷ་མ་ཡིན་གྱི་བུ་མོ་དབང་ཕྱུག་ཐོབ་པ་བརྒྱ་སྟོང་དུ་མ་མུ་ཏིག་དམར་པོ་<span class='delete'>དང། </span><span class='add'>དང་། </span>ཙན་\nདན་གྱི་ཕྱེ་མ་ཐོགས་ནས་དེ་བཞིན་གཤེགས་པ་ལ་རབ་ཏུ་དགའ་བས་མངོན་<span class='delete'>པར་</span><span class='add'>པར་</span>གཏོར་ཏོ། །ལྷ་མ་ཡིན་མང་པོ་<span class='delete'>དང། </span><span class='add'>དང་། </span>གཞན་ཡང་ལྷ་མང་པོ་རྣམས་རིན་པོ་ཆེའི་གདུགས་གསེར་<span class='delete'>དང། </span><span class='add'>དང་། </span>དངུལ་གྱིས་རབ་ཏུ་བརྒྱན་པ་ཐོགས་ནས་\nབར་སྣང་ལ་འདུག་སྟེ། དེ་བཞིན་གཤེགས་པའི་སྟེང་དུ་ཁེབས་པར་གཡོགས་སོ། །གཞན་ཡང་བཅོམ་ལྡན་འདས་ཀྱི་རྫུ་འཕྲུལ་གྱི་སྟོབས་ཀྱིས་ཙན་དན་གྱི་ལྗོན་ཤིང་<span class='delete'>དང། </span><span class='add'>དང་། </span>རིན་པོ་ཆེའི་སྣོད་<span class='delete'>དང། </span><span class='add'>དང་། </span>གོས་ལ་སོགས་པའི་\nལྗོན་ཤིང་བརྒྱ་སྟོང་ཚད་མེད་དཔག་ཏུ་མེད་པ་རིན་པོ་ཆེ་རྣམས་ཀྱིས་བརྒྱན་པ། མེ་ཏོག་<span class='delete'>དང། </span><span class='add'>དང་། </span>ལོ་མ་ཕུན་སུམ་ཚོགས་ཤིང་རྒྱས་པ། སེམས་ཅན་ཚད་མེད་པའི་བསོད་ནམས་ཀྱི་རྣམ་པར་སྨིན་པའི་འབྲས་བུ་ཐུན་མོང་དུ་མངོན་\n<span class='delete'>པར་</span><span class='add'>པར་</span>གྲུབ་པ། རླུང་གི་<span class='delete'>ངང་</span><span class='add'>ངད་</span>ལངས་པ་ཙམ་གྱིས་སྤོས་མཆོག་དམ་པའི་དྲིས་སངས་རྒྱས་ཀྱི་ཞིང་ཚད་མེད་པ་རྣམས་ཀུན་དུ་ཁྱབ་པར་གང་བ་མངོན་<span class='delete'>པར་</span><span class='add'>པར་</span>སྤྲུལ་ཏོ། །སེམས་ཅན་བརྒྱ་སྟོང་ཚད་མེད་པ་རྣམས་ཀྱིས་ཀྱང་དུས་"
 ],
 [
  "79.261b",
  "ཁྱབ་པར་<span class='delete'>སྦྱངས་</span><span class='add'>སྤྱངས་</span>ཤིང་རྒྱན་དུ་<span class='delete'>བྲིས་</span><span class='add'>བྲིས་</span>སོ། །གཞན་ཡང་དེའི་ནང་དུ་ཁྲི་སྟན་རྣམས་བཤམས་<span class='delete'>ནས། །</span><span class='add'>ནས། </span>རིན་པོ་ཆེའི་སྤོས་<span class='delete'>བྱི་</span><span class='add'>ཕྱི་</span>ལི་ཀ་<span class='delete'>དང། </span><span class='add'>དང་། </span>དུ་མ་ཙ་དང་། ཙན་དན་<span class='delete'>དང། </span><span class='add'>དང་། </span>གུར་གུམ་རྣམ་པར་དག་ཅིང་ཡིད་དགའ་བར་བྱེད་པ་སྣ་\nཚོགས་བསྲེགས་སོ། །དེ་བཞིན་དུ་སྦྱར་སྤོས་མཆོག་དམ་པ་སྣ་ཚོགས་ཀྱང་མཆོད་པའི་ཡོ་བྱད་དུ་སྦྱར་ཏོ། །གཞན་ཡང་སྤོས་ཀྱི་ཆུས་ལམ་<span class='delete'>སྲད་</span><span class='add'>སྲང་</span>རྣམས་ཀུན་དུ་ཁྱབ་པར་ཆག་ཆག་བཏབ་བོ། །ས་བཞི་ཀུན་\nདུ་མེ་ཏོག་སྣ་ཚོགས་<span class='delete'>བཙལ་</span><span class='add'>བཅལ་</span>དུ་བཀྲམ་མོ། །དེའི་ཚེ་ལྷའི་བུ་མོ་<span class='delete'>དང། </span><span class='add'>དང་། </span>ལྷ་མ་ཡིན་གྱི་བུ་མོ་<span class='delete'>དང། </span><span class='add'>དང་། </span>སྒྲ་གཅན་ཟིན་གྱི་བུ་མོ་གྲངས་མེད་ཚད་མེད་པ་ཡང་རབ་ཏུ་དགའ་བའི་སེམས་བསྐྱེད་ནས། བྱང་ཆུབ་ཀྱི་རྒྱུ་མངོན་<span class='delete'>པར་</span><span class='add'>པར་</span>བསྒྲུབ་\nཔར་འདོད་པའི་ཕྱིར་དེར་འོངས་ནས་གྲོང་ཁྱེར་ཆེན་པོ་ཁྱད་པར་དུ་འཕགས་པ་དེ་རབ་ཏུ་བརྒྱན་ཏོ། །དེ་ནས་ཟླ་འོད་གཞོན་ནུར་གྱུར་པ་གྲོང་ཁྱེར་དེ་ཀུན་དུ་ཁྱབ་པར་བརྒྱན་ཅིང་ཡོངས་སུ་དག་པ་དང་གདུགས་ཚོད་ལ་བབ་པར་རིག་\nནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་སེམས་ཅན་རྣམས་ལ་སྨན་པར་མཛད་པའི་སླད་དུ་<span class='delete'>གྲོག་</span><span class='add'>གྲོང་</span>ཁྱེར་ཆེན་པོར་གཤེགས་སུ་གསོལ། །དེ་ནས་བཅོམ་ལྡན་འདས་འཁོར་མང་པོ་དང་ཐབས་\nགཅིག་ཏུ་གྲོང་ཁྱེར་དུ་གཤེགས་ནས་སྒོའི་<span class='delete'>ཐིམ་</span><span class='add'>ཐེམ་</span>པ་ལ་ཞབས་བཞག་མ་ཐོག་ཏུ་གྲོང་ཁྱེར་ཆེན་པོ་དེའི་<span class='delete'>ལ་</span><span class='add'>ས་</span>ཆེན་པོ་ཡང་རབ་ཏུ་གཡོས་པར་གྱུར། ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་འབུམ་ཕྲག་བརྒྱ་སྟོང་ཚད་མེད་པ་ཡང་\nརབ་ཏུ་གཡོས་པར་གྱུར་ཏེ། དེའི་ཚེ་ལོང་བ་དག་ནི་གཟུགས་མཐོང་བར་གྱུར། སྡུག་བསྔལ་བ་རྣམས་ནི་བདེ་བ་ཐོབ་པར་གྱུར། འོན་པ་རྣམས་ནི་སྒྲ་ཐོས་པར་གྱུར། བྱད་བཞིན་མི་སྡུག་པ་རྣམས་ནི་བྱད་བཞིན་\nབཟང་པོ་ཐོབ་པར་<span class='delete'>གྱུར། །</span><span class='add'>གྱུར། </span>ནོར་མེད་པ་རྣམས་ནི་ནོར་དང་ལྡན་<span class='delete'>པར་</span><span class='add'>པར་</span>གྱུར། བུ་མེད་པ་རྣམས་ནི་བུ་ཡོད་པར་<span class='delete'>གྱུར། །</span><span class='add'>གྱུར། </span>གོས་མེད་པ་རྣམས་ནི་གོས་ཐོབ་པར་གྱུར། རིན་པོ་ཆེ་མེད་པ་རྣམས་ནི་རིན་པོ་ཆེ་ཐོབ་པར་གྱུར། ཉེ་བཤེས་"
 ],
 [
  "79.262b",
  "གཅིག་ཏུ་མེ་ཏོག་ཐོགས་ནས་བཅོམ་ལྡན་འདས་ལ་མངོན་<span class='delete'>པར་</span><span class='add'>པར་</span>གཏོར་ཏོ། །དེ་བཞིན་དུ་སེམས་ཅན་མ་ཡིན་པ་ཚད་མེད་པ་རྣམས་ཀྱང་དེ་བཞིན་གཤེགས་པའི་རྫུ་འཕྲུལ་གྱི་སྟོབས་ཀྱིས་མངོན་<span class='delete'>པར་</span><span class='add'>པར་</span>སྤྲུལ་པ་ཤ་སྟག་<span class='delete'>གོ། </span><span class='add'>གོ ། </span>\nགང་དག་ཅི་དང་ཅི་སྨོན་པ་དེ་དག་ཀྱང་རྫུ་འཕྲུལ་གྱི་དབང་གིས་དེ་དག་གི་བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་རེ་བ་ཡོངས་སུ་རྫོགས་པར་གྱུར་ཏོ། །བཅོམ་ལྡན་འདས་<span class='delete'>གྲོད་</span><span class='add'>གྲོང་</span>ཁྱེར་དུ་གཤེགས་པའི་ཚེ་འཁོར་འདུས་པ་ཐམས་ཅད་\nནམ་མཁའ་ལ་ཁྱད་པར་དུ་འཕགས་པའི་སྒྲས་བསམ་གྱིས་མི་ཁྱབ་པར་ཡང་དག་པར་སྟོན་པའི་སྒྲ་ཐོས་པར་གྱུར་ཀྱང་དེ་གང་ནས་བྱུང་བ་ཤེས་པར་ཡང་མ་གྱུར་ལ་ཚིགས་སུ་བཅད་པ་བརྒྱ་སྟོང་དུ་མས་ཀྱང་ཆོས་རྣམས་\nཡང་དག་པར་བསྟན་པར་གྱུར་ཏོ། །བཅོམ་ལྡན་འདས་ནི་གྲོང་ཁྱེར་ཞུགས་པའི་<span class='delete'>ཚེ། </span><span class='add'>ཚེ། །</span>མཁའ་ལས་སྒྲ་ནི་འདི་སྐད་གྲགས་པར་གྱུར། །འདོད་ཆགས་ཟད་མཐའ་སྟོང་དབེན་གང་རྟོགས་པ། །ཡང་དག་ཉིད་རྟོགས་བྱང་ཆུབ་ཐོབ་\nཔར་འགྱུར། །བཅོམ་ལྡན་འདས་ནི་གྲོང་ཁྱེར་ཞུགས་པའི་ཚེ། །མཁའ་ལས་སྒྲ་ནི་འདི་སྐད་གྲགས་པར་གྱུར། །འདོད་ཆགས་སྐྱེ་མཐའ་སྟོང་དབེན་གང་རྟོགས་པ། །ཡང་དག་ཉིད་རྟོགས་བྱང་ཆུབ་ཐོབ་པར་འགྱུར། །བཅོམ་\nལྡན་འདས་ནི་གྲོང་ཁྱེར་ཞུགས་པའི་ཚེ། །མཁའ་ལས་སྒྲ་ནི་འདི་སྐད་གྲགས་པར་གྱུར། །འདོད་ཆགས་མཐའ་ནི་སྟོང་དབེན་གང་རྟོགས་པ། །ཡང་དག་ཉིད་རྟོགས་བྱང་ཆུབ་ཐོབ་པར་འགྱུར། །བཅོམ་ལྡན་འདས་ནི་\nགྲོང་ཁྱེར་ཞུགས་པའི་ཚེ། །མཁའ་ལས་སྒྲ་ནི་འདི་སྐད་གྲགས་པར་གྱུར། །འདོད་ཆགས་རབ་ཞི་སྟོང་དབེན་གང་རྟོགས་པ། །ཡང་དག་ཉིད་རྟོགས་བྱང་ཆུབ་ཐོབ་པར་འགྱུར། །བཅོམ་ལྡན་འདས་ནི་གྲོང་ཁྱེར་\nཞུགས་པའི་ཚེ། །མཁའ་ལས་སྒྲ་ནི་འདི་སྐད་གྲགས་པར་གྱུར། །འདོད་ཆགས་འཇུག་པ་སྟོང་དབེན་གང་རྟོགས་པ། །ཡང་དག་ཉིད་རྟོགས་བྱང་ཆུབ་ཐོབ་པར་འགྱུར། །བཅོམ་ལྡན་འདས་ནི་གྲོང་ཁྱེར་ཞུགས་"
 ],
 [
  "79.263b",
  "འདས་ནི་གྲོང་ཁྱེར་ཞུགས་པའི་ཚེ། །མཁའ་ལས་སྒྲ་ནི་འདི་སྐད་གྲགས་པར་གྱུར། །བཅོམ་ལྡན་བརྩོན་འགྲུས་དག་ལ་རབ་མོས་པས། །བརྩོན་འགྲུས་སྟོབས་ཀྱིས་བྱང་ཆུབ་བརྙེས་པར་གྱུར། །བཅོམ་ལྡན་འདས་\nནི་གྲོང་ཁྱེར་ཞུགས་པའི་ཚེ། །མཁའ་ལས་སྒྲ་ནི་འདི་སྐད་གྲགས་པར་གྱུར། །བཅོམ་ལྡན་བསམ་གཏན་དག་ལ་རབ་མོས་པས། །བསམ་གཏན་སྟོབས་ཀྱིས་བྱང་ཆུབ་བརྙེས་པར་གྱུར། །བཅོམ་ལྡན་འདས་ནི་\nགྲོང་ཁྱེར་ཞུགས་པའི་ཚེ། །མཁའ་ལས་སྒྲ་ནི་འདི་སྐད་གྲགས་པར་གྱུར། །བཅོམ་ལྡན་ཤེས་རབ་དག་ལ་རབ་མོས་པས། །ཤེས་རབ་སྟོབས་ཀྱིས་བྱང་ཆུབ་བརྙེས་པར་གྱུར། །རྫུ་འཕྲུལ་མངོན་ཤེས་ཡོན་ཏན་\nགནས་ཤེས་སྟོབས། །ཐབས་དང་གཟུངས་ཀྱི་སྟོབས་དང་གྲགས་པའི་སྟོབས། །ལས་དང་རྟེན་འབྱུང་ཡན་ལག་<span class='delete'>དད་</span><span class='add'>དད་</span>དང་ཐོས། །སྟོང་དང་འཐུན་པའི་སྟོབས་དང་རབ་ཞི་སྟོབས། །རབ་དུལ་ཡང་དག་མཐའ་དང་དབེན་མཁས་\nསྟོབས། །འཇིགས་དང་དགའ་དང་ཕན་འདོགས་ལ་མོས་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>བྱམས་དང་སྙིང་རྗེ་དགའ་སྙོམས་བཟོད་འཚེ་མེད། །སྟོང་དང་མཚན་མ་མེད་སོགས་ཀྱང་དེ་བཞིན། །སྟོབས་བཅུ་འཕགས་པའི་མངའ་བདག་ལྷ་\nཡི་གཙོ། །ཡོན་ཏན་གྲགས་པ་དཔེ་ཟླ་མ་མཆིས་པ། །གྲོང་ཁྱེར་མཆོག་གཤེགས་ཞབས་ནི་བཞག་པའི་ཚེ། །སེམས་ཅན་རྣམས་ལ་རྒྱ་ཆེར་ཕན་པ་མཛད། །སྔོན་ཆད་སྲིད་གསུམ་ལས་དགེ་རབ་བསྒྲུབས་པས། །\nལྷ་ཡི་དགེ་བ་སྣ་ཚོགས་འཕེལ་བར་མཛད། །འཇིག་རྟེན་ཐམས་ཅད་ཀྱིས་ནི་རབ་ཏུ་བཀུར། །ང་ཡི་བསྟན་པ་འདི་ཐོས་ཐམས་ཅད་དགའ། །བཅོམ་ལྡན་གྲོང་ཁྱེར་གཤེགས་ནས་ཞབས་བཞག་ཚེ། །གྲོང་ཁྱེར་ས་ཆེན་\nདག་ནི་རབ་ཏུ་གཡོས། །བཅོམ་ལྡན་རྣམ་དག་འོད་ཟེར་མཐོང་བས་ན། །ངོ་མཚར་མི་འཛིན་མི་དགའ་གང་ཡང་མེད། །བཅོམ་ལྡན་གྲོང་གཤེགས་ཕན་པ་ཆེར་མཛད་པས། །ལྷ་མིའི་འཁོར་རྣམས་སེམས་ནི་དགའ་"
 ],
 [
  "79.259b",
  "དེ་ཚེ་ཁྱོད་ཀྱང་དེར་འདུག་སྟེ། །འདི་སྐད་དུ་ནི་སྨོན་ལམ་བཏབ། །ང་ཡི་བསྟན་པ་ཐ་མ་ལ། །མདོ་སྡེ་འདི་ནི་རབ་བཟུང་ནས། །རྒྱ་ཆེར་སྟོན་པར་ཤོག་ཅེས་སྨྲས། །གང་གིས་ཆོས་འདི་ཐོས་གྱུར་ནས། །ཞེ་སྡང་སེམས་ནི་མི་སྐྱེད་\nཔར། །གཟུང་འཛིན་ཀློག་ཅིང་གང་འདོན་པ། །དེ་ནི་སྐྱེས་བུ་དམ་པ་ཡིན། །ཁྱོད་ཀྱིས་མ་འོངས་དུས་ཀྱི་ཚེ། །ཐོས་དཀའི་ཆོས་འདི་རབ་བཟུང་ནས། །སེམས་ཅན་དག་ལ་དོན་གྱི་ཚུལ། །རྒྱ་ཆེར་དབྱེ་ཞིང་བསྟན་པར་བྱ། །ངས་ཀྱང་འདས་\nཔའི་དུས་ཀྱི་ཚེ། །ཡང་དག་ཆོས་ནི་ནུབ་པ་ན། །འོད་ཟེར་སྟོན་པའི་མདོ་འདི་ནི། །སེམས་ཅན་དག་ལ་རྒྱ་ཆེར་བསྟན། །བླུན་པོས་ནན་ཏན་མི་སྒྲུབ་པས། །འདི་ལ་སྐུར་<span class='delete'>བ་</span><span class='add'>པ་</span>འདེབས་པར་བྱེད། །ངས་ནི་དེ་སྐད་ཐོས་གྱུར་ཀྱང་། །ཞེ་སྡང་\nདག་ནི་སྐྱེད་མི་བྱེད། །ངས་ནི་རྟག་ཏུ་བཟོད་སྒོམས་ནས། །འཇིག་རྟེན་རྣམས་ལ་ཕན་འདོགས་བྱེད། །བཟོད་པའི་སྟོབས་ནི་རྫོགས་པས་ན། །མཚན་དང་དཔེ་བྱད་དག་གིས་བརྒྱན། །གཞོན་ནུ་ཁྱོད་ཀྱིས་སངས་རྒྱས་སྐུ། །གྱ་ནོམ་ཡོངས་\nསུ་རྫོགས་གྱུར་<span class='delete'>ཅིང། །</span><span class='add'>ཅིང་། །</span>གསེར་གྱི་ཁ་དོག་རྣམ་དག་འཕགས། །བཟོད་པའི་སྟོབས་ལས་བྱུང་བར་ལྟོས། །ང་ཡི་ཞབས་ནི་ས་རེག་ནས། །ཞིང་ནི་ཚད་མེད་གཡོ་བྱེད་ཀྱང་། །སེམས་ཅན་རྣམས་ནི་མི་ལྟུང་བ། །ཐམས་ཅད་བཟོད་པའི་སྟོབས་\nལས་སྐྱེས། །ང་ཡི་སྤུ་ཁུང་གཅིག་ནས་ནི། །འོད་ཟེར་བརྒྱ་སྟོང་རབ་བཀྱེ་ནས། །ཐམས་ཅད་གསལ་བར་གང་བྱེད་པ། །ཐམས་ཅད་བཟོད་མཆོག་སྟོབས་ལས་བྱུང་། །སྲིན་པོ་བཞིན་དུ་འཇིགས་པའི་གཟུགས། །སྲོག་ཆགས་གཟི་\nབྱིན་འཕྲོག་བྱེད་པ། །ང་ལ་རྟག་ཏུ་གུས་པ་<span class='delete'>ཡང། །</span><span class='add'>ཡང་། །</span>ཐམས་ཅད་བཟོད་མཆོག་སྟོབས་ལས་<span class='delete'>བྱུང། །</span><span class='add'>བྱུང་། །</span>ང་ཡི་འཁོར་ནི་ཇི་སྙེད་པ། །སེམས་ནི་རབ་ཏུ་དུལ་གྱུར་ནས། །དེ་བཞིན་གཤེགས་ལ་གུས་པ་<span class='delete'>ཡང། །</span><span class='add'>ཡང་། །</span>ཐམས་ཅད་བཟོད་མཆོག་\nསྟོབས་ལས་<span class='delete'>བྱུང། །</span><span class='add'>བྱུང་། །</span>རོལ་མོའི་སྒྲ་ནི་བརྒྱ་སྟོང་<span class='delete'>དག། །</span><span class='add'>དག །</span>འཁོར་འདུས་ཆེན་པོའི་ནང་དག་ཏུ། །སངས་རྒྱས་ཡོན་ཏན་བསྔགས་བརྗོད་པ། །ཐམས་ཅད་བཟོད་མཆོག་སྟོབས་ལས་<span class='delete'>བྱུང། །</span><span class='add'>བྱུང་། །</span>ཀླུ་ཡི་རྒྱལ་པོ་བརྒྱ་སྟོང་<span class='delete'>དག། །</span><span class='add'>དག །</span>རབ་ཏུ་གདུག་ཅིང་"
 ],
 [
  "79.264a",
  "བར་འགྱུར། །ས་དང་མཁའ་འགྲོ་དག་གིས་སྲིད་གསུམ་ན། །བཅོམ་ལྡན་ཤིན་དུ་བདེ་ཞེས་བསྔགས་པར་གྱུར། །བཅོམ་ལྡན་ཞབས་ཀྱི་འཁོར་ལོ་ས་བཞག་ཚེ། །རྣམ་དག་འོད་ཟེར་ཀུན་གསལ་\nངོ་མཚར་གྱུར། །རྟ་ནི་ཅང་ཤེས་གྲོང་ཁྱེར་སྒྲ་སྙན་<span class='delete'>ཕྱུང། །</span><span class='add'>ཕྱུང་། །</span>བྱ་ཚོགས་དག་ཀྱང་མཁའ་ལས་རབ་ཏུ་དགའ། །གཞན་ཡང་རབ་དང་བུད་མེད་མང་པོ་ཡི། །ལག་དང་རྐང་དང་གདུབ་འཁོར་ཕྲེང་བ་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>དེ་བཞིན་རིན་\nཆེན་རྒྱན་ནི་སྣ་ཚོགས་ལས། །མ་དཀྲོལ་པ་ཡང་རང་ལས་སྒྲ་སྙན་བྱུང་། །སོ་སོར་ཕན་ཚུན་དགའ་བའི་གཏམ་བརྗོད་<span class='delete'>ཅིང། །</span><span class='add'>ཅིང་། །</span>སྐད་མང་བཀྲ་ཤིས་མཆོག་གིས་བསྔགས་པ་བརྗོད། །འོན་ལོང་དབང་པོ་མ་\nཚང་དབང་པོ་ཐོབ། །ཐམས་ཅད་བཅོམ་ལྡན་ཁྱད་འཕགས་འབྲས་བུ་<span class='delete'>དབང། །</span><span class='add'>དབང་། །</span>བཅོམ་ལྡན་གྲོང་ཁྱེར་གཤེགས་ཚེ་ཀུན་དགའ་བས། །ལྷ་མིས་མེ་ཏོག་མངོན་<span class='delete'>པར་</span><span class='add'>པར་</span>མཆོད་པ་བྱས། །མཁའ་ལས་ཀུན་དུ་སྒྲ་\nསྙན་བྱུང་བས་ན། །ལྷ་ཚོགས་ཚད་མེད་རབ་ཏུ་དགའ་བར་གྱུར། །གཞན་ཡང་སེམས་ཅན་<span class='delete'>དྲན་</span><span class='add'>དྲན་པ་</span><span class='delete'>ཉམས་</span><span class='add'>ཉམས་</span>པ་<span class='delete'>དག། །</span><span class='add'>དག །</span>སྨྱོས་འཁྲུགས་རབ་ཞི་ཕན་ཚུན་གཏམ་སྙན་བརྗོད། །བུད་མེད་གང་སྦྲུམ་མྱ་ངན་འཇིགས་གྱུར་པ། །འོད་ཟེར་\nབྱིན་གྱིས་བདེ་བ་ཐོབས་པར་གྱུར། །སྐྱེས་པ་བུད་མེད་ངོ་<span class='delete'>ཆར་</span><span class='add'>ཚ་</span>ཁྲེལ་བཅས་<span class='delete'>པ། །</span><span class='add'>ལ། །</span>དྲི་མ་སྤངས་པའི་ཆོས་དག་རབ་བཤད་པས། །ཐམས་ཅད་དགའ་ནས་དག་པའི་སེམས་བསྐྱེད་དེ། །ཐུབ་མཆོག་ཞབས་ལ་སྤྱི་<span class='delete'>བཏུང་</span><span class='add'>བཏུད་</span>ཕྱག་\nབྱས་ནས། །ཁ་ཅིག་བཅོམ་ལྡན་བླ་མེད་ལམ་རབ་ཚོལ། །ཁ་ཅིག་བྱང་ཆུབ་སེམས་དཔའ་ཉན་ཐོས་ཚོལ། །བཅོམ་ལྡན་གྲོང་ཁྱེར་མཆོག་ཏུ་གཤེགས་པས་ན། །བཅོམ་ལྡན་ཞལ་དུ་ལྟ་ཞིང་རང་ཉིད་དགའ། །བཅོམ་\nལྡན་མཁྱེན་པས་ས་ཡི་སྤྱོད་རྟོགས་པས། །འཇིག་རྟེན་རྗེས་མཐུན་ཕན་པ་རབ་ཏུ་མཛད། །ཆོས་ཀྱི་ནོར་མཆོག་བྱང་ཆུབ་སེམས་དཔའ་བྱིན། །རིན་ཆེན་མཆོག་ནི་སེམས་ཅན་རྣམས་ལ་<span class='delete'>བཏང། །</span><span class='add'>བཏང་། །</span>བཅོམ་ལྡན་གྲོང་"
 ],
 [
  "79.263a",
  "པའི་ཚེ། །མཁའ་ལས་སྒྲ་ནི་འདི་སྐད་གྲགས་པར་གྱུར། །འདོད་ཆགས་མེད་ཅིང་སྟོང་དབེན་གང་རྟོགས་པ། །ཡང་དག་ཉིད་རྟོགས་བྱང་ཆུབ་ཐོབ་པར་འགྱུར། །བཅོམ་ལྡན་འདས་ནི་གྲོང་ཁྱེར་ཞུགས་པའི་\nཚེ། །མཁའ་ལས་སྒྲ་ནི་འདི་སྐད་གྲགས་པར་གྱུར། །འདོད་ཆགས་སྐྱེ་མེད་སྟོང་དབེན་གང་རྟོགས་པ། །ཡང་དག་ཉིད་རྟོགས་བྱང་ཆུབ་ཐོབ་པར་འགྱུར། །བཅོམ་ལྡན་འདས་ནི་གྲོང་ཁྱེར་ཞུགས་པའི་ཚེ། །མཁའ་ལས་སྒྲ་\nནི་འདི་སྐད་གྲགས་པར་གྱུར། །འདོད་ཆགས་རབ་འགོག་སྟོང་དབེན་གང་རྟོགས་པ། །ཡང་དག་ཉིད་རྟོགས་བྱང་ཆུབ་ཐོབ་པར་འགྱུར། །ཞེ་སྡང་གཏི་མུག་ཁོང་ཁྲོ་འཆབ་སེར་སྣ། །གཡོ་སྒྱུ་ཁེངས་དང་ང་རྒྱལ་མྱ་ངན་<span class='delete'>དང། </span><span class='add'>དང་། །</span>\nསྡུག་བསྔལ་ཀུན་འབྱུང་འགོག་པ་ལམ་སེམས་ཅན། །ཁྱེའུ་དང་བུ་མོ་བུད་མེད་དག་དང་ནི། །སྐྱེས་བུ་<span class='delete'>གོས་</span><span class='add'>གསོ་</span>བ་དག་དང་དབང་པོ་<span class='delete'>དྲུག། །</span><span class='add'>དྲུག །</span>ཡུལ་དྲུག་འབྱུང་ཆེན་བཞི་ཡི་དངོས་པོ་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>འཇིག་རྟེན་སྡུག་བསྔལ་ཕུང་པོ་ཁམས་\nདག་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>འཇིག་རྟེན་སྐྱེ་སྒྲ་མིང་སོགས་ཀྱང་དེ་བཞིན། །ཆོས་རྗེ་དམ་པའི་ཆོས་ནི་བསྟན་པས་ན། །སེམས་ཅན་ཐམས་ཅད་རབ་ཏུ་དགའ་བར་འགྱུར། །ལྷ་ཡི་འཇིག་རྟེན་ཀུན་ཀྱང་ཐོས་གྱུར་ནས། །དེ་བཞིན་གཤེགས་པའི་\nཐེག་ལ་གནས་པར་མོས། །བཅོམ་ལྡན་འདས་ནི་གྲོང་ཁྱེར་ཞུགས་པའི་ཚེ། །མཁའ་ལས་སྒྲ་ནི་འདི་སྐད་གྲགས་པར་གྱུར། །བཅོམ་ལྡན་སྦྱིན་སྟོབས་དག་ལ་རབ་མོས་པས། །སྦྱིན་པའི་སྟོབས་ཀྱིས་བྱང་ཆུབ་\nབརྙེས་པར་གྱུར། །བཅོམ་ལྡན་འདས་ནི་གྲོང་ཁྱེར་ཞུགས་པའི་ཚེ། །མཁའ་ལས་སྒྲ་ནི་འདི་སྐད་གྲགས་པར་གྱུར། །བཅོམ་ལྡན་ཚུལ་ཁྲིམས་རྣམ་དག་རབ་མོས་པས། །ཚུལ་ཁྲིམས་རྣམ་དག་སྟོབས་ཀྱིས་བྱང་ཆུབ་\nབརྙེས། །བཅོམ་ལྡན་འདས་ནི་གྲོང་ཁྱེར་ཞུགས་པའི་ཚེ། །མཁའ་ལས་སྒྲ་ནི་འདི་སྐད་གྲགས་པར་གྱུར། །བཅོམ་ལྡན་བཟོད་པ་དག་ལ་རབ་མོས་པས། །བཟོད་པའི་སྟོབས་ཀྱིས་བྱང་ཆུབ་བརྙེས་པར་གྱུར། །བཅོམ་ལྡན་"
 ],
 [
  "79.264b",
  "ཁྱེར་གཤེགས་པའི་ཚེ། །མཁའ་ལས་སྒྲ་ནི་འདི་སྐད་<span class='delete'>བྱུང། །</span><span class='add'>བྱུང་། །</span>གང་ཞིག་མིག་ཟད་མཐའ་སྲེད་པ། །སངས་རྒྱས་ལ་ནི་གུས་པ་ཡིན། །བཅོམ་ལྡན་གྲོང་ཁྱེར་གཤེགས་པའི་ཚེ། །མཁའ་ལས་སྒྲ་ནི་འདི་སྐད་<span class='delete'>བྱུང། །</span><span class='add'>བྱུང་། །</span>\nགང་ཞིག་མིག་སྐྱེ་མཐའ་སྲེད་པ། །སངས་རྒྱས་ལ་ནི་གུས་པ་ཡིན། །གང་ཞིག་མིག་ཟད་མཐའ་སྲེད་པ། །སངས་རྒྱས་ཡིད་ཆེས་མི་འཇིགས་འཐོབ། །མིག་ཟད་མཐའ་ནི་ལྟ་བས་ན། །ཤིན་དུ་དད་པ་རྒྱུན་མི་འཆད། །\nགང་ཞིག་མིག་ཟད་མཐའ་སྲེད་པ། །ཆོས་ལ་ཡིད་ཆེས་མི་འཇིགས་འཐོབ། །མིག་ཟད་མཐར་ནི་ལྟ་བས་ན། །ཤིན་དུ་<span class='delete'>དད་</span><span class='add'>དང་</span><span class='delete'>པ་</span><span class='add'>བ་</span>རྒྱུན་མི་འཆད། །གང་ཞིག་མིག་ཟད་མཐའ་སྲེད་པ། །དགེ་འདུན་ཡིད་ཆེས་མི་འཇིགས་\nའཐོབ། །མིག་ཟད་མཐའ་ནི་ལྟ་བས་ན། །ཤིན་དུ་<span class='delete'>དད་</span><span class='add'>དང་</span><span class='delete'>པ་</span><span class='add'>བ་</span>རྒྱུན་མི་འཆད། །གང་ཞིག་མིག་ཟད་མཐའ་སྲེད་པ། །ཚུལ་ཁྲིམས་འཛིན་མེད་ཐོབ་པར་འགྱུར། །མིག་ཟད་མཐར་ནི་ལྟ་བས་ན། །ཤིན་དུ་<span class='delete'>དད་</span><span class='add'>དང་</span><span class='delete'>པ་</span><span class='add'>བ་</span>རྒྱུན་མི་འཆད། །\nགང་ཞིག་མིག་ཟད་མཐའ་སྲེད་པ། །ངན་འགྲོའི་འདོད་ཆགས་སྤོང་བར་འགྱུར། །མིག་ཟད་མཐར་ནི་ལྟ་བས་ན། །འདོད་ཆགས་རྒྱུན་ནི་སྤོང་བར་བྱེད། །གང་ཞིག་མིག་ཟད་མཐར་སྲེད་པ། །ངན་འགྲོའི་ཞེ་སྡང་སྤོང་\nབར་འགྱུར། །མིག་ཟད་མཐར་ནི་ལྟ་བས་ན། །ཞེ་སྡང་རྒྱུན་ནི་སྤོང་བར་བྱེད། །གང་ཞིག་མིག་ཟད་མཐར་སྲེད་པ། །ངན་འགྲོའི་གཏི་མུག་སྤོང་བར་འགྱུར། །མིག་ཟད་མཐར་ནི་ལྟ་བས་ན། །གཏི་མུག་རྒྱུན་ནི་སྤོང་བར་\nབྱེད། །གང་ཞིག་མིག་ཟད་མཐར་སྲེད་པ། །བྱང་ཆུབ་ཡེ་ཤེས་དག་ལ་གནས། །མིག་ཟད་མཐར་ནི་ལྟ་བས་ན། །བྱང་ཆུབ་ཡེ་ཤེས་རྒྱུན་མི་འཆད། །མིག་སྐྱེ་མཐའ་དང་མིག་གི་མཐའ། །འཇུག་པ་དང་ནི་རབ་\nདབེན་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>ཡོད་པ་ཉིད་དུ་མི་འགྱུར་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>མི་སྐྱེ་རབ་ཏུ་ཞི་བ་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>འདི་ལ་སོགས་པའི་སྒོ་རྣམས་<span class='delete'>ཀྱང། །</span><span class='add'>ཀྱང་། །</span>ཐམས་ཅད་མིག་ཟད་འདྲ་བར་བསྟན། །གང་ཞིག་མིག་ཟད་མཐར་སྲེད་པ། །དེ་ནི་རྟག་ཏུ་ཐེ་ཚོམ་མེད། །"
 ],
 [
  "79.265a",
  "དེ་ལྟར་ཐེ་ཚོམ་མེད་པའི་ཕྱིར། །སངས་རྒྱས་རྫུ་འཕྲུལ་ཐོབ་པར་འགྱུར། །གང་ཞིག་མིག་སྐྱེ་མཐའ་སྲེད་པ། །དེ་ནི་རྟག་ཏུ་ཐེ་ཚོམ་མེད། །དེ་ལྟར་ཐེ་ཚོམ་མེད་པའི་ཕྱིར། །སངས་རྒྱས་རྫུ་འཕྲུལ་འཐོབ་\nཔར་འགྱུར། །གང་ཞིག་མིག་གི་མཐའ་སྲིད་པ། །དེ་ནི་རྟག་ཏུ་ཐེ་ཚོམ་མེད། །དེ་ལྟར་ཐེ་ཚོམ་མེད་པའི་ཕྱིར། །སངས་རྒྱས་རྫུ་འཕྲུལ་འཐོབ་པར་འགྱུར། །གང་ཞིག་མིག་གི་འཇུག་སྲེད་པ། །དེ་ནི་རྟག་ཏུ་ཐེ་ཚོམ་མེད། །\nདེ་ལྟར་ཐེ་ཚོམ་མེད་པའི་ཕྱིར། །སངས་རྒྱས་རྫུ་འཕྲུལ་འཐོབ་པར་འགྱུར། །གང་ཞིག་མི་དབེན་རབ་སྲེད་པ། །དེ་ནི་རྟག་ཏུ་ཐེ་ཚོམ་མེད། །དེ་ལྟར་ཐེ་ཚོམ་མེད་པའི་ཕྱིར། །སངས་རྒྱས་རྫུ་འཕྲུལ་འཐོབ་\nཔར་འགྱུར། །གང་ཞིག་མིག་མི་སྐྱེ་སྲེད་པ། །དེ་ནི་རྟག་ཏུ་ཐེ་ཚོམ་མེད། །དེ་ལྟར་ཐེ་ཚོམ་མེད་པའི་ཕྱིར། །སངས་རྒྱས་རྫུ་འཕྲུལ་འཐོབ་པར་འགྱུར། །གང་ཞིག་མིག་མེད་ལ་སྲེད་པ། །དེ་ནི་རྟག་\nཏུ་ཐེ་ཚོམ་མེད། །དེ་ལྟར་ཐེ་ཚོམ་མེད་པའི་ཕྱིར། །སངས་རྒྱས་རྫུ་འཕྲུལ་འཐོབ་པར་འགྱུར། །གང་ཞིག་མིག་ཞི་ལ་སྲེད་པ། །དེ་ནི་རྟག་ཏུ་ཐེ་ཚོམ་མེད། །དེ་ལྟར་ཐེ་ཚོམ་མེད་པའི་ཕྱིར། །\nསངས་རྒྱས་རྫུ་འཕྲུལ་འཐོབ་པར་འགྱུར། །རྣ་བ་སྣ་ལྕེ་ལུས་དང་ཡིད། །གཟུགས་སྒྲ་དྲི་རོ་རེག་བྱ་ནས། །སྒྲ་དང་མིང་གི་བར་དུ་<span class='delete'>ཡང། །</span><span class='add'>ཡང་། །</span>ཐམས་ཅད་དེ་བཞིན་སྦྱར་བར་བྱ། །མིག་སྐྱེ་དཔག་\nམེད་གང་སྐྱེད་པ། །ཡེ་ཤེས་དཔག་མེད་སྐྱེད་པར་བྱེད། །ཡེ་ཤེས་དཔག་ཏུ་མེད་པའི་ཕྱིར། །ཆོས་འདི་བསྟན་པ་འང་དེ་བཞིན་ནོ། །མིག་ཟད་དཔག་མེད་གང་ཤེས་པ། །མིག་ལ་སྒྲིབ་པ་མེད་པར་\nའགྱུར། །དེ་ལྟར་<span class='delete'>སྒྲིག་</span><span class='add'>སྒྲིབ་</span>པ་མེད་པའི་ཕྱིར། །སངས་རྒྱས་མཁྱེན་པ་ཐོགས་མེད་འཐོབ། །རྣ་བ་སྣ་ལྕེ་ལུས་དང་ཡིད། །གཟུགས་སྒྲ་དྲི་རོ་རེག་བྱ་ནས། །སྒྲ་དང་མིང་གི་བར་དུ་<span class='delete'>ཡང། །</span><span class='add'>ཡང་། །</span>ཐམས་ཅད་དེ་བཞིན་སྦྱར་བར་བྱ། །བཅོམ་"
 ],
 [
  "79.266a",
  "ཆོས་ཟད་པ་ནི་མ་ཤེས་ཕྱིར། །རྟག་ཏུ་ཟག་བཅས་ཆོས་ལ་སྤྱོད། །སྦྱངས་པའི་ཆོས་ལ་གནས་གྱུར་ཀྱང། །མིག་ཟད་མཐའ་ཡི་ཤེས་མེད་ན། །མིག་ཟད་པ་ནི་མ་ཤེས་ཕྱིར། །ཡང་དག་སྦྱངས་ལ་གནས་པ་མིན། །ཁ་དོག་སྒྱུར་\nབའི་གོས་བགོས་<span class='delete'>ཀྱང། །</span><span class='add'>ཀྱང་། །</span>མིག་ཟད་མཐའ་ཡི་ཤེས་མེད་ན། །མིག་ཟད་པ་ནི་མ་ཤེས་ཕྱིར། །ཡང་དག་ཆོས་གོས་བགོས་མ་ཡིན། །ཡ་རབས་རིགས་སུ་སྐྱེས་གྱུར་<span class='delete'>ཀྱང། །</span><span class='add'>ཀྱང་། །</span>མིག་ཟད་མཐའ་ཡི་ཤེས་མེད་ན། །མིག་ཟད་པ་ནི་མ་ཤེས་ཕྱིར། །\nདེ་ནི་དག་པའི་རིགས་མ་ཡིན། །འཁོར་མང་དག་ནི་བདོག་གྱུར་<span class='delete'>ཀྱང། །</span><span class='add'>ཀྱང་། །</span>མིག་ཟད་མཐའ་ཡི་ཤེས་མེད་ན། །མྱུར་དུ་ངན་འགྲོར་ལྟུང་འགྱུར་ཏེ། །འཁོར་དག་གིས་ནི་སྐྱོབ་མི་ནུས། །སྒྲ་ཡི་རིག་པ་མཁས་གྱུར་<span class='delete'>ཀྱང། །</span><span class='add'>ཀྱང་། །</span>མིག་ཟད་མཐའ་ཡི་ཤེས་\nམེད་ན། །མིག་ཟད་པ་ནི་མ་ཤེས་ཕྱིར། །སྒྲ་ཡི་རིག་པ་རྟོགས་མ་ཡིན། །བཟོ་རྣམས་ལ་ནི་མཁས་གྱུར་<span class='delete'>ཀྱང། །</span><span class='add'>ཀྱང་། །</span>མིག་ཟད་མཐའ་ཡི་ཤེས་མེད་ན། །མིག་ཟད་པ་ནི་མ་ཤེས་ཕྱིར། །དེ་ནི་བཟོ་ལ་མཁས་མ་ཡིན། །འདྲི་བ་མང་ལ་\nམཁས་གྱུར་<span class='delete'>ཅིང། །</span><span class='add'>ཅིང་། །</span>ཡི་གེ་གཅིག་གིས་རྣམ་འབྱེད་<span class='delete'>ཀྱང། །</span><span class='add'>ཀྱང་། །</span>མིག་ཟད་མཐའ་ཡི་ཤེས་མེད་ན། །དེ་ནི་དོན་འཐུན་བཤད་མ་ཡིན། །མཁས་པའི་རྗེས་སུ་སློབ་བྱེད་<span class='delete'>ཀྱང། །</span><span class='add'>ཀྱང་། །</span>གསང་དང་གསང་མིན་མི་ཤེས་<span class='delete'>ཤིང། །</span><span class='add'>ཤིང་། །</span>མིག་ཟད་མཐའ་\nཡི་ཤེས་མེད་ན། །ཆོས་འདི་རྟོགས་པར་མི་འགྱུར་རོ། །རྗོད་པ་སྣ་ཚོགས་རྒྱང་པན་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>ཆོས་རྣམས་རབ་ཏུ་ཤེས་གྱུར་<span class='delete'>ཀྱང། །</span><span class='add'>ཀྱང་། །</span>མིག་ཟད་མཐའ་ཡི་ཤེས་མེད་ན། །འཁྲི་ཤིང་སྟུག་པོར་ལྷུང་བ་འདྲ། །སྒྲ་ཡི་རིག་པ་མཁས་གྱུར་<span class='delete'>ཅིང། །</span><span class='add'>ཅིང་། །</span>\nདགེ་དང་མི་དགེའི་རྟགས་སྟོན་དང་། །ཚིག་འབྲུ་ཡི་གེ་སྒྲ་སྐད་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>ཀློག་དང་འདོན་པའི་མཐར་ཐུག་<span class='delete'>ཀྱང། །</span><span class='add'>ཀྱང་། །</span>མིག་ཟད་མཐའ་ནི་མ་ཤེས་ན། །དེ་དག་རྣམས་ནི་ཤེས་མེད་ཡིན། །བུད་མེད་དག་གི་མཚན་མ་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>ཚིག་མཁན་\nརྨོངས་པར་བྱེད་པ་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>ལུས་མཉེས་ངལ་སོས་ཆོས་རྣམས་དང་། །མཁྱུད་དཔྱད་དག་ལ་མཁས་གྱུར་<span class='delete'>ཀྱང། །</span><span class='add'>ཀྱང་། །</span>མིག་ཟད་མཐའ་ནི་མ་ཤེས་ན། །དེ་དག་རྣམས་ནི་ཤེས་མེད་ཡིན། །གཞུང་ལུགས་བརྒྱ་མང་སྟོན་བྱེད་<span class='delete'>ཅིང། །</span><span class='add'>ཅིང་། །</span>ཡི་གེ་འབྲུ་གཅིག་"
 ],
 [
  "79.266b",
  "མི་བརྗེད་<span class='delete'>ཀྱང། །</span><span class='add'>ཀྱང་། །</span>མིག་ཟད་མཐའ་<span class='delete'>ན་</span><span class='add'>ནི་</span>མ་ཤེས་ན། །བཤད་པ་དེ་ནི་དོན་མེད་ཡིན། །དེ་བཞིན་མིག་སྐྱེ་མཐའ་དག་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>མིག་མཐའ་དང་ནི་འཇུག་པ་ནས། །རབ་ཏུ་ཞི་བའི་བར་དུ་<span class='delete'>ཡང། །</span><span class='add'>ཡང་། །</span>དེ་བཞིན་དུ་ནི་རིག་པར་གྱིས། །རྣ་བ་སྣ་ལྕེ་ལུས་དང་\nཡིད། །གཟུགས་སྒྲ་དྲི་རོ་རེག་བྱ་ནས། །སྒྲ་དང་མིང་གི་བར་དུ་<span class='delete'>ཡང། །</span><span class='add'>ཡང་། །</span>ཐམས་ཅད་དེ་བཞིན་སྦྱར་བར་བྱ། སྒྲ་ཡི་རིག་པ་ཀློག་འདོན་<span class='delete'>ཅིང། །</span><span class='add'>ཅིང་། །</span>དེ་ཡི་དོན་ནི་རྟོགས་<span class='delete'>སྒྱུར་</span><span class='add'>གྱུར་</span>ཀྱང། །མིག་ཟད་མཐའ་ནི་མ་ཤེས་ན། །དེ་ནི་ནམ་ཡང་དམན་པ་ཡིན། །སྨྲང་\nབཞི་དག་ནི་འདོན་བྱེད་ཅིང། །གསང་སྔགས་དག་ནི་རྟོགས་གྱུར་ཀྱང། །མིག་ཟད་མཐའ་ནི་མ་ཤེས་ན། །དེ་ནི་ནམ་ཡང་དམན་པ་ཡིན། །དེ་བཞིན་མིག་སྐྱེ་མཐའ་དག་དང། །མིག་གི་མཐའ་དང་འཇུག་པ་ནས། །རབ་ཏུ་ཞི་བའི་བར་དུ་\n<span class='delete'>ཡང། །</span><span class='add'>ཡང་། །</span>དེ་བཞིན་དུ་ནི་རིག་པར་གྱིས། །རྣ་བ་སྣ་ལྕེ་ལུས་དང་ཡིད། །གཟུགས་སྒྲ་དྲི་རོ་རེག་བྱ་ནས། །སྒྲ་དང་མིང་གི་བར་དུ་<span class='delete'>ཡང། །</span><span class='add'>ཡང་། །</span>ཐམས་ཅད་དེ་བཞིན་སྦྱར་བར་བྱ།། །།བམ་པོ་བཞི་པ། བཅོམ་ལྡན་གྲོང་ཁྱེར་\nགཤེགས་པའི་<span class='delete'>ཆེ། །</span><span class='add'>ཚེ། །</span>སེམས་ཅན་དག་ནི་<span class='delete'>ཆད་</span><span class='add'>ཚད་</span>མེད་སྙེད། །མཁའ་ལས་ཆོས་བསྟན་སྒྲ་ཐོས་པས། །མིག་ཟད་མཐའ་ཡི་ཤེས་པ་ཐོབ། །བཅོམ་ལྡན་གྲོང་ཁྱེར་གཤེགས་པའི་ཚེ། །སེམས་ཅན་དག་ནི་ཚད་མེད་སྙེད། །མཁའ་ལས་\nཆོས་བསྟན་སྒྲ་ཐོས་པས། །མིག་མི་རང་བཞིན་རྟོགས་པར་གྱུར། །<span class='delete'>སྟོད་</span><span class='add'>སྟོང་</span>དང་བདག་མེད་<span class='delete'>པར་</span><span class='add'>རབ་</span>རྟོགས་པས། །ཐམས་ཅད་རྣམ་དག་མིག་ཐོབ་འགྱུར། །རྣ་བ་སྣ་ལྕེ་ལུས་དང་ཡིད། །གཟུགས་སྒྲ་དྲི་རོ་རེག་བྱ་ནས། །སྒྲ་དང་མིང་གི་\nབར་དུ་ཡང། །ཐམས་ཅད་དེ་བཞིན་སྦྱར་བར་བྱ། །འདོད་སྡང་གཏི་མུག་ཁོང་ཁྲོ་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>ང་རྒྱལ་ཁེངས་དང་གཡོ་སྒྱུ་ནས། །བག་མེད་པ་ཡི་བར་དུ་<span class='delete'>ཡང། །</span><span class='add'>ཡང་། །</span>དེ་བཞིན་དུ་ནི་རིག་པར་གྱིས། །བཅོམ་ལྡན་གྲོང་ཁྱེར་གཤེགས་པའི་<span class='delete'>ཚེ། </span><span class='add'>ཚེ། །</span>\nསེམས་ཅན་དག་ནི་ཚད་མེད་སྙེད། །སྟེང་གི་ནམ་མཁའ་དག་ལས་ནི། །སངས་རྒྱས་མཚན་ནི་སྣ་ཚོགས་ཐོས། །ཁ་ཅིག་འདོད་ཆགས་འཇིགས་པ་ཡི། །དཔེ་ཟླ་མེད་པ་མིང་ཡང་<span class='delete'>ཐོས། </span><span class='add'>ཐོས། །</span>ཁ་ཅིག་ཞེ་སྡང་འཇིགས་བྱེད་<span class='delete'>ཅིང། །</span><span class='add'>ཅིང་། །</span>འཇིག་རྟེན་"
 ],
 [
  "79.267b",
  "པོ་རྣམས། །ཐམས་ཅད་རབ་ཏུ་དགའ་བ་སྐྱེས་པར་གྱུར། །བདུད་དང་བདུད་<span class='delete'>དབུར་</span><span class='add'>དཔུང་</span>གཡོ་སྒྱུ་རབ་བཅོམ་ནས། །ཐམས་ཅད་སངས་རྒྱས་བཀོད་པ་བསྒྲུབ་པར་མོས། །ལྷ་རྣམས་སོ་སོར་གཞལ་མེད་ཁང་ཞུགས་ནས། །ཕན་ཚུན་དགའ་བའི་གཏམ་ནི་འདི་སྐད་སྨྲས། །\nའདྲེན་པ་དེང་ནི་འཇིག་རྟེན་བྱུང་བས་ན། །ལྷ་མི་ཐམས་ཅད་ལ་ནི་ཕན་པ་མཛད། །ས་བླའི་ལྷ་འཁོར་གཞལ་མེད་ཁང་གནས་ནས། །དང་བའི་སེམས་ཀྱིས་དགའ་ནས་འདི་སྐད་དུ། །འདྲེན་པ་འཇིག་རྟེན་དེང་བྱུང་ཤིན་དུ་ལེགས། །འཇིག་རྟེན་ཀུན་བདེ་རྒྱུ་ནི་རབ་ཏུ་མཛད། །\nམཁའ་ལ་སྤྱོད་<span class='delete'>བའི་</span><span class='add'>པའི་</span>ལྷ་རྣམས་<span class='delete'>ད་</span><span class='add'>དེ་</span>ཐོས་ནས། །ཐམས་ཅད་དགའ་ནས་རབ་ཏུ་དང་བ་སྐྱེས། །ཁྱད་འཕགས་སྒྲ་སྙན་སངས་རྒྱས་བསྔགས་བརྗོད་ནས། །འདྲེན་<span class='delete'>བ་</span><span class='add'>པ་</span><span class='delete'>བས་</span><span class='add'></span>བྱུང་བས་འཇིག་རྟེན་ཕན་མཛད་ཟེར། །རྒྱལ་ཆེན་རིགས་བཞིའི་ལྷ་རྣམས་དེ་ཐོས་ནས། །ཐམས་ཅད་དགའ་ནས་\nཤིན་དུ་དང་བ་སྐྱེས། །ཁྱད་འཕགས་སྒྲ་སྙན་སངས་རྒྱས་བསྔགས་བརྗོད་ནས། །འདྲེན་པ་བྱུང་བས་འཇིག་རྟེན་ཕན་མཛད་ཟེར། །སུམ་བཅུ་རྩ་གསུམ་ལྷས་ནི་དེ་ཐོས་ནས། །ཐམས་ཅད་དགའ་ནས་ཤིན་དུ་དང་བ་སྐྱེས། །ཁྱད་འཕགས་སྒྲ་སྙན་སངས་རྒྱས་བསྔགས་\nབརྗོད་<span class='delete'>ནས། </span><span class='add'>ནས། །</span>འདྲེན་<span class='delete'>བ་</span><span class='add'>པ་</span>བྱུང་བས་འཇིག་རྟེན་ཕན་མཛད་ཟེར། །འཐབ་བྲལ་ལྷ་དག་དེ་སྐད་ཐོས་ནས་ནི། །ཐམས་ཅད་དགའ་ནས་ཤིན་དུ་དང་བ་སྐྱེས། །ཁྱད་འཕགས་སྒྲ་སྙན་སངས་རྒྱས་བསྔགས་བརྗོད་ནས། །འདྲེན་པ་བྱུང་ནས་འཇིག་རྟེན་ཕན་མཛད་ཟེར། །\nབདག་ཅག་བྱང་ཆུབ་སེམས་ནི་རབ་བསྐྱེད་ནས། །བཅོམ་ལྡན་བླ་མེད་མཁྱེན་<span class='delete'>བ་</span><span class='add'>པ་</span>ཉེ་བར་བགྱི། །ལྷ་མིའི་གཙོ་མཆོག་ལ་ནི་བརྟེན་ནས་སུ། །སེམས་ཅན་ཐམས་ཅད་སྒྲོལ་བར་བགྱིད་ཅེས་ཟེར། །དགའ་ལྡན་ལྷ་རྣམས་དེ་སྐད་ཐོས་ནས་ཀྱང། །ཐམས་ཅད་\nདགའ་ནས་ཤིན་དུ་དང་བ་སྐྱེས། །ཁྱད་འཕགས་<span class='delete'>ས་</span><span class='add'></span>སྒྲ་སྙན་སངས་རྒྱས་བསྔགས་བརྗོད་ནས། །འདྲེན་པ་བྱུང་བས་འཇིག་རྟེན་ཕན་མཛད་ཟེར། །བཅོམ་ལྡན་འདས་ཀྱིས་བསྐལ་པ་བྱེ་བར་ནི། །སྤྱོད་མཆོག་ཁྱད་འཕགས་\nམེད་མངོན་བསྒྲུབས་ནས་ནི། །སེམས་ཅན་སྡུག་བསྔལ་བ་ལ་བདེ་ལམ་བསྟན། །འཁོར་བ་བསྒྲལ་ནས་མྱ་ངན་འདས་ལ་བཀོད། །འཕྲུལ་དགའི་ལྷ་རྣམས་དེ་སྐད་ཐོས་ནས་ནི། །ཐམས་ཅད་དགའ་ནས་ཤིན་དུ་དང་བ་སྐྱེས། །ཁྱད་འཕགས་"
 ],
 [
  "79.268a",
  "སྒྲ་སྙན་སངས་རྒྱས་བསྔགས་བརྗོད་ནས། །<span class='delete'>འདྲེ་</span><span class='add'>འདྲེ</span><span class='delete'>ནི་</span><span class='add'>ན་</span><span class='delete'>བ་</span><span class='add'>པ་</span>བྱུང་བས་འཇིག་རྟེན་ཕན་མཛད་ཟེར། །གཞན་འཕྲུལ་དབང་བྱེད་ལྷས་ནི་དེ་ཐོས་ནས། །ཐམས་ཅད་དགའ་ནས་ཤིན་དུ་<span class='delete'>ངང་</span><span class='add'>དང་</span>བ་སྐྱེས། །ཁྱད་འཕགས་སྒྲ་སྙན་སངས་རྒྱས་བསྔགས་བརྗོད་ནས། །\nའདྲེན་པ་བྱུང་ནས་འཇིག་རྟེན་ཕན་མཛད་ཟེར། །དེ་བཞིན་གཤེགས་པ་སྐྱེ་ཤི་འདས་པས་ན། །བདུད་དང་མུ་སྟེགས་མང་པོ་ཕམ་<span class='delete'>བར་</span><span class='add'>པར་</span>མཛད། །བླ་མེད་བྱང་ཆུབ་དག་ནི་ཡོངས་རྫོགས་ནས། །སྐྱེ་དགུ་དྲངས་ནས་ཕ་རོལ་འཇོག་ཅེས་ཟེར། །ཚངས་རིས་\nལྷ་རྣམས་དེ་སྐད་ཐོས་ནས་ཀྱང། །ཐམས་ཅད་དགའ་ནས་ཤིན་དུ་<span class='delete'>ངང་</span><span class='add'>དང་</span>བ་སྐྱེས། །ཁྱད་འཕགས་སྒྲ་སྙན་སངས་རྒྱས་བསྔགས་བརྗོད་ནས། །འདྲེན་པ་བྱུང་བས་འཇིག་རྟེན་ཕན་མཛད་ཟེར། །<span class='delete'>བདེ་</span><span class='add'>དེ་</span>བཞིན་གཅིག་ནས་གཅིག་ཏུ་སྒྲ་ཐོས་པས། །\nཚངས་པའི་འཁོར་རྣམས་དགའ་ནས་འདི་སྐད་དུ། །འདྲེན་པ་བྱུང་བས་འཇིག་རྟེན་ཕན་པ་མཛད། །<span class='delete'>བདུག་</span><span class='add'>བདུད་</span>དཔུང་འཇིགས་སྐྲག་མྱ་ངན་བྱེད་ཅེས་ཟེར། །སྲིད་<span class='delete'>བའི་</span><span class='add'>པའི་</span>རྩེ་མོའི་ལྷ་ཡི་བར་དུ་ཡང། །སངས་རྒྱས་བྱུང་ནས་འཇིག་རྟེན་ཕན་མཛད་<span class='delete'>ཐོས། </span><span class='add'>ཐོས། །</span>\nདེ་བཞིན་སྒྲ་ནི་ཀུན་དུ་གྲགས་པས་ན། །ལྷ་མ་ཡིན་དག་འགྲིབས་ཤིང་ལྷ་རྣམས་འཕེལ། །བདུད་ཀྱི་ཁང་པ་དག་ནི་ཡོངས་སྟོངས་ཤིང། །ལྷ་རྣམས་འཁོར་ནི་རབ་ཏུ་རྒྱས་པར་གྱུར། །མི་འཇིགས་སྟོབས་ཀྱིས་ལོག་པ་རབ་བཏུལ་ནས། །\nབྱང་ཆུབ་ཆེན་པོ་མཆོག་ནི་མྱུར་དུ་བརྙེས། །དེ་བཞིན་སྐད་ཅིག་ཡུད་ཙམ་ལྷ་རྣམས་ཀྱིས། །བཅོམ་ལྡན་བྱུང་ནས་ཕན་མཛད་ཐོས་གྱུར་ནས། །འཇིག་རྟེན་འདྲེན་པར་མཛད་པ་ཤིན་དུ་ལེགས། །རྣམ་དག་མིག་ནི་སེམས་ཅན་སྦྱིན་ཞེས་\nཟེར། །བཅོམ་ལྡན་གྲོང་ཁྱེར་གཤེགས་པའི་ཚེ། །འདོད་པས་ཡོངས་སུ་གདུངས་པ་རྣམས། །མི་གཙང་བསྒོམ་པ་བཤད་ཐོས་པས། །འདོད་ཆགས་ཞི་སྟེ་མ་ལུས་སྤངས། །བཅོམ་ལྡན་གྲོང་ཁྱེར་གཤེགས་པའི་ཚེ། །ཞེ་སྡང་དག་གིས་གདུངས་\nབ་རྣམས། །བྱམས་པ་བསྟན་པའི་ཆོས་ཐོས་པས། །ཞེ་སྡང་ཞི་སྟེ་མ་ལུས་སྤངས། །བཅོམ་ལྡན་གྲོང་ཁྱེར་གཤེགས་པའི་ཚེ། །གཏི་མུག་དག་གི་གདུངས་པ་རྣམས། །ཤེས་རབ་ཆོས་ནི་བསྟན་ཐོས་པས། །གཏི་མུག་ཞི་སྟེ་མ་ལུས་སྤངས། །"
 ],
 [
  "79.269a",
  "ཅིང་མཚན་མེད་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>ཅི་ཡང་མེད་པའི་སྒྲ་ཡང་ཐོས། །གཞན་ཡང་སེམས་ཅན་བརྒྱ་སྟོང་དག །མཁའ་ལས་ཤ་དང་ཤེས་རབ་སྤྱན། །དེ་བཞིན་ཆོས་ཀྱི་སྤྱན་བར་དུ། །ཡང་དག་སྟོན་པའི་སྒྲ་ཡང་ཐོས། །བཅོམ་ལྡན་རྫུ་འཕྲུལ་སྟོབས་\nཀྱིས་ནི། །ཚུལ་ཁྲིམས་ཏིང་འཛིན་ཤེས་རབ་སྒྲ། །རྣམ་གྲོལ་རྣམ་གྲོལ་མཐོང་བའི་སྒྲ། །སྟོན་པ་དག་ཀྱང་ཐོས་པར་གྱུར། །སེམས་ཅན་དག་ནི་<span class='delete'>ཇེ་</span><span class='add'>ཇི་</span>སྙེད་ལ། །ཇི་བཞིན་རྫུ་འཕྲུལ་རབ་བསྟན་ནས། །ཇི་ལྟར་རྗེས་འཐུན་སྒྲ་<span class='delete'>སྐང་</span><span class='add'>སྐད་</span>ཀྱིས། །ཡང་དག་ཆོས་\nནི་བསྟན་པར་མཛད། །སེམས་ཅན་ལ་ལ་གང་ཞིག་ནི། །སྦྱིན་དང་ཚུལ་ཁྲིམས་བཟོད་བསྒྲུབ་མོས། །རྫུ་འཕྲུལ་མོས་པ་ཇི་ལྟ་བཞིན། །སྦྱིན་དང་ཚུལ་ཁྲིམས་བཟོད་སྒྲ་སྟོན། །བཅོམ་ལྡན་རྫུ་འཕྲུལ་སྟོབས་ཀྱིས་ནི། །སེམས་ཅན་དབང་\nཔོ་ཇི་ལྟ་བཞིན། །རྒྱ་ཆེར་ཡང་དག་འབྱེད་མཛད་པས། །<span class='delete'>ལིན་</span><span class='add'>ལེན་</span>འཛིན་སྟོན་ལ་དགོད་པར་མཛད། །བཅོམ་ལྡན་རྫུ་འཕྲུལ་སྟོབས་ཀྱིས་ནི། །ཕུང་པོ་ཁམས་དང་སྐྱེ་མཆེད་ཀྱི། །བཅིངས་དང་གྲོལ་དང་ཉེ་རིང་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>ས་ཡི་གནས་སྐབས་བྱེ་བྲག་གི། །མཚན་\nཉིད་སྟོན་པ་ཐོས་པར་གྱུར། །གཞན་ཡང་ས་དང་ཡེ་ཤེས་ཀྱི། །འོད་ཟེར་ཚད་མེད་སྟོན་པ་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>ཉོན་མོངས་བག་ཆགས་སྤངས་པ་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>སྤངས་མིན་སྟོན་པ་ཐོས་པར་གྱུར། །བཅོམ་ལྡན་རྫུ་འཕྲུལ་སྟོབས་ཀྱིས་ནི། །ལྷ་དང་མི་ཡི་ངོ་བོ་ཉིད། །ལས་དང་\nའབྲས་བུ་མི་མཚུངས་མི། །སྐྱེ་ལེན་ཐ་དད་ཐོས་པར་གྱུར། །རེས་འགའ་བུད་མེད་མདུན་དག་ཏུ། །བུད་མེད་བརྒྱན་པའི་ལུས་སྤྲུལ་ནས། །མཁའ་ལས་སྐྱོ་སྟོན་སྒྲ་བསྒྲགས་པས། །གང་ཐོས་འདོད་ཆགས་སེལ་བར་མཛད། །ཤཱ་རིའི་བུ་ནི་ཇི་ལྟ་བཞིན། །ཤིན་ཏུ་<span class='delete'>རང་</span><span class='add'>དང་</span>\nབ་སྐྱེས་གྱུར་པ། །ཐུགས་རྗེས་མོས་པ་ཇི་བཞིན་དུ། །བླ་མེད་ཆོས་ནི་སྟོན་པར་མཛད། །མཽང་གལ་བུ་དང་འོད་སྲུང་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>ཀ་པི་ན་དང་ཀུན་དགའ་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>འོད་སྲུང་ཆེན་པོ་དག་དང་ནི། །ཀུན་ཤེས་<span class='delete'>ཀཽད་</span><span class='add'>ཀཽདི</span><span class='delete'>ནྱི་</span><span class='add'>་ནྱ་</span>ལ་སོགས། །དེ་དག་མོས་པ་ཇི་བཞིན་དུ། །ཉན་ཐོས་ཆོས་སྟོན་ཐོས་\nཔར་གྱུར། །ལྷ་རྣམས་དང་ནི་ལྷ་མ་ཡིན། །གནོད་སྦྱིན་དག་ནི་མང་པོ་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>བེ་རོ་ཀ་ནི་འཁོར་བཅས་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>གྲུལ་བུམ་དག་ནི་ཚད་མེད་རྣམས། །བཅོམ་ལྡན་རྫུ་འཕྲུལ་སྟོབས་ཀྱིས་ནི། །གཟུངས་སྔགས་སྒྲ་ནི་ཐོས་པར་གྱུར། །ཨི་དི་སི། བི་དི་སི། <span class='delete'>ཨི་</span><span class='add'>ཨི</span>ར་སུ་"
 ],
 [
  "79.268b",
  "བཅོམ་ལྡན་གྲོང་ཁྱེར་གཤེགས་པའི་ཚེ། །ང་རྒྱལ་དག་གིས་གདུངས་<span class='delete'>པ་</span><span class='add'>པ་</span>རྣམས། །ང་རྒྱལ་སྤངས་པའི་ཆོས་ཐོས་པས། །ང་རྒྱལ་ཞི་སྟེ་མ་ལུས་སྤངས། །བཅོམ་ལྡན་གྲོང་ཁྱེར་གཤེགས་པའི་ཚེ། །ཕྲག་དོག་དག་གིས་གདུངས་<span class='delete'>པ་</span><span class='add'>པ་</span>རྣམས། །ཕྲག་<span class='delete'>\n</span><span class='add'>\n</span>དོག་སྤངས་པའི་ཆོས་ཐོས་པས། །ཕྲག་དོག་ཞི་སྟེ་མ་ལུས་སྤངས། །བཅོམ་ལྡན་གྲོང་ཁྱེར་གཤེགས་པའི་ཚེ། །ཁོང་ཁྲོ་དག་གིས་གདུངས་<span class='delete'>པ་</span><span class='add'>པ་</span>རྣམས། །ཁོང་ཁྲོ་སྤངས་པའི་ཆོས་ཐོས་<span class='delete'>བས། །</span><span class='add'>པས། །</span>ཁོང་ཁྲོ་ཞི་སྟེ་མ་ལུས་སྤངས། །བཅོམ་ལྡན་གྲོང་\nཁྱེར་གཤེགས་པའི་ཚེ། །སེར་སྣ་དག་གིས་གདུངས་<span class='delete'>པ་</span><span class='add'>པ་</span>རྣམས། །སེར་སྣ་སྤངས་པའི་ཆོས་ཐོས་པས། །སེར་སྣ་ཞི་སྟེ་མ་ལུས་སྤངས། །གང་ཞིག་དུལ་བའི་སྤྱོད་གྲུབ་པ། །དཔག་མེད་ཆོས་ནི་འདི་ཐོས་<span class='delete'>པས། །</span><span class='add'>པས། །</span>མང་དུ་ཐོས་པའི་\nམཚོར་ཞུགས་ནས། །ཀུན་འཛིན་སྒོ་ནི་སྒྲུབ་པར་བྱེད། །གཞན་ཡང་མཁའ་ལས་སྒྲ་ཐོས་པས། །མེ་ཏོག་དག་གིས་སངས་རྒྱས་མཆོད། །ཡོན་ཏན་ཁྱད་པར་འཕགས་སྒྲུབ་ཅིང། །སྙིང་རྗེ་ཆེན་པོའི་རྫུ་འཕྲུལ་སྟོན། །གཞན་ཡང་\nམཁའ་ལས་སྒྲ་ཐོས་པས། །བཅོམ་ལྡན་སྐུ་དང་སྐྱེ་གནས་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>གདུད་རྒྱུད་དང་ནི་གསུང་སྒྲ་རྣམས། །ཁྱད་པར་འཕགས་པའི་བསྔགས་པ་བརྗོད། །སེམས་ཅན་འགྲོ་བ་ཇི་ལྟ་བར། །རྫུ་འཕྲུལ་དག་ཀྱང་ཅི་རིགས་བཤད། །མིག་དང་རྣ་བ་\nསྣ་ལྕེ་ལུས། །གཟུགས་དང་སྒྲ་ལ་སོགས་པ་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>བསྐུམ་པ་དང་ནི་<span class='delete'>བརྐྱང་</span><span class='add'>བཀྱང་</span>བ་<span class='delete'>བདག། །</span><span class='add'>དག །</span>སྟོན་པར་མཛད་པ་ཁྱད་པར་འཕགས། །བཅོམ་ལྡན་འཇིག་རྟེན་འདས་པས་ན། །འཇིག་རྟེན་སྒྲོན་མ་རབ་མཛད་<span class='delete'>ཅིང། །</span><span class='add'>ཅིང་། །</span>གཟུགས་ནི་མང་པོ་སྟོན་པ་<span class='delete'>ཡང། །</span><span class='add'>ཡང་། །</span>\nཐམས་ཅད་སངས་རྒྱས་རྫུ་འཕྲུལ་ཡིན། །སྣོད་དང་སྣོད་མིན་དེ་རྗེས་སུ། །མི་མཐུན་ཆོས་ནི་སྟོན་མཛད་པས། །སེམས་ཅན་ཚེ་རབས་ཚད་མེད་ནས། །སངས་རྒྱས་མཆོད་པ་མ་བྱས་<span class='delete'>ཤིང། །</span><span class='add'>ཤིང་། །</span>དམུ་རྒོད་གདུལ་བར་དཀའ་བ་ལ། །སེམས་ཅན་\nདམྱལ་བར་བཤད་པས་མཛད། །གང་ཞིག་ལས་ལམ་རྨོངས་གྱུར་<span class='delete'>ཅིང། །</span><span class='add'>ཅིང་། །</span>ལྟ་ལ་བརྟེན་ནས་སྤྲོས་དགའ་བ། བཅོམ་ལྡན་དེ་དག་ལྟ་བ་<span class='delete'>དང། </span><span class='add'>དང་། །</span>སྤྲོས་པ་ཞི་བའི་སྒྲ་ཐོས་མཛད། །གཞན་ཡང་མཁའ་ལས་ངོ་བོ་ཉིད། །ངེས་པ་ཉིད་དུ་སྟོང་བ་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>འགྲོ་<span class='delete'>འོད་</span><span class='add'>འོང་</span>མེད་"
 ],
 [
  "79.269b",
  "ཨི་ར། ཨཽ་ན་སི། །མ་ནི་སི། ཨུ་ཁྱི། ཨ་ནོ་ཁྱི། ཨཱ་ཁི་ཙ་ལ་མང་ནཾ་ཡེ། <span class='delete'>ངར་</span><span class='add'>ང་ར་</span>ནི་<span class='delete'>ཤ་</span><span class='add'>ཤྠ་</span><span class='delete'>ཐ་</span><span class='add'></span>ནི་མི། ཏ་ཀ་ནི། ཨེ་མི་མན་ཏྲ། ནི་ཧ་ར། ཨ་བུ་རེ། བྷཱུད་དྷེ། ནི་རེ། ཨ་ཁི་ཚ་ར། བི་ཡ་ཀི་རི་ཡ་ཏེ། ཨ་ཁི་ཚར་བར་མཱི་ཏེ། ཀ་ལཱ་བ་ཧི་ནི། <span class='delete'>ས་</span><span class='add'>ས</span>རྦོ་<span class='delete'>བི་</span><span class='add'>བི</span><span class='delete'>ད་</span><span class='add'>ད་</span>ཤི་ནིར་དྷེ་པཽན། པ་ར་<span class='delete'>ཤས་</span><span class='add'>ཤ་ས་</span>ད་ཏེ། ཤ་སཱ་ཏ། བྷ་ར་ཤ་སད་ཏ། \nཏ་ར་སད་ཏ། བྷཱུ་མི། ཨཱ་མ་བྷ་ར། ལི་ལ་བྷན། ཤི་<span class='delete'>ཅི་</span><span class='add'>ཙི་</span><span class='delete'>ཙི་</span><span class='add'>ཙི</span><span class='delete'>དང། </span><span class='add'>ད་ཏ། </span>བི་བ་མ་ཏི། ཙིད་ཏ་ཨ་ནན་ཏ། ཨོ་བེ་ར་ཧ་བ་མཱི་ཏ་བྷཱུ་མི། ན་ནམ་ཀཱ་ནི། ཨ་ཀ་ནི་བི་བྷི་མིད་ཏ། ཤ་རི་བེ་<span class='delete'>ཤ་</span><span class='add'>ཤྠ</span><span class='delete'>ཐ། </span><span class='add'>། </span>ཨ་མ་ལ་ནི་མ་ལཱ། བཱུ་ལི་ཏེ་ན་ར་ཤི་ཙ། ཧ་ཧ་རི། མ་མ་ལཱི། བྷ་ར་ནི་<span class='delete'>ཏི་</span><span class='add'>ཏི</span><span class='delete'>ཤ་</span><span class='add'>ཤྠ</span><span class='delete'>ཐ། </span><span class='add'>། </span><span class='delete'>ཙ་</span><span class='add'>ཙ</span>ཀྵུ་ནི་ཧ་ར། ཨཱུ་དྷ་རི་ཏ་པ་ཙི། ཨཱན་\nཏ་རི། ཀེ་ཏུ་སུ་ཀེ་ཏུ་སུ་པ་རི་ནི། ཀ་རི་ནི། སུ་སུ་མ་ནི་ཡཻ། ཀ་ཀ་རི། ཀ་ཁཱ་རི། ཨུ་པ་ལ་མཱུ་རི། <span class='delete'>ཏི་</span><span class='add'>ཏི</span><span class='delete'>ཤ་</span><span class='add'>ཤྠ</span><span class='delete'>ཐད་</span><span class='add'>ད་</span>རི་ན། <span class='delete'>ནག་</span><span class='add'>ན་ག་</span>ནིར་ཧ་རེ། པར་བྷད་ཏེ། ཨཱ་ཏེ་པ་ར་ཡ་ཏེ། ཨཱན་<span class='delete'>ཏར་</span><span class='add'>ཏ་ར་</span>བྷན་དྷེ། ཨཱན་ཏ་ར་ཏ་བྷ་ཏི་ཤི་ཙ། ཧ་སཱི་རི་མ་ཁ་ལཱི། ཨཱི་ནི་སམ་བྷ་རེ། <span class='delete'>ཏི་</span><span class='add'>ཏི</span><span class='delete'>ཤཐ་</span><span class='add'>ཤྠ་</span>སིཏྟ་ར་ནི། \nཀུ་བྷུ་ལོ་ཙ་ཏེ། གཞན་ཡང་རྒྱལ་པོ་རྣམ་ཐོས་<span class='delete'>བུ། </span><span class='add'>བུ། །</span>ཡུལ་འཁོར་སྲུང་ནི་ལ་སོགས་<span class='delete'>པས། </span><span class='add'>པས། །</span>ཁྱད་འཕགས་སྒྲ་ནི་གྲངས་མེད་ཀྱིས། །བདེན་པའི་སྔགས་ཚིགས་རབ་ཏུ་སྨྲས། །ཚད་མེད་སྒྲ་ནི་དེ་དག་<span class='delete'>ཀྱང། །</span><span class='add'>ཀྱང་། །</span>བདེ་གཤེགས་རྫུ་འཕྲུལ་དབང་གིས་<span class='delete'>བྱུང། །</span><span class='add'>བྱུང་། །</span>\nརྫུ་འཕྲུལ་དག་ནི་ཚད་མེད་པས། །བསྟན་པ་དག་ཀྱང་ཚད་མེད་པས། །རེས་འགའ་སངས་རྒྱས་མེད་ཞིང་དུ། །རྫུ་འཕྲུལ་རོལ་པའི་སྟོབས་དག་གིས། །འཁོར་བསྐོར་སངས་རྒྱས་སྐུ་སྟོན་པ། །ད་ལྟར་མཐོང་བ་ཇི་བཞིན་<span class='delete'>ནོ། </span><span class='add'>ནོ། །</span>བསམ་གྱིས་མི་ཁྱབ་\nཞིང་དག་ཏུ། །སྤྲུལ་པ་ཚད་མེད་སྟོན་མཛད་པས། །བལྟམ་ནས་གོམ་པ་བདུན་གཤེགས་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>རྒྱལ་སྲིད་སྤངས་ནས་རབ་བྱུང་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>བྱང་ཆུབ་སྙིང་པོར་སངས་རྒྱས་ནས། །བརྙེས་པའི་ཆོས་དག་རབ་དགོངས་ཏེ། །ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་མཛད་<span class='delete'>དང། </span><span class='add'>དང་། །</span>\nམྱ་ངན་འདས་པ་སྟོན་<span class='delete'>པར་</span><span class='add'>པར་</span>མཛད། །རྫུ་འཕྲུལ་གྱི་ནི་སྟོབས་དག་གིས། །སྣ་ཚོགས་ཆོས་ནི་སྟོན་མཛད་པས། །སེམས་ཅན་དག་ནི་ཚད་མེད་རྣམས། །ཁྱད་འཕགས་ཡེ་ཤེས་གྲུབ་པར་མཛད། །དེ་ཚེ་ཐུགས་རྗེ་ཆེན་པོ་ཡིན། །ཚངས་པའི་འཁོར་གྱིས་\nཡོངས་བསྐོར་ནས། །བྱམས་ཆོས་བསྒོམ་པ་བཤད་བསྟན་པས། །བྱམས་པའི་སེམས་ནི་འཕེལ་བར་མཛད། །དེ་ཚེ་ཐུགས་རྗེ་ཆེན་པོ་ཡིས། །ལྷ་རྣམས་ཀྱིས་ནི་ཡོངས་བསྐོར་ནས། །བསྡུ་བའི་དངོས་བཞི་བསྟན་མཛད་པས། །བསྡུ་བའི་"
 ],
 [
  "79.265b",
  "ལྡན་གྲོང་ཁྱེར་གཤེགས་པའི་ཚེ། །སེམས་ཅན་དག་ནི་བརྒྱ་སྟོང་སྙེད། །མཁའ་ལས་ཆོས་བཤད་སྒྲ་ཐོས་པས། །སངས་རྒྱས་ཡོན་ཏན་ཐེ་ཚོམ་མེད། །ཁ་ཅིག་འདོད་ཆགས་སེམས་བྱུང་<span class='delete'>ཡང། །</span><span class='add'>ཡང་། །</span>སངས་རྒྱས་\nཡེ་ཤེས་འཇིགས་མི་<span class='delete'>བྱེད། </span><span class='add'>བྱེད། །</span>གང་ཞིག་འདོད་ཆགས་སེམས་བྱུང་<span class='delete'>ཡང། །</span><span class='add'>ཡང་། །</span>སངས་རྒྱས་ཡོན་ཏན་<span class='delete'>སྟོང་</span><span class='add'>སྟོར་</span>མ་<span class='delete'>གྱུར། </span><span class='add'>གྱུར། །</span>ཁ་ཅིག་འདོད་ཆགས་སེམས་བྱུང་<span class='delete'>ཡང། །</span><span class='add'>ཡང་། །</span>བླ་མེད་ཡེ་ཤེས་ཚོལ་བྱེད་<span class='delete'>ཅིང། །</span><span class='add'>ཅིང་། །</span>མ་འདྲེས་ཆོས་ནི་\nབསྒྲུབ་པ་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>ཉན་ཐོས་ཐེག་པ་མོས་མི་བྱེད། །བྱིས་པ་བསམ་གཏན་སྒོམ་བྱེད་<span class='delete'>ཀྱང། །</span><span class='add'>ཀྱང་། །</span>བསམ་གཏན་བདེ་ལ་མོས་པས་ན། །མངོན་<span class='delete'>པའི་</span><span class='add'>པའི་</span>ང་རྒྱལ་རབ་བསྐྱེད་ནས། །དགེ་སྦྱོང་འབྲས་བུ་ཐོབ་སྙམ་སེམས། །\nབྱིས་པ་བསམ་གཏན་སྒོམ་བྱེད་<span class='delete'>ཀྱང། །</span><span class='add'>ཀྱང་། །</span>མི་ཟད་མཐའ་ཡི་ཤེས་མེད་ན། །བསྐལ་པ་བརྒྱ་སྟོང་སྒོམ་བྱེད་<span class='delete'>ཀྱང། །</span><span class='add'>ཀྱང་། །</span>དེ་ལ་རྣམ་གྲོལ་ཅི་ཡང་མེད། །སྐྱེ་བ་ལེན་པ་ཐམས་ཅད་ནི། །དེ་ལ་ཞེན་ཆགས་སྐྱེད་པར་བྱེད། །\nགལ་ཏེ་སྐྱེ་ཉིད་སྟོང་རིག་ན། །མཐོང་བ་རྣམས་ནི་རྣམ་དག་འགྱུར། །གང་ཞིག་བསམ་གཏན་བཞི་བསྒྲུབས་<span class='delete'>ཀྱང། །</span><span class='add'>ཀྱང་། །</span>མིག་ཟད་མཐའ་ཤེས་མེད་གྱུར་ན། །བསྐལ་པ་བརྒྱ་སྟོང་ལོན་ཡང་ནི། །བསམ་གཏན་ཡོངས་\nསུ་དག་མི་འགྱུར། །གང་ཞིག་<span class='delete'>ཉེད་</span><span class='add'>ཉེར་</span>བསྔོགས་ཐོབ་གྱུར་<span class='delete'>ཀྱང། །</span><span class='add'>ཀྱང་། །</span>ཟད་མཐའ་ཤེས་པ་འཐོབ་མི་འགྱུར། །ཟད་པ་ཐོས་པ་མ་ཤེས་ཕྱིར། །ཟག་པ་ཐོབ་ལ་རྟག་ཏུ་སྤྱོད། །གང་ཞིག་འདུ་ཤེས་ཞེན་བྱེད་པ། །འདུ་ཤེས་ཟད་མཐའི་ཤེས་\nཔ་མེད། །འདུ་ཤེས་ཟད་པ་མ་ཤེས་ཕྱིར། །རྟག་ཏུ་འདུ་ཤེས་ཟག་ལ་སྤྱོད། །གང་ཞིག་འཇིག་རྟེན་ཞེན་ཆགས་པ། །འཇིག་རྟེན་ཟད་མཐའ་ཤེས་པ་མེད། །འཇིག་རྟེན་ཟད་མཐའ་མ་ཤེས་ཕྱིར། །རྟག་ཏུ་འཇིག་རྟེན་ཟག་ལ་\nསྤྱོད། །གང་ཞིག་ཟག་བཅས་སེམས་ལ་གནས། །སེམས་ཟད་མཐའ་ཡི་ཤེས་པ་མེད། །སེམས་ཟད་པ་ནི་མ་ཤེས་ཕྱིར། །རྟག་ཏུ་སེམས་ནི་ཟག་ལ་སྤྱོད། །གང་ཞིག་ཟག་བཅས་ཆོས་ལ་གནས། །ཆོས་ཟད་མཐའ་ཡི་ཤེས་པ་མེད། །"
 ],
 [
  "79.267a",
  "ཕན་འདོགས་མིང་དག་ཐོས། །ཁ་ཅིག་གཏི་མུག་རབ་རྟོགས་<span class='delete'>ཤིང། །</span><span class='add'>ཤིང་། །</span>ང་རྒྱལ་འདུལ་བའི་མིང་དག་ཐོས། །ཁ་ཅིག་འཇིག་རྟེན་དག་ལ་ནི། །རབ་ཞི་སྟོན་པའི་འདྲེན་མིང་ཐོས། །ཁ་ཅིག་ཤེས་རབ་དག་བསྟན་ནས། །\nའཇིག་རྟེན་ཕན་འདོགས་མིང་དག་ཐོས། །ཁ་ཅིག་ཐབས་དག་རབ་བསྟན་ནས། །སེམས་ཅན་ཕན་འདོགས་མིང་དག་ཐོས། །ཁ་ཅིག་བདུད་ནི་རབ་བཏུལ་ཀྱང། །འཁོན་འཛིན་མེད་པའི་མིང་དག་ཐོས། །ཁ་ཅིག་གསུང་རབ་ཆོས་དག་གིས། །\nརྣམ་གྲོལ་བསྟན་པའི་མིང་དག་ཐོས། །ཁ་ཅིག་སེམས་ཅན་སྡུག་བསྔལ་བ། །རྒྱ་ཆེར་སྒྲོལ་བའི་མིང་དག་ཐོས། །ཁ་ཅིག་མི་ཡི་གཙོ་བོ་ཡིས། །འཇིག་རྟེན་སྒྲོལ་བའི་མིང་དག་ཐོས། །མིང་ནི་དེ་དག་ཐོས་གྱུར་ན། །ཐམས་ཅད་\nརྣམ་དག་མིག་ཐོབ་གྱུར། །ནམ་མཁའ་དང་ནི་རྒྱ་མཚོའི་ཆུ། །རི་རབ་ལྷུན་པོའི་བར་དུ་<span class='delete'>ཡང། །</span><span class='add'>ཡང་། །</span>ཐམས་ཅད་གཞལ་དུ་རུང་སྲིད་ཀྱི། །སངས་རྒྱས་མཁྱེན་པ་ཐུབ་མི་འགྱུར། །གང་ཞིག་མི་བཟད་<span class='delete'>དེས་</span><span class='add'>ངེས་</span>པ་ཐོབ་གྱུར་ན། །ཆོས་སྐུ་\nམངོན་<span class='delete'>བར་</span><span class='add'>པར་</span>འགྲུབ་པ་དཀའ་མི་འགྱུར། །གང་ཞིག་ཆོས་སྐུ་མཆོག་ནི་གྲུབ་གྱུར་ན། །ཀུན་འཛིན་ཡེ་ཤེས་དཔག་མེད་ཐོབ་པར་འགྱུར། །གང་ཞིག་ཀུན་འཛིན་ཡེ་ཤེས་དཔག་མེད་ཐོབ། །དེས་ནི་<span class='delete'>མོད་</span><span class='add'>མདོ་</span>སྡེ་དཔག་མེད་གོ་བར་འགྱུར། །\nགང་ཞིག་མདོ་སྡེ་དཔག་མེད་གོ་གྱུར་པས། །སངས་རྒྱས་རྫུ་འཕྲུལ་འཐོབ་པ་དཀའ་མི་འགྱུར། །གང་ཞིག་མིག་སྐྱེ་<span class='delete'>དེས་</span><span class='add'>ངེས་</span>པ་ཐོབ་གྱུར་ན། །ཆོས་སྐུ་མངོན་པར་<span class='delete'>འགྲུབ་</span><span class='add'>འགྲུབ་པ་</span>དཀའ་མི་འགྱུར། །གང་ཞིག་ཆོས་སྐུ་མཆོག་ནི་གྲུབ་གྱུར་ན། །\nཀུན་འཛིན་ཡེ་ཤེས་དཔག་མེད་འཐོབ་<span class='delete'>བར་</span><span class='add'>པར་</span>འགྱུར། །གང་ཞིག་ཀུན་འཛིན་ཡེ་ཤེས་དཔག་མེད་ཐོབ། །དེས་ནི་<span class='delete'>མིད་</span><span class='add'>མདོ་</span>སྡེ་<span class='delete'>དཔག་</span><span class='add'>དཔག་མེད་</span>གོ་བར་འགྱུར། །གང་ཞིག་མདོ་སྡེ་དཔག་མེད་གོ་གྱུར་<span class='delete'>བས། །</span><span class='add'>པས། །</span>སངས་རྒྱས་རྫུ་འཕྲུལ་ཐོབ་པ་དཀའ་མི་\nའགྱུར། །དེ་བཞིན་རྣ་བ་སྣ་ལྕེ་ལུས་དང་ཡིད། །གཟུགས་སྒྲ་དྲི་རོ་རེག་བྱ་ཆོས་དག་ནས། །སྒྲ་རྣམས་དང་ནི་མིང་གི་བར་དུ་ཡང། །ཐམས་ཅད་དེ་བཞིན་དུ་ནི་སྦྱར་བར་བྱ། །དེ་ཚེ་ས་ཆེན་དག་ནི་རབ་ཏུ་གཡོས། །རྒྱ་མཚོ་རི་རྣམས་ཀྱང་ནི་དེ་བཞིན་ནོ། །ལྷ་མ་ཡིན་དང་ལྷ་ནི་མང་"
 ],
 [
  "79.271b",
  "ཆེར་ནི། །བུད་མེད་བག་མེད་གྱུར་པ་ལ། །ཉེས་དམིགས་དཔག་མེད་ཡོད་པར་བསྟན། །ཐུགས་རྗེ་ཆེན་པོས་འཕྲུལ་བསྟན་ནས། །སེམས་ཅན་རྣམས་ལ་རྒྱ་ཆེར་ནི། །གོས་ཀྱིས་བག་མེད་གྱུར་པ་ལ། །ཉེས་དམིགས་\nདཔག་མེད་ཡོད་པར་བསྟན། །ཐུག་རྗེ་ཆེན་པོ་འཕྲུལ་བསྟན་ནས། །སེམས་ཅན་རྣམས་ལ་རྒྱ་ཆེར་ནི། །ཆང་གིས་བག་མེད་གྱུར་པ་ལ། །ཉེས་དམིགས་དཔག་མེད་ཡོད་པར་བསྟན། །ཐུག་རྗེ་ཆེན་པོ་འཕྲུལ་བསྟན་\nནས། །སེམས་ཅན་རྣམས་ལ་རྒྱ་ཆེར་ནི། །རྒྱལ་པོ་བག་མེད་གྱུར་པ་ལ། །ཉེས་དམིགས་དཔག་མེད་ཡོད་པར་བསྟན། །ཐུག་རྗེ་ཆེན་པོ་འཕྲུལ་བསྟན་ནས། །སེམས་ཅན་རྣམས་ལ་རྒྱ་ཆེར་ནི། །ཚུལ་ཁྲིམས་སྙེམས་\nཔར་གྱུར་པ་ལ། །ཉེས་དམིགས་དཔག་མེད་ཡོད་པར་བསྟན། །ཐུག་རྗེ་ཆེན་པོ་འཕྲུལ་བསྟན་ནས། །སེམས་ཅན་རྣམས་ལ་རྒྱ་ཆེར་ནི། །ཤེས་རབ་སྙེམས་པར་གྱུར་པ་ལ། །ཉེས་དམིགས་དཔག་མེད་ཡོད་པར་བསྟན། །\nདེ་བཞིན་རྟོགས་དང་རྫུ་འཕྲུལ་དང་། །བསམ་གཏན་མཁས་པའི་ང་རྒྱལ་དང་། །ནོར་དང་བཤད་དང་རིགས་དང་འཁོར། །རོལ་མོ་གླུ་དང་ལྕེ་རྒྱང་དང་། །གྲགས་པ་ཕུན་ཚོགས་བསྔགས་པ་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>བཀུར་སྟི་དང་ནི་རྙེད་པ་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>\nམཛེས་དང་གཡོ་སྒྱུ་ང་རྒྱལ་དང་། །ངོ་ཚ་མེད་དང་ཁྲེལ་མེད་དང། །ཁེངས་དང་ཕུན་ཚོགས་ང་རྒྱལ་དང། །བག་མེད་འདོད་ཆགས་དེ་བཞིན་ནོ། །ཐུགས་རྗེ་ཆེན་པོས་འཕྲུལ་བསྟན་ནས། །སེམས་ཅན་གང་ཞིག་སེམས་\nདང་ཡིད། །དམན་པར་གྱུར་པ་དེ་དག་ལ། །ཁྱད་པར་འཕགས་པའི་འདུ་ཤེས་བསྟན། །ཐུགས་རྗེ་ཆེན་པོས་འཕྲུལ་བསྟན་ནས། །སེམས་ཅན་གང་ཞིག་རབ་ཞུམ་<span class='delete'>ཞིང། །</span><span class='add'>ཞིང་། །</span>རྩོལ་བར་མི་བྱེད་དེ་དག་ལ། །\nབརྩོན་འགྲུལ་སྟོབས་ནི་སྟོན་པར་མཛད། །ཐུགས་རྗེ་ཆེན་པོས་འཕྲུལ་བསྟན་ནས། །སེམས་ཅན་གང་ཞིག་ནོར་རྣམས་ལ། །ཆགས་པར་གྱུར་པ་དེ་དག་ལ། །ཆོག་ཤེས་ཆོས་ནི་སྟོན་པར་མཛད། །གཞན་ཡང་"
 ],
 [
  "79.272a",
  "སྤོས་ཀྱི་དྲི་གཙང་<span class='delete'>ཁང། །</span><span class='add'>ཁང་། །</span>མེ་ཏོག་དག་ནི་གཞལ་མེད་<span class='delete'>ཁང། །</span><span class='add'>ཁང་། །</span>ཁང་པ་བརྩེགས་མ་མཆོག་སྤྲུལ་ནས། །སྤྲུལ་པའི་སངས་རྒྱས་བཞུགས་པར་བསྟན། །གཞན་ཡང་ལྷ་ཡི་བུ་མོ་རྣམས། །མེ་ཏོག་ཙམ་པ་ཁང་པ་\nན། །གནས་པའི་ལུས་ཕྱེད་མངོན་སྤྲུལ་ནས། །མེ་ཏོག་ཕྲེང་ཐོགས་མཆོད་བྱེད་བསྟན། །གཞན་ཡང་ལྷ་མིན་བུ་མོ་དག །མེ་ཏོག་མ་ལི་ཁང་པ་ན། །གནས་པ་ལུས་ཕྱེད་བསྟན་སྤྲུལ་ནས། །མེ་ཏོག་ཕྲེང་ཐོགས་\nམཆོད་བྱེད་བསྟན། །གཞན་ཡང་ལྷ་ཡི་བུ་རྣམས་དག །པད་མ་སྔོན་པོའི་ཁང་པ་ན། །གནས་པ་ལུས་ཕྱེད་བསྟན་སྤྲུལ་ནས། །སངས་རྒྱས་ཡོན་ཏན་བསྔགས་པ་བསྟན། །གཞན་ཡང་ཚངས་པ་རྣམས་ཀྱི་ལྷ། །\nགསེར་གྱི་གཞལ་མེད་ཁང་པ་ན། །གནས་པ་ལུས་ཀུན་བསྟན་སྤྲུལ་ནས། །སྒྲ་སྙན་སངས་རྒྱས་བསྔགས་པ་བསྟན། །གཞན་ཡང་ལྷ་ཡི་བུ་མོ་<span class='delete'>དག། །</span><span class='add'>དག །</span>སྣ་ཚོགས་རྒྱན་གྱིས་ལུས་བརྒྱན་ཅིང་། །རྒྱན་\nནི་ཕན་ཚུན་རེག་པ་ལས། །སྒྲ་སྙན་དག་ནི་རབ་བྱུང་ནས། །འདུས་བྱས་རྣམས་ཀྱི་ཆོས་དག་ནི། །འགྱུར་ཞིང་མི་བརྟན་ཡིན་ན་<span class='delete'>ཡང། །</span><span class='add'>ཡང་། །</span>བྱིས་པ་མི་བདེན་རྟོག་པ་ཡིས། །ཡང་དག་ཇི་བཞིན་མི་ཤེས་ཟེར། །རྒྱན་གྱི་སྒྲ་\nནི་དེ་དག་<span class='delete'>ཀྱང། །</span><span class='add'>ཀྱང་། །</span>ལུས་དང་སེམས་ལས་བྱུང་མ་ཡིན། །འགྲོ་བ་མེད་ཅིང་འོང་བ་མེད། །ཕྱོགས་ཀྱང་ཡོད་པ་མ་ཡིན་ཏེ། །གཟུགས་དང་སེམས་ཀྱི་བར་དུ་<span class='delete'>ཡང། །</span><span class='add'>ཡང་། །</span>ཐམས་ཅད་དེ་བཞིན་སྦྱར་བར་བྱ། །བྱིས་པ་\nརྣམས་ནི་མི་ཤེས་པས། །འདི་ལ་ཐེ་ཚོམ་སྐྱེ་བར་འགྱུར། །རྒྱན་གྱི་རྣམས་པ་དེ་དག་ལས། །སྒྲ་<span class='delete'>སྙེན་</span><span class='add'>སྙན་</span>བྱུང་བ་དེ་ཡིས་ནི། །སངས་རྒྱས་ཞིང་ཀུན་གྲགས་པས་ན། །སེམས་ཅན་ཚད་མེད་གྲོལ་བར་གྱུར། །དེ་ལྟ་\nབས་ན་ཁྱོད་རྣམས་ཀྱིས། །འདྲེན་པའི་རང་བྱུང་ཡེ་ཤེས་དང་། །ཡོན་ཏན་དཔག་མེད་སྐུ་དག་ནི། །སྲེད་པའི་སྤྲོས་ལས་འདས་པ་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>རབ་དབེན་སྐྱོན་ནི་མེད་པ་དང་། །ལྟ་བྲལ་སེམས་ནི་རབ་སྦྱངས་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>"
 ],
 [
  "79.272b",
  "མཚན་དང་དཔེ་བྱེད་བརྒྱན་པ་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>སྐུ་དང་ཐུགས་ནི་དག་པར་ལྟོས། །ཁྱེད་ཀྱིས་བཅོམ་ལྡན་གྲོང་གཤེགས་ཚེ། །གོམ་པ་དག་ནི་སེང་གེ་འདྲ། །གཤེགས་སྟབས་<span class='delete'>དད་</span><span class='add'>ངང་</span>པ་གླང་ཆེན་འདྲ། །སེམས་ཅན་<span class='delete'>རོ་</span><span class='add'>རེ་</span>བ་བསྐོང་\n<span class='delete'>པར་</span><span class='add'>བར་</span>མཛད། །བསོད་ནམས་ཁྱད་འཕགས་ཡོངས་སུ་རྫོགས། །ཡང་དག་མཚན་གྱིས་རབ་ཏུ་བརྒྱན། །སེམས་ཅན་དག་ནི་ཐམས་ཅད་ཀུན། །ལྟ་བས་མི་ངོམས་ཉིད་དུ་ལྟོས། །ཁྱོད་ཀྱིས་རྐང་གཉིས་གཙོ་\nཡི་མཆོག །ཐུགས་རྗེ་ཆེན་པོ་ལྟ་བས་ན། །དངོས་པོ་ཆུང་<span class='delete'>དུས་</span><span class='add'>ངུས་</span>མཆོད་བྱས་ཀྱང། །ཡོན་ཏན་ཚད་མེད་འཐོབ་མཛད་པས། །སེམས་ཅན་དག་ནི་མང་པོ་རྣམས། །བསྐལ་པ་བརྒྱ་སྟོང་མང་པོར་ནི། །མྱ་ངན་\nའདས་པ་འཐོབ་པར་དུ། །རྣམས་སྨིན་ཐུག་པ་མེད་པར་ལྟོས། །ཁྱེད་ཀྱིས་རྐང་གཉིས་གཙོ་མཆོག་ནི། །ཟག་མེད་ཚུལ་ཁྲིམས་རྫོགས་པས་ན། །སེམས་ཅན་དག་ནི་མང་པོ་རྣམས། །གུས་པས་སྤྱི་བོས་\nཕྱག་བྱེད་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>ལྷ་ཡི་འཁོར་ནི་མང་པོ་རྣམས། །སོ་སོའི་གཞལ་མེད་ཁང་སྤངས་<span class='delete'>ནས །</span><span class='add'>ནས། །</span>རྩེ་བ་དག་ལ་ཆགས་མེད་པར། །འདྲེན་པ་ལ་ནི་སྟེན་བྱེད་ལྟོས། །ཁྱེད་<span class='delete'>གྱིས་</span><span class='add'>གྱིས་</span>བདུད་དང་བདུད་ཀྱི་འཁོར། །\nབཅོམ་ལྡན་འདས་ལ་དད་སྐྱེས་ནས། །གསེར་གྱི་རླུང་ཡབ་དག་ཐོགས་ཏེ། །གཡས་གཡོན་དུ་ནི་<span class='delete'>འཁོར་</span><span class='add'>འཁོད་</span><span class='delete'>པ་</span><span class='add'>པ་</span>དང་། །བདུད་ཀྱི་བུ་ནི་ལྔ་བརྒྱ་<span class='delete'>ཡིས །</span><span class='add'>ཡིས། །</span>ལྷ་ཡི་མེ་ཏོག་ཡིད་འོང་བས། །དེ་བཞིན་གཤེགས་ལ་\nམངོན་གཏོར་ནས། །བླ་མེད་ཡེ་ཤེས་ཚོལ་ལ་ལྟོས། །འདས་པའི་སངས་རྒྱས་རྣམས་ལ་ནི། །བསྔགས་པ་བརྗོད་ཅིང་མཆོད་པས་ན། །དེང་ནི་བཅོམ་ལྡན་ཕྲད་གྱུར་ནས། །སོ་སོར་དགའ་བར་\nགྱུར་པ་ཡིན། །སྤོབས་པ་དག་ནི་ཚད་མེད་ཀྱིས། །དེ་བཞིན་གཤེགས་པའི་བསྔགས་པ་བརྗོད། །དེ་ཡི་ཚེ་ན་བདུད་ཀྱི་བུ། །སྲེད་པ་སྤངས་པ་ཞེས་བྱ་བ། །ཐོག་མར་བཅོམ་ལྡན་བསྔགས་བརྗོད་ནས། །"
 ],
 [
  "79.273a",
  "མིག་ཟད་མཐའ་ནི་ཤེས་པར་གྱུར། །མིག་གི་སྐྱེ་མཐའ་ཤེས་པ་ནས། །རབ་ཞི་མཚན་ཉིད་བར་དུ་རྟོགས། །གཞན་ཡང་མིག་ཟད་ལ་སོགས་པའི། །མིག་དོན་དག་ནི་དཔག་མེད་རྟོགས། །དེས་ན་ཚིག་མཁས་དག་\nགིས་ནི། །སེམས་ཅན་རྣམས་ལ་ཡང་དག་བསྟན། །མིང་<span class='delete'>དག་</span><span class='add'>དང་</span>དོན་རྣམས་ལ་ཡང་ནི། །ཞེན་དང་ཐེ་ཚོམ་མེད་པས་ན། །འགྲོ་<span class='delete'>འོད་</span><span class='add'>འོང་</span>མེད་པར་རབ་རྟོགས་<span class='delete'>ཤིང། །</span><span class='add'>ཤིང་། །</span>བླང་དོར་མེད་པ་ཉིད་དུ་གྱུར། །རང་བཞིན་དག་ནི་སྟོང་དབེན་པས། །\nཡི་གེ་རྣམས་ནི་སྤངས་པ་དང་། །ལེན་དང་འཛིན་དང་ཀློག་པ་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>ཁ་ཏོན་འདོན་ཅིང་བསྒྲུབ་མེད་རྟོགས། །འདས་པའི་དེ་བཞིན་གཤེགས་རྣམས་ཀྱིས། །སྔོན་ཡང་རབ་ཏུ་ཕྱེ་སྟེ་བསྟན། །བཏགས་པའི་མིང་ཙམ་\nཡིན་པས་ན། །ཡང་དག་བརྗོད་དུ་ཅི་ཡང་མེད། །རང་བཞིན་སྟོང་པ་དེ་དག་ནི། །ཕུང་པོ་ཁམས་དང་སྐྱེ་མཆེད་འདས། །བརྫུན་པ་མེད་ཅིང་བདེན་པའང་མེད། །གནས་དང་གནས་པ་ཡོད་པ་མིན། །ཚིགས་གིས་སྨྲ་\n<span class='delete'>པའི་</span><span class='add'>བའི་</span>ལམ་ཆད་ཅི། །སེམས་ཀྱི་སྤྱོད་པའང་རབ་ཏུ་ཞི། །སྐྱེ་བོའི་མཚན་མ་ཞེན་པའི་ཕྱིར། །བཅོམ་ལྡན་གྲོང་ཁྱེར་གཤེགས་པར་<span class='delete'>མཐོང། །</span><span class='add'>མཐོང་། །</span>བཅོམ་ལྡན་མཚན་མ་ཡོངས་སྤངས་<span class='delete'>ཀྱང། །</span><span class='add'>ཀྱང་། །</span>བྱིས་པ་ཡང་དག་མ་\nཡིན་<span class='delete'>རྟོག། །</span><span class='add'>རྟོག །</span>བཅོམ་ལྡན་གྲོང་ཁྱེར་གཤེགས་པའི་ཚེ། །གང་ཞིག་དགའ་བ་སྐྱེ་འགྱུར་<span class='delete'>པ། །</span><span class='add'>བ། །</span>དེ་ཡི་མཚན་མར་རྟོག་པ་སྟེ། །མྱ་ངན་<span class='delete'>གདུད་</span><span class='add'>གདུང་</span>དང་བཅས་པར་འགྱུར། །གང་གིས་མཚན་མའི་རྟོག་སྤངས་པ། །\nགྲོང་ཁྱེར་གཤེགས་པ་མཐོང་མི་འགྱུར། །གཤེགས་ཤིང་བསྐྱོད་པའི་མཚན་མ་ལ། །རྣམ་རྟོག་མེད་པ་ཤེས་རབ་འཐོབ། །གང་གིས་མཚན་མར་སངས་རྒྱས་<span class='delete'>མཐོང། །</span><span class='add'>མཐོང་། །</span>དེས་ནི་གྲོང་ཁྱེར་གཤེགས་པ་<span class='delete'>མཐོང། །</span><span class='add'>མཐོང་། །</span>\nསྐྱེ་ཞིང་འཁོར་བའི་ཆོས་དག་ལ། །རྣམ་པར་རྟོག་པ་སྐྱེད་པར་བྱེད། །གང་གིས་སངས་རྒྱས་མཚན་མར་<span class='delete'>མཐོང། །</span><span class='add'>མཐོང་། །</span>དགའ་བ་དག་ནི་སྐྱེ་འགྱུར་བ། །དེ་ནི་བདུད་ཀྱི་སྤྱོད་ལ་གནས། །བདུད་ཀྱི་སྤྱོད་ཡུལ་སྣང་"
 ],
 [
  "79.273b",
  "བ་ཡིན། །གང་གིས་མཚན་མར་སངས་རྒྱས་མཐོང་། །དེ་ནི་འགྱུར་བ་མཐོང་བ་ཡིན། །དེ་ནི་མྱ་ངན་གདུངས་བཅས་པས། །མཁས་པས་སྙིང་བརྩེར་བྱ་བ་ཡིན། །ཆོས་ལ་ཐོབ་པར་གང་ལྟ་བ། །དེ་ལ་ཆོས་སྟོར་མྱ་ངན་ཡོད། །སངས་\nརྒྱས་མཐོང་བ་སྐྱེས་པ་ལ། །མྱ་ངན་འདས་པའི་སྡུག་བསྔལ་ཡོད། །བསྐལ་པ་མང་པོ་གང་བསྒོམས་པས། །མཚན་མ་ཐམས་ཅད་རྟོགས་པས་ན། །གྲོང་ཁྱེར་གཤེགས་པར་མི་རྟོག་<span class='delete'>ཅིང། །</span><span class='add'>ཅིང་། །</span>མྱ་ངན་འདའ་བའི་འདུ་\nཤེས་<span class='delete'>མེད །</span><span class='add'>མེད། །</span>སེམས་ཀྱི་མཚན་ཉིད་སྟོང་རྟོགས་པ། །སངས་རྒྱས་སྤྱོད་ལ་གནས་པས་ན། །གྲོང་ཁྱེར་གཤེགས་པར་མི་རྟོག་<span class='delete'>ཅིང། །</span><span class='add'>ཅིང་། །</span>མྱ་ངན་འདས་པའི་འདུ་ཤེས་མེད། །གང་གིས་དེ་ལྟར་རབ་ཤེས་པ། །སངས་རྒྱས་\nརྣམས་ནི་མཐོང་འགྱུར་<span class='delete'>ཞིང། །</span><span class='add'>ཞིང་། །</span>ངོ་བོ་ཉིད་ཀྱང་སྟོང་རྟོགས་<span class='delete'>པ། །</span><span class='add'>པས། །</span>མཐར་ནི་སྐྱེ་འགག་ཅི་ཡང་མེད། །བཅོམ་ལྡན་བསྐལ་པ་དཔག་མེད་ནས། །དཀའ་བ་རྣམས་ནི་རབ་སྤྱད་ནས། །ངོ་བོ་ཉིད་ནི་སྟོང་མཁྱེན་ན། །བྱིས་པ་རྣམས་ཀྱི་\nཀྱིས་མི་རྟོགས་སོ། །བཅོམ་ལྡན་གྲོང་ཁྱེར་གཤེགས་པའི་ཚེ། །འཁོར་ནི་བརྒྱ་སྟོང་མང་གིས་བསྐོར། །མི་དང་མི་མ་ཡིན་ལ་སོགས། །དང་བའི་སེམས་ཀྱིས་མཆོད་པ་བས། །གང་གིས་སྐད་ཅིག་ཙམ་དུ་ནི། །མིག་ཟད་\nམཐའ་ནི་རབ་སེམས་<span class='delete'>ཤིང། །</span><span class='add'>ཤིང་། །</span>མཚན་མ་རྣམས་ནི་སྟོང་རྟོགས་ན། །འདི་ཡི་བསོད་ནམས་དེ་བས་འཕགས། །བགྲང་བ་དང་ནི་གྲངས་ཀྱི་ཆ། །རྒྱུ་ཙམ་དུ་ཡང་མི་བཟོད་དོ། །དེ་བཞིན་མིག་གི་སྐྱེ་མཐའ་དང་། །མིག་གི་མཐའ་\nདང་འཇུག་པ་ནས། །རབ་ཏུ་ཞི་བའི་བར་དུ་ཡང་། །དེ་བཞིན་དུ་ནི་རིག་པར་བྱ། །རྣ་བ་སྣ་ལྕེ་ལུས་དང་ཡིད། །གཟུགས་སྒྲ་དྲི་རོ་རེག་བྱ་ནས། །སྒྲ་དང་མིང་གི་བར་དུ་ཡང་། །ཐམས་ཅད་དེ་བཞིན་སྦྱར་བར་བྱ། །དེ་ནས་དེ་ཚེ་\nབཅོམ་ལྡན་འདས། །གྲོང་ཁྱེར་དུ་ནི་གཤེགས་པའི་ཚེ། །ཞབས་ནི་ས་ལ་རེག་ཙམ་གྱིས། །ས་ནི་ཀུན་ཏུ་རབ་ཏུ་གཡོས། །རི་རྣམས་གང་ཡིན་དེ་དག་<span class='delete'>ཀྱང། །</span><span class='add'>ཀྱང་། །</span>ཐམས་ཅད་བཅོམ་ལྡན་འདས་ལ་ཕྱོགས། །"
 ],
 [
  "79.270a",
  "སྤྱོད་བཞི་འཕེལ་བར་མཛད། །དེ་ཚེ་ཐུགས་རྗེ་ཆེན་པོ་ཡིས། །ཀླུ་རྣམས་ཀྱིས་ནི་ཡོངས་བསྐོར་ནས། །ཞེ་སྡང་ཉེས་དམིགས་བཤད་བསྟན་པས། །ཞེ་སྡང་སེམས་ནི་སྤངས་པར་གྱུར། །དེ་ཚེ་ཐུགས་རྗེ་ཆེན་པོ་ཡིས། །གནོད་\nསྦྱིན་རྣམས་ཀྱིས་ཡོངས་བསྐོར་ནས། །རྣམ་འཚེ་ཉེས་དམིགས་བཤད་བསྟན་པས། །རྣམ་འཚེ་སེམས་ནི་སྤངས་བར་གྱུར། །དེ་ཚེ་ཐུགས་རྗེ་ཆེན་པོ་ཡིས། །ལྷ་མ་ཡིན་གྱིས་ཡོངས་བསྐོར་ནས། །འཐབ་པའི་ཉེས་དམིགས་བཤད་\nབསྟན་ཏེ། བཟོད་པ་བསྒོམས་པའི་བསྔགས་པ་བརྗོད། །དེ་ཚེ་ཐུགས་རྗེ་ཆེན་པོ་ཡིས། །ནམ་མཁའ་ལྡིང་གིས་ཡོངས་བསྐོར་ནས། །འགལ་བྱས་ཉེས་དམིགས་བཤད་བསྟན་<span class='delete'>ཏེ། </span><span class='add'>ཏེ། །</span>འདུམ་པའི་སེམས་ཀྱིས་བསྔགས་པ་<span class='delete'>མཛད། </span><span class='add'>མཛད། །</span>\nདེ་ཚེ་ཐུགས་རྗེ་ཆེན་པོ་ཡིས། །དྲི་ཟའི་འཁོར་གྱིས་ཡོངས་བསྐོར་ནས། །དགའ་བའི་ཚིག་ནི་དཔག་མེད་<span class='delete'>ཀྱིས། </span><span class='add'>ཀྱིས། །</span>དེ་བཞིན་གཤེགས་པའི་བསྔགས་བརྗོད་བསྟན། །དེ་ཚེ་ཐུགས་རྗེ་ཆེན་པོ་<span class='delete'>ཡིས། </span><span class='add'>ཡིས། །</span>ལྟོ་འཕྱེ་འཁོར་གྱིས་ཡོངས་བསྐོར་<span class='delete'>ནས། </span><span class='add'>ནས། །</span>\nམུ་སྟེགས་ཆོས་ལ་སྨོད་མཛད་<span class='delete'>ཅིང། །</span><span class='add'>ཅིང་། །</span>བཅོམ་ལྡན་གསུང་རབ་བསྔགས་བརྗོད་བསྟན། །དེ་ཚེ་ཐུགས་རྗེ་ཆེན་པོ་ཡིས། །འདྲེ་སྲིན་འཁོར་གྱིས་ཡོངས་བསྐོར་ནས། །དེ་བཞིན་གཤེགས་པའི་ཡོན་ཏན་མཆོག །རྒྱ་ཆེར་བསྔགས་པ་བསྟན་པར་\nམཛད། །ཐུགས་རྗེ་ཆེན་པོས་འཕྲུལ་བསྟན་པས། །སེམས་ཅན་དག་ནི་བརྒྱ་སྟོང་སྙེད། །མི་བཟད་མཐའ་བསྟན་ཐོས་པས་ན། །མཐར་ཕྱིན་དོན་ནི་རྟོགས་པར་གྱུར། །ཐུགས་རྗེ་ཆེན་པོ་འཕྲུལ་བསྟན་པས། །སེམས་ཅན་དག་ནི་བརྒྱ་སྟོང་སྙེད། །མིག་སྐྱེ་\nམཐའ་ནི་བསྟན་ཐོས་པས། །མཐར་ཕྱིན་དོན་ནི་རྟོགས་པར་གྱུར། །ཐུགས་རྗེ་ཆེན་པོས་འཕྲུལ་བསྟན་པས། །སེམས་ཅན་དག་ནི་བརྒྱ་སྟོང་<span class='delete'>སྙེད། </span><span class='add'>སྙེད། །</span>མིག་གི་མཐའ་ནི་བསྟན་ཐོས་པས། །མཐར་ཕྱིན་དོན་ནི་རྟོགས་པར་གྱུར། །ཐུགས་རྗེ་ཆེན་པོས་\nའཕྲུལ་བསྟན་<span class='delete'>པས། </span><span class='add'>པས། །</span>སེམས་ཅན་དག་ནི་བརྒྱ་སྟོང་སྙེད། །མིག་འཇུག་བསྟན་པ་ཐོས་གྱུར་ནས། །མཐར་ཕྱིན་དོན་ནི་རྟོགས་པར་གྱུར། །ཐུགས་རྗེ་ཆེན་པོས་འཕྲུལ་བསྟན་པས། །སེམས་ཅན་དག་ནི་བརྒྱ་སྟོང་སྙེད། །མིག་དབེན་བསྟན་པ་ཐོས་པས་ན། །"
 ],
 [
  "79.274b",
  "རབ་ཏུ་རྟོགས་པར་གྱུར་པའི་ཕྱིར། །སངས་རྒྱས་རྣམས་ཀྱི་ཡོན་ཏན་<span class='delete'>ཡང། །</span><span class='add'>ཡང་། །</span>རབ་ཏུ་རྟོགས་པར་ཁོང་དུ་ཆུད། །མིག་ནི་ཟད་པའི་མཐའ་དག་ལ། །མི་འཛིན་སྦེད་པ་མེད་པ་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>མིག་ནི་སྐྱེ་བའི་མཐའ་དག་ལ། །\nརྟེན་ཅིང་གནས་པ་མེད་པ་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>མིག་ནི་རབ་ཏུ་དབེན་པ་ལ། །གཡོ་བའི་བསམ་པ་མེད་གྱུར་པ། །དེས་ནི་དེ་བཞིན་གཤེགས་པ་རྣམས། །མཐོང་བ་ཉིད་དུ་གྱུར་པ་ཡིན། །མིག་ནི་སྐྱེ་བའི་མཐའ་དག་ལ། །རྣམ་པར་\nརྟོག་པ་མེད་པ་<span class='delete'>དང། །</span><span class='add'>དང་།  །</span>མིག་གི་མཐའ་ནི་གང་ཡིན་པ། །དེ་ལ་ཡིད་ཀྱི་རྟོག་མེད་<span class='delete'>དང། །</span><span class='add'>དང་།  །</span>མིག་ནི་རྣམ་པར་འཇིག་པ་ལ། །བསྟན་པར་བྱ་བ་མེད་གྱུར་པ། །དེས་ནི་དེ་བཞིན་གཤེགས་པ་རྣམས། །མཐོང་བ་ཉིད་དུ་\nགྱུར་པ་ཡིན། །མིག་ནི་མེད་པར་གྱུར་པ་ལ། །མངོན་<span class='delete'>པར་</span><span class='add'>པར་</span>ཞེན་པ་མེད་པ་<span class='delete'>དང། །</span><span class='add'>དང་།  །</span>མིག་ནི་སྐྱེ་བ་མེད་པ་ལ། །ཡོངས་སུ་སྡུད་པ་མེད་པ་<span class='delete'>དང། །</span><span class='add'>དང་།  །</span>མིག་ནི་རབ་ཏུ་ཞི་བ་ལ། །འཛིན་པ་དག་ནི་མེད་གྱུར་པ། །དེས་ནི་དེ་བཞིན་\nགཤེགས་པ་རྣམས། །མཐོང་བ་ཉིད་དུ་གྱུར་པ་ཡིན། །མིག་ནི་ཟད་པར་ཤེས་པའི་ཕྱིར། །མཚན་རྣམས་མངོན་<span class='delete'>པར་</span><span class='add'>པར་</span>བསྒྲུབ་པ་<span class='delete'>དང། །</span><span class='add'>དང་།  །</span>མིག་གི་མཐའ་ནི་ཤེས་པའི་ཕྱིར། །དབང་པོ་དག་ནི་ངེས་གྱུར་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>མིག་\nནི་སྐྱེ་བ་ཤེས་པའི་ཕྱིར། །དབང་པོ་རང་དབང་ཐོབ་གྱུར་པ། །དེས་ནི་དེ་བཞིན་གཤེགས་པ་རྣམས། །མཐོང་བ་ཉིད་དུ་གྱུར་པ་ཡིན། །མིག་ནི་མེད་པར་རྟོགས་གྱུར་ནས། །གཟུགས་ནི་ཁོང་དུ་ཆུད་པ་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>མིག་\nནི་འཇིག་པར་རབ་ཤེས་ནས། །ཆོས་ལ་སོ་སོར་རྟོག་པ་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>མིག་ནི་སྐྱེ་མེད་ཤེས་གྱུར་ནས། །ལམ་ནི་སྒྲུབ་པར་གང་བྱེད་པ། །དེས་ནི་དེ་བཞིན་གཤེགས་པ་རྣམས། །མཐོང་བ་ཉིད་དུ་གྱུར་པ་<span class='delete'>ཡིན། </span><span class='add'>ཡིན། །</span>\nམིག་ཟད་མཐའ་ནི་གང་ཡིན་པ། །ཡང་དག་ཇི་བཞིན་རྟོགས་པའི་ཕྱིར། །ལས་ཀྱི་བྱེ་བྲག་ཐ་དད་པ། །དེ་ཡང་རབ་ཏུ་རྟོགས་པར་འགྱུར། །ལས་ཀྱི་བྱེ་བྲག་ཐ་དད་པ། །རབ་ཏུ་རྟོགས་པར་གྱུར་<span class='delete'>པ</span><span class='add'>པ</span>འི་"
 ],
 [
  "79.275a",
  "ཕྱིར། །དེས་ནི་དེ་བཞིན་གཤེགས་པ་རྣམས། །མཐོང་བ་ཉིད་དུ་གྱུར་པ་<span class='delete'>ཡིན། </span><span class='add'>ཡིན། །</span>མིག་སྐྱེ་མཐའ་ནི་གང་ཡིན་<span class='delete'>པ། </span><span class='add'>པ། །</span>ཡང་དག་ཇི་བཞིན་རྟོགས་པའི་<span class='delete'>ཕྱིར། </span><span class='add'>ཕྱིར། །</span>སྡུག་བསྔལ་བྱེ་བྲག་ཐ་དད་<span class='delete'>པ། </span><span class='add'>པ། །</span>དེ་ཡང་རབ་ཏུ་རྟོགས་\nཔར་<span class='delete'>འགྱུར། </span><span class='add'>འགྱུར། །</span>སྡུག་བསྔལ་བྱེ་བྲག་ཐ་དད་<span class='delete'>པ། </span><span class='add'>པ། །</span>རབ་ཏུ་རྟོགས་པར་གྱུར་<span class='delete'>པའི་</span><span class='add'>པའི་</span><span class='delete'>ཕྱིར། </span><span class='add'>ཕྱིར། །</span>དེས་ནི་དེ་བཞིན་གཤེགས་པ་རྣམས། །མཐོང་བ་ཉིད་དུ་གྱུར་པ་<span class='delete'>ཡིན། </span><span class='add'>ཡིན། །</span>མིག་གིས་འཇིག་པ་གང་ཡིན་<span class='delete'>པ། </span><span class='add'>པ། །</span>ཡང་དག་ཇི་བཞིན་\nརྟོགས་པའི་<span class='delete'>ཕྱིར། </span><span class='add'>ཕྱིར། །</span>སྡུག་བསྔལ་འཇིག་པ་གང་ཡིན་<span class='delete'>པ། </span><span class='add'>པ། །</span>དེ་ཡང་རབ་ཏུ་རྟོགས་པར་<span class='delete'>འགྱུར། </span><span class='add'>འགྱུར། །</span>སྡུག་བསྔལ་འཇིག་པ་གང་ཡིན་<span class='delete'>པ། </span><span class='add'>པ། །</span>རབ་ཏུ་རྟོགས་པར་གྱུར་པ་<span class='delete'>ཡི། </span><span class='add'>ཡི། །</span>དེས་ནི་དེ་བཞིན་གཤེགས་པ་རྣམས། །མཐོང་\nབ་ཉིད་དུ་གྱུར་པ་<span class='delete'>ཡིན། </span><span class='add'>ཡིན། །</span>མིག་གི་མེད་པ་གང་ཡིན་<span class='delete'>པ། </span><span class='add'>པ། །</span>ཡང་དག་ཇི་བཞིན་རྟོགས་པའི་<span class='delete'>ཕྱིར། </span><span class='add'>ཕྱིར། །</span>མཚན་མ་སྤངས་པ་གང་ཡིན་<span class='delete'>པ། </span><span class='add'>པ། །</span>དེ་ཡང་རབ་ཏུ་རྟོགས་པ་<span class='delete'>འགྱུར། </span><span class='add'>འགྱུར། །</span>མཚན་མ་སྤངས་པ་གང་ཡིན་<span class='delete'>པ། </span><span class='add'>པ། །</span>རབ་ཏུ་རྟོགས་པར་\nགྱུར་པའི་<span class='delete'>ཕྱིར། </span><span class='add'>ཕྱིར། །</span>དེས་ནི་དེ་བཞིན་གཤེགས་པ་རྣམས། །མཐོང་བ་ཉིད་དུ་གྱུར་པ་<span class='delete'>ཡིན། </span><span class='add'>ཡིན། །</span>མིག་གི་སྐྱེ་མེད་གང་ཡིན་<span class='delete'>པ། </span><span class='add'>པ། །</span>ཡང་དག་ཇི་བཞིན་རྟོགས་པའི་<span class='delete'>ཕྱིར། </span><span class='add'>ཕྱིར། །</span>བག་ཆགས་སྤངས་པ་གང་ཡིན་<span class='delete'>པ། </span><span class='add'>པ། །</span>དེ་ཡང་རབ་ཏུ་རྟོགས་\nཔར་<span class='delete'>འགྱུར། </span><span class='add'>འགྱུར། །</span>བག་ཆགས་སྤངས་པ་གང་ཡིན་<span class='delete'>པ། </span><span class='add'>པ། །</span>རབ་ཏུ་རྟོགས་པར་གྱུར་པའི་<span class='delete'>ཕྱིར། </span><span class='add'>ཕྱིར། །</span>དེས་ནི་དེ་བཞིན་གཤེགས་པ་རྣམས། །མཐོང་བ་ཉིད་དུ་གྱུར་པ་<span class='delete'>ཡིན། </span><span class='add'>ཡིན། །</span>གཞན་ཡང་མིག་གི་མི་རྟོག་<span class='delete'>ཉིད། </span><span class='add'>ཉིད། །</span>ཡང་དག་ཇི་བཞིན་\nརྟོགས་པའི་<span class='delete'>ཕྱིར། </span><span class='add'>ཕྱིར། །</span>སྒྲིབ་པ་སྤངས་པ་གང་ཡིན་<span class='delete'>པ། </span><span class='add'>པ། །</span>དེ་ཡང་རབ་ཏུ་རྟོགས་པར་<span class='delete'>འགྱུར། </span><span class='add'>འགྱུར། །</span>སྒྲིབ་པ་སྤངས་པ་གང་ཡིན་<span class='delete'>པ། </span><span class='add'>པ། །</span>རབ་ཏུ་རྟོགས་པར་གྱུར་<span class='delete'>པའི་</span><span class='add'>པའི་</span><span class='delete'>ཕྱིར། </span><span class='add'>ཕྱིར། །</span>དེས་ནི་དེ་བཞིན་གཤེགས་པ་རྣམས། །མཐོང་བ་\nཉིད་དུ་གྱུར་པ་<span class='delete'>ཡིན། </span><span class='add'>ཡིན། །</span>གཞན་ཡང་མིག་ལ་ཡི་གེ་<span class='delete'>མེད། </span><span class='add'>མེད། །</span>ཡང་དག་ཇི་བཞིན་རྟོགས་པའི་<span class='delete'>ཕྱིར། </span><span class='add'>ཕྱིར། །</span>སངས་རྒྱས་ཡེ་ཤེས་སྟོབས་དག་<span class='delete'>ཀྱང། </span><span class='add'>ཀྱང་། །</span>རབ་ཏུ་རྟོགས་པར་གྱུར་པ་<span class='delete'>ཡིན། </span><span class='add'>ཡིན། །</span>སངས་རྒྱས་ཡེ་ཤེས་སྟོབས་"
 ],
 [
  "79.275b",
  "དག་ནི། །རབ་ཏུ་རྟོགས་པར་གྱུར་<span class='delete'>པའི་</span><span class='add'>པའི་</span><span class='delete'>ཕྱིར། </span><span class='add'>ཕྱིར། །</span>དེས་ནི་དེ་བཞིན་གཤེགས་པ་རྣམས། །མཐོང་བ་ཉིད་དུ་གྱུར་པ་<span class='delete'>ཡིན། </span><span class='add'>ཡིན། །</span>གཞན་ཡང་མིག་གི་མི་འོང་<span class='delete'>ཉིད། </span><span class='add'>ཉིད། །</span>ཡང་དག་ཇི་བཞིན་རྟོགས་པའི་<span class='delete'>ཕྱིར། </span><span class='add'>ཕྱིར། །</span>འདོད་རྣམས་\nསྤངས་པ་གང་ཡིན་<span class='delete'>པ། </span><span class='add'>པ། །</span>དེ་ཡང་རབ་ཏུ་རྟོགས་པར་<span class='delete'>འགྱུར། </span><span class='add'>འགྱུར། །</span>འདོད་རྣམས་སྤངས་པ་གང་ཡིན་<span class='delete'>པ། </span><span class='add'>པ། །</span>རབ་ཏུ་རྟོགས་པར་གྱུར་<span class='delete'>པའི་</span><span class='add'>པའི་</span><span class='delete'>ཕྱིར། </span><span class='add'>ཕྱིར། །</span>དེས་ནི་དེ་བཞིན་གཤེགས་པ་རྣམས། །མཐོང་བ་ཉིད་དུ་གྱུར་པ་<span class='delete'>ཡིན། </span><span class='add'>ཡིན། །</span>\nགཞན་ཡང་བསམ་གཏན་བསྒོམ་པ་<span class='delete'>དག། </span><span class='add'>དག །</span>ཡང་དག་ཇི་བཞིན་རྟོགས་པའི་<span class='delete'>ཕྱིར། </span><span class='add'>ཕྱིར། །</span>ཉོན་མོངས་སྤངས་པ་གང་ཡིན་<span class='delete'>པ། </span><span class='add'>པ། །</span>དེ་ཡང་རབ་ཏུ་རྟོགས་པར་<span class='delete'>འགྱུར། </span><span class='add'>འགྱུར། །</span>ཉོན་མོངས་སྤངས་པ་གང་ཡིན་<span class='delete'>པ། </span><span class='add'>པ། །</span>རབ་ཏུ་རྟོགས་པར་\nགྱུར་<span class='delete'>པའི་</span><span class='add'>པའི་</span><span class='delete'>ཕྱིར། </span><span class='add'>ཕྱིར། །</span>དེས་ནི་དེ་བཞིན་གཤེགས་པ་<span class='delete'>རྣམས། </span><span class='add'>རྣམས། །</span>མཐོང་བ་ཉིད་དུ་གྱུར་པ་<span class='delete'>ཡིན། </span><span class='add'>ཡིན། །</span>གང་ཟག་དེས་ནི་དེ་བཞིན་<span class='delete'>དུ། </span><span class='add'>དུ། །</span>མིག་གིས་སྔོན་མཐའ་ཤེས་པ་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>མིག་གི་མི་གནས་ཤེས་པ་<span class='delete'>དང། </span><span class='add'>དང་། །</span>མིག་\nགི་སྐྱེ་བ་ཤེས་པ་<span class='delete'>དང། </span><span class='add'>དང་། །</span>སངས་རྒྱས་རྫུ་འཕྲུལ་ཤེས་པ་<span class='delete'>དང། </span><span class='add'>དང་། །</span>མིག་གི་དམན་པ་ཤེས་པ་<span class='delete'>དང། </span><span class='add'>དང་། །</span>མིག་གི་ཁྱད་པར་འཕགས་ཤེས་<span class='delete'>དང། </span><span class='add'>དང་། །</span>ཡེ་ཤེས་དམན་པ་ཤེས་པ་<span class='delete'>དང། </span><span class='add'>དང་། །</span>རྣམ་དག་ཡེ་ཤེས་ཤེས་པ་\n<span class='delete'>དང། </span><span class='add'>དང་། །</span>ཚུལ་ཁྲིམས་རྣམ་དག་ཤེས་པ་དང། <span class='delete'></span><span class='add'>དང་། །</span>ལུས་ཀྱི་སྡོམ་པའི་ཤེས་པ་<span class='delete'>དང། </span><span class='add'>དང་། །</span>རྣམ་དག་སྒྲ་ཡི་ཤེས་པ་<span class='delete'>དང། </span><span class='add'>དང་། །</span>ངག་གི་སྡོམ་པའི་ཤེས་པ་<span class='delete'>དང། </span><span class='add'>དང་། །</span>རྣམ་དག་སེམས་ཀྱི་\nཤེས་པ་<span class='delete'>དང། </span><span class='add'>དང་། །</span>གནས་ཀྱི་བྱེ་བྲག་ཤེས་པ་<span class='delete'>དང། </span><span class='add'>དང་། །</span>སེམས་ཀྱི་ཆོས་ཀྱི་ཤེས་པ་<span class='delete'>དང། </span><span class='add'>དང་། །</span>སེམས་སྐྱོན་ཤེས་པའི་ཤེས་པ་<span class='delete'>དང། </span><span class='add'>དང་། །</span>རྣམ་དག་ལས་ནི་ཤེས་པ་<span class='delete'>དང། </span><span class='add'>དང་། །</span>སེམས་ཀྱི་སྡོམ་པའི་\nཤེས་པ་<span class='delete'>དང། </span><span class='add'>དང་། །</span>ཉེས་དམིགས་ཤེས་པའི་ཤེས་པ་<span class='delete'>དང། </span><span class='add'>དང་། །</span>རྣམ་དག་སྒྲ་ཡི་ཤེས་པ་<span class='delete'>དང། </span><span class='add'>དང་། །</span>ཕུང་པོའི་བྱེ་བྲག་ཤེས་པ་<span class='delete'>དང། </span><span class='add'>དང་། །</span>ཕུང་པོའི་རྒྱུ་རྐྱེན་ཤེས་པ་<span class='delete'>དང། </span><span class='add'>དང་། །</span>མིག་ནི་ཡོངས་ཤེས་ཤེས་པ་<span class='delete'>དང། </span><span class='add'>དང་། །</span>སྡུག་བསྔལ་འབྱུང་གནས་ཤེས་པ་<span class='delete'>ད</span><span class='add'>དང་། །</span>ང།"
 ],
 [
  "79.276a",
  "ཟག་མེད་ཚུལ་ཁྲིམས་ཤེས་པ་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>ཚུལ་ཁྲིམས་རྒྱུ་རྐྱེན་ཤེས་པ་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>སྡུག་བསྔལ་རྒྱུ་རྐྱེན་ཤེས་པ་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>སྡུག་བསྔལ་ཟད་པའི་རྒྱུ་ཤེས་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>འདུས་བྱས་རྣམས་ཀྱི་ཤེས་པ་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>ཟག་པ་ཟད་པའི་ཤེས་པ་\nདག །ཡོངས་སུ་རྫོགས་པར་བྱེད་པ་ཡིན། །གཞན་ཡང་རྒྱུ་རྐྱེན་བཅུ་གཉིས་ཀྱི། །སྤྱོད་དང་བཅས་པའི་ཤེས་པ་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>སྤྱོད་པ་མེད་པའི་ཤེས་པ་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>མཚན་མ་བཅས་<span class='delete'>དག་</span><span class='add'>དང་</span>མཚན་མ་མེད། །འདུས་བྱས་དང་ནི་འདུས་མ་\nབྱས། །རྣམ་པར་གཞག་དང་ཡོངས་སྡུད་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>བདག་དང་གཞན་གྱི་སེམས་ཤེས་པ། །ཡང་དག་ཇི་བཞིན་ཤེས་པ་ཡིན། །གཞན་ཡང་མིག་ཟད་སྐྱེ་མཐའ་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>མིག་གི་མཐའ་དང་རབ་དབེན་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>འཇུག་པ་དང་ནི་\nམེད་པ་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>མི་སྐྱེ་བ་དང་ཉེར་ཞི་ཉིད། །ཡང་དག་ཇི་བཞིན་ཤེས་པས་ན། །སེམས་ཅན་དག་ནི་མང་པོ་རྣམས། །རྣམ་པར་དག་པའི་ཡེ་ཤེས་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>མཐུ་དང་བཅས་པའི་ཡེ་ཤེས་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>བརྩོན་འགྲུས་ཡེ་ཤེས་འཐོབ་\nཔར་བྱེད། །གཞན་ཡང་གཅིག་དང་ཐ་དད་ཤེས། །སེམས་ཅན་དག་ནི་ཐམས་ཅད་ཀྱི། །མོས་པའི་ཤེས་པ་གང་ཡིན་པ། །ཡང་དག་ཇི་བཞིན་ཤེས་པ་ཡིན། །གཞན་ཡང་སེམས་ཅན་ཐམས་ཅད་ཀྱི། །མོས་པ་\nཁྱད་པར་འཕགས་པ་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>རྣམ་དག་སེམས་ཀྱི་ཤེས་པ་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>ལས་དང་རྣམ་སྨིན་ཤེས་པ་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>དབང་པོ་ཁམས་ཀྱི་ཤེས་པ་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>སེམས་ཀྱི་འགྱུར་<span class='delete'>པ་</span><span class='add'>བ་</span>ཤེས་པ་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>ཤེས་རབ་མོས་པའི་ཤེས་པ་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>\nཤིན་ཏུ་རྣམ་གྲོལ་ཤེས་པ་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>སྤོབས་པ་མཆོག་གི་ཤེས་པ་དག །ཡང་དག་ཇི་བཞིན་ཤེས་པ་ཡིན། །གཞན་ཡང་སེམས་ཅན་མ་རུངས་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>ཆོས་ལ་མོས་པ་མེད་གྱུར་པ། །ཡང་དག་ཇི་བཞིན་ཤེས་པས་ན། །\nམོས་པའི་ཤེས་པ་སྐྱེད་པར་བྱེད། །གཞན་ཡང་དོན་གྱི་ཚུལ་དག་ནི། །ཡང་དག་ཇི་བཞིན་ཤེས་པས་ན། །ལེ་ལོ་མེད་པའི་ཤེས་པ་དག །དུས་ཤེས་སྒྲུབ་པར་བྱེད་པ་ཡིན། །གཞན་ཡང་རྫུ་འཕྲུལ་སྟོབས་དག་གིས། །"
 ],
 [
  "79.276b",
  "ཆོས་རྣམས་རབ་ཏུ་འབྱེད་པ་<span class='delete'>དང། །</span><span class='add'>དང་།  </span>ཐོགས་པ་མེད་པའི་ཡེ་ཤེས་དག །ཡང་དག་ཇི་བཞིན་ཤེས་པ་ཡིན། །གཞན་ཡང་རྒྱ་ཆེན་དོན་དག་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>ཚིག་གིས་བསྟན་པ་གང་ཡིན་པ། །རྗེས་སུ་ཤེས་པའི་ཤེས་པ་དག །\nཡང་དག་ཇི་བཞིན་ཤེས་པ་ཡིན། །གཞན་ཡང་གྲོགས་བཟང་འཐུན་གནས་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>གོས་དང་ཟས་དང་བཏུང་བ་དག །ཚོད་ཤེས་པ་ཡི་ཤེས་པ་རྣམས། །ཡང་དག་ཇི་བཞིན་ཤེས་པ་ཡིན། །གཞན་ཡང་\nབྱ་བ་མེད་པ་ཡི། །གཟུགས་ཀྱི་ཆོས་ནི་གང་ཡིན་པ། །ནན་ཏན་བསྒྲུབ་པའི་ཤེས་པ་དག །ཡང་དག་ཇི་བཞིན་ཤེས་པ་ཡིན། །གཞན་ཡང་ལུས་སེམས་སྐྱོན་མེད་<span class='delete'>ཅིང། །</span><span class='add'>ཅིང་།  །</span><span class='delete'>སྒོ་</span><span class='add'>སྒྲོ་</span>འདོགས་སྐུར་འདེབས་\nཡོངས་སྤངས་ནས། །བླ་མེད་ཡེ་ཤེས་གང་ཚོལ་བ། །ཡང་དག་ཇི་བཞིན་ཤེས་པ་ཡིན། །གཞན་ཡང་རྫུ་འཕྲུལ་སྟོབས་དག་གིས། །ནམ་མཁའ་བར་སྣང་དག་ལས་ནི། །སྤྲུལ་པའི་སྐུ་ནི་རབ་\nབསྟན་ནས། །སེམས་ཅན་དག་ནི་བརྒྱ་སྟོང་སྙེད། །ཡོངས་སུ་སྨིན་པར་མཛད་པས་ན། །ཐམས་ཅད་རབ་ཏུ་དགའ་གྱུར་ནས། །<span class='delete'>དད་</span><span class='add'>དད་</span><span class='delete'>པ་</span><span class='add'>པ་</span>སྐྱེས་པའི་ཤེས་པ་<span class='delete'>དང། །</span><span class='add'>དང། །</span>དེ་བཞིན་གཤེགས་པ་རྣམས་ལ་<span class='delete'>ཡང། །</span><span class='add'>ཡང་། །</span>མོས་ཤིང་\nགུས་པའི་ཤེས་པ་<span class='delete'>དང། །</span><span class='add'>དང་།  །</span>འདོད་ཆགས་སྤངས་པའི་ཆོས་དག་ལ། །རབ་མོས་བསྒྲུབ་པའི་ཤེས་པ་<span class='delete'>དང། །</span><span class='add'>དང་།  །</span>འཕགས་པའི་དགེ་འདུན་ཚོགས་ལ་<span class='delete'>ཡང། །</span><span class='add'>ཡང་། །</span>མཆོད་པར་མོས་པའི་ཤེས་པ་<span class='delete'>དང། །</span><span class='add'>དང་།  །</span>བྱང་ཆུབ་ཆེན་པོ་དག་\nལ་<span class='delete'>ཡང། །</span><span class='add'>ཡང་། །</span>རབ་མོས་བསྔོ་བའི་ཤེས་པ་<span class='delete'>དང། །</span><span class='add'>དང་།  །</span>གཟུངས་རྣམས་ཀྱི་ནི་སྒོ་དག་ལ། །རབ་མོས་སྟོན་པའི་ཤེས་པ་<span class='delete'>དང། །</span><span class='add'>དང་།  །</span>མོས་པ་རྣམས་ནི་གང་ཡིན་པ། །སོ་སོར་རབ་རྟོགས་ཤེས་པ་<span class='delete'>དང། །</span><span class='add'>དང་།  </span>འཕགས་པའི་ཏིང་\nའཛིན་གང་ཡིན་པ། །ལེགས་པར་རྟོགས་པའི་ཤེས་པ་<span class='delete'>དང། །</span><span class='add'>དང་།  །</span>བསྲུང་དང་རྗེས་སུ་དྲན་རྣམས་ལ། །ངེས་པར་བྱེད་པའི་ཤེས་པ་<span class='delete'>དང། །</span><span class='add'>དང་།  །</span>དཔག་ཏུ་མེད་པའི་སེམས་དག་ལ། །ལེགས་པར་འཇུག་པའི་"
 ],
 [
  "79.277a",
  "ཤེས་པ་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>ཚིགས་སུ་བཅད་པ་ཚད་མེད་རྣམས། །ཡང་དག་སྟོན་པའི་ཤེས་པ་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>འདོད་པའི་མཚམས་སྦྱོར་གང་ཡིན་པ། །རྟོགས་<span class='delete'>ཤིག་</span><span class='add'>ཤིང་</span>གོ་བའི་ཤེས་པ་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>འགྲོ་བ་དམན་པ་དེ་དག་ཏུ། །\nལྟུང་བར་མི་འགྱུར་ཤེས་པ་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>མི་དགེ་<span class='delete'>བ་</span><span class='add'>བ</span>ཤེས་གཉེན་གང་ཡིན་པ། །ཡོངས་སུ་སྤོང་བྱེད་ཤེས་པ་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>དགེ་བའི་བཤེས་གཉེན་གང་ཡིན་པ། །སྟེན་པར་བྱེད་པའི་ཤེས་པ་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>འདྲི་ཞིང་ལན་ལྡོན་གང་\nཡིན་པ། །རབ་ཏུ་རྣམ་འབྱེད་ཤེས་པ་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>གནས་དང་གནས་མིན་གང་ཡིན་པ། །ལེགས་པར་རྟོགས་པའི་ཤེས་པ་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>ས་དང་ས་མིན་གང་ཡིན་པ། །ལེགས་པར་རྟོགས་པའི་ཤེས་པ་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>རབ་\nའབྲིང་ཐ་མ་གང་ཡིན་པ། །རྣམ་པར་འབྱེད་པའི་ཤེས་པ་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>འདུས་བྱས་ཤེས་པ་གང་ཡིན་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>འདུས་མ་བྱས་ཀྱི་ཤེས་པ་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>དངོས་པོ་དང་ནི་རྫས་ཀྱི་ཤེས། །དངོས་དང་རྫས་མིན་ཤེས་པ་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>\nཡོངས་སུ་སྡུད་བྱེད་ཤེས་པ་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>ཡོངས་སུ་སྡུད་མིན་ཤེས་པ་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>མངོན་<span class='delete'>པར་</span><span class='add'>པར་</span>སྒྲུབ་པའི་ཤེས་པ་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>ཡང་དག་སྒྲུབ་མིན་ཤེས་པ་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>མིག་དང་མིག་མིན་ཤེས་པ་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>མིག་དང་ལྷན་\nཅིག་ཤེས་པ་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>མིག་གི་བྱེ་བྲག་ཤེས་པ་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>མིག་གི་རང་བཞིན་ཤེས་པ་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>ཡང་དག་ཇི་བཞིན་ཤེས་པ་ཡིན། །རྣ་བ་སྣ་ལྕེ་ལུས་ནས་ནི། །སྒྲ་དང་མིང་ལ་སོགས་པའི་བར། །ཆོས་ནི་\nརྣམ་པ་ཉི་ཤུ་ལྔ། །ཐམས་ཅད་དེ་བཞིན་སྦྱར་བར་བྱ། །གང་ཞིག་མིག་གི་རྒྱུ་རྐྱེན་ཉིད། །ཡང་དག་སྟོང་ཞིང་དབེན་པ་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>མཐར་ནི་བདག་ཡོད་མ་ཡིན་པར། །སེམས་<span class='delete'>བར་</span><span class='add'>པར་</span>བྱེད་པ་གང་ཡིན་པ། །\nགང་ཟག་དེས་ནི་བཞིན་དུ། །ཡང་དག་ངེས་པ་ཁོ་ནར་ནི། །སེམས་ཀྱི་ཏིང་འཛིན་གང་ཡིན་པ། །ཡོངས་སུ་རྫོགས་པར་བྱེད་པར་འགྱུར། །གང་ཞིག་མིག་གི་རྟེན་འབྲེལ་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>མིག་མི་རྟག་"
 ],
 [
  "79.277b",
  "པའི་མཚན་ཉིད་དག །དེས་པ་ཉིད་དུ་རྟོགས་གྱུར་ནས། །སེམས་པར་བྱེད་པ་གང་ཡིན་པ། །གང་ཟག་དེས་ནི་དེ་བཞིན་དུ། །མིག་གི་རྒྱུ་རྐྱེན་གང་ཡིན་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>མཐར་ནི་ཡོད་པ་མ་ཡིན་པ། །ཡང་དག་ཇི་བཞིན་རྟོགས་པར་\nའགྱུར། །རྣ་བ་སྣ་ལྕེ་ལུས་ནས་ནི། །སྒྲ་དང་མིང་ལ་སོགས་པའི་བར། །ཆོས་ནི་རྣམ་པ་ཉི་ཤུ་ལྔ། །ཐམས་ཅད་དེ་བཞིན་སྦྱར་བར་བྱ། །དེ་ཡི་ཚེ་ན་བཅོམ་ལྡན་འདས། །གྲོང་ཁྱེར་དུ་ནི་གཤེགས་པའི་ཚེ། །ཞབས་\nནི་ས་ལ་རེག་ཙམ་གྱིས། །དངོས་པོ་ངོ་མཚར་རབ་བསྟན་པ། །དེང་འདིར་བདག་གི་མདོར་བསྡུས་ནས། །ཡོན་ཏན་ཕྱོགས་ནི་ཅུང་ཟད་ཅིག །སེམས་ཅན་དགའ་བ་བསྐྱེད་པའི་ཕྱིར། །ཡང་དག་པར་ནི་སྟན་པར་བྱ། །\nདེ་ཚེ་ལྷ་མི་འདྲེན་པ་ཡིས། །སྤུ་ཡི་ཁུང་བུ་གཅིག་ནས་ནི། །འོད་ཟེར་བརྒྱ་སྟོང་ཚད་མེད་སྙེད། །རབ་ཏུ་བཀྱེ་བར་གྱུར་པས་ན། །འོད་ཟེར་དག་ནི་རེ་རེས་<span class='delete'>ཀྱང། །</span><span class='add'>ཀྱང་། །</span>ཞིང་ནི་ཚད་མེད་གསལ་མཛད་ནས། །སེམས་ཅན་\nམང་པོ་ཀུན་གྱི་ཕྱིར། །སངས་རྒྱས་མཛད་པ་རབ་ཏུ་མཛད། །གང་ཞིག་འདས་པའི་དུས་སུ་ནི། །སངས་རྒྱས་རྣམས་ལ་མཆོད་པ་དང། །ཡུན་རིང་སྦྱིན་དང་ཚུལ་ཁྲིམས་དག །མངོན་པར་བསྒྲུབས་པ་གང་ཡིན་པ། །\nདེ་ལྟ་བུ་ཡི་གང་ཟག་དག །དེས་ནི་ཇི་སྐད་བསྟན་པ་ཡི། །རྫུ་འཕྲུལ་དངོས་པོ་ཐོས་གྱུར་ན། །རབ་ཏུ་དགའ་ཞིང་མོས་པར་འགྱུར། །གང་ཞིག་སངས་རྒྱས་རྫུ་འཕྲུལ་རྣམས། །ཉན་ཐོས་དང་ནི་རང་རྒྱལ་གྱི། །\nསྤྱོད་ཡུལ་མིན་པར་རབ་ཤེས་ནས། །དེ་ལྟ་བུ་ཡི་གང་ཟག་ནི། །དེས་ནི་ཇི་སྐད་བསྟན་པ་ཡི། །རྫུ་འཕྲུལ་དག་ནི་ཐོས་གྱུར་ན། །མོས་པ་དག་ནི་སྐྱེ་འགྱུར་<span class='delete'>ཞིང། །</span><span class='add'>ཞིང་། །</span>ངོ་མཚར་འཛིན་པའི་སེམས་ཀྱང་སྐྱེད། །\nལྷ་དང་མི་ནི་འདྲེན་པ་ཡིན། །བསམ་གྱིས་མི་ཁྱབ་མཐུ་དག་གིས། །དེ་ལྟ་བུ་ལ་སོགས་པ་ཡི། །རྫུ་འཕྲུལ་སྣ་ཚོགས་རབ་བསྟན་པས། །སེམས་ཅན་དག་ནི་བརྒྱ་སྟོང་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>ཚད་མེད་གྲངས་མེད་པ་"
 ],
 [
  "79.274a",
  "ལྷ་དང་མི་ནི་ཆོས་ཀྱི་ཕྱིར། །ཐམས་ཅད་འོངས་ནས་གུས་མཆོད་བྱས། །དེ་ནས་དེ་ཚེ་བཅོམ་ལྡན་འདས། །གྲོང་ཁྱེར་དུ་ནི་གཤེགས་པའི་ཚེ། །ལྷ་ཡི་དབང་པོ་མི་ཡི་རྒྱལ། །ལྷ་མ་ཡིན་ནི་མང་པོ་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>\nགནོད་སྦྱིན་དག་ནི་མང་པོ་རྣམས། །རང་གི་གྲོང་ཁྱེར་སྤངས་ནས་ནི། །བཅོམ་ལྡན་སྤྱན་སྔར་འདུས་གྱུར་ཏེ། །རབ་ཏུ་དགའ་བས་མཆོད་པ་བྱས། །དེ་ནས་དེ་ཚེ་བཅོམ་ལྡན་འདས། །གྲོང་ཁྱེར་དུ་ནི་གཤེགས་པའི་ཚེ། །\nགཞན་ཡང་རྣམ་པ་ཐ་དད་པའི། །བྱ་ཡི་<span class='delete'>ཆོགས་</span><span class='add'>ཚོགས་</span>ནི་ཚད་མེད་པ། །ནེ་ཙོ་དང་ནི་རྨ་བྱ་དང། །ཀ་ལ་<span class='delete'>བིང་</span><span class='add'>པིང་</span>ཀ་བྱ་ཡི་རྣམས། །བཅོམ་ལྡན་དེ་བཞིན་གཤེགས་པ་ཡི། །ཡོན་ཏན་མཆོག་ནི་མཐོང་བས་ན། །ཐམས་ཅད་\nནམ་མཁའ་དག་ལ་ནི། །རབ་ཏུ་དགའ་བས་རྣམ་པར་རྩེ། །ཐམས་ཅད་རྣམ་པ་སྣ་ཚོགས་ཀྱི། །སྒྲ་སྙན་དག་ནི་རབ་ཏུ་<span class='delete'>ཕྱུང། །</span><span class='add'>ཕྱུང་། །</span>དེ་ནས་དེ་ཚེ་བཅོམ་ལྡན་འདས། །གྲོང་ཁྱེར་དུ་ནི་གཤེགས་པའི་ཚེ། །བཅོམ་\nལྡན་འདས་ཀྱི་ཡོན་ཏན་<span class='delete'>དང། །</span><span class='add'>དང་།  །</span>རྫུ་འཕྲུལ་གྱི་ནི་སྟོབས་དག་གིས། །སེམས་ཅན་ཚད་མེད་བརྒྱ་སྟོང་སྙེད། །ལྡོངས་<span class='delete'>པ་</span><span class='add'>བ་</span>དག་ནི་མཐོང་<span class='delete'>པར་</span><span class='add'>བར་</span>འགྱུར། །འོན་པ་རྣམས་ནི་ཐོས་པར་གྱུར། །དབང་པོ་མ་ཚང་གང་ཡིན་པ། །\nཐམས་ཅད་དབང་པོ་ཚང་བར་གྱུར། །སྡུག་བསྔལ་ལ་ནི་གནས་པ་དག །ཐམས་ཅད་བདེ་བ་ཐོབ་པར་གྱུར། །དེ་ནས་དེ་ཚེ་བཅོམ་ལྡན་འདས། །གྲོང་ཁྱེར་དུ་ནི་གཤེགས་པའི་ཚེ། །ནམ་མཁའ་བར་སྣང་དག་ལས་ནི། །འདི་སྐད་\nསྨྲ་བ་ཐོས་པར་གྱུར། །གང་གིས་མཚན་མ་རྣམས་ཀྱིས་ནི། །དེ་བཞིན་གཤེགས་པ་རྟོགས་བྱེད་པ། །དེ་ཡིས་བཅོམ་ལྡན་འདས་ལ་ནི། །མཆོད་པ་བྱས་ཤེས་བརྗོད་མི་བྱ། །མིག་ཟད་མཐའ་ཡི་ངོ་བོ་ཉིད། །རྟོགས་\nཔར་ཡང་ནི་མི་འགྱུར་རོ། །མཚན་མ་རྣམས་ནི་གང་སྤངས་པ། །ཡོན་ཏན་བཞི་ནི་བསགས་པས་ན། །མིག་ཟད་མཐའ་ཡི་ངོ་བོ་ཉིད། །རབ་ཏུ་རྟོགས་པར་ཡང་འགྱུར་རོ། །འདི་ལྟར་མིག་ནི་ཟད་པའི་མཐའ། །"
 ],
 [
  "79.278a",
  "རྣམས་ཀྱིས། །དེ་བཞིན་གཤེགས་པ་རྣམས་ལ་ནི། །བསྟེན་ཅིང་རིམ་གྲོ་མཆོད་པ་བྱས། །ལྷ་དང་མི་ནི་འདྲེན་པ་ཡིས། །བསམ་གྱིས་མི་ཁྱབ་མཐུ་དག་གིས། །མདོ་སྡེ་དག་ནི་བརྒྱ་\nསྟོང་དང་། །ཚད་མེད་གྲངས་མེད་རབ་བཤད་པས། །སེམས་ཅན་དག་ནི་མང་པོ་རྣམས། །བསྟན་པ་དེ་ནི་ཐོས་པས་ན། །ཐམས་ཅད་དང་བས་རབ་བླངས་ཏེ། །སེམས་ནི་རབ་ཏུ་དགའ་བར་གྱུར། །དེ་ཡི་\nཚེ་ན་བཅོམ་ལྡན་འདས། །གྲོངས་ཁྱེར་དུ་ནི་གཤེགས་པའི་ཚེ། །རྫུ་འཕྲུལ་གྱི་ནི་མཐུ་དག་གིས། །ནམ་མཁའ་ལས་ནི་འདི་སྐད་དུ། །མིག་ཟད་མཐའ་ནི་ཤེས་པ་ནས། །མིག་ནི་ཉེ་བར་ཞི་བ་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>\nམིག་ཉིད་རྒྱུ་ཡི་བར་དུ་<span class='delete'>ཡང། །</span><span class='add'>ཡང་། །</span>འགྲོ་བ་མེད་ཅིང་འོང་མེད་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>མཐར་ནི་སྟོང་དབེན་ཤེས་པར་གྱིས། །དེ་སྐད་དུ་ནི་ཐོས་པར་གྱུར། །རྣ་བ་སྣ་ལྕེ་ལུས་ནས་ནི། །སྒྲ་དང་མིང་ལ་སོགས་པའི་བར། །ཆོས་ནི་\nརྣམ་པ་ཉི་ཤུ་ལྔ། །ཐམས་ཅད་དེ་བཞིན་སྦྱར་བར་བྱ། །དེ་ཡི་ཚེ་ན་བཅོམ་ལྡན་འདས། །གྲོང་ཁྱེར་དུ་ནི་གཤེགས་པའི་ཚེ། །ནམ་མཁའ་བར་སྣང་དག་ལས་ནི། །སྒྲ་སྙན་དམ་པ་མཆོག་བྱུང་ནས། །དེ་བཞིན་\nགཤེགས་པའི་མཚན་སྣ་ཚོགས། །བསྔགས་པ་བརྗོད་པར་གྱུར་པས་ན། །འཁོར་ནི་འདུས་པ་ཆེན་པོ་རྣམས། །ཐམས་ཅད་<span class='delete'>དང་</span><span class='add'>དད་</span>མོས་སེམས་ཀྱང་སྐྱེས། །ད་ལྟར་འཇིག་རྟེན་བཞུགས་པ་ཡི། །མི་ཡི་\nསེང་གེ་གང་ཡིན་པ། །མཚན་ནི་བདུད་དང་བདུད་དཔུང་དག །ཕམ་མཛད་ཆོས་ཀྱི་རྒྱལ་ཞེས་བྱ། །གང་གིས་འདི་ལྟ་བུ་ཡི་མཚན། །ཐོས་པར་གྱུར་པ་དེ་དག་ནི། །ལོག་པར་ལྟ་བའི་ཚོགས་ཐམས་ཅད། །\nརབ་ཏུ་འདུལ་བར་ནུས་ཤེས་ཟེར། །ད་ལྟར་འཇིག་རྟེན་བཞུགས་པ་ཡི། །མི་ཡི་སེང་གེ་གང་ཡིན་པ། །མཚན་ནི་འདོད་ཆགས་གཞོམ་<span class='delete'>པ་</span><span class='add'>པ་</span><span class='delete'>དང། </span><span class='add'>དང་། །</span>ཞི་མཛད་ཆོས་ཀྱི་རྒྱལ་ཞེས་བྱ། །གང་གིས་འདི་ལྟ་བུ་ཡི་"
 ],
 [
  "79.271a",
  "བཅས་ཚུལ་ཁྲིམས་རབ་སྨད་དེ། །ཟག་མེད་བསླབ་གནས་བསྔགས་པར་མཛད། །ཐུགས་རྗེ་ཆེན་པོས་འཕྲུལ་བསྟན་པས། །སེམས་ཅན་རྣམས་ལ་རྒྱ་ཆེར་ནི། །སེམས་རྒྱ་ཆུང་ངུའི་སྐྱོན་བརྗོད་དེ། །\nསེམས་རྒྱ་ཆེན་པོའི་ཡོན་ཏན་བསྔགས། །ཐུགས་རྗེ་ཆེན་པོས་འཕྲུལ་བསྟན་ནས། །ལུས་ཀྱི་ཚུལ་ཁྲིམས་སེམས་ཤེས་རབ། །ཟག་མེད་རྟེན་པ་མེད་པ་ཡི། །བསྔགས་པ་དག་ནི་བརྗོད་པར་མཛད། །ཐུགས་རྗེ་ཆེན་པོས་\nའཕྲུལ་བསྟན་ནས། །སྡུག་བསྔལ་འགོག་པའི་ལམ་བསྔགས་<span class='delete'>ཤིང། །</span><span class='add'>ཤིང་། །</span>སྤྲོས་ལ་དགའ་ཞིང་ཞེན་པ་དག །སངས་རྒྱས་སྨད་པར་རབ་ཏུ་བསྟན། །ཐུགས་རྗེ་ཆེན་པོས་འཕྲུལ་བསྟན་ནས། །སེམས་ཅན་རྣམས་ལ་\nརྒྱ་ཆེར་ནི། །མི་བཟད་སྐྱོན་ནི་རབ་འབྱེད་<span class='delete'>ཅིང། །</span><span class='add'>ཅིང་། །</span>རབ་ཞི་མཚན་ཉིད་བསྟན་པར་མཛད། །རྣ་བ་སྣ་ལྕེ་ལུས་དང་ཡིད། །གཟུགས་སྒྲ་དྲི་རོ་རེག་བྱ་ནས། །སྒྲ་དང་མིང་གིས་བར་དུ་ཡང་། །ཐམས་ཅད་དེ་བཞིན་སྦྱར་བར་བྱ། །\nཐུགས་རྗེ་ཆེན་པོས་འཕྲུལ་བསྟན་ནས། །སེམས་ཅན་རྣམས་ལ་རྒྱ་ཆེར་ནི། །དར་ལ་བབ་ཅིང་གཞོན་པ་ལ། །ཉེས་དམིགས་དཔག་མེད་ཡོད་པར་བསྟན། །ཐུགས་རྗེ་ཆེན་པོས་འཕྲུལ་བསྟན་ནས། །སེམས་ཅན་རྣམས་\nལ་རྒྱ་ཆེར་ནི། །ཆོ་རིགས་དག་ནི་སྙེམས་པ་ལ། །ཉེས་དམིགས་དཔག་མེད་ཡོད་པར་བསྟན། །ཐུགས་རྗེ་ཆེན་པོས་འཕྲུལ་བསྟན་ནས། །སེམས་ཅན་རྣམས་ལ་རྒྱ་ཆེར་ནི། །ལོངས་སྤྱོད་བག་མེད་གྱུར་པ་ལ། །ཉེས་\nདམིགས་དཔག་མེད་ཡོད་པར་བསྟན། །ཐུགས་རྗེ་ཆེན་པོས་འཕྲུལ་བསྟན་ནས། །སེམས་ཅན་རྣམས་ལ་རྒྱ་ཆེར་ནི། །རང་དབང་བག་མེད་གྱུར་པ་ལ། །ཉེས་དམིགས་དཔག་མེད་ཡོད་པར་བསྟན། །ཐུགས་རྗེ་ཆེན་པོས་\nའཕྲུལ་བསྟན་ནས། །སེམས་ཅན་རྣམས་ལ་རྒྱ་ཆེར་ནི། །གཟུགས་ཀྱིས་བག་མེད་གྱུར་པ་ལ། །ཉེས་དམིགས་དཔག་མེད་ཡོད་པར་བསྟན། །ཐུགས་རྗེ་ཆེན་པོས་འཕྲུལ་བསྟན་ནས། །སེམས་ཅན་རྣམས་ལ་རྒྱ་"
 ],
 [
  "79.279a",
  "ཐོས་པར་གྱུར་པ་དེ་དག་ནི། །མི་བདེན་དག་ནི་གང་ཡིན་པ། །ཐམས་ཅད་སྤོང་བར་འགྱུར་ཞེས་ཟེར། །ད་ལྟར་འཇིག་རྟེན་བཞུགས་པ་ཡི། །མི་ཡི་སེང་གེ་གང་ཡིན་པ། །མཚན་ནི་<span class='delete'>ལྷ་</span><span class='add'>ལྟ་</span>རྣམས་གཞོམ་<span class='delete'>པ་</span><span class='add'>པ་</span><span class='delete'>དང། །</span><span class='add'>དང་། །</span>\nཞི་མཛད་ཆོས་ཀྱི་རྒྱལ་ཞེས་བྱ། །གང་གིས་འདི་ལྟ་བུ་ཡི་མཚན། །ཐོས་པར་གྱུར་པ་དེ་དག་ནི། །ལྟ་བ་དག་ནི་གང་ཡིན་པ། །ཐམས་ཅད་སྤོང་བར་འགྱུར་ཞེས་ཟེར། །ད་ལྟར་འཇིག་རྟེན་བཞུགས་པ་ཡི། །\nམི་ཡི་སེང་གེ་གང་ཡིན་པ། །མཚན་ནི་སྤྲོས་པ་གཞོམ་<span class='delete'>པ་</span><span class='add'>པ་</span><span class='delete'>དང། །</span><span class='add'>དང་། །</span>ཞི་མཛད་ཆོས་ཀྱི་རྒྱལ་ཞེས་བྱ། །གང་གིས་འདི་ལྟ་བུ་ཡི་མཚན། །ཐོས་པར་གྱུར་པ་དེ་དག་ནི། །སྤྲོས་པ་དག་ནི་གང་ཡིན་པ། །ཐམས་ཅད་\nསྤོང་བར་འགྱུར་ཞེས་ཟེར། །ད་ལྟར་འཇིག་རྟེན་བཞུགས་པ་ཡི། །མི་ཡི་སེང་གེ་གང་ཡིན་པ། །མཚན་ནི་ཡང་དག་པ་ཡི་ཆོས། །རྣམ་དག་ཆོས་ཀྱི་རྒྱལ་ཞེས་བྱ། །གང་གིས་འདི་ལྟ་བུ་ཡི་མཚན། །ཐོས་\nཔར་གྱུར་པ་དེ་དག་ནི། །རྣམ་དག་ཆོས་ནི་གང་ཡིན་པ། །རབ་ཏུ་རྟོགས་པར་འགྱུར་ཞེས་ཟེར། །ད་ལྟར་འཇིག་རྟེན་བཞུགས་པ་ཡི། །མི་ཡི་སེང་གེ་གང་ཡིན་པ། །མཚན་ནི་ལས་རྣམས་རྟོགས་པ་ཡི། །ཆོས་ཀྱི་རྒྱལ་\nཞེས་བྱ་བ་ཡིན། །གང་གིས་འདི་ལྟ་བུ་ཡི་མཚན། །ཐོས་པར་གྱུར་པ་དེ་དག་ནི། །ལས་རྣམས་ཐམས་ཅད་གང་ཡིན་པ། །རབ་ཏུ་རྟོགས་པར་འགྱུར་ཞེས་ཟེར། །ད་ལྟར་འཇིག་རྟེན་བཞུགས་པ་ཡི། །མི་ཡི་\nསེང་གེ་གང་ཡིན་པ། །མཚན་ནི་རྫུ་འཕྲུལ་ཕུན་ཚོགས་པའི། །ཆོས་ཀྱི་རྒྱལ་ཞེས་བྱ་བ་ཡིན། །གང་གིས་འདི་ལྟ་བུ་ཡི་མཚན། །ཐོས་པར་གྱུར་པ་དེ་དག་ནི། །རྫུ་འཕྲུལ་ཡོན་ཏན་གང་ཡིན་པ། །ཡོངས་\nསུ་རྫོགས་པར་འགྱུར་ཞེས་ཟེར། །ད་ལྟར་འཇིག་རྟེན་བཞུགས་པ་ཡི། །མི་ཡི་སེང་གེ་གང་ཡིན་པ། །མཚན་ནི་ཕ་རོལ་ཕྱིན་པ་རྣམས། །ཕུན་ཚོགས་ཆོས་ཀྱི་རྒྱལ་ཞེས་བྱ། །གང་གིས་འདི་ལྟ་བུ་"
 ],
 [
  "79.279b",
  "ཡི་མཚན། །ཐོས་པར་གྱུར་པ་དེ་དག་ནི། །ཕ་རོལ་ཕྱིན་དྲུག་གང་ཡིན་པ། །ཡོངས་སུ་རྫོགས་པར་འགྱུར་ཞེས་ཟེར། །ད་ལྟར་འཇིག་རྟེན་བཞུགས་པ་ཡི། །མི་ཡི་སེང་གེ་གང་ཡིན་པ། །མཚན་ནི་<span class='delete'>དུས་</span><span class='add'>འདུ་</span>བྱེད་\nགང་ཡིན་པ། །རབ་རྟོགས་ཆོས་ཀྱི་རྒྱལ་ཞེས་བྱ། །གང་གིས་འདི་ལྟ་བུ་ཡི་མཚན། །འཛིན་པར་བྱེད་པ་དེ་དག་ནི། །འདུ་བྱེད་དག་ནི་ཐམས་ཅད་ཀུན། །རབ་ཏུ་རྟོགས་པར་འགྱུར་ཞེས་ཟེར། །ད་ལྟར་འཇིག་\nརྟེན་བཞུགས་པ་ཡི། །མི་ཡི་སེང་གེ་གང་ཡིན་པ། །མཚན་ནི་རྣམ་པར་དག་པ་ཡི། །འོད་ཟེར་ཀུན་འཛིན་སྐྱེད་ཅེས་བྱ། །གང་གིས་འདི་ལྟ་བུ་ཡི་མཚན། །ཐོས་པར་གྱུར་པ་དེ་དག་ནི། །ཁྱད་པར་འཕགས་\nཔའི་སྐྱེ་ལེན་དག །ཡོངས་སུ་རྫོགས་པར་འགྱུར་ཞེས་ཟེར། །ད་ལྟར་འཇིག་རྟེན་བཞུགས་པ་ཡི། །མི་ཡི་སེང་གེ་གང་ཡིན་པ། །མཚན་ནི་ཁ་དོག་དག་པ་ཡི། །འོད་ཟེར་ཀུན་འཛིན་ཞེས་ཀྱང་བྱ། །གང་\nགིས་འདི་ལྟ་བུ་ཡི་མཚན། །ཐོས་པར་གྱུར་པ་དེ་དག་ནི། །ཁྱད་པར་འཕགས་པའི་གཟུགས་དམ་པ། །ཡོངས་སུ་རྫོགས་པར་འགྱུར་ཞེས་ཟེར། །ད་ལྟར་འཇིག་རྟེན་བཞུགས་པ་ཡི། །མི་ཡི་སེང་\nགེ་གང་ཡིན་པ། །མཚན་ནི་སྐུ་ཉིད་དག་པ་ཡི། །འོད་ཟེར་ཀུན་འཛིན་ཞེས་ཀྱང་བྱ། །གང་གིས་འདི་ལྟ་བུ་ཡི་མཚན། །ཐོས་པར་གྱུར་པ་དེ་དག་ནི། །ཁྱད་པར་འཕགས་པའི་གཟུགས་སྐུ་དག །ཡོངས་སུ་\nརྫོགས་པར་འགྱུར་ཞེས་ཟེར། །ད་ལྟར་འཇིག་རྟེན་བཞུགས་པ་ཡི། །མི་ཡི་སེང་གེ་གང་ཡིན་པ། །མཚན་ནི་<span class='delete'>གདུད་</span><span class='add'>གདུང་</span>ཉིད་དག་པ་ཡི། །འོད་ཟེར་ཀུན་འཛིན་ཞེས་ཀྱང་བྱ། །གང་གིས་འདི་ལྟ་བུ་ཡི་མཚན། །ཐོས་\nཔར་གྱུར་པ་དེ་དག་ནི། །ཁྱད་པར་འཕགས་པའི་རུས་རིགས་རྣམས། །ཡོངས་སུ་རྫོགས་པར་འགྱུར་ཞེས་ཟེར། །ད་ལྟར་འཇིག་རྟེན་བཞུགས་པ་ཡི། །མི་ཡི་སེང་གེ་གང་ཡིན་པ། །མཚན་ནི་རྒྱ་ཆེར་གྲགས་"
 ],
 [
  "79.280a",
  "པ་ཡི། །འོད་ཟེར་ཀུན་འཛིན་ཞེས་ཀྱང་བྱ། །གང་གིས་འདི་ལྟ་བུ་ཡི་མཚན། །ཐོས་པར་གྱུར་པ་དེ་དག་ནི། །རྒྱ་ཆེར་གྲགས་པའི་གྲགས་པ་རྣམས། །ཡོངས་སུ་རྫོགས་པར་འགྱུར་ཞེས་ཟེར། །ད་\nལྟར་འཇིག་རྟེན་བཞུགས་པ་ཡི། །མི་ཡི་སེང་གེ་གང་ཡིན་པ། །མཚན་ནི་སྦྱིན་པ་གཏོང་བ་དང་། །ཚུལ་ཁྲིམས་ཅན་དང་བཟོད་བསྒོམས་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>བརྩོན་འགྲུས་བརྩམས་དང་བསམ་གཏན་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>ཤེས་རབ་ཀུན་\nའཛིན་ཞེས་ཀྱང་བྱ། །གང་གིས་འདི་ལྟ་བུ་ཡི་མཚན། །ཐོས་པར་གྱུར་པ་དེ་དག་ནི། །སྦྱིན་པ་དང་ནི་ཚུལ་ཁྲིམས་ནས། །ཤེས་རབ་ཕ་རོལ་ཕྱིན་པ་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>གཟུངས་ཀྱི་སྒོ་ནི་གང་ཡིན་པ། །ཡོངས་སུ་རྫོགས་\nཔར་འགྱུར་ཞེས་ཟེར། །ད་ལྟར་འཇིག་རྟེན་བཞུགས་པ་ཡི། །མི་ཡི་སེང་གེ་གང་ཡིན་པ། །མཚན་ནི་སྟོང་ཉིད་རྫོགས་པ་ཡི། །ཆོས་ཀྱི་རྗེ་ཞེས་བྱ་བ་ཡིན། །གང་གིས་འདི་ལྟ་བུ་ཡི་མཚན། །འཛིན་པར་བྱེད་\nཔ་དེ་དག་ནི། །ཆོས་རྣམས་སྟོང་པའི་དོན་དག་<span class='delete'>ཀྱང། །</span><span class='add'>ཀྱང་། །</span>ཡང་དག་སྟོན་པར་འགྱུར་ཞེས་ཟེར། །ད་ལྟར་འཇིག་རྟེན་བཞུགས་པ་ཡི། །མི་ཡི་སེང་གེ་གང་ཡིན་པ། །མཚན་ནི་བདག་མེད་རྫོགས་པ་ཡི། །\nཆོས་ཀྱི་རྗེ་ཞེས་བྱ་བ་ཡིན། །གང་གིས་འདི་ལྟ་བུ་ཡི་མཚན། །འཛིན་པར་བྱེད་པ་དེ་དག་ནི། །སྐྱེ་འགག་མེད་དོན་གང་ཡིན་པ། །ཡང་དག་སྟོན་པར་འགྱུར་ཞེས་ཟེར། །ད་ལྟར་འཇིག་རྟེན་བཞུགས་\nཔ་ཡི། །མི་ཡི་སེང་གེ་གང་ཡིན་པ། །མཚན་ནི་སྤྱན་ཉིད་དག་པ་ཡི། །ཀུན་འཛིན་ཆོས་ཀྱི་རྗེ་ཞེས་བྱ། །གང་གིས་འདི་ལྟ་བུ་ཡི་མཚན། །འཛིན་པར་བྱེད་པ་དེ་དག་ནི། །མིག་ཟད་མཐའ་དོན་གང་\nཡིན་པ། །ཡང་དག་སྟོན་པར་འགྱུར་ཞེས་ཟེར། །རྣ་བ་སྣ་ལྕེ་ལུས་ནས་ནི། །སྒྲ་དང་མིང་ལ་སོགས་པའི་བར། །ཆོས་ནི་ཉི་ཤུ་རྩ་ལྔ་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>མེ་ཏོག་ཕྲེང་བ་སྤོས་དག་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>མར་མེ་གདུག་དང་གོས་"
 ],
 [
  "79.280b",
  "རྣམས་<span class='delete'>ཀྱང། །</span><span class='add'>ཀྱང་། །</span>ཐམས་ཅད་དེ་བཞིན་སྦྱར་བར་བྱ།། །། །།བམ་པོ་ལྔ་པ་སྟེ་ཐ་མ།། དེ་ཡི་ཚེ་ན་བཅོམ་ལྡན་འདས། །གྲོང་ཁྱེར་དུ་ནི་གཤེགས་པའི་ཚེ། །བསམ་གྱིས་མི་ཁྱབ་པ་དག་ནི། །རྫུ་འཕྲུལ་\nགྱི་ནི་སྟོབས་རྣམས་ཀྱིས། །ནམ་མཁའ་བར་སྣང་དག་ལས་ནི། །སྒྲ་སྙན་དམ་པ་རབ་བྱུང་སྟེ། །གཟུགས་ཀྱི་སྤྱོད་པ་སྣ་ཚོགས་དག །ཡང་དག་པར་ནི་བསྟན་པས་ན། །འཁོར་ནི་འདུས་པ་ཆེན་པོ་རྣམས། །འདི་ལྟ་བུ་\nཡི་ཚིག་ཐོས་ཏེ། །གཟུངས་ནི་གང་ཡིན་འདི་དག་གིས། །མིག་གི་ཟད་མཐའ་གང་ཡིན་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>སྐྱེ་མཐའ་དང་ནི་མཐའ་རྣམས་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>རབ་དབེན་དང་ནི་འཇུག་པ་ནས། །ཉེ་བར་ཞི་བའི་བར་རྣམས་ཀྱི། །\nཆོས་རྣམས་གང་ཡིན་དེ་དག་གིས། །མཐར་ཕྱིན་གནས་ནི་གང་ཡིན་པ། །ཐམས་ཅད་རབ་ཏུ་རྟོགས་པར་བྱེད། །སྦྱིན་པའི་སྟོབས་ནི་གང་དག་གིས། །མཐར་ནི་གང་དག་སྡུད་པ་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>ཚུལ་ཁྲིམས་སྟོབས་\nནི་གང་དག་གིས། །མཐར་ནི་གང་དག་འགྲུབ་པ་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>བཟོད་པའི་སྟོབས་ནི་གང་དག་གིས། །མཐར་ནི་གང་དག་བཀོད་པ་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>བརྩོན་འགྲུས་སྟོབས་ནི་གང་དག་གིས། །མཐར་ནི་གང་དག་སློང་བ་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>\nཤེས་རབ་སྟོབས་ནི་གང་དག་གིས། །མཐར་ནི་གང་དག་སྟོན་པ་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>ཡི་གེ་རྣམས་དང་བརྗོད་པ་<span class='delete'>དང། །</span><span class='add'>དང་། །</span><span class='delete'>སྒྲ་</span><span class='add'>སྒྲ་</span>སྐད་རྣམས་ནི་སྤངས་པ་ནས། །གཟུགས་དང་སེམས་ཀྱི་བར་དུ་<span class='delete'>ཡང། །</span><span class='add'>ཡང་། །</span>མཐར་ནི་རྣམ་དག་ཉིད་དུ་\nརྟོགས། །ཟག་དང་བཅས་དང་ཟག་མེད་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>དོན་རྣམས་དང་ནི་ཕན་པ་དག །ཐམས་ཅད་སྟོང་ཞིང་དབེན་པ་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>མཐར་ནི་རྣམ་དག་ཉིད་དུ་རྟོགས། །སྲིད་པ་དག་ནི་ཐམས་ཅད་ལ། །རྟེན་ཅིང་གནས་པར་མི་\nབྱེད་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>གཟུགས་དང་ཏིང་འཛིན་དག་ལ་ནི། །རབ་ཏུ་དབེན་པར་གནས་པར་བྱེད། །འགྲོ་བ་མེད་ཅིང་<span class='delete'>འོད་</span><span class='add'>འོང་</span>མེད་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>དགེ་བ་མ་ཡིན་མི་དགེ་མིན། །ལུང་དུ་མི་སྟོན་པ་ཡང་མིན། །བདག་དང་གཞན་ལ་ཕན་འདོགས་པའི།།"
 ],
 [
  "79.281a",
  "དེ་ལྟ་བུ་ཡི་མཚན་མ་རྣམས། །ཐམས་ཅད་ཡོངས་སུ་དག་པས་ན། །དབང་ཕྱུག་ཡོན་ཏན་<span class='delete'>ངག་</span><span class='add'>དག་</span>ལ་ཡང་། །གནས་པར་ཡང་ནི་མི་བྱེད་དོ། །ཉན་ཐོས་དང་ནི་སྐྱེ་བོ་དང་། །སངས་རྒྱས་རྣམས་ཀྱི་ཆོས་ལ་\nཡང་། །གནས་པར་ཡང་ནི་མི་བྱེད་དོ། །མིག་ནི་ཟད་པའི་མཐའ་དག་དང་། །སྐྱེ་མཐའ་དང་ནི་མཐའ་རྣམས་ནས། །ཉེ་བར་ཞི་བའི་བར་རྣམས་ཀྱི། །སྤྱོད་པ་དག་ནི་གང་ཡིན་པ། །ཐམས་ཅད་ཡོངས་སུ་ཞི་བར་\nབྱེད། །སྐྱེ་བ་དང་ནི་མི་སྐྱེ་དང་། །སྡུག་བསྔལ་དང་ནི་བདེ་བ་དང་། །བསྟོད་པ་དག་ནི་སྨད་པ་<span class='delete'>དག། །</span><span class='add'>དག །</span>ཐམས་ཅད་ཡོངས་སུ་སྤོང་ཞེས་ཟེར། །མཐར་ཕྱིན་སྣང་བ་གང་ཡིན་དང་། །<span class='delete'>སྟོད་</span><span class='add'>སྟོང་</span>པའི་གཟུངས་ནི་གང་ཡིན་\nཔ། །ཐམས་ཅད་རབ་ཏུ་གང་རྟོགས་པ། །འདི་ཉིད་སངས་རྒྱས་སྤྱོད་ཡུལ་ལ། །རབ་ཏུ་གནས་པར་བྱེད་པ་ཡིན། །འདི་ཉིད་སངས་རྒྱས་རོལ་པ་ཡི། །གནས་ལ་རབ་ཏུ་གནས་པ་ཡིན། །འདི་ཉིད་སངས་\nརྒྱས་རྫུ་འཕྲུལ་ལ། །རབ་ཏུ་གནས་པར་གྱུར་པ་ཡིན། །འདི་ཉིད་སངས་རྒྱས་མཁྱེན་པ་ལ། །རབ་ཏུ་གནས་པར་གྱུར་པ་ཡིན། །མིག་ཟད་མཐའ་ཡི་སྟོབས་དག་ལ། །དེ་བཞིན་དུ་ནི་གནས་པ་དང་། །མིག་\nསྐྱེ་མཐའ་ཡི་སྟོབས་དག་ལ། །དེ་བཞིན་དུ་ནི་གནས་པ་དང་། །མིག་གི་མཐའ་ཡི་སྟོབས་དག་ལ། །དེ་བཞིན་དུ་ནི་གནས་པ་ནས། །ཉེ་བར་ཞི་བའི་སྟོབས་ཀྱི་བར། །དེ་ལ་རབ་ཏུ་གནས་པ་དང་། །རྣ་བ་སྣ་ལྕེ་\nལུས་ནས་ནི། །སྒྲ་དང་མིང་ལ་སོགས་པའི་བར། །ཆོས་ནི་རྣམས་པ་ཉི་ཤུ་ལྔ། །ཐམས་ཅད་དེ་བཞིན་སྦྱར་ཞེས་ཟེར། །གཟུངས་ནི་གང་ཡིན་འདི་དག་གིས། །དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་སྟོབས། །\nཁྱད་པར་འཕགས་པ་གང་ཡིན་པ། །ཡོངས་སུ་རྫོགས་པར་བྱེད་ཅེས་ཟེར། །གཟུངས་ནི་གང་ཡིན་འདི་དག་གིས། །གཟི་བྱིན་མཐུ་སྟོབས་དེ་ལྟ་བུ། །ཡོངས་སུ་རྫོགས་པར་བྱས་ནས་ནི། །དེ་བཞིན་གཤེགས་"
 ],
 [
  "79.282b",
  "མཆོག་བྱུང་ནས། །ཁྱད་པར་འཕགས་པ་གཟུངས་ཀྱི་ཆོས། །འདི་སྐད་དུ་ནི་བཀའ་སྩལ་ཏེ། །འདི་ཡང་དེ་བཞིན་གཤེགས་པ་ཡིས། །རྫུ་འཕྲུལ་དག་གིས་སྤྲུལ་པ་ཡིན། །འདི་ལྟ་སྟེ། སི་ལེ། མ་ལེ་མ་ལེ། སིད་\nདྷེ་ཨཻ་ནི། སི་ཎེ་ཀུ་ལུ་<span class='delete'>ནི་</span><span class='add'>ནི་</span>ཡུ། ཀུ་ལུ་ནེ་ཡུ། ཀུ་ལེ་མ་<span class='delete'>ཡེ། </span><span class='add'>ལེ།   </span>ཀུ་ནོ་ཏེ། ཨ་ལ་ཤི་ཨ་སི་ལེ། སི་སི་ལེ་ཏེ། སུ་སི་ལེ། སི་ལེ་སི་ལེ། ཁྱི་<span class='delete'>བི་</span><span class='add'>པི་</span>ལེ། ཨཱ་པཱི་ལེ་སུ་ཊེ་ཙ་ན། དྷ་ནི་མ་ནི། ཀ་ནི། ཀ་ལེ་ཏེ། སུ་\nཀ་ལེ། པྲ་ཡ། །ཤ་ནང་ནི། ཨ་ནུ་ལོ་སི་ཀྱི། བི་ལོ་མི། སུ་བྷ་ནི་རེ་<span class='delete'>ཤ་</span><span class='add'>ཤྷེ</span><span class='delete'>ཧེ། </span><span class='add'>། </span>ཨ་ཤི་རི་ལེ། སར་མ་<span class='delete'>པར་</span><span class='add'>པ་ར་</span>ཕན་ཏེ། པ་རི་བྷ་ཧེ། དྷ་ར་ནི། དྷེ་ཤུ་ཙི་<span class='delete'>ཏ། </span><span class='add'>ཧ།   </span>སུ་དྷེ། ཨ་ཙ་ན། བྷུ་པོ་ག་<span class='delete'>གནང་། </span><span class='add'>ག་ནང་། ཀུད་</span><span class='delete'></span><span class='add'></span>ཀུར་བ་ནོ། བྷ་ས་བྷ་ནང་། \n<span class='delete'>པ་</span><span class='add'>པ</span>ན་རི་<span class='delete'>དྷྱ་</span><span class='add'>དྷུ་</span>རི་ཡ། ནི་པ་རི་ཀ་ནོ་ནི། <span class='delete'>མན་</span><span class='add'>མ་ན་</span>བྷ། སུ་རུ་ཙི་ཊ། བ་ན་ཨཱ་ཙ་ར། ཨཱ་<span class='delete'>བྷེ་</span><span class='add'>བྷཱེ་</span>ལ་<span class='delete'>བིདྱ་</span><span class='add'>བིརྱ་</span>པྲ་ཊི་<span class='delete'>ཤ་</span><span class='add'>ཤྠ་</span><span class='delete'>ཐ་</span><span class='add'></span>ཧ། དྷ་རི་ནི། ཨ་སི་ཊ། ལོ་ཎི་བྷི།། །།གཟུངས་རྣམས་གང་ཡིན་འདི་དག་ནི། །སངས་རྒྱས་རྣམས་ཀྱིས་རབ་ཏུ་བརྙེས། །མཐུ་\nཆེན་དག་ནི་ཕུན་སུམ་ཚོགས། །ཤེས་རབ་དག་ནི་ཚད་ཀྱང་མེད། །འཛིན་པ་དག་ནི་ཡོངས་སུ་<span class='delete'>སྤོང། །</span><span class='add'>སྤོང་། །</span>དྲན་པ་དག་ནི་དག་པར་བྱེད། །གཟུངས་མེད་འགྲོ་དང་འོང་བ་མེད། །ཕྱོགས་དང་ཕྱོགས་མཚམས་ཡོད་པ་མིན། མཚན་\nམ་མེད་ཅིང་བརྗོད་དང་བྲལ། །སྤྲོས་པ་དག་ལས་ཡང་དག་འདས། །བྱང་ཆུབ་སེམས་དཔས་སྒྲུབ་བྱེད་<span class='delete'>ན། </span><span class='add'>ན། །</span>མཐར་ནི་གསིལ་བ་འཐོབ་པར་འགྱུར། །ཚིགས་སུ་བཅད་པ་བྱེ་བ་<span class='delete'>ཕྲག། །</span><span class='add'>ཕྲག །</span>བརྒྱ་སྟོད་མང་པོ་དག་གི་ནི། །\nཚིགས་ཅིག་ཙམ་ནི་རབ་བསྟན་ཀྱང་། །མཐའ་ནི་དམིགས་པར་ཡོད་མི་ནུས། །འཕགས་པ་མང་པོས་རབ་ཏུ་བསྔགས། །རྣམ་པར་<span class='delete'>དག་</span><span class='add'></span><span class='delete'>ནི་</span><span class='add'></span><span class='delete'>དག་</span><span class='add'>དག་</span>ཅིང་ཞེན་པ་མེད། །འཁོར་འདུས་མང་པོ་ཐམས་ཅད་ཀྱིས། །ཤིན་ཏུ་\nགུས་པ་སྐྱེད་པར་བྱེད། །གཟུངས་ནི་གང་ཡིན་འདི་དག་གི། །དགེ་བའི་ཆོས་ཀྱི་མཐུ་སྟོབས་ཀྱིས། །ཉོན་མོངས་རབ་བཅོམ་ཉེར་ཞི་ནས། །ཁྱད་འཕགས་ཕན་ཡོན་ཐོས་པར་བྱེད། །ཡོན་ཏན་དང་ནི་ཤེས་རབ་དག། །"
 ],
 [
  "79.282a",
  "རྣམས་ལས། །གྲུབ་པའི་མིག་ནི་གང་ཡིན་དང་། །ཡེ་ཤེས་མིག་དང་ཤེས་རབ་<span class='delete'>མིག། །</span><span class='add'>མིག །</span>ཚངས་པའི་མིག་དང་ལྷ་མིག་དང་། །ཚངས་པའི་སྐྱེས་ནས་ཐོབ་མིག་དང་། །ལྷར་ནི་སྐྱེས་ནས་ཐོག་མིག་དང་། །ཚངས་པའི་\nརྣམ་སྨིན་མིག་དག་དང་། །ལྷ་ཡི་རྣམ་སྨིན་མིག་དག་དང་། །ཚངས་པའི་རྒྱུ་ལས་སྐྱེས་མིག་དང་། །ལྷ་ཡི་རྒྱུ་ལས་སྐྱེས་པའི་<span class='delete'>མིག། །</span><span class='add'>མིག །</span>ལྷ་ཡི་རྫུ་འཕྲུལ་མི་དག་དང་། །ལྷ་ཡི་བརྩོན་འགྲུས་དག་གི་<span class='delete'>མིག། །</span><span class='add'>མིག །</span>དམན་པར་སྐྱེས་པའི་མིག་\nདག་དང་། །ཁྱད་འཕགས་སྐྱེས་པའི་མིག་དག་དང་། །གཤིན་རྗེའི་འཇིག་རྟེན་གང་ཡིན་པ། །ཡོངས་སུ་སྤངས་པའི་མི་དག་དང་། །ཀླུ་དང་གནོད་སྦྱིན་མི་དག་དང་། །གྲུལ་བུམ་གྱི་ནི་མི་དག་དང་། །ཡོངས་སུ་གདུང་བཅས་\nམིག་དག་དང་། །ཡོངས་སུ་གདུང་མིན་མིག་དག་དང་། །རྣམ་པར་དག་པའི་མིག་དག་དང་། །རྣམ་པར་དག་མིན་མིག་དག་དང་། །ཆུར་རིང་ཞིང་ཐུང་མིག་དག་དང་། །ཉན་ཐོས་ཐེག་<span class='delete'>པ་</span><span class='add'>པའི་</span>མིག་དག་དང་། །བསམ་གཏན་པ་ཡི་མིག་དག་\nདང་། ཏིང་ངེ་འཛིན་གྱི་མིག་དག་དང་། །སྤྱོད་ཡུལ་ལས་བྱུང་མིག་དག་དང་། །འདུ་ཤེས་ལས་བྱུང་མིག་དག་དང་། འདོད་ཆགས་ལས་བྱུང་མིག་དག་དང་། །འདོད་ཆགས་བྲལ་བའི་མིག་དག་དང་། །རྒྱུ་ལས་བྱུང་བའི་མིག་དག་\nདང་། །རྒྱུ་མིན་ལས་བྱུང་<span class='delete'>བའི་</span><span class='add'></span>མིག་དག་དང་། །མཚུངས་པར་ལྡན་པའི་མིག་དག་དང་། །མཚུངས་པར་ལྡན་མིན་མིག་དག་དང་། །བསྒོ་བརྟེན་ལས་བྱུང་མིག་དག་དང་། །བསྒོ་ལས་བྱུང་མིན་མིག་དག་དང་། །རྒྱུ་རྐྱེན་ལས་བྱུང་མིག་དག་\nདང་། །ཤ་ལས་གྲུབ་མིན་མིག་དག་དང་། །ཡེ་ཤེས་རྣམ་པར་དག་མིག་དང་། །ཡོད་པ་མིན་པའི་མིག་དག་དང་། །དམིགས་མེད་མིག་ནི་གང་ཡིན་པ། །ཐམས་ཅད་རྟོགས་པར་བྱེད་ཅེས་ཟེར། །རྣ་བ་སྣ་ལྕེ་ལུས་ནས་ནི། །སྒྲ་དང་\nམིང་ལ་སོགས་པའི་བར། །ཆོས་ནི་རྣམ་པར་ཉི་ཤུ་ལྔ། ཐམས་ཅད་དེ་བཞིན་སྦྱར་ཞེས་ཟེར། །དེ་ཡི་ཚེ་ན་བཅོམ་ལྡན་འདས། །ནམ་མཁའ་བར་སྣང་དག་ལས་ནི། །གཞན་ཡང་དཔག་ཏུ་མེད་པའི་སྒྲ། །སྒྲ་སྙན་དམ་པ་"
 ],
 [
  "79.281b",
  "པ་ཐམས་ཅད་ཀྱི། གནས་ཀུན་ལ་ནི་འཇུག་པ་དང་། །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི། །སྤྱོད་ཡུལ་ཀུན་ལ་གནས་འགྱུར་བས། འཇིག་རྟེན་པ་ནི་ཐམས་ཅད་ཀུན། །ལྷ་མ་ཡིན་གྱི་ཚོགས་དག་ལ། །བརྟན་པར་འཛིན་པའི་སེམས་སྤངས་ནས། །ཚངས་པའི་སྤྱོད་ལ་གནས་པར་བྱེད། །\nགནོད་སྦྱིན་བརྒྱ་སྟོང་ཚད་མེད་དང་། །གྲུལ་བུམ་དག་ནི་ཚད་མེད་རྣམས། །དེ་དག་ཐམས་ཅད་ཀུན་ཀྱང་ནི། །རབ་ཏུ་དགའ་བ་སྐྱེད་པར་བྱེད། །དྲི་ཟའི་འཁོར་ནི་གང་ཡིན་དང་། །སྲིན་པོའི་འཁོར་ནི་གང་ཡིན་པ། །\nཚད་མེད་གྲངས་མེད་དེ་དག་ཀྱང་། །རབ་ཏུ་དུལ་ལ་དགའ་བར་བྱེད། །གལ་ཏེ་ཚངས་པའི་འཁོར་རྣམས་ཀྱིས། །སྒྲ་སྙན་དག་ནི་དམ་པ་ཡིས། །ཚིགས་དང་དོན་ནི་རྗོད་བྱེད་ཀྱང་། །ཡང་དག་བསྟན་པར་མི་ནུས་ཏེ། །སེམས་\nལས་བྱུང་བའི་ཆོས་རྣམས་ཀྱིས། །དཔག་པར་བྱ་བ་མ་ཡིན་དང་། །སེམས་ལས་བྱུང་བའི་ཆོས་རྣམས་ཀྱིས། །གཟུངས་བར་བྱ་བ་མིན་ཞེས་ཟེར། །གཟུངས་ནི་གང་ཡིན་འདི་དག་ནི། །མིག་གིས་དམིགས་པར་བྱ་བ་མིན། །\nགཟུངས་ནི་གང་ཡིན་འདི་དག་ནི། །ལུས་ཀྱི་བར་གྱིས་དམིགས་བྱ་མིན། །གཟུངས་ནི་གང་ཡིན་འདི་དག་ནི། །མིག་གིས་དམིགས་པར་བྱ་བ་མིན། །མིག་གི་སྤྱོད་ཡུལ་བར་གྱིས་ཀྱང་། །དམིགས་པར་བྱ་བ་མ་ཡིན་ཏེ། །\nརྣ་བ་སྣ་ལྕེ་ལུས་ནས་ནི། །སྒྲ་དང་མིང་ལ་སོགས་པའི་བར། །ཆོས་ནི་རྣམ་པ་ཉི་ཤུ་ལྔ། །ཐམས་ཅད་དེ་བཞིན་སྦྱར་ཞེས་ཟེར། །གཞན་ཡང་མིག་གིས་ཟད་མཐའ་དང་། །མིག་རྣམས་ཀྱི་ནི་སྐྱེ་མཐའ་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>མིག་\nགི་མཐའ་དང་འཇུག་པ་ནས། །ཉེ་བར་ཞི་བའི་བར་དག་ལ། །བདག་དང་སྐྱེས་བུ་མེད་པ་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>སེམས་དང་སྲོག་ནི་མེད་པ་<span class='delete'>དང། །</span><span class='add'>དང་། །</span>དེ་བཞིན་གང་ཟག་མེད་པ་དང་། །མཚན་མ་མེད་ཅིང་བྱེད་མེད་དང་། །འགྲོ་བ་མེད་\nཅིང་འོང་མེད་དང་། །འདི་ལྟ་བུ་ལ་སོགས་པའི་མཚན། །ཐམས་ཅད་རྟོགས་པར་འགྱུར་ཞེས་ཟེར། །གཞན་ཡང་འདི་སྐད་ཆོས་ཉིད་ཀྱི། །མིག་ནི་རྟོགས་པར་འགྱུར་ཞེས་ཟེར། །གཞན་ཡང་འདི་སྐད་ཆོས་"
 ],
 [
  "79.283b",
  "གང་དུ་གནས་པའི་ཡུལ་དེར་ནི། །རྟག་ཏུ་གནོད་དང་འཁྲུགས་པ་དང་། །ནད་དང་སྡུག་བསྔལ་མྱ་ངན་མེད། །སེམས་ཅན་དག་ནི་ཐམས་ཅད་ཀུན། །སོ་སོར་དགའ་བའི་སེམས་བསྐྱེད་ནས། །གཟུངས་འདི་\nརྟག་ཏུ་བདག་ཅག་གི །སེམས་ལ་གནས་པར་སྨོན་ལམ་འདེབས། གཟུངས་སྔགས་གང་ཡིན་འདི་དག་ནི། ལུས་དང་སེམས་དང་རྐན་དག་དང་། །ཁ་མཆུ་དག་ལ་གནས་གྱུར་ན། །ཡོན་ཏན་དཔག་མེད་སྐྱེད་པར་\nབྱེད། །གལ་ཏེ་རྟག་ཏུ་འཛིན་བྱེད་ན། །ཡོན་ཏན་ཚད་མེད་ཐོབ་གྱུར་ནས། །སེམས་ཅན་མང་ལ་ཕན་འདོགས་ཤིང་། །ཐམས་ཅད་དགའ་བ་ཐོབ་ཅེས་ཟེར། །གཟུངས་སྔགས་གང་ཡིན་འདི་དག་གིས། །སྡིག་པ་\nརྣམས་ནི་རབ་སྤོང་ཞིང་། །དམ་ཆོས་དག་ནི་སྟོན་བྱེད་པས། །ཐུག་པ་མེད་པའི་སྤོབས་པ་འཐོབ། །སེམས་ཅན་དག་ནི་རྒྱ་སྟོང་རྣམས། །ཐེ་ཚོམ་དག་ནི་རབ་བསལ་ནས། །ང་རྒྱལ་རྣམས་ནི་རབ་བཅོམ་སྟེ། །\nཡོན་ཏན་དཔག་མེད་འཐོབ་ཅེས་ཟེར། །ཤིན་ཏུ་ཟབ་ཅིང་གསང་བའི་ཆོས། །གཟུངས་སྔགས་གང་ཡིན་འདི་དག་ནི། མཁས་པས་རྟག་ཏུ་སེམས་བྱེད་ཅིང་། །ནན་ཏན་གྱིས་ནི་སྒྲུབ་པར་བྱེད། །ཤེས་རབ་གོ་\nཆ་རབ་<span class='delete'>དགོས་</span><span class='add'>བགོས་</span>ནས། །ཉོན་མོངས་རབ་ཏུ་<span class='delete'>འཛོམས་</span><span class='add'>འཇོམས་</span>པར་བྱེད། །ཡོན་ཏན་སེམས་<span class='delete'>ཅན་</span><span class='add'></span>ནི་འཕེལ་བྱེད་པས། །རབ་ཏུ་མོས་ཤིང་སྐྱོ་བ་མེད། །གཟུངས་སྔགས་གང་ཡིན་འདི་དག་ནི། །གྲགས་པ་ཆེན་པོ་ཕུན་ཚོགས་\nཔས། །<span class='delete'>ཐད་</span><span class='add'>ཟད་</span>པ་དང་ནི་མི་<span class='delete'>ཐད་</span><span class='add'>ཟད་</span>དང་། །སྐྱེ་དང་མི་སྐྱེ་མཐའ་རབ་རྟོགས། །འདི་འདྲའི་ཤེས་རབ་སྣ་ཚོགས་ཀྱིས། །བདག་ཉིད་རབ་ཏུ་བརྒྱན་པས་ན། །དེ་བཞིན་གཤེགས་པ་བརྒྱ་སྟོང་རྣམས། །ཤིན་ཏུ་གུས་ཤིང་\n<span class='delete'>མཆེད་</span><span class='add'>མཆོད་</span>པ་མཛད། །དེ་འདྲའི་གཟུངས་ནི་གང་ཡིན་པ། །རིག་པ་དག་གིས་རྐང་གཉིས་བྱེད། །ཏིང་འཛིན་མཆོག་ལ་རབ་གནས་ནས། །བྱང་ཆུབ་ལམ་ལ་གཞོལ་བར་བྱེད། །ཞི་གནས་ལྷག་མཐོང་རྗེས་འབྲང་ཞིང་། །"
 ],
 [
  "79.284a",
  "ཟག་མེད་ཤེས་རབ་རྟོགས་པར་བྱེད། །རབ་<span class='delete'>དག་</span><span class='add'>དང་</span>དབང་པོ་སྟོབས་ཀྱིས་ནི། །ལག་གཉིས་ཡོངས་སུ་གྲུབ་པར་བྱེད། །བརྩོན་འགྲུས་དང་ནི་བཟོད་པ་ཡིས། །ནུ་མ་གཉིས་ནི་གྲུབ་པར་བྱེད། །ཤེས་\nརབ་ཕ་རོལ་ཕྱིན་པས་ནི། །སྤྱི་གཙུག་མཚན་ཉིད་རབ་ཏུ་བྱེད། །མདོ་སྡེ་དག་གིས་སྐུར་བྱས་ནས། །སོ་སོར་རིག་བཞི་ཕྲེང་བར་རྒྱུས། །སྔོན་ནི་མངོན་<span class='delete'>པར་</span><span class='add'>པར་</span>བསྒྲུབས་པ་ཡི། །ཡོན་ཏན་རྣམ་པ་སྣ་ཚོགས་དང་། །དཔེ་\nནི་ཚད་མེད་ཇི་སྙེད་པ། །ཐམས་ཅད་རབ་ཏུ་བརྒྱན་ཅེས་ཟེར། །གཟུངས་སྔགས་གང་ཡིན་འདི་དག་ནི། །ཡོན་ཏན་ཚད་མེད་ཕུན་ཚོགས་པས། །མིག་གི་སྔོན་དང་ཕྱི་མཐའ་དང་། །ཟད་དང་མི་ཟད་མཐའ་\nདག་དང་། །སྐྱེ་བ་<span class='delete'>དང་</span><span class='add'>དང་ནི་</span>མི་སྐྱེ་དང་། །མཐའ་དང་མཐའ་མིན་གང་ཡིན་<span class='delete'>དང་། </span><span class='add'>དང་། །</span>དབེན་པ་དང་ནི་མི་དབེན་དང་། །འཇུག་པ་དང་ནི་འཇུག་མིན་དང་། །ཅི་ཡང་མེད་དང་མི་འབྱུང་དང་། །ཉེར་ཞི་<span class='delete'>དང་</span><span class='add'>དང་ནི་</span>བདག་མེད་དང་། །གང་\nཟག་མེད་དང་སྲོག་མེད་དང་། །སེམས་ཅན་མེད་པའི་བར་དག་དང་། །འདི་ལ་སོགས་པའི་ཚད་མེད་སྒོ། །ཐམས་ཅད་རབ་ཏུ་རྟོགས་པར་འགྱུར། །རྣ་བ་སྣ་ལྕེ་ལུས་དང་ཡིད། །ཡུལ་དྲུག་དང་ནི་འབྱུང་ཆེན་\nབཞི། །འཇིག་རྟེན་སྐྱེ་བའི་མིང་བར་དུ། །ཐམས་ཅད་དེ་བཞིན་སྦྱར་ཞེས་ཟེར། །གོང་དུ་བསྔགས་པ་བརྗོད་པ་ཡི། །གཟུངས་མཆོག་དམ་པ་གང་ཡིན་པ། །རབ་དབེན་ཡོན་ཏན་མཆོག་ལྡན་ཞིང། །\nསངས་རྒྱས་སྤྱོད་ཡུལ་ཡིན་པས་ན། །གཟུངས་དོན་ཡང་དག་གང་ཡིན་པ། །ཡི་གེས་བརྗོད་བྱ་མ་ཡིན་ཡང་། །འཇིག་རྟེན་པ་ཡི་རྗེས་སུ་ནི། །བཏགས་པའི་མིང་གིས་བརྗོད་པ་ཡིན། །དེ་ནས་བཅོམ་\nལྡན་འདས་འཁོར་མང་པོ་དང་ཐབས་གཅིག་ཏུ་ཟླ་འོད་གཞོན་ནུའི་ཁྱིམ་དུ་བྱོན་པ་དང་། གདན་ཤམས་པ་ལ་རབ་ཏུ་བཞུགས་<span class='delete'>སོ། </span><span class='add'>སོ། །</span>དེ་ཡི་ཚེ་ཟླ་འོད་གཞོན་ནུར་གྱུར་པས་བཅོམ་ལྡན་འདས་གདན་ལ་བཞུགས་པར་རིག་"
 ],
 [
  "79.278b",
  "མཚན། །ཐོས་པར་གྱུར་<span class='delete'>བ་</span><span class='add'>པ་</span>དེ་དག་ནི། །འདོད་པའི་འདོད་ཆགས་གང་ཡིན་པ། །ཐམས་ཅད་སྤོང་བར་འགྱུར་ཞེས་ཟེར། །ད་ལྟར་འཇིག་རྟེན་བཞུགས་པ་ཡི། །མི་ཡི་སེང་གེ་གང་ཡིན་པ། །མཚན་ནི་ཞེ་སྡང་\nགཞོམ་<span class='delete'>པ་</span><span class='add'>པ་</span><span class='delete'>དང། །</span><span class='add'>དང་། །</span>ཞི་མཛད་ཆོས་ཀྱི་རྒྱལ་ཞེས་བྱ། །གང་གིས་འདི་ལྟ་བུ་ཡི་མཚན། །ཐོས་པར་གྱུར་པ་དེ་དག་ནི། །ཞེ་སྡང་དག་ནི་གང་ཡིན་པ། །ཐམས་ཅད་<span class='delete'>སྤོད་</span><span class='add'>སྤོང་</span><span class='delete'>པར་</span><span class='add'>བར་</span>འགྱུར་ཞེས་ཟེར། །ད་ལྟར་འཇིག་རྟེན་བཞུགས་\nཔ་ཡི། །མི་ཡི་སེང་གེ་གང་ཡིན་པ། །མཚན་ནི་གཏི་མུག་གཞོམ་<span class='delete'>པ་</span><span class='add'>པ་</span><span class='delete'>དང། །</span><span class='add'>དང་། །</span>ཞི་མཛད་ཆོས་ཀྱི་རྒྱལ་ཞེས་བྱ། །གང་གིས་འདི་ལྟ་བུ་ཡི་མཚན། །ཐོས་པར་གྱུར་པ་དེ་དག་ནི། །གཏི་མུག་དག་ནི་གང་ཡིན་པ། །ཐམས་\nཅད་<span class='delete'>སྤོད་</span><span class='add'>སྤོང་</span><span class='delete'>པར་</span><span class='add'>བར་</span>འགྱུར་ཞེས་ཟེར། །ད་ལྟར་འཇིག་རྟེན་བཞུགས་པ་ཡི། །མི་ཡི་སེང་གེ་གང་ཡིན་པ། །མཚན་ནི་ང་རྒྱལ་གཞོམ་<span class='delete'>པ་</span><span class='add'>པ་</span><span class='delete'>དང། །</span><span class='add'>དང་། །</span>ཞི་མཛད་ཆོས་ཀྱི་རྒྱལ་ཞེས་བྱ། །གང་གིས་འདི་ལྟ་བུ་ཡི་མཚན། །\nཐོས་པར་གྱུར་པ་དེ་དག་ནི། །ང་རྒྱལ་དག་ནི་གང་ཡིན་པ། །ཐམས་ཅད་<span class='delete'>སྤོད་</span><span class='add'>སྤོང་</span><span class='delete'>པར་</span><span class='add'>བར་</span>འགྱུར་ཞེས་ཟེར། །ད་ལྟར་འཇིག་རྟེན་བཞུགས་པ་ཡི། །མི་ཡི་སེང་གེ་གང་ཡིན་པ། །མཚན་ནི་ཁོང་ཁྲོ་གཞོམ་<span class='delete'>པ་</span><span class='add'>པ་</span><span class='delete'>དང། །</span><span class='add'>དང་། །</span>\nཞི་མཛད་ཆོས་ཀྱི་རྒྱལ་ཞེས་བྱ། །གང་གིས་འདི་ལྟ་བུ་ཡི་མཚན། །ཐོས་པར་གྱུར་པ་དེ་དག་ནི། །ཁོང་ཁྲོ་དག་ནི་གང་ཡིན་པ། །ཐམས་ཅད་<span class='delete'>སྤོད་</span><span class='add'>སྤོང་</span><span class='delete'>པར་</span><span class='add'>བར་</span>འགྱུར་ཞེས་ཟེར། །ད་ལྟར་འཇིག་རྟེན་བཞུགས་པ་ཡི། །\nམི་ཡི་སེང་གེ་གང་ཡིན་པ། །མཚན་ནི་ཕྲག་དོག་གཞོམ་<span class='delete'>པ་</span><span class='add'>པ་</span><span class='delete'>དང། །</span><span class='add'>དང་། །</span>ཞི་མཛད་ཆོས་ཀྱི་རྒྱལ་ཞེས་བྱ། །གང་གིས་འདི་ལྟ་བུ་ཡི་མཚན། །ཐོས་པར་གྱུར་པ་དེ་དག་ནི། །ཕྲག་དོག་དག་ནི་གང་ཡིན་པ། །ཐམས་\nཅད་སྤོང་བར་འགྱུར་ཞེས་ཟེར། །ད་ལྟར་འཇིག་རྟེན་བཞུགས་པ་ཡི། །མི་ཡི་སེང་གེ་གང་ཡིན་པ། །མཚན་ནི་མི་བདེན་གཞོམ་<span class='delete'>པ་</span><span class='add'>པ་</span><span class='delete'>དང། །</span><span class='add'>དང་། །</span>ཞི་མཛད་ཆོས་ཀྱི་རྒྱལ་ཞེས་བྱ། །གང་གིས་འདི་ལྟ་བུ་ཡི་མཚན། །"
 ],
 [
  "79.283a",
  "ཤིན་ཏུ་རྒྱ་ཆེ་རྒྱ་མཚོ་འདྲ། །བཟོད་པ་དག་ནི་སྒྲུབ་པར་བྱེད། །སེམས་ནི་རབ་བདེ་གཡོ་མེད་འགྱུར། །བྱང་ཆུབ་སེམས་དཔས་རྟག་ཏུ་བསྒོམས། །མཁས་པ་དག་གིས་རབ་ཏུ་བསྔགས། །དབུལ་ཕོངས་\nདག་ནི་སྤོང་བྱེད་ཅིང་། །ནོར་<span class='delete'>དག་</span><span class='add'>དང་</span>རིན་ཆེན་འཐོབ་པར་བྱེད། །གཟུངས་ནི་གང་ཡིན་འདི་དག་གིས། །ཡོན་ཏན་རྣམས་ནི་འཕེལ་བར་བྱེད། །རྟག་ཏུ་སྟོང་ཉིད་ལ་སོགས་པའི། །བདེན་ཚིག་དག་གིས་རབ་ཏུ་\nབརྒྱན། །ཡི་གེ་དག་ནི་སྤངས་པས་ན། །སྟོང་པའི་ངོ་བོ་ཉིད་ཅེས་བྱ། །སེམས་དང་རྣམ་ཤེས་སྤངས་པས་ན། ཆོས་ཀྱི་ངོ་བོ་ཉིད་ཅེས་བྱ། །གཟུངས་ནི་གང་ཡིན་འདི་དག་གིས། །དྲི་བྲལ་རྟག་ཏུ་རྣམ་དག་བྱེད། །ཡང་དག་ཡེ་\nཤེས་ལ་གནས་ནས། །ཕན་པ་སྣ་ཚོགས་སྟོན་པར་བྱེད། །སེམས་ཅན་དག་ནི་མང་པོ་རྣམས། །དགའ་ཞིང་<span class='delete'>དད་</span><span class='add'>དང་</span><span class='delete'>པ་</span><span class='add'>བ་</span>སྐྱེད་<span class='delete'>པར་</span><span class='add'>པར་</span>བྱེད། །གནོད་སྦྱིན་འཁོར་ནི་ཚད་མེད་དང་། །གྲུལ་བུམ་འཁོར་ནི་གང་ཡིན་པ། །འདི་ལ་སོགས་\nཔ་ཡི་དགས་རྒྱལ། །དགའ་བ་ཆེན་པོ་སྐྱེད་ཅེས་ཟེར། །གཟུངས་སྔགས་གང་ཡིན་འདི་དག་<span class='delete'>ནི །</span><span class='add'>ནི། །</span>རབ་ཏུ་ཞི་ཞིང་སྤྲོས་པ་མེད། །སེམས་ཅན་དག་ལ་བྱམས་པས་ན། །ཀུན་ལ་བདེ་བ་སྦྱིན་པར་བྱེད། །བསྐལ་བ་མང་\nཔོ་བརྒྱ་སྟོང་དུ། །འགྲོ་བ་རྣམས་སུ་རྟགས་གནས་ཤིང་། །ཕན་པ་ཚད་མེད་པ་བྱེད་ཀྱང་། །རྣམ་པར་དག་ཅིང་གོས་པ་<span class='delete'>མེད། </span><span class='add'>མེད། །</span>ཚིགས་སུ་བཅད་པ་བརྒྱ་སྟོང་གིས། །བདུད་རྩིའི་ཆོས་ནི་རབ་བསྟན་ནས། །སེམས་\nཅན་དག་ནི་ཚད་མེད་རྣམས། །དགའ་བ་ཆེན་པོ་སྐྱེད་པར་བྱེད། །སྔོན་གྱི་སངས་རྒྱས་ཚད་མེད་རྣམས། །ཤིན་ཏུ་རྣམ་དག་མོས་པ་ཡིས། །གཟུངས་འདི་<span class='delete'>ལ་</span><span class='add'>ལ་ནི་</span>བརྟེན་ནས་སུ། །རྟག་ཏུ་ཆོས་ཉིད་དགོངས་\nཔར་མཛད། །ཚངས་དང་བརྒྱ་བྱིན་ལྷ་རྣམས་དང་། །ཀླུ་ཡི་རྒྱལ་པོ་ལྷ་མ་<span class='delete'>ཡིན །</span><span class='add'>ཡིན། །</span>གཟུངས་འདི་ཐོས་<span class='delete'>བར་</span><span class='add'>པར་</span>གྱུར་ནས་ཀྱང་། །སེམས་ཀྱིས་དགའ་བ་སྐྱེད་ཅེས་ཟེར། །གཟུངས་སྔགས་གང་ཡིན་འདི་དག་རྣམས། །"
 ],
 [
  "79.285a",
  "པའི་རྒྱལ་པོ་རྣམས་ཡོངས་སུ་<span class='delete'>དང་</span><span class='add'>དང་བ་</span>སྐྱེ་བར་འགྱུར་བ་དང་། མཐུ་ཆེན་པོ་དང་ལྡན་པ་དང་། མདོའི་སྡེ་དང་། ཚིགས་སུ་བཅད་པ་དང་། ལུང་དུ་བསྟན་པ་དང་། ཆེད་དུ་བརྗོད་པ་དང་། དབྱངས་ཀྱིས་བསྙད་པ་\nདང་། རྟོགས་པ་བརྗོད་པ་དང་། གླེང་གཞི་དང་། དེ་ལྟ་བུ་བྱུང་བ་དང་། སྐྱེས་པའི་རབས་དང་། ཤིན་ཏུ་རྒྱས་པ་དང་། རྨད་དུ་བྱུང་བ་དང་། གཏན་ལ་ཕབ་པར་བསྟན་པའི་སྡེའི་བར་དུ་ལེན་པ་དང་། འཛིན་པ་དང་། ཡང་དག་\nཔར་སྟོན་པར་འགྱུར་བ་དང་། སེམས་ལ་ལེ་ལོ་མེད་པ་དང་། ཆོས་ལ་སེར་སྣ་མེད་པ་དང་། སངས་རྒྱས་ཀྱི་ལམ་ལ་ཡང་དག་པར་གནས་པ་དང་། འཇིག་རྟེན་ན་མཆོག་ཏུ་གྱུར་ཅིང་མིང་དང་གཟུགས་ཡོངས་སུ་དག་པར་འགྱུར་བ་དང་། \nཆོས་ཀྱི་སྐུ་མངོན་དུ་བྱེད་པར་འགྱུར་<span class='delete'>པ་</span><span class='add'>བ་</span>དང་། མི་འཇིགས་པ་ཐོབ་པར་འགྱུར་བ་དང་། བསོད་ནམས་ཕུན་སུམ་ཚོགས་པར་འགྱུར་བ་དང་། མུ་སྟེགས་ཅན་རྣམས་ཟིལ་གྱིས་གནོན་པ་དང་། སྐྱེས་བུ་དམ་པའི་ཆོས་ཕུན་སུམ་ཚོགས་པ་\nདང་། སྡིག་པ་ཅན་<span class='delete'>གྱིས་</span><span class='add'>གྱི་</span>སྤྱོད་པ་སྤོང་བར་འགྱུར་བ་དང་། བསོད་ནམས་དང་ཡེ་ཤེས་ཀྱི་རྒྱུ་ལ་མངོན་<span class='delete'>པར་</span><span class='add'>པར་</span>ཡིད་ཆེས་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་སྡུད་པར་བྱེད་པ་དང་། བདུད་མང་པོ་ཕམ་པར་བྱེད་པ་དང་། སངས་རྒྱས་ཀྱིས་\nགསུངས་པའི་ཆོས་བདེན་པ་དག་ལ་ཐེ་ཚོམ་དང་། ནེམ་ནུར་མེད་པ་དང་། འདོད་པ་ངན་པ་རྣམས་རབ་ཏུ་བཅོམ་པ་དང་། གཟི་བྱིན་ཆེན་པོ་དང་ལྡན་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་མངོན་<span class='delete'>པར་</span><span class='add'>པར་</span>བསྒྲུབས་པས་རྫུ་འཕྲུལ་\nཁྱད་པར་དུ་འཕགས་པ་འཐོབ་པར་འགྱུར་བ་དང་། སྐྱེ་<span class='delete'>ཤེ་</span><span class='add'>ཤི་</span>སྤོང་བར་འགྱུར་བ་དང་། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་དང་། སྤྱོད་པ་དཔག་ཏུ་མེད་པའི་བསྔགས་པ་བརྗོད་པ་དང་། ཡོན་ཏན་རྣམས་ཡོངས་སུ་སྡུད་\nཔར་འགྱུར་བ་དང་། སེམས་ཅན་རྣམས་ལ་སྤྲོ་བ་བསྐྱེད་པ་དང་། ཆོས་ཀྱི་དགའ་བ་ལ་ཡོངས་སུ་སྤྱོད་པར་འགྱུར་བ་དང་། སྦྱིན་པ་གཏོང་བ་མངོན་<span class='delete'>པར་</span><span class='add'>པར་</span>སྒྲུབ་པར་འགྱུར་བ་དང་། ཡེ་ཤེས་ཆེན་<span class='delete'>པའི་</span><span class='add'>པོའི་</span>སྒོར་འཇུག་པར་"
 ],
 [
  "79.286a",
  "སེམས་ལ་རབ་གནས་ནས། །<span class='delete'>སྦྱིན་</span><span class='add'>སྦྱིན་པ་</span>ནན་ཏན་བསྒྲུབ་པར་གྱིས། །སྦྱིན་པའི་སེམས་ནི་གང་དག་གིས། །བསོད་ནམས་ཚོགས་ནི་རྫོགས་བྱེད་པ། །བྱང་ཆུབ་སེམས་དཔས་སྒྲུབ་བྱེད་ན། །སངས་\nརྒྱས་བྱང་ཆུབ་འཐོབ་པར་འགྱུར། །སྦྱིན་པའི་མཐུ་ཡི་སྟོབས་ཀྱིས་ནི། །རྫུ་འཕྲུལ་མཆོག་ནི་རྫོགས་བྱེད་པས། །ཞིང་ནི་བྱེ་བ་བསྒུལ་བྱས་ཀྱང་། །སེམས་ཅན་རྣམས་ལ་གནོད་མི་འགྱུར། །སྦྱིན་པ་གཏང་བའི་དབང་\nགིས་ན། །རྣམ་དག་ཚུལ་ཁྲིམས་མང་ཐོས་དང་། །ཡང་དག་ཡིད་ཆེས་བརྩོན་འགྲུས་དང་། །ཏིང་འཛིན་ཟག་མེད་ཤེས་རབ་འདྲེན། །སྦྱིན་པ་གཏང་བའི་དབང་གིས་ན། །དབང་པོ་སྟོབས་དང་ཡང་དག་ལམ། །ཡང་དག་\nསྤོང་དང་རྫུ་འཕྲུལ་རྐང་། །བག་ཆགས་སྤོང་བ་འདྲེན་པར་བྱེད། །སྦྱིན་པ་གཏང་བའི་དབང་གིས་ན། །རྣམ་དག་སྒྲ་སྙན་དག་གིས་ནི། །ཞིང་ནི་བྱེ་བ་བརྒྱ་ཕྲག་ཏུ། །དཔག་མེད་ཆོས་སྟོན་འདྲེན་པར་<span class='delete'>བྱེད </span><span class='add'>བྱེད།  ། </span>ཡོངས་སུ་\nདང་བས་སྦྱིན་གཏང་བས། །རྫུ་འཕྲུལ་རྣམས་ནི་མྱུར་དུ་འཐོབ། །རྫུ་འཕྲུལ་ཡོངས་སུ་རྫོགས་བྱའི་ཕྱིར། །ནན་ཏན་སྦྱིན་པ་གཏང་བར་གྱིས། །ལྷ་ནི་མང་པོ་ཚད་མེད་རྣམས། །ལྷ་མ་ཡིན་དང་ཀླུ་རྣམས་དང་། །གནོད་\nསྦྱིན་བརྒྱ་སྟོང་མང་པོ་དང་། །འཁོར་རྣམས་ཀྱིས་ནི་ཡོངས་བསྐོར་ནས། །གཞལ་མེད་ཁང་མཆོག་རབ་ཞུགས་ཏེ། རང་དབང་དག་གིས་རྩེ་བྱེད་པ། །འདི་ལ་སོགས་པའི་རྒྱལ་པོ་རྣམས། །སྦྱིན་ལ་བརྩོན་པ་\nམཐོང་གྱུར་ན། ཐམས་ཅད་ལངས་ནས་བསུ་ནས་ནི། །སྟན་བཏིང་མཆོད་པ་དག་ཀྱང་བྱེད། །སྦྱིན་གཏོང་གང་ཟག་གང་ཡིན་པ། །གཟི་བྱིན་ཆེན་པོ་ཕུན་ཚོགས་ཤིང་། །རྫུ་འཕྲུལ་སྟོབས་ལ་དབང་ཐོབ་པས། །\nལྷ་རྒྱལ་རྣམས་ནི་སྡུད་པར་བྱེད། །གྲུལ་བུམ་དང་ནི་གནོད་སྦྱིན་རྣམས། །ཐམས་ཅད་སྐྱབས་སུ་འགྲོ་བར་འགྱུར། །དྲི་ཟ་འཁོར་བཅས་རྣམས་ཀྱིས་ཀྱང་། །རོལ་མོ་དག་གིས་མཆོད་པར་བྱེད། །ཆོམ་རྐུན་དག་ནི་བྱམས་"
 ],
 [
  "79.286b",
  "སེམས་བསྐྱེད། །མ་རུངས་པ་རྣམས་རིང་དུ་འགྲོ། །ནོར་རྣམས་ཉམས་པར་མི་གྱུར་ཏེ། །བང་མཛོད་དག་ནི་གང་བར་འགྱུར། །སྦྱིན་པ་ཡོངས་སུ་བཏང་བའི་ཕྱིར། །ཚོགས་མཆོག་དག་ནི་རྫོགས་པར་འགྱུར། །སངས་རྒྱས་\nཡེ་ཤེས་ཐུག་<span class='delete'>པར་</span><span class='add'>བར་དུ། །</span><span class='delete'>འགྱུར། </span><span class='add'></span>མུ་སྟེགས་ཆོས་ནི་སྤྱོད་མི་བྱེད། །དེ་ལ་ན་བ་ཡོད་མེད་དེ། །གཟུངས་རྣམས་ཡོངས་སུ་སྲུང་བར་བྱེད། །ཁྱད་པར་འཕགས་པའི་སྟོབས་རྣམས་ཀྱང་། །སྦྱིན་པ་ལས་ནི་བྱུང་བ་ཡིན། །དེ་ལྟར་སྦྱིན་པ་\nགང་གཏོང་བ། །བྱང་ཆུབ་ལམ་ནི་སྒྲུབ་པར་བྱེད། །མི་དགེ་བཤེས་གཉེན་ཕྲད་མི་འགྱུར། སྤྱོད་མཐུན་གྲོགས་པོ་འཐོབ་པར་འགྱུར། །གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་རྣམས། །སྦྱིན་པའི་ཚོགས་ནི་སོགས་བྱེད་པ། །\nབསམ་གྱིས་མི་ཁྱབ་གཟུངས་དག་དང་། །ཤེས་རབ་ཡོངས་སུ་རྫོགས་བྱེད་པས། །ཚིགས་སུ་བཅད་པ་ཚད་མེད་ཀྱིས། །<span class='delete'>ཀུན་</span><span class='add'>ཀུན་འཛིན་</span>ཡང་དག་སྟོན་པར་བྱེད། ཐམས་ཅད་ལ་ནི་ཐོགས་མེད་པས། །ངོ་བོ་ཉིད་དོན་སྟོར་མི་འགྱུར། །\nབྱང་ཆུབ་སེམས་ནི་རྒྱ་ཆེ་ལ། །མོས་པའི་སེམས་ནི་བརྟན་པར་འགྱུར། །ཚུལ་ཁྲིམས་དག་པ་ཕུན་ཚོགས་ཤིང་། །བདུད་ཀྱི་ལས་རྣམས་སྤོང་བར་བྱེད། །འདོད་པ་ལྔ་ལ་ཞེན་མེད་ཅིང་། །རྩེ་གཅིག་ཡང་དག་དྲན་པ་ཚོལ། །\nསེམས་ལ་རྟག་ཏུ་རྨོངས་མེད་པས། །འདོད་པ་དག་ལ་<span class='delete'>སྲིད་</span><span class='add'>སྲེད་</span>མི་སྐྱེད། །ཞེ་སྡང་ཉོན་མོངས་གང་ཡིན་པ། །ཡང་དག་ཇི་བཞིན་རབ་ཏུ་རྟོགས། །སྤྱོད་ཡུལ་དག་ནི་ཐམས་ཅད་ལ། །ཞེན་པ་མེད་ཅིང་<span class='delete'>མོངས་</span><span class='add'>རྨོངས་</span>པ་མེད། །གང་\nཟག་དེས་ནི་ཉོན་མོངས་རྣམས། །ལེགས་པ་ཉིད་དུ་རྟོགས་པར་འགྱུར། །རྒྱུ་དང་རྐྱེན་ནི་འདུས་པ་ལ། །ཉེས་དམིགས་རྣམས་ནི་སྐྱེ་བ་ནས། །སངས་རྒྱས་ཆོས་ཀྱི་བར་དག་གི། །རྒྱུ་དང་རྒྱུ་ཡི་རྒྱུ་ཉིད་དང་། །དེ་བཞིན་\nརྒྱུ་ཡི་བྱ་བ་རྣམས། །ཐམས་ཅད་རབ་ཏུ་རྟོགས་པར་འགྱུར། །དེས་ནི་མིག་ཟད་མཐའ་ཡི་རྒྱུ། །གང་ཡིན་རབ་ཏུ་རྟོགས་པས་ན། །རྨོངས་པ་རྣམས་ནི་ཡོངས་སྤངས་ནས། །མིག་ལ་མངོན་<span class='delete'>པར་</span><span class='add'>པར་</span>ཞེན་མི་འགྱུར། །དེས་"
 ],
 [
  "79.284b",
  "སྟེ། བདག་ཉིད་མཆོད་པའི་ཡོ་བྱད་མཆོག་དམ་པ་ཐོགས་ནས། དེ་བཞིན་གཤེགས་པ་དང་འཁོར་འདུས་པ་ཆེན་པོ་རྣམས་ལ་རབ་ཏུ་ཕུལ་ཏེ་མཆོད་པ་དེ་ཡང་བསམ་གཏན་དང་། །ཏིང་ངེ་འཛིན་དང་། བསམ་གཏན་གྱི་ཡོན་ཏན་\nཁྱད་པར་དུ་འཕགས་པའི་དགེ་བའི་རྩ་བ་<span class='delete'>དག་</span><span class='add'>དང་</span>བསམ་གྱིས་མི་ཁྱབ་པའི་མཐུ་ལས་མངོན་<span class='delete'>པར་</span><span class='add'>པར་</span>གྲུབ་པ་ཤ་སྟག་གོ། དེ་ལྟར་མཆོད་པ་ཕུལ་བ་ཡང་བདག་འབའ་ཤིག་གི་ཕྱིར་མ་ཡིན་གྱི་སེམས་ཅན་ཚད་མེད་པ་ཐམས་ཅད་བླ་\nན་མེད་པའི་བྱང་ཆུབ་ལ་གཞོལ་ཞིང་ཕན་ཡོན་ཆེན་པོ་འཐོབ་པར་བྱ་བའི་ཕྱིར་མཆོད་ཅིང་ཕུལ་བས་ན་མཆོད་པ་དེས་ཀུན་དུ་ཁྱབ་ཅིང་ཐམས་ཅད་རབ་ཏུ་ཚིམ་པར་གྱུར་<span class='delete'>ཏོ། </span><span class='add'>ཏོ། །</span>དེ་ནས་བཅོམ་ལྡན་འདས་གདུགས་ཆོད་གསོལ་\n<span class='delete'>པའི་</span><span class='add'>བའི་</span>འོག་ཏུ་འཁོར་འདུས་པ་མང་པོའི་མདུན་དུ་ཟླ་འོད་གཞོན་ནུར་གྱུར་པ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་<span class='delete'>ཏོ། </span><span class='add'>ཏོ། །</span>གཞོན་ནུ་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གང་ལ་ལ་ཞིག་ཐེག་པ་ཆེན་པོ་ལ་གནས་ནས་སྦྱིན་པའི་ཚོགས་\nམངོན་<span class='delete'>པར་</span><span class='add'>པར་</span>སྒྲུབ་པར་བྱེད་ན་ཡོན་ཏན་ཁྱད་པར་དུ་འཕགས་པ་རྣམ་པ་བརྒྱད་བཅུ་དང་ལྡན་པར་འགྱུར་<span class='delete'>རོ། </span><span class='add'>རོ། །</span>རྣམ་པ་བརྒྱད་བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་ཅིང་ཚིག་སྙན་པས་ཡོངས་སུ་སྡུད་པར་བྱེད་པ་དང་། མཚན་གྱ་\nནོམ་པ་ཡོངས་སུ་རྫོགས་པ་དང་། དབང་པོ་རྣམས་མ་ཚང་བ་མེད་པ་དང་། འཁོར་བ་སྤངས་ནས་མྱ་ངན་འདས་པ་མངོན་དུ་བྱེད་པ་དང་། ཉོན་མོངས་པ་རྣམས་ཟད་ནས་དབང་ཕྱུག་མཆོག་འཐོབ་པ་དང་། ཡོན་ཏན་ཕུན་སུམ་ཚོགས་ཤིང་སངས་རྒྱས་ཀྱི་ཞིང་རབ་ཏུ་བརྒྱན་པ་དང་། འཁོར་\nརྣམ་པར་དག་པ་དང་། གཟི་བྱིན་ཆེན་པོ་དང་ལྡན་པ་<span class='delete'>དང་། །</span><span class='add'>དང་། </span>ཤེས་རབ་ཕུན་སུམ་ཚོགས་པ་དང་། སྤྱོད་པ་ཁྱད་པར་དུ་འཕགས་པ་མཆོག་མངོན་<span class='delete'>པར་</span><span class='add'>པར་</span>གྲུབ་པ་དང་། སྤྱོད་པ་བླ་ན་མེད་ཅིང་མཚུངས་པ་མེད་པ་ཡོངས་སུ་རྫོགས་པ་དང་། བག་ཆགས་ཡང་དག་པར་བཅོམ་ནས་དེ་བཞིན་གཤེགས་པའི་\nཐམས་ཅད་མཁྱེན་པའི་སྤྱོད་པ་འཕེལ་བར་བྱེད་པ་དང་། ལུས་དང་རིང་<span class='delete'>སྲེལ་</span><span class='add'>བསྲེལ་</span>འཇིག་རྟེན་ཐམས་ཅད་དང་། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་རྣམས་ཀྱིས་མཆོད་པར་འགྱུར་བ་དང་། མ་རུངས་པ་རྣམས་རབ་ཏུ་བཏུལ་བས་མིའི་རྒྱལ་པོ་དང་། ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་གི་རྒྱལ་པོ་དང་། ཚངས་"
 ],
 [
  "79.287a",
  "ནི་མིག་གི་སྐྱེ་མཐའ་དང་། མཐའ་དང་རབ་ཏུ་དབེན་པ་དང་། །འཇུག་པ་དང་ནི་མེད་པ་དང་། །མི་སྐྱེ་བ་ནས་ཉེར་ཞིའི་བར། །འདི་ལ་སོགས་པའི་རྒྱུ་ཉིད་ཀྱང་། །རབ་ཏུ་རྟོགས་པར་གྱུར་<span class='delete'>བས་</span><span class='add'>པས་</span>ན། །\nརྨོངས་པ་རྣམས་ནི་ཡོངས་སྤངས་ནས། །མིག་ལ་མངོན་<span class='delete'>པར་</span><span class='add'>པར་</span>ཞེན་མི་འགྱུར། །དེས་ནི་མིག་གི་སྔོན་མཐའ་ཡི། །བརྗོད་པ་འཇིག་རྟེན་རྗེས་སུ་ནི། །བཏགས་པ་ཡིན་པས་དེ་ལ་ནི། །ཡང་དག་ཅི་ཡང་མེད་པར་རྟོགས། །\nདེས་ནི་མིག་གི་ཕྱི་མཐའ་ཡི། །བརྗོད་པ་འཇིག་རྟེན་རྗེས་སུ་ནི། །ཡང་དག་ཅི་ཡང་མེད་པར་རྟོགས། །དེས་ནི་མིག་གི་སྐྱེ་མཐའ་དང་། །མཐའ་<span class='delete'>དག་</span><span class='add'>དང་</span>རབ་དབེན་འཇུག་པ་དང་། །ཅི་ཡང་མེད་དང་སྐྱེ་མེད་ནས། །ཉེ་བར་ཞི་\nབའི་བར་དག་དང་། །འདི་ལ་སོགས་པའི་བརྗོད་པ་རྣམས། །འཇིག་རྟེན་རྗེས་སུ་བཏགས་པས་ན། །དེ་ལ་ཡང་དག་མེད་པར་ནི། །རབ་ཏུ་རྟོགས་པར་འགྱུར་བ་ཡིན། །དེས་ནི་མིག་གི་སྔོན་མཐའ་ཡི། །བརྗོད་པ་\nརྒྱུ་རྐྱེན་འདུས་པ་ལས། །བྱུང་བ་ཉིད་དུ་རྟོགས་པས་ན། །དེ་ལ་ཞེན་པ་ཅི་ཡང་མེད། །དེས་ནི་མིག་གི་ཕྱི་མཐའ་ཡི། །བརྗོད་པ་རྒྱུ་རྐྱེན་འདུས་པ་<span class='delete'>རྣམས། །</span><span class='add'>ལས། །</span>བྱུང་བ་ཉིད་དུ་རྟོགས་པས་ན། །དེ་ལ་ཞེན་པ་ཅི་ཡང་མེད། །དེས་\nནི་མིག་གི་སྐྱེ་མཐའ་དང་། །མཐའ་དང་རབ་དབེན་འཇུག་པ་དང་། །ཅི་ཡང་མེད་དང་སྐྱེ་མེད་ནས། །ཉེ་བར་ཞི་བའི་བར་དག་དང་། །འདི་<span class='delete'>ལས་</span><span class='add'>ལ་</span>སོགས་པའི་བརྗོད་པ་རྣམས། །རྒྱུ་དང་རྐྱེན་ནི་འདུས་པ་ལས། །བྱུང་བ་ཉིད་\nདུ་རྟོགས་པས་ན། །དེ་ལ་ཞེན་པ་ཅི་ཡང་མེད། །དེས་ནི་མིག་གི་སྔོན་མཐའ་ཡི། །བརྗོད་པའི་རང་བཞིན་བསྟན་མེད་པར། །རབ་ཏུ་རྟོགས་པར་གྱུར་པས་ན། །དེ་ལ་ཞེན་པ་ཅི་ཡང་མེད། དེས་ནི་མིག་གི་ཕྱི་\nམཐའ་ཡི། །བརྗོད་པ་རང་བཞིན་བསྟན་མེད་པར། །རབ་ཏུ་རྟོགས་པར་གྱུར་པས་ན། །དེ་ལ་ཞེན་པ་ཅི་ཡང་མེད། །དེས་ནི་མིག་གི་སྐྱེ་མཐའ་དང་། །མཐའ་དང་རབ་དབེན་འཇུག་པ་དང་། །ཅི་ཡང་མེད་དང་སྐྱེ་"
 ],
 [
  "79.285b",
  "འགྱུར་བ་དང་། བྲོ་བར་གྱུར་<span class='delete'>བའི་</span><span class='add'>པའི་</span>ཆོས་ལ་གནས་པར་འགྱུར་བ་དང་། རིགས་ངེས་པ་ཉིད་དུ་འགྱུར་བ་དང་། ཆོས་ཀྱི་བཟོད་པ་བསྒྲུབ་པར་འགྱུར་བ་དང་། སངས་རྒྱས་ཀྱི་ལམ་ལ་བདེ་བར་གནས་པ་གང་ཡིན་<span class='delete'>པའོ། </span><span class='add'>པའོ། །</span>གཞོན་\nནུ་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གང་ལ་ལ་ཞིག་སྦྱིན་པའི་<span class='delete'>ཆོས་</span><span class='add'>ཚོགས་</span>མངོན་<span class='delete'>པར་</span><span class='add'>པར་</span>སྒྲུབ་པར་བྱེད་ན་ཡོན་ཏན་ཁྱད་པར་དུ་འཕགས་པ་རྣམ་<span class='delete'>པར་</span><span class='add'>པ་</span>བརྒྱད་བཅུ་པོ་འདི་དག་ཕུན་སུམ་ཚོགས་ཤིང་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ། །\nདེ་ནས་དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱིས་ཚིགས་སུ་བཅད་དེ་བཀའ་སྩལ་པ། བྱང་ཆུབ་སེམས་དཔའ་བློ་ཆེན་གང་། །སྦྱིན་པའི་ཚོགས་དང་ལྡན་པ་ལ། །ཕན་ཡོན་མཆོག་ནི་བརྒྱད་བཅུ་ཡོད། །ངས་མདོར་<span class='delete'>སྡུས་</span><span class='add'>བསྡུས་</span>\nཏེ་བསྟན་པ་ཡིན། །གཞན་ཡང་དཔག་མེད་བསམ་བཀའ་ཡི། །ཡོན་ཏན་དག་ནི་གང་ཡིན་པ། ཐམས་ཅད་སྦྱིན་པ་ལས་སྐྱེས་སྟེ། །དེང་འདིར་ཅུང་ཟད་བསྟན་པར་བྱ། །ཁྱོད་ཀྱིས་འཁོར་འདུས་མང་པོ་ལ། །མཉམ་\nཔའི་སེམས་ཀྱིས་གང་མཆོད་པ། །སྦྱིན་པའི་ཚོགས་ནི་དེ་དག་ལ། །མཁས་པ་རྣམས་ཀྱིས་བསྒྲུབ་པར་བྱ། །སྦྱིན་པ་འདི་ཡིས་བསགས་པ་ཡི། །བསོད་ནམས་ཕུང་པོ་བསམ་མི་ཁྱབ། །མཚན་དང་དཔེ་བྱད་\nལུས་བརྒྱན་པ། །ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་འགྱུར། །སྐྱེ་གནས་དང་ནི་རུས་རིགས་དང་། །ཡུལ་རྣམས་དང་ནི་ཁྱིམ་དག་དང་། གྲགས་པ་དང་ནི་གཟུགས་དང་སེམས། །ཐམས་ཅད་ཡོངས་སུ་དག་\nཔར་འགྱུར། །ལྷ་རྣམས་རྫུ་འཕྲུལ་དངོས་པོ་དང་། །གཞལ་མེད་ཁང་དང་ལྷ་མོ་དང་། །རྣམ་དག་ཐོག་མེད་སྤོབས་པ་ཡང་། །སྦྱིན་པ་ལས་ནི་བྱུང་བ་ཡིན། །སྦྱིན་པའི་ཚོགས་མཆོག་གང་ཡིན་པ། །སངས་\nརྒྱས་རྣམས་ཀྱིས་འདི་སྐད་དུ། །འདི་ནི་དང་པོར་བྱང་ཆུབ་རྣམས། །གནས་པའི་གཞི་ཞེས་བསྔགས་པར་མཛད། །བྱང་ཆུབ་སེམས་དཔའ་བརྩོན་འགྲུས་ཅན། །སྦྱིན་ལ་ཐེ་ཚོམ་མེད་པ་<span class='delete'>དག། །</span><span class='add'>དག །</span>ངེས་པའི་"
 ],
 [
  "79.288b",
  "བཞིན་གཏི་མུག་གང་མཆོད་པ། །ཟག་པ་མེད་ལ་མཆོད་པ་ཡིན། །ཟག་པ་མེད་ལ་མཆོད་པའི་ཕྱིར། །ཀུན་འཛིན་སྒོ་ནི་རྫོགས་པར་འགྱུར། །དེ་བཞིན་གཏི་མུག་གང་མཆོད་པ། །ཅི་ཡང་མེད་ལ་མཆོད་པ་ཡིན། །ཅི་ཡང་མེད་ལ་མཆོད་པའི་ཕྱིར། །ཀུན་འཛིན་\nསྒོ་ནི་རྫོགས་པར་འགྱུར། །དེ་བཞིན་གཏི་མུག་གང་མཆོད་པ། །དཔག་ཏུ་མེད་ལ་མཆོད་པ་ཡིན། །དཔག་ཏུ་མེད་ལ་མཆོད་པའི་ཕྱིར། །ཀུན་འཛིན་སྒོ་ནི་རྫོགས་པར་འགྱུར། །དེ་བཞིན་གཏི་མུག་གང་མཆོད་པ། །སྲིད་པ་\nགསུམ་ལ་མཆོད་པ་ཡིན། །སྲིད་པ་གསུམ་ལ་མཆོད་པའི་ཕྱིར། །ཀུན་འཛིན་སྒོ་ནི་རྫོགས་པར་འགྱུར། །དེ་བཞིན་གཏི་མུག་གང་མཆོད་པ། །རབ་དབེན་ལ་ནི་མཆོད་པ་ཡིན། །རབ་དབེན་ལ་ནི་མཆོད་པའི་ཕྱིར། །ཀུན་\nའཛིན་སྒོ་ནི་རྫོགས་པར་འགྱུར། །དེ་བཞིན་གཏི་མུག་གང་མཆོད་པ། །འཁོར་བར་འཇུག་ལ་མཆོད་པ་ཡིན། །འཁོར་བར་འཇུག་ལ་མཆོད་པའི་ཕྱིར། །ཀུན་འཛིན་སྒོ་ནི་རྫོགས་པར་འགྱུར། །དེ་བཞིན་གཏི་མུག་\nགང་མཆོད་པ། །འཇུག་པ་མེད་ལ་མཆོད་པ་ཡིན། །འཇུག་པ་མེད་ལ་མཆོད་པའི་ཕྱིར། །ཀུན་འཛིན་སྒོ་ནི་རྫོགས་པར་འགྱུར། །དེ་བཞིན་གཏི་མུག་གང་མཆོད་པ། །ཡོད་པ་མིན་<span class='delete'>པ་</span><span class='add'>ལ་</span>མཆོད་པ་ཡིན། །ཡོད་པ་\nམིན་ལ་མཆོད་པའི་ཕྱིར། །ཀུན་འཛིན་སྒོ་ནི་རྫོགས་པར་འགྱུར། །དེ་བཞིན་གཏི་མུག་གང་མཆོད་པ། །བྱུང་བ་མེད་ལ་མཆོད་པ་ཡིན། །བྱུང་བ་མེད་ལ་མཆོད་པའི་ཕྱིར། །ཀུན་འཛིན་སྒོ་ནི་རྫོགས་པར་འགྱུར། །\nདེ་བཞིན་གཏི་མུག་གང་མཆོད་པ། །ཉེ་བར་ཞི་ལ་མཆོད་པ་ཡིན། །ཉེ་བར་ཞི་ལ་མཆོད་པའི་ཕྱིར། །ཀུན་འཛིན་སྒོ་ནི་རྫོགས་པར་འགྱུར། །དེ་བཞིན་གཏི་མུག་གང་མཆོད་པ། འོང་བ་མེད་ལ་མཆོད་པ་ཡིན། །\nའོང་བ་མེད་ལ་མཆོད་པའི་ཕྱིར། །ཀུན་འཛིན་སྒོ་ནི་རྫོགས་པར་འགྱུར། །དེ་བཞིན་གཏི་མུག་གང་མཆོད་པ། །འགྲོ་བ་མེད་ལ་མཆོད་པ་ཡིན། །འགྲོ་བ་མེད་ལ་མཆོད་པའི་ཕྱིར། །ཀུན་འཛིན་<span class='delete'>ནི་</span><span class='add'></span>སྒོ་ནི་རྫོགས་པར་"
 ],
 [
  "79.288a",
  "གཏི་མུག་ཡིན་སྟོན་ཅིང་། །རང་བཞིན་དབྱེར་མེད་རབ་ཤེས་ན། །ཀུན་འཛིན་སྒོ་ནི་སློབ་པ་ཡིན། །དེ་བཞིན་གཏི་མུག་གང་མཆོད་པ། །དེ་ནི་སངས་རྒྱས་མཆོད་པ་ཡིན། །སངས་རྒྱས་ལ་ནི་མཆོད་པའི་\nཕྱིར། །ཀུན་འཛིན་སྒོ་ནི་རྫོགས་པར་འགྱུར། །དེ་བཞིན་གཏི་མུག་གང་མཆོད་པ། །དེ་ནི་ཆོས་ལ་མཆོད་པ་ཡིན། །ཆོས་ལ་མཆོད་པ་བྱས་པའི་ཕྱིར། །ཀུན་འཛིན་སྒོ་ནི་རྫོགས་པར་འགྱུར། །དེ་བཞིན་གཏི་མུག་གང་\nམཆོད་པ། །དེ་ནི་དགེ་འདུན་མཆོད་པ་ཡིན། །དགེ་འདུན་ལ་ནི་མཆོད་པའི་ཕྱིར། །ཀུན་འཛིན་སྒོ་ནི་རྫོགས་པར་འགྱུར། །དེ་བཞིན་གཏི་མུག་གང་མཆོད་པ། །དེ་ནི་ཚུལ་ཁྲིམས་མཆོད་པ་ཡིན། །ཚུལ་ཁྲིམས་ལ་ནི་\nམཆོད་པའི་ཕྱིར། །ཀུན་འཛིན་སྒོ་ནི་རྫོགས་པར་འགྱུར། །དེ་བཞིན་གཏི་མུག་གང་མཆོད་པ། །བརྩོན་འགྲུས་ལ་ནི་མཆོད་པ་ཡིན། །བརྩོན་འགྲུས་ལ་ནི་མཆོད་པའི་ཕྱིར། །ཀུན་འཛིན་སྒོ་ནི་རྫོགས་པར་འགྱུར། །\nདེ་བཞིན་གཏི་མུག་གང་མཆོད་པ། །བསྔགས་པ་བརྗོད་ཅིང་མཆོད་པ་ཡིན། བསྔགས་པ་བརྗོད་ཅིང་མཆོད་པའི་ཕྱིར། །ཀུན་འཛིན་སྒོ་ནི་རྫོགས་པར་འགྱུར། །དེ་བཞིན་གཏི་མུག་གང་མཆོད་པ། །སངས་རྒྱས་\nཆོས་ལ་མཆོད་པའི་ཕྱིར། །ཀུན་འཛིན་སྒོ་ནི་རྫོགས་པར་འགྱུར། དེ་བཞིན་གཏི་མུག་གང་མཆོད་པ། །ཆོས་ཉིད་ལ་ནི་མཆོད་པ་ཡིན། ཆོས་ཉིད་ལ་ནི་མཆོད་པའི་ཕྱིར། །ཀུན་འཛིན་སྒོ་ནི་རྫོགས་པར་འགྱུར། །དེ་བཞིན་\nགཏི་མུག་གང་མཆོད་པ། །དེ་བཞིན་ཉིད་ལ་མཆོད་པ་ཡིན། །དེ་བཞིན་ཉིད་ལ་མཆོད་པའི་ཕྱིར། །ཀུན་འཛིན་སྒོ་ནི་རྫོགས་པར་འགྱུར། །དེ་བཞིན་གཏི་མུག་གང་མཆོད་པ། །སྐྱེ་བ་མེད་ལ་མཆོད་པ་ཡིན། །སྐྱེ་བ་མེད་ལ་\nམཆོད་པའི་ཕྱིར། །ཀུན་འཛིན་སྒོ་ནི་རྫོགས་པར་འགྱུར། །དེ་བཞིན་གཏི་མུག་གང་མཆོད་པ། །འགག་<span class='delete'>བ་</span><span class='add'>པ་</span>མེད་ལ་མཆོད་པ་ཡིན །འགག་<span class='delete'>བ་</span><span class='add'>པ་</span>མེད་ལ་མཆོད་པའི་ཕྱིར། །ཀུན་འཛིན་སྒོ་ནི་རྫོགས་པར་འགྱུར། །དེ་"
 ],
 [
  "79.289a",
  "འགྱུར། །དེ་བཞིན་གཏི་མུག་གང་མཆོད་པ། །འདུས་བྱས་ལ་ནི་མཆོད་པ་ཡིན། །འདུས་བྱས་ལ་ནི་མཆོད་པའི་ཕྱིར། །ཀུན་འཛིན་སྒོ་ནི་རྫོགས་པར་འགྱུར། །དེ་བཞིན་གཏི་མུག་གང་མཆོད་པ། །སྡུག་\nབསྔལ་ལ་སོགས་མཆོད་པ་ཡིན། །སྡུག་བསྔལ་ལ་སོགས་མཆོད་པའི་ཕྱིར། །ཀུན་འཛིན་སྒོ་ནི་རྫོགས་པར་འགྱུར། །དེ་བཞིན་གཏི་མུག་གང་མཆོད་པ། །སྡུག་བསྔལ་ཤེས་ལ་མཆོད་པ་ཡིན། །སྡུག་བསྔལ་\nཤེས་ལ་མཆོད་པའི་ཕྱིར། །ཀུན་འཛིན་སྒོ་ནི་རྫོགས་པར་འགྱུར། །དེ་བཞིན་གཏི་མུག་གང་མཆོད་པ། །ཀུན་འབྱུང་ཤེས་ལ་མཆོད་པ་ཡིན། །ཀུན་འབྱུང་ཤེས་ལ་མཆོད་པའི་ཕྱིར། །ཀུན་འཛིན་སྒོ་ནི་རྫོགས་པར་\nའགྱུར། །དེ་བཞིན་གཏི་མུག་གང་མཆོད་པ། །འགོག་པ་ཤེས་ལ་མཆོད་པ་ཡིན། །འགོག་པ་ཤེས་ལ་མཆོད་པའི་ཕྱིར། །ཀུན་འཛིན་སྒོ་ནི་རྫོགས་པར་འགྱུར། །དེ་བཞིན་གཏི་མུག་གང་མཆོད་པ། །ལམ་ཤེས་ལ་ནི་\nམཆོད་པ་ཡིན། །ལམ་ཤེས་ལ་ནི་མཆོད་པའི་ཕྱིར། །ཀུན་འཛིན་སྒོ་ནི་རྫོགས་པར་འགྱུར། །དེ་བཞིན་གཏི་མུག་གང་མཆོད་པ། །ཆོས་ཤེས་ལ་ནི་མཆོད་པ་ཡིན། །ཆོས་ཤེས་ལ་ནི་མཆོད་པའི་ཕྱིར། །ཀུན་འཛིན་\nསྒོ་ནི་རྫོགས་པར་འགྱུར། །དེ་བཞིན་གཏི་མུག་གང་མཆོད་པ། །རྗེས་ལ་ཤེས་ལ་མཆོད་པ་ཡིན། །རྗེས་ལ་ཤེས་ལ་མཆོད་པའི་ཕྱིར། །ཀུན་འཛིན་སྒོ་ནི་རྫོགས་པར་འགྱུར། །དེ་བཞིན་གཏི་མུག་གང་མཆོད་པ། །སྐྱེ་\nམེད་ཡེ་ཤེས་མཆོད་པ་ཡིན། །སྐྱེ་མེད་ཡེ་ཤེས་<span class='delete'>ལ་</span><span class='add'></span>མཆོད་པའི་ཕྱིར། །ཀུན་འཛིན་སྒོ་ནི་རྫོགས་པར་འགྱུར། །དེ་བཞིན་གཏི་མུག་གང་མཆོད་པ། །ཟད་པའི་ཡེ་ཤེས་མཆོད་པ་ཡིན། །ཟད་པའི་ཡེ་ཤེས་མཆོད་པའི་\nཕྱིར། །ཀུན་འཛིན་སྒོ་ནི་རྫོགས་པར་འགྱུར། །དེ་བཞིན་ཡང་དག་སྤོང་བ་དང་། །དྲན་པ་ཉེར་གཞག་རྫུ་འཕྲུལ་<span class='delete'>རྐང།། །</span><span class='add'>རྐང་། །</span>དབང་པོ་ལྔ་དང་སྟོབས་ལྔ་དང་། །བྱང་ཆུབ་ཡན་ལག་བདུན་པོ་དང་། །ཡན་ལག་བརྒྱད་པའི་"
 ],
 [
  "79.289b",
  "ལམ་དག་དང་། །ཞི་གནས་ལྷག་མཐོང་ལ་སོགས་པ། །ཆོས་ནི་རྣམ་པར་དགུ་པོ་རྣམས། །ཐམས་ཅད་དེ་བཞིན་སྦྱར་<span class='delete'>པར་</span><span class='add'>བར་</span>བྱ། །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཟླ་འོད་གཞོན་ནུར་གྱུར་པ་ལ་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་སེམས་\nཅན་གང་ལ་ལ་ཞིག་ཐེག་པ་ལ་གནས་ནས། གོང་དུ་ཇི་སྐད་བསྟན་པའི་གཟུངས་མངོན་<span class='delete'>པར་</span><span class='add'>པར་</span>བསྒྲུབ་པར་འདོད་པས་གང་ཟག་རྣམ་པ་བརྒྱད་བཅུ་ཡོངས་སུ་སྡང་བར་བྱའོ། །རྣམ་པ་བརྒྱད་བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ཕ་བསད་<span class='delete'>བ་</span><span class='add'>པ་</span>\nདང་། མ་བསད་<span class='delete'>བ་</span><span class='add'>པ་</span>དང་། དགྲ་བཅོམ་བ་བསད་<span class='delete'>བ་</span><span class='add'>པ་</span>དང་། གནོད་སེམས་ཀྱིས་དེ་བཞིན་གཤེགས་པའི་སྐུ་ལ་མཚལ་ཕྱུང་བ་དང་། དགེ་འདུན་འཐུན་པ་གཤིག་པ་དང་། རྐུན་བུར་རབ་ཏུ་བྱུང་བ་དང་། དབང་པོ་མ་ཚང་བ་དང་། དབང་པོ་\nགཉིས་དང་ལྡན་པ་དང་། ལོག་པར་ལྟ་བ་དང་། ལོག་པར་སེམས་པ་དང་། ལོག་པར་སྨྲ་བ་དང་། ལོག་པའི་ལམ་ཅན་དང་། ལོག་པར་འཚོ་བ་དང་། ལོག་པར་བརྩོན་པ་<span class='delete'>དང་། །</span><span class='add'>དང་། </span>ལོག་པའི་དྲན་པ་ཅན་དང་། ལོག་པའི་ཏིང་ངེ་འཛིན་\nལ་གནས་པ་དང་། གནས་མི་ཤེས་པ་<span class='delete'>དང་། །</span><span class='add'>དང་། </span>དུས་མི་ཤེས་པ་དང་། <span class='delete'>ཚོད་</span><span class='add'>ཚོད་</span>མི་ཤེས་པ་དང་། ལམ་མི་ཤེས་པ་དང་། ཚད་མི་ཤེས་པ་དང་། བདག་དང་གཞན་མི་ཤེས་པ་དང་། སངས་རྒྱས་དང་། ཆོས་དང་། དགེ་འདུན་དང་། \nབསླབ་པའི་གནས་རྣམས་ལ་གུས་པ་མེད་པ་དང་། བག་ཡོད་པ་དང་སྤྱོད་ཡུལ་ཁྱད་པར་དུ་འཕགས་པ་དག་ལ་བཙུན་པར་མི་འཛིན་པ་དང་། ཆོས་མི་ཤེས་པ་དང་། འདུལ་བ་མི་ཤེས་པ་དང་། བསླབ་པའི་གནས་མི་ཤེས་\nཔ་དང་། ཁ་ན་མ་ཐོ་བ་དང་ལྕི་བ་དང་ཡང་བ་མི་ཤེས་པ་དང་། ཚུལ་ཁྲིམས་ཉམས་པ་དང་<span class='delete'>ཚལ་</span><span class='add'>རལ་</span>བ་མི་ཤེས་པ་དང་། གཞན་ཡང་སྤྱོད་པ་ཤིན་ཏུ་ཕྲ་བ་དང་རགས་པ་མི་ཤེས་པ་དང་། ལས་མ་འོངས་པ་དང་ད་ལྟར་བྱུང་བ་མི་\nཤེས་པ་དང་། དངོས་པོ་དམན་པ་རྣམས་མི་ཤེས་པ་དང་། ཉན་ཐོས་ཀྱི་ཐེག་པའི་བསྔགས་པ་བརྗོད་ཅིང་དེ་བཞིན་གཤེགས་པའི་ཆོས་ལ་སྐུར་<span class='delete'>པ་</span><span class='add'>པ་</span>འདེབས་པ་དང་། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་<span class='delete'>བསྒྲུབ་</span><span class='add'>སྒྲུབ་</span>པར་བསྐུལ་<span class='delete'>བ་</span><span class='add'>བ་</span>དང་།"
 ],
 [
  "79.290a",
  "བླ་ན་མེད་པའི་ལམ་ཡང་དག་པ་ལ་སྐྱོ་ཞིང་སྤོང་བར་བྱེད་པ་དང་། ཚུལ་ཁྲིམས་ཉམས་པ་དང་། ལྟ་བ་ཉམས་པ་དང། སྤྱོད་ལམ་ཉམས་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>ལམ་མ་ཡིན་པ་སྤྱོད་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>བདག་ཡོད་པར་\nསྨྲ་བ་<span class='delete'>དང། </span><span class='add'>དང་། </span>སེམས་ཅན་ཡོད་པར་སྨྲ་བ་དང་། སྲོག་ཡོད་པར་སྨྲ་བ་<span class='delete'>དང། </span><span class='add'>དང་། </span>གང་ཟག་ཡོད་པར་སྨྲ་བ་<span class='delete'>དང། </span><span class='add'>དང་། </span>བསམ་པ་ཤིན་དུ་དམན་ཞིང་འདོད་ཆགས་<span class='delete'>དང། </span><span class='add'>དང་། </span>ཞེ་སྡང་<span class='delete'>དང། </span><span class='add'>དང་། </span>གཏི་མུག་སྐྱེད་པར་བྱེད་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>ཆད་པར་ལྟ་བ་<span class='delete'>དང། </span><span class='add'>དང་། </span>\nརྟག་པར་ལྟ་བ་<span class='delete'>དང། </span><span class='add'>དང་། </span>སྟོང་ཞིང་རྒྱུ་མེད་པར་ལྟ་བ་<span class='delete'>དང། </span><span class='add'>དང་། </span>ཡོད་པ་མི་མཐོང་བ་<span class='delete'>དང། </span><span class='add'>དང་། </span>མེད་པ་མི་མཐོང་བ་<span class='delete'>དང། </span><span class='add'>དང་། </span>ལས་མི་མཐོང་བ་<span class='delete'>དང། </span><span class='add'>དང་། </span>བརྩོན་འགྲུས་མི་མཐོང་བ་<span class='delete'>དང། </span><span class='add'>དང་། </span>ལས་མི་ཤེས་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>ལས་ཀྱི་རྒྱུ་མི་ཤེས་པ་\n<span class='delete'>དང། </span><span class='add'>དང་། </span>རྣམ་པར་སྨིན་པ་མི་ཤེས་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>རྣམ་པར་སྨིན་པའི་རྒྱུ་མི་ཤེས་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>དབང་པོ་རྣམས་མི་ཤེས་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>དབང་པོ་རྣམས་ཀྱི་རྒྱུ་མི་ཤེས་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>ཁམས་མི་ཤེས་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>ཁམས་ཀྱི་རྒྱུ་མི་ཤེས་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>\nརྣམ་པར་གྲོལ་བ་མི་ཤེས་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>རྣམ་པར་གྲོལ་བའི་རྒྱུ་མི་ཤེས་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>ལམ་མི་ཤེས་པ་དང་། ལམ་གྱི་རྒྱུ་མི་ཤེས་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>ཉོན་མོངས་པ་མི་ཤེས་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>ཉོན་མོངས་པའི་རྒྱུ་མི་ཤེས་པ་དང་། གཏོང་བ་\nམི་ཤེས་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>གཏོང་བའི་རྒྱུ་མི་ཤེས་པ་དང་། སྔོན་གྱི་མཐའ་དང་ཕྱི་མའི་མཐའ་མི་ཤེས་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>སྔོན་གྱི་མཐའ་དང་ཕྱི་མའི་མཐའི་རྒྱུ་མི་ཤེས་པ་དང་། སྐྱེ་ཤི་མི་ཤེས་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>སྐྱེ་ཤིའི་རྒྱུ་མི་ཤེས་པ་\nདང་། ཟག་པ་དང་བཅས་པ་མི་ཤེས་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>ཟག་པ་དང་བཅས་པའི་རྒྱུ་མི་ཤེས་པ་དང་། ཟད་པ་དང་ཟད་པ་མ་ཡིན་པ་མི་ཤེས་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>ཡོད་པ་དང་ཡོད་པ་མ་ཡིན་པ་མི་ཤེས་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>མཐའ་དང་མཐའ་\nམ་ཡིན་པ་མི་ཤེས་པ་<span class='delete'>དང། </span><span class='add'>དང་། </span>དབེན་པ་དང་དབེན་པ་མ་ཡིན་པ་མི་ཤེས་པ་དང་། འཇུག་པ་དང་འཇུག་པ་མ་ཡིན་པ་མི་ཤེས་པ་དང་། ངོ་བོ་ཉིད་དང་ངོ་བོ་ཉིད་མ་ཡིན་པ་མི་ཤེས་པ་དང་། སྐྱེ་བ་དང་སྐྱེ་བ་མ་ཡིན་པ་མི་"
 ],
 [
  "79.290b",
  "ཤེས་པ་དང་། འགག་པ་དང་འགག་པ་མ་ཡིན་པ་མི་ཤེས་པ་གང་ཡིན་པ་སྟེ། གཞོན་<span class='delete'>ནུར་</span><span class='add'>ནུ་</span>རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གང་ལ་ལ་ཞིག་གོང་དུ་ཇི་སྐད་དུ་བསྟན་པའི་གཟུངས་མངོན་<span class='delete'>པར་</span><span class='add'>པར་</span>བསྒྲུབ་པར་འདོད་པས་ཆོས་མ་ཡིན་པ་སྤྱོད་པའི་གང་ཟག་\nབརྒྱད་བཅུ་པོ་འདི་དག་ཡོངས་སུ་སྤང་བར་བྱའོ། །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཡང་ཚིགས་སུ་བཅད་དེ་བཀའ་སྩལ་པ། གང་ཞིག་མིག་གི་སྐྱེ་མཐའ་དང་། །ཟད་མཐའ་དག་ནི་མི་རྟོགས་པ། །དེ་ནི་ཀུན་འཛིན་ལ་རྨོངས་པས། །\nམཁས་པས་ཡོངས་སུ་སྤང་བར་བྱ། །གང་ཞིག་མིག་ལ་བདག་མེད་དང་། །སེམས་ཅན་མེད་པར་རྟོགས་གྱུར་པ། །དེས་ནི་ཀུན་འཛིན་ལ་གནས་པས། །མཁས་པས་ཡོངས་སུ་བསྟེན་པར་བྱ། །གང་ཞིག་མིག་ནི་སྐྱེ་ཟད་དང་། །ཡི་གེ་སྤངས་པར་\nརྟོགས་གྱུར་པ། །དེ་ནི་ཀུན་འཛིན་ལ་གནས་པས། །མཁས་པས་ཡོངས་སུ་བསྟེན་པར་བྱ། །གང་ཞིག་མིག་གི་དབེན་པ་དང་། །གནས་པ་མེད་པར་རྟོགས་གྱུར་<span class='delete'>བ། །</span><span class='add'>པ། །</span>དེ་ནི་ཀུན་འཛིན་ལ་གནས་<span class='delete'>པ། །</span><span class='add'>པས། །</span>མཁས་པས་ཡོངས་སུ་བསྟེན་པར་བྱ། །གང་\nཞིག་མིག་གི་རང་བཞིན་ཉིད། །གནས་པ་མེད་པར་རྟོགས་གྱུར་པས། །དེ་ནི་ཀུན་འཛིན་ལ་གནས་པས། །མཁས་པས་ཡོངས་སུ་བསྟེན་<span class='delete'>པས་</span><span class='add'>པར་</span>བྱ། །གང་ཞིག་མིག་ལ་འཇུག་མེད་དང་། །གཟུགས་ཀྱི་མཚན་ཉིད་མེད་རྟོགས་པ། །དེ་ནི་ཀུན་འཛིན་ལ་གནས་\nཔས། །མཁས་པ་ཡོངས་སུ་བསྟེན་པར་བྱ། །གང་ཞིག་མིག་ལ་སྐྱེ་མེད་དང་། །རང་བཞིན་ཞི་བར་རྟོགས་གྱུར་པ། །དེ་ནི་ཀུན་འཛིན་ལ་གནས་པས། །མཁས་པས་ཡོངས་སུ་བསྟེན་པར་བྱ། །གང་ཞིག་མིག་ནི་རང་བཞིན་གྱིས། །མིག་གི་མཚན་ཉིད་སྤངས་པས་ན། །\nསངས་རྒྱས་རྣམས་ཀྱི་བསྔགས་པ་དང་། །བསྟན་དུ་མེད་པར་རྟོགས་གྱུར་པ། །དེ་ནི་ཀུན་འཛིན་ལ་གནས་པས། །མཁས་པས་ཡོངས་སུ་བསྟེན་པར་<span class='delete'>བྱ། </span><span class='add'>བྱ། །</span>གང་ཞིག་མིག་ནི་རང་བཞིན་གྱིས། །མིག་གི་མཚན་ཉིད་སྤངས་པས་ན། །སུ་ཡང་སེམས་ཤིང་འཛིན་པ་དང་། །\nབཤད་དུ་མེད་པར་རྟོགས་གྱུར་པ། །དེ་ནི་ཀུན་འཛིན་ལ་གནས་པས། །མཁས་པས་ཡོངས་སུ་བསྟེན་པར་བྱ། །དེ་བཞིན་གཟུངས་ཀྱི་ངོ་བོ་ཉིད། །ཡི་གེས་བརྗོད་བྱ་མ་ཡིན་པས། །ཕྱོགས་ཀྱང་ཡོད་པ་མ་ཡིན་ལ། །སེམས་ཀྱིས་ཀྱང་ནི་ཕྱིན་མི་<span class='delete'>འགྱུར།</span><span class='add'>འགྱུར། །</span>"
 ],
 [
  "79.287b",
  "མེད་ནས། །ཉེ་བར་ཞི་བའི་བར་དག་དང་། འདི་ལ་སོགས་པའི་བརྗོད་པ་རྣམས། །རང་བཞིན་གྱིས་ནི་བསྟན་མེད་པར། །རབ་ཏུ་རྟོགས་པར་གྱུར་པས་ན། །དེ་ལ་ཞེན་པ་ཅི་ཡང་མེད། །རྣ་བ་སྣ་ལྕེ་ལུས་དང་ཡིད། །\nཡུལ་དྲུག་དང་ནི་འབྱུང་ཆེན་བཞི། །འཇིག་རྟེན་སྐྱེ་བའི་མིང་གི་བར། །ཐམས་ཅད་དེ་བཞིན་སྦྱར་བར་བྱ། །དེས་ནི་འདོད་ཆགས་སངས་རྒྱས་ལམ། །རང་བཞིན་དབྱེར་མེད་ཡིན་པར་ནི། །རབ་ཏུ་རྟོགས་པར་གྱུར་པས་ན། །\nའདོད་ཆགས་ལ་ནི་ཞེན་པ་མེད། །སངས་རྒྱས་ལམ་ནི་ཐམས་ཅད་ཀུན། །ཉོན་མོངས་ལས་ནི་བཙལ་བར་བྱ། །རང་བཞིན་དབྱེར་མེད་རབ་ཤེས་ན། །ཀུན་འཛིན་སྒོར་ནི་ཞུགས་པ་ཡིན། །འདོད་ཆགས་ཀུན་འཛིན་\nཡིན་པ་དང་། །ཀུན་འཛིན་འདོད་ཆགས་ཡིན་སྟོན་ཅིང་། །རང་བཞིན་དབྱེར་མེད་རབ་ཤེས་ན། །ཀུན་འཛིན་སྒོར་ནི་སློབ་པ་ཡིན། །དེ་བཞིན་འདོད་ཆགས་གང་མཆོད་པ། །དེ་ནི་སངས་རྒྱས་མཆོད་པ་ཡིན། །\nསངས་རྒྱས་ལ་ནི་མཆོད་པའི་ཕྱིར། །ཀུན་འཛིན་སྒོར་ནི་རྫོགས་པར་འགྱུར། །དེས་ནི་ཞེ་སྡང་སངས་རྒྱས་ལམ། །རང་བཞིན་དབྱེར་མེད་ཡིན་པར་ནི། །རབ་ཏུ་རྟོགས་པར་གྱུར་<span class='delete'>བས་</span><span class='add'>པས་</span>ན། །ཞེ་སྡང་ལ་ནི་ཞེན་པ་མེད། །\nཞེ་སྡང་ཀུན་འཛིན་ཡིན་པ་དང་། །ཀུན་འཛིན་ཞེ་སྡང་ཡིན་སྟོན་ཅིང་། །རང་བཞིན་དབྱེར་མེད་རབ་ཤེས་ན། །ཀུན་འཛིན་སྒོ་ནི་སློབ་པ་ཡིན། །དེ་བཞིན་ཞེ་སྡང་གང་མཆོད་པ། །དེ་ནི་སངས་རྒྱས་མཆོད་པ་ཡིན། །\nསངས་རྒྱས་ལ་ནི་མཆོད་པའི་ཕྱིར། །ཀུན་འཛིན་སྒོ་ནི་རྫོགས་པར་འགྱུར། །དེས་ནི་གཏི་མུག་སངས་རྒྱས་ལམ། །རང་བཞིན་དབྱེར་མེད་ཡིན་པར་ནི། །རབ་ཏུ་རྟོགས་པར་གྱུར་པས་ན། །གཏི་མུག་ལ་ནི་ཞེན་པ་\nམེད། །གལ་ཏེ་གཏི་མུག་ཉིད་ཀྱི་མཐའ། །ཡང་དག་ཇི་བཞིན་རྟོགས་གྱུར་ན། །དེས་ནི་སངས་རྒྱས་ལམ་བསྒྲུབས་པས། །ཀུན་འཛིན་སྒོ་ནི་རྫོགས་པར་འགྱུར། །གཏི་མུག་ཀུན་འཛིན་ཡིན་པ་དང་། །ཀུན་འཛིན་"
 ],
 [
  "79.292a",
  "དང་ཐ་<span class='delete'>དང་</span><span class='add'>དད་</span>མཚན་ཉིད་མེད། །ལེན་དང་རྣམ་རྟོག་མེད་གྱུར་པ། །ཀུན་འཛིན་སྒོ་ལ་གནས་པ་ཡིན། །གང་ཞིག་མིག་གི་མཐའ་དག་ལ། །འགྱུར་དང་ཐ་<span class='delete'>དང་</span><span class='add'>དད་</span>མཚན་ཉིད་མེད། །ལེན་དང་རྣམ་རྟོག་མེད་\nགྱུར་པ། །ཀུན་འཛིན་སྒོ་ལ་གནས་པ་ཡིན། །གང་ཞིག་མིག་གི་ཉེར་ཞི་ལ། །འགྱུར་དང་ཐ་<span class='delete'>དང་</span><span class='add'>དད་</span>མཚན་ཉིད་མེད། །ལེན་དང་རྣམ་རྟོག་མེད་གྱུར་པ། །ཀུན་འཛིན་སྒོ་ལ་གནས་པ་ཡིན། །གང་ཞིག་མིག་གི་འཇུག་པ་ལ། །འགྱུར་\nདང་ཐ་<span class='delete'>དང་</span><span class='add'>དད་</span>མཚན་ཉིད་མེད། །ལེན་དང་རྣམ་རྟོག་མེད་གྱུར་པ། ཀུན་འཛིན་སྒོ་ལ་གནས་པ་ཡིན། །གང་ཞིག་མིག་གི་མེད་པ་ལ། །འགྱུར་དང་ཐ་<span class='delete'>དང་</span><span class='add'>དད་</span>མཚན་ཉིད་མེད། །ལེན་དང་རྣམ་རྟོག་མེད་གྱུར་པ། །ཀུན་འཛིན་སྒོ་ལ་གནས་\nཔ་ཡིན། །གང་ཞིག་མིག་གི་སྐྱེ་མེད་ལ། །འགྱུར་དང་ཐ་<span class='delete'>དང་</span><span class='add'>དད་</span>མཚན་ཉིད་མེད། །ལེན་དང་རྣམ་རྟོག་མེད་གྱུར་པ། །ཀུན་འཛིན་སྒོ་ལ་གནས་པ་ཡིན། །གང་ཞིག་མིག་གི་ཉེར་ཞི་ལ། །འགྱུར་དང་ཐ་<span class='delete'>དང་</span><span class='add'>དད་</span>མཚན་ཉིད་མེད། །ལེན་དང་\nརྣམ་རྟོག་མེད་གྱུར་པ། །ཀུན་འཛིན་སྒོ་ལ་གནས་པ་ཡིན། །རྣ་བ་སྣ་ལྕེ་ལུས་དང་ཡིད། །ཡུལ་དྲུག་དང་ནི་འབྱུང་ཆེན་བཞི། འཇིག་རྟེན་སྐྱེ་བའི་མིང་གི་བར། །ཐམས་ཅད་དེ་བཞིན་སྦྱར་བར་བྱ། །འདོད་སྡང་གཏི་མུག་ང་རྒྱལ་ཆེ། །\nཕྲག་དོག་སེར་སྣ་སྒྱུ་མྱ་ངན། །ཉེས་དམིགས་དྲི་མ་ཟུག་རྔུ་དང་། །ཆུ་བོ་དཀར་ནག་ལས་རྣམས་དང་། །སྐྱེ་བ་མེད་དང་འགག་མེད་དང་། །འགྲོ་བ་མེད་དང་འོང་མེད་དང་། །<span class='delete'>མིག་</span><span class='add'>མི་ག</span>ཡོ་ཐ་དད་མི་འགྱུར་དང་། །བྱས་མིན་སྤྱོད་པ་མ་ཡིན་\nདང་། །སྣང་མིན་མུན་པ་མ་ཡིན་དང་། །འཇུག་མིན་ཆུ་བོ་སྤངས་པ་དང་། །ཟག་པ་མེད་དང་གནས་མེད་དང་། །འགྲོ་<span class='delete'>མི་</span><span class='add'></span><span class='delete'>མིན་</span><span class='add'>མིན་མི་</span>འགྲོ་མ་ཡིན་དང་། །ཡི་གེ་མ་ཡིན་དམིགས་མིན་དང་། །འབྱུང་བ་མ་ཡིན་འཇུག་མིན་དང་། །ཡང་\nདག་མ་ཡིན་རྣམ་རྟོག་སོགས། །སྒོ་ནི་དྲུག་བཅུ་རྩ་གཉིས་རྣམས། །སོ་སོའི་དོན་དང་ཅི་རིགས་པར། །ཐམས་ཅད་དེ་བཞིན་སྦྱར་བར་བྱ། །གང་ཞིག་མིག་གི་སྔོན་མཐའ་ཡི། །རབ་དང་ཐ་མའི་བར་ཤེས་ཤིང་། །ལེན་དང་"
 ],
 [
  "79.291b",
  "ནི་ཉེར་ཞི་བ། །ཡང་དག་ཇི་བཞིན་རབ་རྟོགས་ན། །ཀུན་འཛིན་སྒོ་ནི་གང་ཡིན་པ། །མཐར་ནི་ཡོངས་སུ་རྫོགས་པར་བྱེད། །གང་ཞིག་མིག་ནི་འགྱུར་བ་ཡི། །ཟད་མཐའ་ཡང་དག་བཞིན་རྟོགས་ན། །ཀུན་འཛིན་སྒོ་ནི་གང་\nཡིན་པ། །མཐར་ནི་ཡོངས་སུ་རྫོགས་པར་བྱེད། །གང་ཞིག་མིག་གི་འགྱུར་བ་ཡི། །སྐྱེ་མཐའ་ཡང་དག་བཞིན་རྟོགས་ན། །ཀུན་འཛིན་སྒོ་ནི་གང་ཡིན་པ། །མཐར་ནི་ཡོངས་སུ་རྫོགས་པར་བྱེད། །གང་ཞིག་མིག་\nགི་འགྱུར་བ་ཡི། །མཐར་ནི་ཡང་དག་བཞིན་རྟོགས་ན། །ཀུན་འཛིན་སྒོ་ནི་གང་ཡིན་པ། །མཐར་ནི་ཡོངས་སུ་རྫོགས་པར་བྱེད། །གང་ཞིག་མིག་གི་འགྱུར་བ་ཡི། །རབ་དབེན་ཡང་དག་བཞིན་རྟོགས་ན། །ཀུན་འཛིན་སྒོ་ནི་གང་\nཡིན་པ། །མཐར་ནི་ཡོངས་སུ་རྫོགས་པར་བྱེད། །གང་ཞིག་མིག་གི་འགྱུར་བ་ཡི། །འཇུག་པ་ཡང་དག་བཞིན་རྟོགས་ན། །ཀུན་འཛིན་སྒོ་ནི་གང་ཡིན་པ། །མཐར་ནི་ཡོངས་སུ་རྫོགས་པར་བྱེད། །གང་ཞིག་མིག་གི་འགྱུར་\nབ་ཡི། །མེད་པ་ཡང་དག་བཞིན་རྟོགས་ན། །ཀུན་འཛིན་སྒོ་ནི་གང་ཡིན་པ། །མཐར་ནི་ཡོངས་སུ་རྫོགས་པར་བྱེད། །གང་ཞིག་མིག་གི་འགྱུར་བ་ཡི། །སྐྱེ་མེད་ཡང་དག་བཞིན་རྟོགས་ན། །ཀུན་འཛིན་སྒོ་ནི་གང་ཡིན་པ། །\nམཐར་ནི་ཡོངས་སུ་རྫོགས་པར་བྱེད། གང་ཞིག་མིག་གི་འགྱུར་བ་ཡི། །ཉེར་ཞི་ཡང་དག་བཞིན་རྟོགས་ན། །ཀུན་འཛིན་སྒོ་ནི་གང་ཡིན་པ། །མཐར་ནི་ཡོངས་སུ་རྫོགས་པར་བྱེད། །རྣ་བ་སྣ་ལྕེ་ལུས་དང་ཡིད། །ཡུལ་དྲུག་དང་ནི་\nའབྱུང་ཆེན་བཞི། །འཇིག་རྟེན་སྐྱེ་བའི་མིང་གི་བར། །ཐམས་ཅད་དེ་བཞིན་སྦྱར་བར་བྱ། །གང་ཞིག་མིག་གི་སྔོན་མཐའ་ལ། །འགྱུར་དང་ཐ་<span class='delete'>དང་</span><span class='add'>དད་</span>མཚན་ཉིད་མེད། །ལེན་དང་རྣམ་རྟོག་མེད་གྱུར་པ། །ཀུན་འཛིན་\nསྒོ་ལ་གནས་པ་ཡིན། །གང་ཞིག་མིག་གི་ཟད་མཐའ་ལ། །འགྱུར་དང་ཐ་<span class='delete'>དང་</span><span class='add'>དད་</span>མཚན་ཉིད་མེད། །ལེན་དང་རྣམ་རྟོག་མེད་འགྱུར་པ། །ཀུན་འཛིན་སྒོ་ལ་གནས་པ་ཡིན། །གང་ཞིག་མིག་གི་སྐྱེ་མཐའ་ལ། །འགྱུར་"
 ],
 [
  "79.291a",
  "ཆོས་དེ་ལ་ནི་དགའ་བ་མེད། །ཞེ་སྡང་ལ་ཡང་གནས་པ་མིན། །རི་རྒྱལ་བཞིན་དུ་མི་གཡོ་བས། །རྗོད་པར་བྱེད་ཀྱང་དམིགས་སུ་མེད། །ཀུན་འཛིན་ཡང་དག་ཡོད་མ་ཡིན། །བདག་ཀྱང་ཡོད་པ་མ་ཡིན་<span class='delete'>ཏེ། </span><span class='add'>ཏེ། །</span>\nགལ་ཏེ་བདག་ནི་རང་བཞིན་སྟོང་། །ཀུན་འཛིན་ཡང་ནི་ཡོད་མི་འགྱུར། །ཀུན་འཛིན་རང་བཞིན་སྟོང་ཡིན་ན། །བྱིས་<span class='delete'>བས་</span><span class='add'>པས་</span>ཡོད་པར་རབ་ཏུ་བརྟགས། །ཡང་དག་མ་ཡིན་བརྟགས་པས་ན། །མ་ཐོས་པར་ཡང་མྱ་ངན་སྐྱེད། །གང་\nཞིག་འདོད་དང་ཀུན་འཛིན་<span class='delete'>དག། །</span><span class='add'>དག །</span>སྟོང་པ་ཉིད་དུ་རྣམ་རྟོག་པ། །རྟོག་པ་གཉིས་པོ་དེ་དག་ཀྱང་། །མཐར་ནི་གང་ཡང་དམིགས་མི་འགྱུར། །གལ་ཏེ་སྟོང་ཉིད་སྟོང་རྟོགས་ན། །ཀུན་འཛིན་དག་ཀྱང་ཡོད་མི་འགྱུར། །བྱང་ཆུབ་\nཡན་ལག་བར་དག་དང་། །ཏིང་འཛིན་དག་ཀྱང་སྟོང་པ་ཡིན། །གང་ཞིག་ཀུན་འཛིན་སྟོང་ཉིད་དང་། །ཏིང་འཛིན་དག་གི་བར་དག་ཀྱང་། །རབ་ཏུ་རྟོགས་པར་གྱུར་ན་ནི། །མིག་ཀྱང་རབ་ཏུ་རྟོགས་པར་འགྱུར། །གང་ཞིག་མིག་ནི་<span class='delete'>ཟང་</span><span class='add'>ཟད་</span>\nཔའི་མཐའ། །ཡང་དག་ཇི་བཞིན་རབ་རྟོགས་ན། །ཀུན་འཛིན་སྒོ་ནི་གང་ཡིན་པ། །མཐར་ནི་ཡོངས་སུ་རྫོགས་པར་བྱེད། །གང་ཞིག་མིག་ནི་སྐྱེ་<span class='delete'>པའི་</span><span class='add'>བའི་</span>མཐའ། །ཡང་དག་ཇི་བཞིན་རབ་རྟོགས་ན། །ཀུན་འཛིན་སྒོ་ནི་གང་\nཡིན་པ། །མཐར་ནི་ཡོངས་སུ་རྟོགས་པར་བྱེད། །གང་ཞིག་མིག་གི་མཐའ་ཡི་རྣམས། །ཡང་དག་ཇི་བཞིན་རབ་རྟོགས་ན། །ཀུན་འཛིན་སྒོ་ནི་གང་ཡིན་པ། །མཐར་ནི་ཡོངས་སུ་རྫོགས་པར་བྱེད། །གང་ཞིག་མིག་ནི་\nརབ་དབེན་པ། །ཡང་དག་ཇི་བཞིན་རབ་རྟོགས་ན། །ཀུན་འཛིན་སྒོ་ནི་གང་ཡིན་པ། །མཐར་ནི་ཡོངས་སུ་རྫོགས་པར་བྱེད། །གང་ཞིག་མིག་གི་འཇུག་པ་<span class='delete'>དག། །</span><span class='add'>དག །</span>ཡང་དག་ཇི་བཞིན་རབ་རྟོགས་ན། །ཀུན་འཛིན་སྒོ་ནི་\nགང་ཡིན་པ། །མཐར་ནི་ཡོངས་སུ་རྫོགས་པར་བྱེད། །གང་ཞིག་མིག་ནི་ཡོད་མིན་པ། །ཡང་དག་ཇི་བཞིན་རབ་རྟོགས་ན། །ཀུན་འཛིན་སྒོ་ནི་གང་ཡིན་པ། །མཐར་ནི་ཡོངས་སུ་རྫོགས་པར་བྱེད། །གང་ཞིག་མིག་"
 ],
 [
  "79.292b",
  "རྣམ་རྟོག་མེད་གྱུར་པ། །ཀུན་འཛིན་སྒོ་ལ་གནས་པ་ཡིན། །གང་ཞིག་མིག་གི་ཟད་མཐའ་ཡི། །རབ་དང་ཐ་མའི་བར་ཤེས་ཤིང་། །ལེན་དང་རྣམ་རྟོག་མེད་གྱུར་པ། །ཀུན་འཛིན་སྒོ་ལ་གནས་པ་ཡིན། །གང་ཞིག་མིག་གི་སྐྱེ་\nམཐའ་ཡི། །རབ་དང་ཐ་མའི་བར་ཤེས་ཤིང་། །ལེན་དང་རྣམ་རྟོག་མེད་གྱུར་པ། །ཀུན་འཛིན་སྒོ་ལ་གནས་པ་ཡིན། །གང་ཞིག་མིག་གི་མཐའ་དག་གི། །རབ་དང་ཐ་མའི་བར་ཤེས་ཤིང་། །ལེན་དང་རྣམ་རྟོག་མེད་གྱུར་པ། །ཀུན་\nའཛིན་སྒོ་ལ་གནས་པ་ཡིན། །གང་ཞིག་མིག་གི་རབ་དབེན་པའི། །རབ་དང་ཐ་མའི་བར་ཤེས་ཤིང་། །ལེན་དང་རྣམ་རྟོག་མེད་གྱུར་པ། །ཀུན་འཛིན་སྒོ་ལ་གནས་པ་ཡིན། །གང་ཞིག་མིག་གི་འཇུག་པ་ཡི། །རབ་དང་ཐ་མའི་\n<span class='delete'>རབ་</span><span class='add'>བར་</span>ཤེས་ཤིང་། །ལེན་དང་རྣམ་རྟོག་མེད་གྱུར་པ། །ཀུན་འཛིན་སྒོ་ལ་གནས་པ་ཡིན། །གང་ཞིག་མིག་ནི་མེད་པ་ཡི། རབ་དང་ཐ་མའི་བར་ཤེས་ཤིང་། །ལེན་དང་རྣམ་རྟོག་མེད་གྱུར་པ། །ཀུན་འཛིན་སྒོ་ལ་གནས་པ་ཡིན། །གང་ཞིག་\nམིག་ནི་མི་སྐྱེ་བའི། །རབ་དང་ཐ་མའི་བར་ཤེས་<span class='delete'>ཤིང། </span><span class='add'>ཤིང་། </span>ལེན་དང་རྣམ་རྟོག་མེད་གྱུར་པ། །ཀུན་འཛིན་སྒོ་ལ་གནས་པ་ཡིན། །གང་ཞིག་མིག་གི་ཉེར་ཞི་བའི། །རབ་དང་ཐ་མའི་རབ་ཤེས་ཤིང་། །ལེན་དང་རྣམ་རྟོག་མེད་གྱུར་པ། །\nཀུན་འཛིན་སྒོ་ལ་གནས་པ་ཡིན། །རྣ་བ་སྣ་ལྕེ་ལུས་དང་ཡིད། །ཡུལ་དྲུག་དང་ནི་འབྱུང་ཆེན་བཞི། །འཇིག་རྟེན་སྐྱེ་བའི་མིང་གི་བར། ཐམས་ཅད་དེ་བཞིན་སྦྱར་བར་བྱ། །ས་ལ་འགྱུར་བ་མེད་པ་དང་། །ལེན་དང་རྣམ་རྟོག་མེད་\n<span class='delete'>གྱུར་</span><span class='add'></span><span class='delete'>པ། </span><span class='add'>པར་ནི། །</span>དེ་ལྟར་གང་ཞིག་རྟོག་གྱུར་པ། །ཀུན་འཛིན་སྒོ་ནི་རྫོགས་པར་<span class='delete'>བྱ། །</span><span class='add'>བྱེད། །</span>ས་ནི་མི་སྐྱེ་འདུ་ཤེས་ཤིང་། །ལེན་དང་རྣམ་རྟོག་མེད་པར་ནི། །དེ་ལྟར་གང་ཞིག་རྟོགས་གྱུར་པ། །ཀུན་འཛིན་སྒོ་ནི་རྫོགས་པར་བྱེད། །ས་\nནི་འགག་མེད་འདུ་ཤེས་ཤིང་། །ལེན་དང་རྣམ་རྟོག་མེད་པར་ནི། །དེ་ལྟར་གང་ཞིག་རྟོགས་གྱུར་པ། །ཀུན་འཛིན་སྒོ་ནི་རྫོགས་པར་བྱེད། །ས་ལ་འཇུག་པར་འདུ་ཤེས་ཤིང་། །ལེན་དང་རྣམ་རྟོག་མེད་པར་ནི། །དེ་ལྟར་གང་"
 ],
 [
  "79.293a",
  "ཞིག་རྟོགས་གྱུར་པ། །ཀུན་འཛིན་སྒོ་ནི་རྫོགས་པར་བྱེད། །ས་ལ་ངེས་འབྱུང་འདུ་ཤེས་ཤིང་། །ལེན་དང་རྣམ་རྟོག་མེད་པར་ནི། །དེ་ལྟར་གང་ཞིག་རྟོགས་གྱུར་པ། །ཀུན་འཛིན་སྒོ་ནི་རྫོགས་པར་བྱེད། །ས་\nལ་སྨོན་མེད་འདུ་ཤེས་ཤིང་། །ལེན་དང་རྣམ་རྟོག་མེད་པར་ནི། །དེ་ལྟར་གང་ཞིག་རྟོགས་གྱུར་པ། །ཀུན་འཛིན་སྒོ་ནི་རྫོགས་པར་བྱེད། །ས་ལ་གནས་མེད་འདུ་ཤེས་ཤིང་། །འགྲོ་བ་མེད་དང་འོང་མེད་དང་། །མཐའ་མེད་དང་ནི་ཟད་\nམེད་དང་། །མཚུངས་པར་ལྡན་དང་མཚུངས་མི་ལྡན། །མིང་དང་ཡི་གེ་བརྟགས་བྲལ་དང་། །སོ་སོར་བརྟགས་དང་འཇུག་པ་དང་། །གཉེན་པོ་མི་འཐུན་ཕྱོགས་མེད་དང་། །བརྗོད་དུ་མེད་ཅིང་བསྟན་མེད་དང་། །རབ་དབེན་\nགནས་པ་མེད་པ་དང་། །དྲན་པ་ཉེ་གཞག་ཡང་དག་སྤོང་། །རྫུ་འཕྲུལ་རྐང་དང་དབང་པོ་སྟོབས། །བྱང་ཆུབ་ཡན་ལག་མི་འཇིགས་ལམ། །དེ་ལྟར་སའི་ཆོས་རྣམས་ལ། །ལེན་དང་རྣམ་རྟོག་མེད་པར་ནི། །དེ་ལྟར་གང་ཞིག་\nརྟོགས་གྱུར་པ། །ཀུན་འཛིན་སྒོ་ནི་རྫོགས་པར་བྱེད། །གལ་ཏེ་བདག་ལ་འཇུག་མེད་པས། །ལེན་དང་རྣམ་རྟོག་མེད་པར་ནི། །དེ་ལྟར་གང་ཞིག་རྟོགས་གྱུར་པ། །ཀུན་འཛིན་སྒོ་ནི་རྫོགས་པར་བྱེད། །གལ་ཏེ་བདག་ལ་འབྱུང་མེད་\nཔས། །ལེན་དང་རྣམ་རྟོག་མེད་པར་ནི། །དེ་ལྟར་གང་ཞིག་རྟོགས་གྱུར་པ། །ཀུན་འཛིན་སྒོ་ནི་རྫོགས་པར་བྱེད། །གལ་ཏེ་བདག་ལ་མཚན་མེད་པས། །ལེན་དང་རྣམ་རྟོག་མེད་པར་ནི། །དེ་ལྟར་གང་ཞིག་རྟོགས་གྱུར་པ། །ཀུན་\nའཛིན་སྒོ་ནི་རྫོགས་པར་བྱེད། །གལ་ཏེ་བདག་ལ་སྨོན་མེད་པས། །ལེན་དང་རྣམ་རྟོག་མེད་པར་ནི། །དེ་ལྟར་གང་ཞིག་རྟོགས་གྱུར་པ། །ཀུན་འཛིན་སྒོ་ནི་རྫོགས་<span class='delete'>གྱུར་</span><span class='add'></span><span class='delete'>པ། །</span><span class='add'>པར་བྱེད། །</span>གལ་ཏེ་བདག་ལ་གནས་མེད་པས། །ལེན་དང་རྣམ་\nརྟོག་མེད་པར་ནི། །དེ་ལྟར་གང་ཞིག་རྟོགས་གྱུར་པ། །ཀུན་འཛིན་སྒོ་ནི་རྫོགས་པར་བྱེད། །གལ་ཏེ་བདག་ལ་སྐྱེ་མེད་པས། །ལེན་དང་རྣམ་རྟོག་མེད་པར་ནི། །དེ་ལྟར་གང་ཞིག་རྟོགས་གྱུར་པ། །ཀུན་འཛིན་སྒོ་ནི་རྫོགས་"
 ],
 [
  "79.293b",
  "པར་བྱེད། །གལ་ཏེ་བདག་ལ་འགག་མེད་པས། །ལེན་དང་རྣམ་རྟོག་མེད་པར་ནི། །དེ་ལྟར་གང་ཞིག་རྟོགས་གྱུར་པ། །ཀུན་འཛིན་སྒོ་ནི་རྫོགས་པར་བྱེད། །གལ་ཏེ་བདག་ལ་ཡིག་མེད་པས། །ལེན་དང་རྣམ་རྟོག་མེད་པར་ནི། །\nདེ་ལྟར་གང་ཞིག་རྟོགས་གྱུར་པ། །ཀུན་འཛིན་སྒོ་ནི་རྫོགས་པར་བྱེད། །གལ་ཏེ་བདག་ནི་ཡིག་བྲལ་བས། །ལེན་དང་རྣམ་རྟོག་མེད་པར་ནི། །དེ་ལྟར་གང་ཞིག་རྟོགས་གྱུར་པ། །ཀུན་འཛིན་སྒོ་ནི་རྫོགས་པར་བྱེད། །མིག་གི་སྔོན་དང་\nཕྱི་མཐའ་<span class='delete'>དག། །</span><span class='add'>དག །</span>རྟག་ཆད་དག་ནི་སྤངས་པ་དང་། །རྒྱུ་རྐྱེན་རང་བཞིན་སྟོང་<span class='delete'>བར་</span><span class='add'>པར་</span>ནི། །འདྲེན་པས་ཐབས་ཀྱིས་བསྟན་རིག་བྱོས། །གལ་ཏེ་ཆོས་ནི་སྟོན་པའི་ཚེ། །མིག་གི་མཚན་ཉིད་རྟོགས་བྱེད་ན། དེ་ནི་མི་བདེན་རྟོག་ཡིན་པས། །\nཡང་དག་ཆོས་བསྟན་ཞེས་མི་བྱ། །གལ་ཏེ་ཆོས་ནི་སེམས་པའི་ཚེ། །མིག་གི་མཚན་ཉིད་རྟོག་བྱེད་ན། དེ་ནི་མི་བདེན་རྟོག་ཡིན་པས། །ཆོས་སེམས་པ་ཞེས་མི་བྱའོ། །གལ་ཏེ་ཆོས་ནི་སྒོམ་པའི་ཚེ། །མིག་གི་མཚན་ཉིད་\nརྟོགས་བྱེད་ན། །དེ་ནི་མི་བདེན་རྟོག་ཡིན་པས། །ཆོས་སྒོམ་པ་ཞེས་མི་བྱའོ། །གང་ཞིག་མིག་གི་སྟོང་ཉིད་རྟོགས། །བྱང་ཆུབ་གཞོལ་བར་མི་བྱེད་ན། །སངས་རྒྱས་གང་ཟག་དེ་དག་ལ། །རྟག་ཏུ་མངོན་སུམ་ཆོས་སྟོན་\nམཛད། །གལ་ཏེ་མིག་ནི་མ་རྟོགས་ན། །གཟུགས་ཀྱང་རྟོགས་པར་མི་འགྱུར་ལ། །གལ་ཏེ་མིག་ནི་རྟོགས་གྱུར་ན། །གཟུགས་ཀྱང་རབ་ཏུ་རྟོགས་<span class='delete'>པར་</span><span class='add'>པར་འ</span>གྱུར། །གལ་ཏེ་མིག་ནི་རྟོག་གྱུར་ན། །གཟུགས་ཀྱང་རབ་\nཏུ་རྟོགས་འགྱུར་ལ། །གལ་ཏེ་གཟུགས་ནི་རྟོགས་གྱུར་ན། །མིག་ཀྱང་རབ་ཏུ་རྟོགས་པར་འགྱུར། །རྣ་བ་སྣ་ལྕེ་ལུས་དང་ཡིད། ཡུལ་དྲུག་དང་ནི་འབྱུང་ཆེན་བཞི། །འཇིག་རྟེན་སྐྱེད་པའི་<span class='delete'>མིག་</span><span class='add'>མིང་</span>གི་བར། །ཐམས་ཅད་དེ་\nབཞིན་སྦྱར་བར་བྱ། །གལ་ཏེ་ཆོས་ནི་སྟོན་པའི་ཚེ། །རྒྱུ་ཡི་མཚན་ཉིད་རྟོགས་བྱེད་ན། །དེ་ནི་མི་བདེན་རྟོག་ཡིན་པས། །ཆོས་སྟོན་པ་ཞེས་མི་བྱའོ། །གལ་ཏེ་ཆོས་ནི་སྟོན་པའི་ཚེ། །འབྲས་བུའི་མཚན་"
 ],
 [
  "79.294b",
  "པར་བྱ། །མིག་ཉིད་སྟོང་པར་མ་ཤེས་ན། །མིག་གི་རང་བཞིན་དག་ལ་རྨོངས། །འདི་ལྟར་ཁོང་དུ་མ་ཆུད་ཕྱིར། །དེས་ནི་ཆོས་རྣམས་བསྟན་མི་བྱ། །གལ་ཏེ་མིག་ཉིད་སྟོང་ཤེས་ན། །ཚིག་གི་རང་བཞིན་ཤེས་པར་འགྱུར། །\nའདི་ལྟར་རབ་ཏུ་ཤེས་པའི་ཕྱིར། །དེས་ནི་ཆོས་རབ་བསྟན་པར་བྱ། །མིག་ཉིད་སྟོང་<span class='delete'>བར་</span><span class='add'>པར་</span>མ་ཤེས་ན། །མིག་གི་རང་བཞིན་དག་ལ་རྨོངས། །འདི་ལྟར་ཁོང་དུ་མ་ཆུད་ཕྱིར། །དེས་ནི་ཆོས་རྣམས་བསྟན་<span class='delete'>མ་</span><span class='add'>མི་</span>བྱ། །གལ་ཏེ་མིག་ཉིད་\nསྟོང་ཤེས་ན། །མིག་གི་རང་བཞིན་ཤེས་པར་འགྱུར། །འདི་ལྟར་རབ་ཏུ་ཤེས་པའི་ཕྱིར། །དེས་ནི་ཆོས་རབ་བསྟན་པར་བྱ། །མིག་ཉིད་སྟོང་པར་མ་ཤེས་ན། །གཟུགས་ཀྱི་རང་བཞིན་དག་ལ་རྨོངས། །འདི་ལྟར་ཁོང་དུ་མ་ཆུད་ཕྱིར། །དེས་\nནི་ཆོས་རྣམས་བསྟན་མི་བྱ། །གལ་ཏེ་མིག་ཉིད་སྟོང་ཤེས་ན། །གཟུགས་ཀྱི་རང་བཞིན་ཤེས་པར་འགྱུར། །འདི་ལྟར་རབ་ཏུ་ཤེས་པའི་ཕྱིར། །དེས་ནི་ཆོས་རབ་བསྟན་པར་བྱ། །མིག་ཉིད་སྟོང་པར་མ་ཤེས་ན། །འཇིག་རྟེན་\nམཚན་གནས་རྟོག་བྱེད་པས། །རྗེས་སུ་འཐུན་པ་ཁོ་ནར་ནི། །སེམས་ཅན་རྣམས་ནི་གདུལ་མི་ནུས། །མིག་གི་ཡོད་མེད་མ་རྟོགས་པར། །འཁོར་གྱི་ནང་དུ་ཆོས་སྟོན་པ། །དེ་ནི་རྙིང་ལ་གདུ་བས་ན། །ཐམས་ཅད་ཡིད་ཆེས་ལེན་\nམི་བྱེད། །མིག་གི་ཡོད་མེད་རྟོགས་གྱུར་ན། །འཁོར་གྱི་ནང་དུ་ཆོས་སྟོན་པས། །དེས་ནི་མངོན་ཞེན་མེད་པས་ན། །ཐམས་ཅད་ཡིད་ཆེས་ལེན་པར་བྱེད། །མིག་ཉིད་སྟོང་པར་མ་རྟོགས་པར། །ཆོས་ཀྱི་སྟན་ལ་འདུག་ནས་ནི། །\nདཔེ་མང་དག་གིས་རབ་བསྟན་<span class='delete'>ཀྱང། །</span><span class='add'>ཀྱང་། །</span>ཐམས་ཅད་ཡིད་ཆེས་ལེན་མི་བྱེད། །གལ་ཏེ་མིག་ཉིད་སྟོང་ཤེས་ན། །ཆོས་ཀྱི་སྟན་ལ་འདུག་ནས་ནི། །དཔེ་རྣམས་ཀྱིས་ནི་སྟོན་བྱེད་ན། །ཐམས་ཅད་ཡིད་ཆེས་ལེན་པར་བྱེད། །\nརྣ་བ་སྣ་ལྕེ་ལུས་དང་ཡིད། །ཡུལ་དྲུག་དང་ནི་འབྱུང་ཆེན་བཞི། །འཇིག་རྟེན་སྐྱེད་པའི་མིང་གི་<span class='delete'>པར། །</span><span class='add'>བར། །</span>ཐམས་ཅད་དེ་བཞིན་སྦྱར་བར་བྱ། །བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་<span class='delete'>ནས། །</span><span class='add'>ནས། </span>ཟླ་འོད་གཞོན་"
 ],
 [
  "79.294a",
  "ཉིད་རྟོགས་བྱེད་ན། །དེ་ནི་མི་བདེན་<span class='delete'>རྟོགས་</span><span class='add'>རྟོག་</span>ཡིན་པས། །ཆོས་སྟོན་པ་ཞེས་མི་བྱའོ། །གལ་ཏེ་ཆོས་ནི་སྟོན་པའི་ཚེ། །ལམ་གྱི་མཚན་ཉིད་རྟོགས་བྱེད་ན། །དེ་ནི་མི་བདེན་རྟོག་ཡིན་པས། །ཆོས་\nསྟོན་པ་ཞེས་མི་བྱའོ། །གལ་ཏེ་ཆོས་ནི་སྟོན་པའི་ཚེ། །སྟོང་པའི་མཚན་ཉིད་རྟོགས་བྱེད་ན། །དེ་ནི་མི་བདེན་རྟོག་ཡིན་པས། །ཆོས་སྟོན་པ་ཞེས་མི་བྱའོ། །གལ་ཏེ་ཆོས་ནི་སྟོན་པའི་ཚེ། །བསགས་པ་དག་ཏུ་རྟོགས་\nབྱེད་ན། །དེ་ནི་མི་བདེན་རྟོག་ཡིན་པས། །ཆོས་སྟོན་པ་ཞེས་མི་བྱའོ། །གལ་ཏེ་ཆོས་ནི་སྟོན་པའི་ཚེ། །རྫས་ཀྱི་དངོས་པོར་རྟོགས་བྱེད་ན། །དེ་ནི་མི་བདེན་རྟོག་ཡིན་པས། །ཆོས་སྟོན་པ་ཞེས་མི་<span class='delete'>བྱའོ། </span><span class='add'>བྱའོ། །</span>གལ་ཏེ་\nཆོས་ནི་སྟོན་པའི་ཚེ། །མིག་གི་འཛིན་པར་རྟོགས་བྱེད་ན། །དེ་ནི་མི་བདེན་རྟོག་ཡིན་པས། །ཆོས་སྟོན་པ་ཞེས་མི་<span class='delete'>བྱའོ། </span><span class='add'>བྱའོ། །</span>མིག་ནི་ཤེས་པར་མ་གྱུར་ན། །འདོད་ཆགས་དག་ནི་སྐྱེ་བར་འགྱུར། །གལ་ཏེ་མིག་ནི་ཤེས་གྱུར་\n<span class='delete'>ན། </span><span class='add'>ན། །</span>འདོད་ཆགས་དག་ནི་སྐྱེ་མི་འགྱུར། །རྣ་བ་སྣ་ལྕེ་ལུས་དང་ཡིད། །ཡུལ་དྲུག་དང་ནི་འབྱུང་ཆེན་བཞི། །འཇིག་རྟེན་སྐྱེ་<span class='delete'>བ་</span><span class='add'>བའི་</span>མིང་གི་བར། །ཐམས་ཅད་དེ་བཞིན་སྦྱར་བར་བྱ། །གལ་ཏེ་ཆོས་ནི་སྟོན་པའི་ཚེ། །ཁམས་\nནི་སྣ་ཚོགས་རྟོགས་བྱེད་ན། །དེ་ནི་མི་བདེན་རྟོག་ཡིན་པས། །ཆོས་སྟོན་པ་ཞེས་མི་བྱའོ། །ཡི་དམ་དག་ནི་མི་ཉམས་ཤིང་། ངོ་བོ་ཉིད་སྟོང་རྟོགས་པ་དང་། །ཏིང་འཛིན་སྒོ་རྣམས་ཐོབ་གྱུར་པ། །དེས་ནི་ཆོས་ལེགས་སྟོན་\nཔར་འགྱུར། །ཡི་དམ་དག་ནི་མི་ཉམས་ཤིང་། །མིག་ལ་རྟོག་པ་སྤངས་པ་ནི། །རྣམ་རྟོག་མེད་པར་གྱུར་<span class='delete'>པའི་</span><span class='add'>པའི་</span>ཕྱིར། །དེས་ནི་ཆོས་ལེགས་སྟོན་པར་འགྱུར། །མིག་ཉིད་སྟོང་<span class='delete'>པར་</span><span class='add'>པར་</span>མ་ཤེས་ན། །མིག་གི་རང་བཞིན་དག་ལ་\nརྨོངས། །འདི་ལྟར་ཁོང་དུ་མ་ཆུད་ཕྱིར། །དེས་ནི་ཆོས་རྣམས་བསྟན་<span class='delete'>མ་</span><span class='add'>མི་</span>བྱ། །གལ་ཏེ་མིག་ཉིད་སྟོང་ཤེས་ན། །མིག་གི་རང་བཞིན་ཤེས་པར་འགྱུར། །འདི་ལྟར་རབ་ཏུ་ཤེས་པའི་ཕྱིར། །དེས་ནི་ཆོས་རབ་བསྟན་"
 ]
]