[
 [
  "78.276b",
  "བར་ཤེས་པ། གནས་བརྟན་ཉན་ཐོས་ཆེན་པོ་ཤ་སྟག་ལ་འདི་ལྟ་སྟེ། ཚེ་དང་ལྡན་པ་ཀུན་ཤེས་ཀཽཎྜྻི་ནྱ་དང་། ཚེ་དང་ལྡན་<span class='add'>  པ་  </span>རྟ་ཐུལ་དང་། ཚེ་དང་ལྡན་ལྡན་<span class='add'>  པ་  </span>ཅིང་ཆེན་དང་། ཚེ་དང་ལྡན་<span class='add'>  པ་  </span>རྒྱལ་བཟངས་དང་། \nཚེ་དང་ལྡན་<span class='add'>  པ་  </span>གྲགས་ལྷ་དང་། ཚེ་དང་ལྡན་པ་དྲི་མ་མེད་དང་། ཚེ་དང་ལྡན་<span class='add'>  པ་  </span>ལག་བཟངས་དང་། ཚེ་དང་ལྡན་<span class='add'>  པ་  </span>གང་པོ་དང་། ཚེ་དང་ལྡན་<span class='add'>  པ་  </span>པ་བདག་དང་། ཚེ་དང་ལྡན་<span class='add'>  པ་  </span>ལྟེང་རྒྱས་འོད་སྲུང་དང་། ཚེ་དང་\nལྡན་པ་ཆུ་ཀླུང་འོད་སྲུང་ད། ཚེ་དང་ལྡན་<span class='add'>  པ་  </span>བ་ཡ་འོད་སྲུང་དང་། ཚེ་དང་ལྡན་<span class='add'>  པ་  </span>བཞོན་དུ་འོད་སྲུང་དང་། ཚེ་དང་ལྡན་<span class='add'>  པ་  </span>འོད་སྲུང་ཆེན་པོ་དང་། ཚེ་དང་ལྡན་<span class='add'>  པ་  </span>ཤཱ་རིའི་བུ་དང་། ཚེ་དང་ལྡན་བ་<span class='add'>  མཽད་  </span>གལ་གྱི་བུ་ཆེན་\nཔོ་དང་། ཚེ་དང་ལྡན་<span class='add'>  པ་  </span>གསུས་པོ་ཚེ་དང་། ཚེ་དང་ལྡན་<span class='add'>  པ་  </span>ཀ་བིན་ཆེན་པོ་དང་། ཚེ་དང་ལྡན་པ་སྒུལ་བྱེད་ཆེན་པོ་དང་། ཚེ་དང་ལྡན་<span class='add'>  པ་  </span>མ་འགས་པ་དང་། ཚེ་དང་ལྡན་<span class='add'>  པ་  </span>གྲུབ་པོ་དང་། ཚེ་དང་ལྡན་<span class='add'>  པ་  </span>དགའ་ཡོད་དང་། ཚེ་དང་\nལྡན་<span class='add'>  པ་  </span>ཀིམ་པི་ལ་དང་། ཚེ་དང་ལྡན་<span class='add'>  པ་  </span>རབ་འབྱོར་དང་། ཚེ་དང་ལྡན་<span class='add'>  པ་  </span>ནམ་གྲུ་དང་། ཚེ་དང་ལྡན་པ་སེང་ལྡེང་ནགས་པ་དང་། ཚེ་དང་ལྡན་<span class='add'>  པ་  </span>བཀྐུ་ལ་དང་། ཚེ་དང་ལྡན་<span class='add'>  པ་  </span><span class='add'>  ལེགས་  </span>འོངས་དང་། ཚེ་དང་ལྡན་<span class='add'>  པ་  </span>དོན་ཡོད་\nརྒྱལ་པོ་དང་། ཚེ་དང་ལྡན་པ་ཕ་རོལ་སོན་དང་། ཚེ་དང་ལྡན་པ་ལམ་བསྟན་དང་། ཚེ་དང་ལྡན་པ་ལམ་ཕྲན་བསྟན་དང་། ཚེ་དང་ལྡན་<span class='add'>  པ་  </span>སྒྲ་གཅན་ཟིན་དང་། ཚེ་དང་ལྡན་<span class='add'>  པ་  </span>དགའ་བོ་དང་། དེ་དག་དང་གཞན་ཡང་\nམངོན་པར་ཤེས་པ་མངོན་<span class='add'>  པར་  </span>ཤེས་པ་གནས་བརྟན་ཉན་ཐོས་ཆེན་པོ་ཤ་སྟག་སྟེ། གང་ཟག་གཅིག་མ་གཏོགས་པ་ནི་འདི་ལྟ་སྟེ། སློབ་<span class='add'>  པའི་  </span>ལམ་ལ་གོང་དུ་བྱ་བ་ཡོད་པ་ཚེ་དང་ལྡན་<span class='add'>  པ་  </span>ཀུན་དགའ་བོ་འོ། །\nབྱམས་པ་ལ་སོགས་པ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མང་པོ་དང་ཡང་ཐབས་གཅིག་གོ །དེ་ནས་ཚེ་དང་ལྡན་<span class='add'>  པ་  </span>ཀུན་དགའ་བོ་སྟན་ལས་ལངས་ཏེ། བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་"
 ],
 [
  "78.277a",
  "གནས་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་\nཁྱོད་ཀྱི་དབང་པོ་རྣམས་ནི་ཤིན་ཏུ་དང་། ཞལ་གྱི་མདོག་ནི་ཡོངས་སུ་དག །ལྤགས་པའི་མདོག་ནི་ཡོངས་སུ་བྱང་ཞིང་སེར་པོར་གདའ་སྟེ། འདི་ལྟ་སྟེ་། དཔེར་ན་སྟོན་གྱི་གོས་སེར་སྐྱ་<span class='add'>  ཡོངས་སུ་དག་པ། ཡོངས་  </span>\nསུ་དག་པ། ཡོངས་སུ་སྦྱངས་པ་སེར་པོར་གདའ་བ་དེ་བཞིན་དུ་བཅོམ་ལྡན་འདས་ཀྱི་དབང་པོ་རྣམས་ནི་ཤིན་དུ་དང་། ཞལ་གྱི་མདོག་ནི། ཡོངས་སུ་དག །ལྤགས་པའི་མདོག་ནི་ཡོངས་སུ་བྱང་ཞིང་སེར་བར་གདའ་སྟེ། བཙུན་\n<span class='add'>  པ་  </span>བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ། དཔེར་ན་འཛམ་བུའི་ཆུ་བོའི་གསེར་བརྒྱ་ཚད་པ་མགར་བ་འམ་མགར་བའི་སློབ་མ་མཁས་པས་ཞི་གའི་ནང་དུ་བསྩལ་ཏེ། ཤིན་དུ་སྦྱངས་ནས་ལ་<span class='add'>  བ་སེར་  </span>པོའི་ནང་དུ་\nསྩལ་ན་ཤིན་དུ་ཡོངས་སུ་དག་ཅིང་ཡོངས་སུ་བྱང་ལ་སེར་པོར་གདའ་བར་གྱུར་རོ། །དེ་བཞིན་དུ་བཅོམ་ལྡན་འདས་ཀྱི་དབང་པོ་རྣམས་ནི་ཤིན་དུ་དང་། ཞལ་གྱི་མདོག་ནི་ཡོངས་སུ་དག །ལྤགས་པའི་\nམདོག་ནི་ཡོངས་སུ་བྱང་ཞིང་སེར་བར་གདའོ། །བཅོམ་ལྡན་འདས་བདག་གིས་སྔ་བས་ཀྱང་ཆེས་སྔ་བ་ན་དེ་བཞིན་གཤེགས་པའི་དབང་པོ་རྣམས་འདི་ལྟར་<span class='add'>  དང་  </span>བ་དང་། ཞལ་གྱིས་མདོག་འདི་ལྟར་ཡོངས་སུ་\nདག་པ་དང་། ལྤགས་པའི་མདོག་ཡོངས་སུ་བྱང་ཞིང་སེར་བར་གདའ་བར་མ་འཚལ་ཏོ། བཅོམ་ལྡན་འདས་དེ་ལ་བདག་འདི་སྙམ་བགྱིད་དེ། དེ་བཞིན་གཤེགས་པ་དེ་རིང་འདས་པ་དང་། མ་བྱོན་པ་དང་། \nད་ལྟར་བྱུང་བའི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་ལྡན་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་རྗེས་སུ་དགོངས་ཤིང་། དེ་བཞིན་གཤེགས་པ་དེ་རིང་སངས་རྒྱས་ཀྱི་གནས་པས་བཞུགས་ཏེ།"
 ],
 [
  "78.277b",
  "རྒྱལ་བའི་གནས་པ་དང་། ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་གནས་པ་དང་། གླང་པོ་ཆེའི་གནས་<span class='add'>  པས་  </span>བཞུགས་པ་སྙམ་བགྱིད་དོ། །དེ་སྐད་ཅེས་གསོལ་པ་དང་། །བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་<span class='add'>  པ་  </span>ཀུན་དགའ་བོ་ལ་\nའདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ཀུན་དགའ་བོ་ལེགས་སོ་ལེགས་སོ། །ཅི་དོན་འདི་ཁྱོད་ལ་ལྷ་རྣམས་ཀྱིས་བསྙད་དམ། འོན་ཏེ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས་སམ། འོན་ཏེ་བདག་རང་\nགི་དཔྱོད་པའི་ཤེས་པས་དེ་ལྟར་ཤེས། དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་། བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་འདི་སྐས་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་དོན་འདི་ནི་ལྷ་རྣམས་\nཀྱིས་བདག་ལ་བསྙད་པ་ཡང་མ་མཆིས། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས་ཀྱང་མ་ལགས་ཀྱི། བཅོམ་ལྡན་འདས་བདག་རང་གི་དཔྱོད་པའི་འཚལ་བས་འདི་སྙམ་དུ་དེ་བཞིན་གཤེགས་\nཔ་ནི་དེ་རིང་འདས་པ་དང་། མ་བྱོན་པ་དང་། ད་ལྟར་བྱུང་བའི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་རྗེས་སུ་དགོངས་ཤིང་། དེ་བཞིན་གཤེགས་\nཔ་དེ་རིང་སངས་རྒྱས་ཀྱི་གནས་པས་བཞུགས་ཏེ། རྒྱལ་བའི་གནས་པ་དང་། ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་གནས་པ་དང་། གླང་པོ་ཆེའི་གནས་པས་བཞུགས་པ་སྙམ་བགྱིད་དོ། །དེ་སྐད་ཅེས་\nགསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་<span class='add'>  པ་  </span>ཀུན་དགའ་བོ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ཀུན་དགའ་བོ་ཁྱོད་ཀྱི་རྟོག་པ་རྒྱ་ཆེ་སྟེ། དཔྱོད་པ་བཟང་ཞིང་སྤོབས་<span class='add'>  པ་  </span>དགེ་སྟེ། ཀུན་དགའ་\nབོ་ཁྱོད་སྐྱེ་བོ་མང་པོ་ལ་ཕན་<span class='add'>  པ་  </span>དང་། སྐྱེ་བོ་མང་པོ་ལ་བདེ་བའི་ཕྱིར་ཞུགས་པ་དང་། འཇིག་རྟེན་ལ་སྙིང་བརྩེ་བ་དང་། སྐྱེ་བོའི་ཚོགས་ཕལ་པོ་ཆེ་དང་། ལྷ་དང་རྣམས་ཀྱིས་དོན་དང་ཕན་<span class='add'>  པ་  </span>དང་"
 ],
 [
  "78.278a",
  "བདེ་བའི་ཕྱིར་ཁྱོད་དེ་བཞིན་གཤེགས་པ་ལ་དོན་འདི་འདྲི་བར་སེམས་པ་ལེགས་སོ་ལེགས་སོ། །ཀུན་དགའ་བོ་དེ་དེ་བཞིན་ཏེ། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་\nཔའི་སངས་རྒྱས་དཔག་ཏུ་མེད་གྲངས་མེད་པ་དག་གིས་ཡེ་ཤེས་མཐོང་བ་སྡུད་ཀྱང་དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་མཐོང་བ་ལ་གནོད་པ་མེད་དོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཀུན་དགའ་བོ་དེ་བཞིན་\nགཤེགས་པའི་ཡེ་ཤེས་མཐོང་བ་ཐོགས་པའི་ཕྱིར་ཏེ། ཀུན་དགའ་བོ་དེ་བཞིན་གཤེགས་པ་བཞེད་ན་བསོད་སྙོམས་གཅིག་བསྐལ་པ་འམ། བསྐལ་པ་བརྒྱ་འམ། བསྐལ་པ་སྟོང་ངམ། \nབསྐལ་པ་བརྒྱ་སྟོང་ངམ། དེ་བས་ཀྱང་ལྷག་པར་བཞུགས་ཀྱང་དེ་བཞིན་གཤེགས་པའི་དབང་པོ་རྣམས་ལ་ཉམས་པ་མེད་དོ། །ཞལ་བྱི་མདོག་གཞན་དུ་འགྱུར་བ་མེད་དོ། ལྤགས་པའི་\nམདོག་ལ་གནོད་པ་མེད་དོ། ། དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཀུན་དགའ་བོ་འདི་ལྟར་དེ་བཞིན་གཤེགས་པ་ནི་ཏིང་ངེ་འཛིན་གྱི་བདེ་བའི་ཕ་རོལ་དུ་བྱོན་བའོ། །ཀུན་དགའ་བོ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་\nརྣམས་འཇིག་རྟེན་དུ་འབྱུང་བ་ཤིན་དུ་དཀའ་སྟེ། འདི་ལྟ་སྟེ། དཔེར་ན་ཨུ་དུམ་པ་རའི་མེ་ཏོག་འཇིག་རྟེན་དུ་འབྱུང་བར་དཀའ་བ་དེ་བཞིན་དུ་ཀུན་དགའ་བོ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་\nརྒྱས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་བཞེད་པ། ཕན་པ་བཞེད་པ། ཐུགས་བརྩེ་<span class='add'>  བ་ཅན།   </span>ཐུགས་རྗེ་ཆེན་པོ་ལ་ཞུགས་པ་རྣམས་འཇིག་<span class='add'>  རྟེན་  </span>དུ་འབྱུང་བ་ནི་ཤིན་ཏུ་དཀའ་བོ། ། ཀུན་དགའ་པོ་གང་\nཁྱོད་འཇིག་རྟེན་ཐམས་ཅད་ཀྱི་སློབ་དཔོན་<span class='add'>  ཁོང་  </span>དཔའ་བ་དག་འཇིག་རྟེན་དུ་འབྱུང་བར་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་དོན་གྱི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་ལ་དོན་"
 ],
 [
  "78.278b",
  "འདི་འདྲི་བར་སེམས་པ་དེ་ནི་དེ་བཞིན་གཤེགས་པའི་མཐུ་ཡིན་ནོ། །ཀུན་དཀའ་བོ་དེའི་ཕྱིར་ལེགས་པར་རབ་ཏུ་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག་དང་། ངས་ཁྱོད་ལ་བཤད་དོ། །ཀུན་དཀའ་བོས་བཅོམ་ལྡན་\nའདས་དེ་བཞིན་ནོ་ཞེས་གསོལ་ཏེ། བཅོམ་ལྡན་འདས་ཀྱི་ལྟར་ཉན་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ཀུན་དགའ་བོ་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན་འདི་ནས་བསྐལ་\nཔ་གྲངས་མེད་པའི་ཡང་ཆེས་གྲགས་མེད་པ། ཤིན་དུ་རྒྱས་པ་ཚད་མེད་པ་བསམ་གྱིས་མི་ཁྱབ་པར་གྱུར་པ་དེའི་ཚེ་དེའི་དུས་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་\nསངས་རྒྱས་མར་མེ་མཛད་ཅེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་ངོ་། །ཀུན་དགའ་བོ་དེ་བཞིན་གཤེགས་<span class='add'>  པ་  </span>མར་མེ་མཛད་ཀྱི་སྔ་རོལ་གྱི་ཡང་ཆེས་སྔ་རོལ་དུ་དེ་བཞིན་གཤེགས་པ་འོད་ལྡན་ཞེས་བྱ་བ་བྱུང་ངོ་། །དེའི་སྔ་\nརོལ་གྱི་ཡང་ཆེས་སྔ་རོལ་དུ་དེ་བཞིན་གཤེགས་པ་འོད་མཛད་ཅེས་བྱ་བ་བྱུང་ངོ་། །དེའི་སྔ་རོལ་གྱི་ཡང་ཆེས་སྔ་རོལ་དུ་དེ་བཞིན་གཤེགས་པ་ཙན་དན་གྱི་དྲི་ཞེས་བྱ་བ་བྱུང་ངོ་། །ཀུན་དགའ་བོ་དེ་བཞིན་\nགཤེགས་པ་ཙན་དན་གྱི་དྲི་དེའི་སྔ་རོལ་གྱི་ཡང་ཆེས་སྔ་རོལ་དུ་དེ་བཞིན་གཤེགས་པ་རི་རབ་ལྟ་བུ་ཞེས་བྱ་བ་བྱུང་ངོ་། །དེ་བཞིན་<span class='add'>  དུ་དེ་བཞིན་  </span>གཤེགས་པ་ཟླ་བའི་ཞལ་ཞེས་བྱ་བ་བྱུང་ངོ་། །དེ་བཞིན་གཤེགས་པ་དྲི་མ་མེད་པའི་\nཞལ་ཞེས་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པ་མི་གོས་པ་ཞེས་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པ་འོད་དྲི་མ་མེད་པ་ཞེས་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པ་ཀླུ་ཟིལ་གྱིས་གནོན་ཅེས་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པ་ཉི་མའི་\nཞལ་ཞེས་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པ་རིའི་རྒྱལ་པོའི་དབྱངས་ཤེས་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པ་རི་རབ་བརྩེགས་ཞེས་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པ་གསེར་འོད་ཅེས་བྱ་བ་དང་། དེ་བཞིན་"
 ],
 [
  "78.279a",
  "གཤེགས་པ་སྐར་མའི་འོད་ཅེས་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པ་བཻ་དཱུརྻར་སྣང་བ་ཞེས་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པ་ཚངས་པའི་དབྱངས་ཤེས་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པ་ཟླ་\nབ་ཟིལ་གྱི་གནོན་ཅེས་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པ་ཉི་མའི་དབྱངས་ཤེས་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པ་མེ་ཏོག་སིལ་མའི་འོད་ཀྱིས་བརྒྱན་ཅེས་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པ་དཔལ་བརྩེགས་\nཞེས་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་བ་རྒྱ་མཚོ་མཆོག་གི་བློས་རྣམ་པར་རོལ་པའི་མངོན་པར་མཁྱེན་པ་ཞེས་བྱ་བ་དང་།      །      །།       །དེ་བཞིན་གཤེགས་པ་འོད་མཆོག་\nཅེས་བྱ་བ་དང་། དེ་བཞིན་<span class='add'>  གཤེགས་  </span>པ་སྤོས་ཀྱི་རྒྱལ་པོ་ཆེན་པོར་སྣང་བ་ཞེས་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པ་ཐབ་དང་དྲི་མ་དང་ཁོང་ཁྲོ་བ་དང་བྲལ་བཞེས་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པ་དཔལ་བརྩེགས་\nཞེས་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེ་གཏོང་<span class='add'>  བ་  </span>ཞེས་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པ་ཡོན་ཏན་ཆེན་པོ་མངའ་བའི་བློ་བརྙེས་པའི་མངོན་<span class='add'>  པར་  </span>མཁྱེན་པ་ཞེས་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པ་\nའོད་ཀྱིས་ཉི་ཟླ་ཟིལ་དུ་རླག་པར་མཛད་ཅེས་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པ་བཻ་དཱུརྻ་སྦྱངས་བར་སྣང་བ་ཞེས་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པ་སེམས་ཀྱི་རྒྱུད་ཀྱི་བློ་ཤིན་དུ་རྒྱས་པ་མངོན་བར་འཕགས་པ་\nཞེས་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པ་མེ་ཏོག་གི་ཕྲེང་བའི་ནགས་ཀྱི་རྒྱལ་པོ་མེ་ཏོག་ཀུན་དུ་རྒྱས་<span class='add'>  པ་  </span>མངོན་<span class='add'>  པར་  </span>མཁྱེན་པ་ཞེས་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པ་མེ་ཏོག་གི་འབྱུང་གནས་ཞེས་བྱ་བ་དང་། \nདེ་བཞིན་གཤེགས་ཆུ་ཟླ་ལྟ་བུ་ཞེས་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་མ་རིག་པའི་མུན་པ་རྣམ་པར་འཇོམས་<span class='add'>  པ་  </span>ཞེས་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པ་འཇིག་རྟེན་དབང་པོ་ཞེས་བྱ་བ་དང་"
 ],
 [
  "78.279b",
  "དེ་བཞིན་གཤེགས་པ་མུ་ཏིག་གི་བྱི་རུ་འདྲ་བའི་གདུགས་ཞེས་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པ་བཞེད་པ་ཞེས་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་བློ་གྲོས་ཀྱིས་བསྒྲགས་པའི་རྒྱལ་པོ་ཞེས་བྱ་བ་དང་། \nདེ་བཞིན་གཤེགས་པ་སེང་གེ་དང་རྒྱ་མཚོ་དང་བརྩེགས་པ་ལྟར་བསྒྲགས་པའི་རྒྱལ་པོ་ཞེས་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པ་རྒྱ་མཚོ་རི་རབ་ཟླ་བ་ཞེས་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པ་ཚངས་པའི་དབྱངས་\nཀྱི་ང་རོལ་མངོན་པར་དགྱེས་པ་ཞེས་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པ་མེ་ཏོག་འབྱུང་ཞེས་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པ་སྡེ་བརྙེས་ཞེས་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པ་ཉི་ཟླ་ཞེས་བྱ་བ་དང་། དེ་བཞིན་\nགཤེགས་པ་ལྷུན་པོ་བརྩེགས་ཞེས་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པ་ཟླ་འོད་ཅེས་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པ་དྲི་མ་<span class='add'>    </span>པའི་སྤྱན་ཞེས་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པ་རི་བོའི་རྒྱལ་པོའི་སྒྲ་དབྱངས་ཞེས་\nབྱ་བ་དང་། དེ་བཞིན་གཤེགས་པ་མེ་ཏོག་འོད་ཅེས་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པ་མེ་ཏོག་གི་ཆར་རབ་ཏུ་འཐོར་བ་ཞེས་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་གདུགས་ཞེས་བྱ་བ་དང་། དེ་བཞིན་\nགཤེགས་པ་པད་མས་སྲང་མཛེས་པར་མཛད་ཅེས་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པ་ཙན་དན་གྱི་དྲི་ཞེས་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པ་རྒྱ་སྤོས་ཀྱི་དྲི་ཞེས་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེར་སྣང་\nབ་ཞེས་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པ་མུ་ཁྱུད་ཅེས་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པ་བཀོད་པ་ཆེན་པོ་ཞེས་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པ་ཐ་བ་དང་ཞེ་སྡང་དང་བྲལ་བ་ཞེས་བྱ་བ་དང་། དེ་བཞིན་\nགཤེགས་པ་ཚངས་པའི་དབྱངས་ཞེས་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེ་སྣ་བདུན་ཀྱི་ཆར་འབེབས་པ་ཞེས་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པ་ཡོན་ཏན་ཆེན་པོ་མངའ་བ་ཞེས་བྱ་བ་དང་། དེ་"
 ],
 [
  "78.281a",
  "སེམས་ཅན་ཀུན་སྐྱོབ་སངས་རྒྱས་འགྱུར་བར་བགྱི། བྱང་ཆུབ་བཞི་མཆོག་མཚུངས་མེད་ཚོལ་བགྱིད་ཅིང་། སངས་རྒྱས་བྱ་བ་བརྒྱ་སྟོང་དུ་མ་ཕྲག །གང་གཱའི་བྱེ་མ་ལྟ་བུར་མཐའ་\nཡས་པ། མགོན་པོ་དེ་ཀུན་བདག་གིས་མཆོད་<span class='add'>  པར་  </span>བགྱི། གང་གཱའི་རྡུལ་དང་མཉམ་པའི་འཇིག་རྟེན་ཁམས། དེ་བས་ཁོང་དུ་མཐའ་ཡས་ཞིང་གི་རྣམས། དེ་དག་ཀུན་དུ་འོད་ནི་རབ་འབྱིན་པ། འདི་འདྲའི་\nབརྩོན་འགྲུས་སྟོབས་ནི་བརྩམ་པར་བགྱི། བདག་གིས་ཞིང་ཡངས་གཙོ་བོ་དམ་པ་མཆོག །འདུས་བྱས་འདིར་ནི་བརྒྱན་<span class='add'>  པ་  </span>བགྱིས་ནས་སུ། མཚུངས་པ་མ་མཆིས་མྱ་ངན་འདས་དབྱིངས་བདེ། དེ་ཡང་མ་\nམཆིས་པས་ནི་རྣམ་པར་སྦྱང་། ཕྱོགས་བཅུ་དག་ནས་ལྷགས་པའི་སེམས་ཅན་རྣམས་། དེར་ལྷགས་མྱུར་དུ་བདེ་ལ་དགའ་བར་འགྱུར། སངས་རྒྱས་ཚད་མེད་འདི་ན་བདག་གི་དབང་། མ་ལོག་བརྩོན་འགྲུས་\nསྟོབས་ནི་བསྐྱེད་པར་འཚལ། ཕྱོགས་བཅུའི་འཇིག་རྟེན་མི་ཆགས་མཁྱེན་པ་ཅན། མཁས་པ་དེ་དག་རྟག་ཏུ་བདག་སེམས་མཁྱེན། བདག་ནི་མཚམས་མེད་མཆིས་ཏེ་རྟག་གནས་བགྱི། སྨོན་ལམ་\nསྟོབས་ལས་ལྡོག་བར་ཡོད་མི་བགྱི། ཀུན་དགའ་བོ་དེ་ནས་དགེ་སློང་ཆོས་ཀྱི་འབྱུང་གནས་དེས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་འཇིག་རྟེན་དབང་ཕྱུག་རྒྱལ་པོ་ལ་ཚིགས་སུ་བཅད་པ་འདི་དག་གིས་མངོན་\nསུམ་དུ་མངོན་བར་བསྟོད་ནས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བདག་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་<span class='add'>  པར་  </span>རྫོགས་པར་འཚང་རྒྱ་བར་འཚལ་ཏེ། ཡང་དང་ཡང་བླ་ན་མེད་པ་\nཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ཅིང་ཡོངས་སུ་བསྔོ་བ་བགྱིད་ན། ཅི་ནས་ཀྱང་བདག་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་<span class='add'>  པར་  </span>རྫོགས་པར་འཚང་རྒྱ་བ་དང་།"
 ],
 [
  "78.282a",
  "པར་ཡང་དག་པར་རབ་ཏུ་བཤད་དོ། །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་<span class='add'>  པ་  </span>ཀུན་དགའ་བོས་འདི་སྐད་ཅེས་གསོལ་ཏོ། བཅོམ་ལྡན་འདས་བཅོམ་ལྡན་འདས་འཇིག་རྟེན་དབང་ཕྱུག་\nརྒྱལ་པོ་དེའི་སྐུ་ཚེའི་ཚད་ཇི་ཙམ་ཞིག་ཐུབ་པར་གྱུར། དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་<span class='add'>  པ་  </span>ཀུན་དགའ་བོ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །དེ་བཞིན་གཤེགས་\nཔ་འཇིག་རྟེན་དབང་ཕྱུག་རྒྱལ་པོ་དེའི་ཚེའི་ཚད་ནི་བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་བཞི་བཅུ་ཐམ་པ་ཐུབ་པར་གྱུར་ཏོ། །ཀུན་དགའ་བོ་དེ་ནས་དགེ་སློང་ཆོས་ཀྱི་འབྱུང་གནས་དེས་སངས་\nརྒྱས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་བརྒྱད་བཅུ་རྩ་གཅིག་པོ་དེ་དག་གི་སངས་རྒྱས་ཀྱི་ཞིང་ཡོན་ཏན་གྱི་རྒྱན་བཀོད་པ་ཕུན་སུམ་ཚོགས་པ་གང་ཡིན་<span class='add'>  པ་  </span>དེ་དག་ཐམས་ཅད་སངས་རྒྱས་ཀྱི་ཞིང་\nགཅིག་ཏུ་ཡོངས་སུ་བཟུང་ནས། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་འཇིག་རྟེན་དབང་ཕྱུག་རྒྱལ་པོ་དེའི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། བསྐོར་བ་བྱས་ནས་བཅོམ་ལྡན་འདས་དེའི་\nགན་ནས་སོང་ངོ་། །གང་དུ་ཡང་བསྐལ་པ་ལྔར་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་གྱི་རྒྱན་བཀོད་པ་ཕུན་སུམ་ཚོགས་པ། ཤིན་ཏུ་ཐ་གྲུ་ཆེ་བ། ཤིན་དུ་གྱ་ནོམ་པ། སྔོན་ཕྱོགས་བཅུའི་འཇིག་རྟེན་\nགྱི་ཁམས་ཐམས་ཅད་དུ་མ་བྱུང་བ་དག་ཀྱང་ཡོངས་སུ་བཟུང་བར་གྱུ་ར་ཏོ། །སྨོན་ལམ་ཤིན་དུ་རྒྱ་ཆེན་པོ་ཡང་བཏབ་བོ། །ཀུན་དགའ་བོ་དེ་ལྟར་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་འཇིག་རྟེན་\nདབང་ཕྱུག་རྒྱལ་པོ་དེས་སངས་རྒྱས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་བརྒྱད་བཅུ་རྩ་གཅིག་པོ་དེ་དག་གི་ཞིང་ཕུན་སུམ་ཚོགས་པ་གང་བརྗོད་པ་དེ་བས་ཀྱང་སངས་རྒྱས་ཀྱི་ཞིང་ཕུན་སུམ་ཚོགས་པ་ཆེས་"
 ],
 [
  "78.282b",
  "ལྷག་པར་ཐ་གྲུ་ཆེ་བ། ཆེས་གྱ་ནོམ་པ། ཆེས་དཔག་ཏུ་མེད་པ་ཡོངས་སུ་བཟུང་སྟེ། བཅོམ་ལྡན་འདས་འཇིག་རྟེན་དབང་ཕྱུག་རྒྱལ་པོ་ག་ལ་བ་དེར་སོང་སྟེ། ཕྱིན་ནས་བཅོམ་ལྡན་འདས་དེའི་ཞབས་\nལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བདག་གིས་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་གྱི་རྒྱན་བཀོད་པ་ཕུན་སུམ་ཚོགས་པ་ཡོངས་སུ་གཟུང་ལགས་སོ། །\nཀུན་དགའ་བོ་དེ་སྐད་ཅེས་གསོལ་པ་དང་། དེ་བཞིན་གཤེགས་པ་འཇིག་རྟེན་དབང་ཕྱུག་རྒྱལ་པོ་དེས་དགེ་སློང་ཆོས་ཀྱི་འབྱུང་གནས་དེ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །དེའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་ཡང་\nརྗེས་སུ་ཡིད་རང་བ་མཛད་ཀྱིས་དགེ་སློང་གིས་སྨོས་ཤིག །འདི་ནི་དུས་ཡིན་གྱིས་འཁོར་དགའ་བར་བགྱིས་ཤིག །མགུ་<span class='add'>  བ་སྐྱེད་  </span>ཅིག །སེང་གེའི་<span class='add'>  སྒྲ་  </span>སྒྲོགས་ཤིག །དེ་ཐོས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་\nཆེན་པོ་དག་ད་ལྟར་དང་། མ་འོངས་པའི་དུས་ན་སངས་རྒྱས་ཀྱི་ཞིང་ཕུན་སུམ་ཚོགས་པ་སྨོན་ལམ་གྱི་གནས་འདི་ལྟ་བུ་ཡོངས་སུ་འཛིན་པར་འགྱུར། ཡོངས་སུ་རྫོགས་པར་བྱེད་པར་འགྱུར་\nརོ། །ཀུན་དགའ་བོ་དེ་ནས་དགེ་སློང་ཆོས་ཀྱི་འབྱུང་གནས་དེས་དེའི་ཚེ་བཅོམ་ལྡན་འདས་དེ་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །དེའི་སླད་དུ་ཇི་ལྟར་བདག་བླ་ན་མེད་པ་ཡང་དག་\nཔར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་བར་རྫོགས་པར་སངས་རྒྱས་པའི་ཚེ་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ཡོན་ཏན་གྱི་རྒྱན་བཀོད་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་ལྡན་བར་འགྱུར་བའི་བདག་གི་སྨོན་ལམ་གྱི་ཁྱད་པར་བདག་ལ་གསན་\nདུ་གསོལ། བཅོམ་ལྡན་འདས་གལ་ཏེ་བདག་གི་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན་སེམས་ཅན་དམྱལ་བ་དང་། དུད་འགྲོའི་སྐྱ་གནས་དང་། ཡི་དགས་ཀྱི་ཡུལ་དང་། ལྷ་མ་ཡིན་གྱི་རིས་མཆིས་པར་གྱུར་པ་དེ་སྲིད་དུ"
 ],
 [
  "78.280b",
  "སངས་རྒྱས་འཇིག་རྟེན་དབང་ཕྱུག་རྒྱལ་པོ་དེའི་བསྟན་པ་ལ་དགེ་སློང་ཆོས་ཀྱི་འབྱུང་གནས་ཤེས་བྱ་བ་ཤས་ཆེར་དྲན་པ་དང་ལྡན་པ། བློ་གྲོས་དང་ལྡན་པ། རྟོགས་པ་དང་ལྡན་པ། ཤེས་རབ་དང་\nལྡན་བ། བརྩུན་འགྲུས་དང་ལྡན་བ། རྒྱ་ཆེན་པོ་ལ་མོས་པ་ཞིག་བྱུང་ངོ་། ཀུན་དགའ་བོ་དེ་ནས་དགེ་སློང་ཆོས་ཀྱི་འབྱུང་གནས་དེ་སྟན་ལས་ལངས་ཏེ་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས། པུས་\nམོ་གཡས་པའི་ལྷ་ང་ས་ལ་གཙུགས་ཏེ། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་འཇིག་རྟེན་དབང་ཕྱུག་རྒྱལ་པོ་ག་ལ་བ་དེ་ལོགས་སུ་ཐམ་མོ་སྦྱར་བ་བཏུད་ནས་བཅོམ་ལྡན་འདས་ལ་ཕྱག་འཚལ་\nཏེ། དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་གིས་མངོན་སུམ་དུ་བསྟོད་དོ། །འོད་ནི་དཔག་མེད་བློ་ནི་མཐའ་ཡས་མཚུངས། གཞན་གྱི་འོད་ནི་གང་ཡང་མི་གསལ་ཏེ། ཉི་ཟླ་ནོར་བུ་ཚོགས་ཀྱི་འོད་རྣམས་<span class='add'>  ནི། །  </span>\nའཇིག་རྟེན་ཀུན་ན་ལྷམ་མེ་ལྷན་མ་ལགས། སེམས་ཅན་སྙིང་པོའི་གཟུགས་ནི་མཐའ་ཡས་ཏེ། དེ་བཞིན་སངས་རྒྱས་གསུངས་ནི་མཐའ་ཡས་དབྱངས། ཚུལ་ཁྲིམས་ཏིང་འཛིན་ཤེས་རབ་བརྩོན་\nའགྲུས་ཀྱང་། ཁྱོད་འདྲ་འཇིག་རྟེན་འདི་ན་གཞན་མ་མཆིས། ཟབ་ཅིང་ཤིན་དུ་རྒྱས་པའི་ཆོས་བརྙེས་པ། སངས་རྒྱས་མཆོག་གི་ཐུགས་ནི་རྒྱ་མཚོ་བཞིན། དེས་ཀྱང་སྟོན་ལ་ཁེངས་པ་མི་མངའ་སྟེ། \nཐ་བ་ཞེ་སྡང་སྤངས་ནས་ཕ་མཐར་སྒྲོལ། ཇི་ལྟར་སངས་རྒྱས་མཆོག་གི་གཟི་མཐའ་ཡས། མི་དབང་གཟི་བརྗིད་ཕྱོགས་ཀུན་ལྷམ་མེར་གདའ། དེ་ལྟར་བདག་ཀྱང་སངས་རྒྱས་<span class='add'>  ཆོས་  </span>རྒྱལ་གྱུར།\nསྐྱེས་དགུ་རྒ་དང་འཆི་ལས་རབ་ཐར་གྱི། སྦྱིན་དང་དུལ་དང་ཚུལ་ཁྲིམས་བཟོད་བརྩོན་འགྲུས། བསམ་གཏན་ཏིང་འཛིན་དེ་བཞིན་ཤེས་རབ་མཆོག །བརཏལ་ཞུགས་འདི་དག་བདག་གིས་ཡང་དག་བླངས།"
 ],
 [
  "78.283a",
  "བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་<span class='add'>  པར་  </span>འཚང་རྒྱ་བར་མི་བགྱིའོ། །བཅོམ་ལྡན་འདས་གལ་ཏེ་བདག་གི་སངས་རྒྱས་ཀྱི་ཞིང་དེར་སེམས་ཅན་གང་དག་སྐྱེས་པར་གྱུར་\nབ་དེ་དག་དེ་ནས་ཤི་འཕོས་ནས་སེམས་ཅན་དམྱལ་བའམ། དུད་འགྲོའི་སྐྱེ་གནས་སམ། ཡི་དགས་ཀྱི་ཡུལ་ལམ། ལྷ་མ་ཡིན་གྱི་རིས་སུ་མི་ལྟུང་བར་གྱུར་པ་དེ་སྲིད་དུ་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་\nཔའི་བྱང་ཆུབ་མངོན་<span class='add'>  པར་  </span>རྫོགས་པར་འཚང་རྒྱ་བར་མི་བགྱིའོ། །བཅོམ་ལྡན་འདས་གལ་ཏེ་བདག་གི་སངས་རྒྱས་ཀྱི་ཞིང་དེར་སེམས་ཅན་གང་དག་སྐྱེས་པ་དེ་དག་ཐམས་ཅད་འདི་ལྟ་སྟེ། གསེར་གྱི་ཁ་དོག་\nཏུ་ཁ་དོག་གཅིག་པར་མ་གྱུར་པ་དེ་སྲིད་དུ་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་<span class='add'>  པར་  </span>རྫོགས་པར་འཚང་རྒྱ་བར་མི་བགྱིའོ། །བཅོམ་ལྡན་འདས་གལ་ཏེ་བདག་གི་སངས་རྒྱས་ཀྱི་\nཞིང་དེ་ན་ལྷ་དང་མི་ཐ་དད་པ་དག་གདའ་བར་གྱུར་པ་གཞན་དུ་ན་ཀུན་རྫོབ་ཀྱི་ཐ་སྙད་ཙམ་དུ་མིང་དང་བརྡས་ལྷ་དང་མི་ཞེས་བགྱི་བའི་གྲངས་སུ་མཆི་བར་མ་གྱུར་པ་དེ་སྲིད་དུ་བདག་བླ་ན་མེད་པ་ཡང་དག་\nཔར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་འཚང་རྒྱ་བར་མི་བགྱིའོ། །བཅོམ་ལྡན་འདས་གལ་ཏེ་བདག་གི་སངས་རྒྱས་ཀྱི་ཞིང་དེར་སེམས་ཅན་གང་དག་སྐྱེས་པར་གྱུར་པ་དེ་དག་ཐམས་\nཅད་གལ་ཏེ་ཐ་ན་སེམས་ཀྱི་སྐད་ཅིག་ཐང་ཅིག་ལ་སངས་རྒྱས་ཀྱི་ཞིང་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་འདའ་བའི་རྫུ་འཕྲུལ་ལ་དབང་བའི་དམ་པའི་ཕ་རོལ་དུ་སོན་པར་མ་གྱུར་པ་དེ་སྲིད་བདག་བླ་ན་མེད་པ་\nཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་མི་བགྱིའོ། །བཅོམ་ལྡན་འདས་གལ་ཏེ་བདག་གི་སངས་རྒྱས་ཀྱི་ཞིང་དེར་སེམས་ཅན་གང་དག་སྐྱེས་པར་གྱུར་པ་དེ་དག་"
 ],
 [
  "78.281b",
  "འཇིག་རྟེན་དུ་དེ་བཞིན་གཤེགས་པ་མི་མཉམ་པ་དང་མཉམ་<span class='add'>  པར་  </span>འགྱུར་བ་དེ་ལྟ་བུའི་ཆོས་བཅོམ་ལྡན་འདས་ཀྱིས་བདག་ལ་ལེགས་པར་བསྟན་དུ་གསོལ། རྣམ་<span class='add'>  པ་  </span>གང་དག་གིས་སངས་རྒྱས་ཀྱི་ཞིང་\nགི་ཡོན་ཏན་གྱི་རྒྱན་བཀོད་པ་ཕུན་སུམ་ཚོགས་པ་ཡོངས་སུ་འཛིན་པར་འགྱུར་བའི་རྣམ་པ་དེ་ཡང་བཅོམ་ལྡན་འདས་ཀྱིས་བདག་ལ་ཡོངས་སུ་བཤད་དུ་གསོལ། ཀུན་དགའ་བོ་དེ་སྐད་ཅེས་གསོལ་\nཔ་དང་། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་འཇིག་རྟེན་དབང་ཕྱུག་རྒྱལ་པོ་དེས་དགེ་སློང་ཆོས་ཀྱི་འབྱུང་གནས་དེ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །དེའི་ཕྱིར་དགེ་སློང་ཁྱོད་བདག་ཉིད་ཀྱིས་\nསངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་གྱི་རྒྱན་བཀོད་པ་ཕུན་སུམ་ཚོགས་པ་ཡོངས་སུ་ཟུང་ཤིག །དེས་གསོལ་པ། བཅོམ་ལྡན་འདས་བདག་སྤྲོ་བ་མ་མཆིས་སོ། །དེ་བཞིན་གཤེགས་པ་གཞན་དག་\nགི་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་བཀོད་པའི་རྒྱན་ཕུན་སུམ་ཚོགས་པ་གང་ཐོས་ནས་བདག་གི་རྒྱན་བཀོད་པ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་འགྱུར་བ་བཅོམ་ལྡན་འདས་ཀྱིས་བཤད་དུ་\nགསོལ། ཀུན་དགའ་བོ་དེ་ནས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འཇིག་རྟེན་དབང་ཕྱུག་རྒྱལ་པོ་དེས་དགེ་སློང་དེའི་བསམ་པ་མཁྱེན་ནས་དོན་བཞེད་པ། ཕན་<span class='add'>  པ་  </span>\nབཞེད་པ། ཐུགས་བརྩེ་བ་ཅན་གྱིས་ཐུགས་བརྩེ་བ་ཉེ་བར་བཟུང་སྟེ་སངས་རྒྱས་ཀྱི་ཚུལ་མི་གཅད་པའི་ཕྱིར་སེམས་ཅན་རྣམས་ལ་ཐུགས་རྗེ་ཆེན་པོ་བསྐྱེད་ནས། ལོ་བྱེ་བ་ཐམ་པར་སངས་རྒྱས་བྱེ་\nབ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་བརྒྱད་ཅུ་རྩ་གཅིག་གི་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་གྱི་རྒྱན་བཀོད་པ་ཕུན་སུམ་ཚོགས་པ་རྣམ་པ་དང་བཅས། ཡུལ་ཕྱོགས་དང་བཅས། གཞི་ཅི་ལས་གྱུར་བ་དང་བཅས་"
 ],
 [
  "78.285a",
  "ཞིང་གྲངས་མ་མཆིས་དཔག་ཏུ་མ་མཆིས་པ་དག་ན་སེམས་ཅན་གང་དག་གིས་བདག་གི་མིང་ཐོས་ན་སངས་རྒྱས་ཀྱི་ཞིང་དེར་སྐྱེ་བར་བགྱི་བའི་སླད་དུ་སེམས་གཏོང་ཞིང་། དགེ་བའི་\nརྩ་བ་རྣམས་ཀྱང་ཡོངས་སུ་བསྔོ་བ་རང་གྱི་དན་མཚམས་མ་མཆིས་པར་བགྱིད་པ་དང་། དམ་པའི་ཆོས་སྤོང་བའི་སྒྲིབ་བས་བསྒྲགས་པའི་སེམས་ཅན་རྣམས་མ་གཏོགས་པར་དེ་དག་ཐ་ན་སེམས་\nབསྐྱེད་པའི་འགྱུར་བ་བཅུས་སངས་རྒྱས་ཀྱི་ཞིང་དེར་སྐྱེ་བར་མ་གྱུར་པ་དེ་སྲིད་དུ་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་མི་བགྱིའོ། །\nབཅོམ་ལྡན་འདས་གལ་ཏེ་བདག་ཀྱང་བྱང་ཆུབ་ཐོབ་པའི་ཚེ་སངས་རྒྱས་ཀྱི་ཞིང་དེར་སེམས་ཅན་གང་དག་སྐྱེས་པར་གྱུར་པ་དེ་དག་ཐམས་ཅད་སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་བཅུ་རྩ་གཉིས་དང་ལྡན་\nབར་མ་གྱུར་པ་དེ་སྲིད་དུ་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་མི་བགྱིའོ། །བཅོམ་ལྡན་འདས་གལ་ཏེ་བདག་བྱང་ཆུབ་ཐོབ་པའི་ཚེ་སངས་རྒྱས་\nཀྱི་ཞིང་དེས་སེམས་ཅན་གང་དག་སྐྱེས་པར་གྱུར་པ་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ག་ཆ་ཆེན་པོ་བགོས་པ་འཇིག་རྟེན་ཐམས་ཅད་ཀྱི་དོན་དུ་གོ་ཆ་བགོས་པ། འཇིག་རྟེན་ཐམས་ཅད་ཀྱི་དོན་ལ་བརྩོན་པ། འཇིག་\nརྟེན་ཐམས་ཅད་ཡོངས་སུ་མྱ་ངན་ལས་བཟླ་བ་ལ་མངོན་<span class='add'>  པར་  </span>བརྩོན་<span class='add'>  པ་  </span>འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་དུ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པར་འཚལ་བ། སངས་རྒྱས་ཐམས་ཅད་ལ་ཕུ་དུད་བགྱི་བར་འཚལ་བ། \nསེམས་ཅན་གང་དག་གང་གཱའི་ཀླུང་གི་བྱེ་མ་རྙེད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་<span class='add'>  དགོད་  </span>པར་འཚལ་བ་ཡང་གོང་མའི་སྤྱོད་པ་ལ་མངོན་དུ་ཕྱོགས་པ། ཀུན་དུ་བཟང་པོའི་སྤྱོད་པས་ངེས་"
 ],
 [
  "78.286a",
  "བསྒྲུན་པ་རྣམ་པ་དེ་ལྟ་བུ་དེ་དག་སེམས་བསྐྱེད་མ་ཐག་ཏུ་གལ་ཏེ་དེ་དག་ལ་བྱུང་བར་མ་གྱུར་པ་དེ་སྲིད་དུ་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་<span class='add'>  པར་  </span>རྫོགས་\nཔར་འཚང་རྒྱ་བར་མི་བགྱིའོ། །བཅོམ་ལྡན་འདས་གལ་ཏེ་བདག་བྱང་ཆུབ་ཐོབ་པའི་ཚེ་སངས་རྒྱས་ཀྱི་ཞིང་དེར་སེམས་ཅན་གང་དག་སྐྱེས་པར་གྱུར་པ་དེ་དག་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་\nལྡན་པའི་ཆོས་ཀྱི་བཀའ་མཆིད་མཆི་བར་མ་གྱུར་པ་དེ་སྲིད་དུ་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་<span class='add'>  པར་  </span>རྫོགས་པར་འཚང་རྒྱ་བར་མི་བགྱིའོ། །བཅོམ་ལྡན་འདས་གལ་\nཏེ་བདག་བྱང་ཆུབ་ཐོབ་པའི་ཚེ་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན་བྱང་ཆུབ་སེམས་དཔའ་དག་འདི་སྙམ་དུ་བདག་ཅག་འཇིག་རྟེན་གྱི་ཁམས་འདི་ན་གནས་བཞིན་དུ་སངས་རྒྱས་ཀྱི་ཞིང་གྲངས་མེད་དཔག་ཏུ་མེད་པ་དག་ཏུ་\nསངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ལ་འདི་ལྟ་སྟེ། ན་བཟའ་དང་། ཞལ་ཟས་དང་། གཟིམས་ཆད་དང་། སྙུན་གྱི་གསོས་སྨན་དང་། ཡོ་བྱད་རྣམས་དང་། མེ་ཏོག་དང་། བདུག་པ་དང་། སྤོས་དང་། ཕྲེང་བ་དང་། བྱུག་\nཔ་དང་། ཕྱེ་མ་དང་། ན་བཟའ་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་རྣམས་དང་། གླུ་དང་། གར་དང་། སིལ་སྙན་དང་། རིན་པོ་ཆེ་རྣམ་པ་ཐ་དད་པའི་ཆར་རྣམས་ཀྱིས་སྟི་སྟང་དུ་བགྱི་བ་དང་། བླ་མར་བགྱི་\nབ་དང་། རིམ་གྲོར་བགྱི་བ་དང་། མཆོད་པར་བགྱི་བར་སེམས་བསྐྱེད་ལ་། དེ་དག་གིས་སེམས་བསྐྱེད་མ་ཐག་ཏུ་གལ་ཏེ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གིས་ཐུགས་བརྩེ་བ་ཉེ་བར་བཟུང་སྟེ། མཆོད་\nཔ་དེ་དག་བཞེས་པར་མ་གྱུར་པ་དེ་སྲིད་དུ་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་<span class='add'>  པར་  </span>རྫོགས་པར་འཚང་རྒྱ་བར་མི་བགྱིའོ། །བཅོམ་ལྡན་འདས་གལ་ཏེ་བདག་བྱང་ཆུབ་ཐོབ་པའི་"
 ],
 [
  "78.286b",
  "ཚེ་སངས་རྒྱས་ཀྱི་ཞིང་དེར་སེམས་ཅན་གང་དག་སྐྱེས་པར་གྱུར་པ་དེ་དག་ཐམས་ཅད་སྲེད་མེད་ཀྱི་བུ་དང་། རྡོ་རྗེ་ལྟར་འཁྲེགས་པའི་ལུས་དང་། མཐུ་ཐོབ་པར་མ་གྱུར་པ་དེ་སྲིད་དུ་བདག་བླ་ན་མེད་པ་ཡང་དག་\nཔར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་<span class='add'>  པར་  </span>རྫོགས་པར་འཚང་རྒྱ་བར་མི་བགྱིའོ། །བཅོམ་ལྡན་འདས་གལ་ཏེ་བདག་བྱང་ཆུབ་ཐོབ་པའི་ཚེ་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན་རྒྱན་གྱི་ཁ་དོག་སེམས་ཅན་འགའ་ཞིག་\nགིས་ལྷའི་མིག་གིས་མཐའ་བལྟ་ན་ཡང་སངས་རྒྱས་ཀྱི་ཞིང་འདིའི་གཟི་བརྗིད་ནི་འདི་ལྟ་བུའོ། །ཁ་དོག་ནི་འདི་ལྟ་བུའོ། །འབྱོར་པ་ནི་འདི་ལྟ་བུའོ། །ཞེས་ཁ་དོག་ཐ་དད་པ་དག་འཚལ་པར་མ་གྱུར་པ་དེ་སྲིད་དུ་བདག་བླ་\nན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་<span class='add'>  པར་  </span>རྫོགས་པར་འཚང་རྒྱ་བར་མི་བགྱིའོ། །བཅོམ་ལྡན་འདས་གལ་ཏེ་བདག་བྱང་ཆུབ་ཐོབ་པའི་ཚེ་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན་ཐམས་ཅད་ཀྱི་ནང་ན་བྱང་ཆུབ་\nསེམས་དཔའ་གང་དགེ་བའི་རྩ་བ་ཆུང་བ་དེས་ཀྱང་བྱང་ཆུབ་གྱི་ཤིང་དཔག་ཚད་སྟོང་དྲུག་བརྒྱ་ཙམ་དུ་མཐོ་བར་འཚལ་བར་མ་གྱུར་པ་དེ་སྲིད་དུ་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་\nམངོན་<span class='add'>  པར་  </span>རྫོགས་པར་འཚང་རྒྱ་བར་མི་བགྱིའོ། །བཅོམ་ལྡན་འདས་གལ་ཏེ་བདག་བྱང་ཆུབ་ཐོབ་པའི་ཚེ་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན་བྱང་ཆུབ་སེམས་དཔའ་གང་ལུང་ནོད་པ་དང་། ཁ་དོན་བགྱིད་པར་\nམ་གྱུར་པ་དེ་དག་ཐམས་ཅད་ཡང་དག་པར་རིག་པ་ཐོབ་པར་འགྱུར་པ་དེ་སྲིད་དུ་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་<span class='add'>  པར་  </span>རྫོགས་པར་འཚང་རྒྱ་བར་མི་བགྱིའོ། །བཅོམ་\nལྡན་འདས་གལ་ཏེ་བདག་བྱང་ཆུབ་ཐོབ་པའི་ཚེ་སངས་རྒྱས་ཀྱི་ཞིང་དེར་སེམས་ཅན་གང་དག་སྐྱེས་པར་གྱུར་པ་དེ་དག་ཐམས་ཅད་ཤེས་རབ་དང་། སྤོབས་པ་མཐའ་ཡས་པ་ཐོབ་པར་མ་གྱུར་པ་དེ་"
 ],
 [
  "78.287a",
  "སྲིད་དུ་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་<span class='add'>  པར་  </span>རྫོགས་པར་འཚང་རྒྱ་བར་མི་བགྱིའོ། །བཅོམ་ལྡན་འདས་གལ་ཏེ་བདག་བྱང་ཆུབ་ཐོབ་པའི་ཚེ། སངས་རྒྱས་ཀྱི་ཞིང་དེར་\nགང་ན་ཀུན་དུ་སངས་རྒྱས་ཀྱི་ཞིང་དཔག་ཏུ་མ་མཆིས་། གྲངས་མ་མཆིས་བསམ་གྱིས་མི་ཁྱབ། མཚུངས་པ་མ་མཆིས། ཚད་མ་མཆིས་པ་དང་ཀུན་དུ་གདའ་བ་འདི་ལྟ་སྟེ། །དཔེར་ན་ཤིན་ཏུ་ཕྱིས་པའི་མེ་ཏོག་\nལོང་གི་དཀྱིལ་འཁོར་གདའ་བ་དེ་ལྟ་བུའི་འོད་གསལ་བར་མ་གྱུར་པ་དེ་སྲིད་དུ་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་མི་བགྱིའོ། །བཅོམ་ལྡན་\nའདས་གལ་ཏེ་བདག་བྱང་ཆུབ་ཐོབ་པའི་ཚེ། སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན་སའི་སྟེང་ནས་བཟུང་སྟེ། བར་སྣང་གི་བར་ལས་ལྷ་དང་མིའི་ཡུལ་ལས་ཤིན་དུ་འདས་པའི་བདུག་པ་རིགས་བཟང་པོ་དེ་བཞིན་གཤེགས་\nཔ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ལ་འོས་པ་དག་དྲི་རབ་ཏུ་བདའ་བའི་<span class='add'>  པོ  </span>ག་པོར་སྣོད་རིན་པོ་ཆེ་སྣ་ཚོགས་ལས་བགྱིས་པ་བརྒྱ་སྟོང་དག་ནས་རྟག་ཏུ་བདུགས་པར་མ་གྱུར་པ་དེ་སྲིད་དུ་བདག་བླ་ན་མེད་པ་ཡང་\nདག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་<span class='add'>  པར་  </span>རྫོགས་པར་འཚང་རྒྱ་བར་མི་བགྱིའོ། །བཅོམ་ལྡན་འདས་གལ་ཏེ་བདག་བྱང་ཆུབ་ཐོབ་པའི་ཚེ། སངས་རྒྱས་གྱི་ཞིང་དེ་ན་མེ་ཏོག་དྲི་རབ་ཏུ་བདའ་བ་ཐ་དད་པའི་\nཆར་རྟག་ཏུ་འབབ་པར་གྱུར་པ་དང་། རོལ་མོའི་དབྱངས་སྒྲའི་ང་རོ་ཡིད་དུ་མཆི་བ་རྟག་ཏུ་སྒྲ་འབྱུང་བར་མ་གྱུར་པ་དེ་སྲིད་དུ་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་<span class='add'>  པར་  </span>རྫོགས་པར་\nའཚང་རྒྱ་བར་མི་བགྱིའོ། །བཅོམ་ལྡན་འདས་གལ་ཏེ་བདག་བྱང་ཆུབ་ཐོབ་པའི་ཚེ། བདག་གི་འོད་ཀྱིས་འཇིག་རྟེན་གྱི་ཁམས་གྲངས་མ་མཆིས། བསམ་གྱིས་མི་ཁྱབ་མཚུངས་པ་མ་མཆིས་པ་དག་ཏུ་"
 ],
 [
  "78.284a",
  "བགྱིའོ། །བཅོམ་ལྡན་འདས་གལ་ཏེ་སངས་རྒྱས་ཀྱི་ཞིང་དེར་སེམས་ཅན་གང་དག་སྐྱེས་པར་གྱུར་པ་དེ་དག་ཐམས་ཅད་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་ཆེན་པོའི་བར་དུ་འདི་ལྟ་སྟེ། ཡང་དག་\nཔ་ཉིད་ལ་ངེས་པར་མ་གྱུར་པ་དེ་སྲིད་དུ་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་མི་བགྱིའོ། །བཅོམ་ལྡན་འདས་གལ་ཏེ་བདག་བླ་ན་མེད་པ་ཡང་\nདག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའི་ཚེ་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན་སེམས་ཅན་འགའ་ཞིག་གིས་ཉན་ཐོས་རྣམས་ཀྱིས་ཚད་ཀྱི་གྲངས་རྙེད་པར་འགྱུར་པ་ལྟ་ན་ཐ་ན་སྟོང་\nགསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་སུ་གཏོགས་པའི་སེམས་ཅན་ཐམས་ཅད་རང་སངས་རྒྱས་སུ་གྱུར་ལ། བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དུ་བགྲངས་ཏེ་གྲངས་རྙེད་པར་གྱུར་ན་\nཡང་དེ་སྲིད་དུ་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་མི་བགྱིའོ། །བཅོམ་ལྡན་འདས་གལ་ཏེ་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་\nབྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའི་ཚེ་སངས་རྒྱས་ཀྱི་ཞིང་དེར་བདག་གི་འོད་ཐ་ན་སངས་རྒྱས་ཀྱི་ཞིང་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་གི་ཚད་ཀྱི་ཚད་དང་ལྡན་<span class='add'>  པར་  </span>གྱུར་ན་ཡང་དེ་སྲིད་དུ་བདག་བླ་ན་མེད་པ་\nཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་མི་བགྱིའོ། །བཅོམ་ལྡན་འདས་གལ་ཏེ་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའི་ཚེ་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན་\nསྨོན་ལམ་གྱི་དབང་མ་གཏོགས་པར་སེམས་ཅན་རྣམས་ཀྱི་ཚེའི་ཚད་ལ་ཚད་མཆིས་པར་གྱུར་པ་དེ་སྲིད་དུ་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་མི་བགྱིའོ། །"
 ],
 [
  "78.287b",
  "སེམས་ཅན་གང་དག་ལ་གསལ་བར་གྱུར་པ་དེ་དག་ཐམས་ཅད་ལྷ་དང་མིའི་ལས་ཤིན་ཏུ་འདས་པའི་བདེ་བ་དང་ལྡན་<span class='add'>  པར་  </span>མ་གྱུར་པ་དེ་སྲིད་དུ་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་\nཔར་རྫོགས་པར་འཚང་རྒྱ་བར་མི་བགྱིའོ། །བཅོམ་ལྡན་འདས་གལ་ཏེ་བདག་བྱང་ཆུབ་ཐོབ་བའི་ཚེ། ཀུན་དུ་སངས་རྒྱས་ཀྱི་ཞིང་དཔག་ཏུ་མ་མཆིས། གྲངས་མ་མཆིས། བསམ་གྱིས་མི་ཁྱབ། \nམཚུངས་པ་མ་མཆིས། ཚད་མ་མཆིས་<span class='add'>  པ་  </span>དག་ཏུ་བྱང་ཆུབ་སེམས་དཔའ་དག་གིས་བདག་གིས་མིང་ཐོས་ཏེ། ཐོས་མ་ཐག་ལས་བྱུག་བའི་དགེ་བའི་རྩ་བས་ཚེ་རྗེས་ནས་བྱང་ཆུབ་ཀྱི་སྙིང་པོའི་མཐའི་\nབར་དུ་གཟུངས་ཐོབ་པར་མ་གྱུར་པ་དེ་སྲིད་དུ་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་<span class='add'>  པར་  </span>རྫོགས་པར་འཚང་རྒྱ་བར་མི་བགྱིའོ། །བཅོམ་ལྡན་འདས་གལ་ཏེ་བདག་བྱང་ཆུབ་ཐོབ་\nཔའི་ཚེ། ཀུན་དུ་སངས་རྒྱས་ཀྱི་ཞིང་གྲངས་མ་མཆིས། བསམ་གྱིས་མི་ཁྱབ་མཚུངས་པ་མ་མཆིས། ཚད་མ་མཆིས་པ་དག་ན་བུད་མེད་གང་དག་གིས་བདག་གི་མིང་ཐོས་ན་རབ་ཏུ་དང་བ་སྐྱེས་ཏེ། བྱང་\nཆུབ་ཏུ་སེམས་བསྐྱེད་པར་གྱུར་ལ། བུད་མེད་ཀྱི་ལུས་ལ་སྨོད་པར་གྱུར་ཏེ། །དེ་དག་ཚེ་རྗེས་ནས་གལ་ཏེ་བུད་མེད་ཀྱི་ལུས་ལན་གཉིས་ཐོབ་པར་གྱུར་པ་དེ་སྲིད་དུ་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་\nརྫོགས་པའི་བྱང་ཆུབ་མངོན་<span class='add'>  པར་  </span>རྫོགས་པར་འཚང་རྒྱ་བར་མི་བགྱིའོ། །བཅོམ་ལྡན་འདས་གལ་ཏེ་བདག་བྱང་ཆུབ་ཐོབ་པའི་ཚེ་། སངས་རྒྱས་ཀྱི་ཞིང་དཔག་ཏུ་མ་མཆིས། གྲངས་མ་མཆིས། \nབསམ་གྱིས་མི་ཁྱབ། མཚུངས་པ་མ་མཆིས།ཚད་མ་མཆིས་པ་དག་ན་སེམས་ཅན་གང་དག་གིས་བདག་གི་མིང་ཐོས་པར་གྱུར་ལ། མིང་ཐོས་པ་ཙམ་གྱིས་བྱང་ཆུབ་ཀྱི་སྙིང་པོའི་མཐའི་བར་དུ་ཚངས་པར་སྤྱོད་"
 ],
 [
  "78.288a",
  "པར་མ་གྱུར་པ་དེ་སྲིད་དུ་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་<span class='add'>  པར་  </span>རྫོགས་པར་འཚང་རྒྱ་བར་མི་བགྱིའོ། །བཅོམ་ལྡན་འདས་གལ་ཏེ་བདག་བྱང་ཆུབ་ཐོབ་པའི་ཚེ། ཕྱོགས་\nབཅུ་ཀུན་དུ་སངས་རྒྱས་ཀྱི་ཞིང་དཔག་ཏུ་མ་མཆིས་པ་དང་། གྲངས་མ་མཆིས་པ། བསམ་གྱིས་མི་ཁྱབ་པ། མཚུངས་པ་མ་མཆིས་པ། ཚད་མ་མཆིས་པ་དག་ན་སེམས་ཅན་གང་དག་གིས་བདག་གི་མིང་ཐོས་ལ། \nཡན་ལག་ལྔའི་ཕྱག་བགྱི་བས་ཕྱག་འཚལ་བ་དང་། དེ་དག་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་<span class='add'>  པས་  </span>ན་ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་གྱིས་སྟི་སྟང་དུ་བགྱི་བར་མ་གྱུར་པ་དེ་སྲིད་དུ་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་\nཔའི་བྱང་ཆུབ་མངོན་<span class='add'>  པར་  </span>རྫོགས་པར་འཚང་རྒྱ་བར་མི་བགྱིའོ། །བཅོམ་ལྡན་འདས་གལ་ཏེ་བདག་བྱང་ཆུབ་ཐོབ་པའི་ཚེ། སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན་བྱང་ཆུབ་སེམས་དཔའ་གང་ཆོས་གོས་འཁྲུ་འམ། སྐེམས་སམ། འདྲུབ་\nབམ། འཚེད་པའི་ལས་བགྱིད་པར་<span class='add'>    </span><span class='add'>    </span>གྱུར་ལ། ཆོས་གོས་རིན་པོ་ཆེ་སར་པ་ཁྲེའུ་ཚད་རིགས་བཟང་བ་དེ་བཞིན་གཤེགས་པས་གནང་བ་དག་སེམས་བསྐྱེད་མ་ཐག་ཏུ་བགོས་པར་བདག་གིས་འཚལ་བར་མ་གྱུར་པ་དེ་སྲིད་དུ་\nབདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་<span class='add'>  པར་  </span>རྫོགས་པར་འཚང་རྒྱ་བར་མི་བགྱིའོ། །བཅོམ་ལྡན་འདས་གལ་ཏེ་བདག་བྱང་ཆུབ་ཐོབ་པའི་ཚེ། སངས་རྒྱས་ཀྱི་ཞིང་དེར་སེམས་ཅན་དག་སྐྱེས་མ་\nཐག་ཏུ་འདི་ལྟ་སྟེ། དཔེར་ན་དགེ་སློང་དགྲ་བཅོམ་པ་ཡོངས་སུ་གདུང་བ་མ་མཆིས་པ། བསམ་གཏན་གསུམ་པ་ལ་སྙོམ་པར་འཇུག་པ་ལྟ་བུར་བདེ་བ་རྣམ་པ་དེ་ལྟ་བུ་ཐོབ་པར་མ་གྱུར་པ་དེ་སྲིད་དུ་བདག་བླ་ན་མེད་པ་ཡང་དག་\nཔར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་<span class='add'>  པར་  </span>རྫོགས་པར་འཚང་རྒྱ་བར་མི་བགྱིའོ། །བཅོམ་ལྡན་འདས་གལ་ཏེ་བདག་བྱང་ཆུབ་ཐོབ་པའི་ཚེ་སངས་རྒྱས་ཀྱི་ཞིང་དེར་བྱང་ཆུབ་སེམས་དཔའ་གང་དག་སྐྱེས་པར་གྱུར་པ་དེ་དག་སངས་"
 ],
 [
  "78.288b",
  "རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་གྱི་རྒྱན་བཀོད་པ་རྣམ་པ་ཇི་ལྟ་བུ་དག་འདོད་པར་གྱུར་པ་རྣམ་པ་དེ་ལྟ་བུ་དག་རིན་པོ་ཆེའི་ཤིང་སྣ་ཚོགས་ལས་འཚལ་བར་མ་གྱུར་པ་དེ་སྲིད་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་\nམངོན་<span class='add'>  པར་  </span>རྫོགས་པར་འཚང་རྒྱ་བར་མི་བགྱིའོ། །བཅོམ་ལྡན་འདས་གལ་ཏེ་བདག་བྱང་ཆུབ་ཐོབ་པའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སངས་རྒྱས་ཀྱི་ཞིང་གཞན་དུ་སྐྱེས་པ་དག་གིས་བདག་གི་མིང་ཐོས་ལ་དབང་\nཔོ་མ་ཚང་བ་ཐོབ་པར་མི་འགྱུར་པ་དེ་སྲིད་དུ་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་<span class='add'>  པར་  </span>རྫོགས་པར་འཚང་རྒྱ་བར་མི་བགྱིའོ། །བཅོམ་ལྡན་འདས་གལ་ཏེ་བདག་བྱང་ཆུབ་ཐོབ་པའི་\nཚེ། སངས་རྒྱས་ཀྱི་ཞིང་གཞན་ན་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་དག་གིས་བདག་གི་མིང་ཐོས་མ་ཐག་ཏུ་ཤིན་དུ་རྣམ་པར་ཕྱེ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཐོབ་པར་མ་གྱུར་པ་དང་། བྱང་ཆུབ་སེམས་\nདཔའ་ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ནས་སྨད་ཅིག་གཅིག་འདས་པ་ཙམ་གྱིས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དཔག་ཏུ་མ་མཆིས། གྲངས་མ་མཆིས། བསམ་གྱིས་མི་ཁྱབ་། མཚུངས་པ་མ་མཆིས། ཚད་མ་མཆིས་\nཔ་དག་མཐོང་ལ་ཏིང་ངེ་འཛིན་དེ་བར་<span class='add'>  མ་དོར་  </span>ཆབ་འཚལ་བར་མ་གྱུར་པ་དེ་སྲིད་དུ་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་<span class='add'>  པར་  </span>རྫོགས་པར་འཚང་རྒྱ་བར་མི་བགྱིའོ། །བཅོམ་ལྡན་འདས་\nགལ་ཏེ་བདག་བྱང་ཆུབ་ཐོབ་པའི་ཚེ་སེམས་ཅན་དག་གིས་བདག་གི་མིང་ཐོས་ལ་ཐོས་མ་ཐག་པ་ལས་བྱུང་བའི་དགེ་བའི་རྩ་བས་སེམས་ཅན་རྣམས་བྱང་ཆུབ་ཀྱི་མཐའི་བར་དུ་རིགས་བཟང་པོའི་རིགས་སུ་སྐྱེ་བ་\nཐོབ་<span class='add'>  པར་  </span>མ་གྱུར་པ་དེ་སྲིད་དུ་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་<span class='add'>  པར་  </span>རྫོགས་པར་འཚང་རྒྱ་བར་མི་བགྱིའོ། །བཅོམ་ལྡན་འདས་གལ་ཏེ་བདག་བྱང་ཆུབ་ཐོབ་པའི་ཚེ་འདི་ལས་གཞན་དུ"
 ],
 [
  "78.289a",
  "གྱུར་པའི་སངས་རྒྱས་ཀྱི་ཞིང་རྣམས་སུ་བྱང་ཆུབ་སེམས་དཔའ་གང་དག་གིས་བདག་གི་མིང་ཐོས་པར་གྱུར་ལ། དེ་ཐོས་མ་ཐག་པ་ལས་བྱུང་བའི་དགེ་བའི་རྩ་བས་བྱང་ཆུབ་ཀྱི་མཐའི་བར་དུ་ཐམས་ཅད་བྱང་\nཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་དགའ་བ་དང་། མཆོག་ཏུ་དགའ་བའི་དགེ་བའི་རྩ་བ་དང་ཕྲད་པར་མ་གྱུར་པ་དེ་སྲིད་དུ་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་<span class='add'>  པར་  </span>རྫོགས་པར་འཚང་རྒྱ་བར་མི་\nབགྱིའོ། །བཅོམ་ལྡན་འདས་གལ་ཏེ་བདག་བྱང་ཆུབ་ཐོབ་པའི་ཚེ་འདི་ལས་གཞན་དུ་གྱུར་པའི་འཇིག་རྟེན་གྱི་ཁམས་རྣམས་སུ་བྱང་ཆུབ་སེམས་དཔའ་གང་དག་གིས་བདག་གི་མིང་ཐོས་མ་ཐག་ཏུ་ཀུན་\nགྱི་རྗེས་སུ་སོང་བ་ཞེས་བགྱི་བའི་ཏིང་ངེ་འཛིན་ཐོབ་<span class='add'>  པར་  </span>མ་གྱུར་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་དག་ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ནས་སྐད་ཅིག་གཅིག་འདས་པ་ཙམ་གྱིས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ནས་\nགྲངས་མ་མཆིས་དཔག་ཏུ་མ་མཆིས་། བསམ་གྱིས་མི་ཁྱབ། མཚུངས་པ་མ་མཆིས། ཚད་མ་མཆིས་བ་དག་ལ་སྟི་སྟང་བགྱིད་ལ། ཏིང་ངེ་འཛིན་དེ་བྱང་ཆུབ་ཀྱི་སྙིང་པོའི་མཐའི་བར་མ་དོར་ཆབ་\nའཚལ་བར་མ་གྱུར་པ་དེ་སྲིད་དུ་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་<span class='add'>  པར་  </span>རྫོགས་པར་འཚང་རྒྱ་བར་མི་བགྱིའོ། །བཅོམ་ལྡན་འདས་གལ་ཏེ་བདག་བྱང་ཆུབ་ཐོབ་པའི་ཚེ་སངས་རྒྱས་ཀྱི་ཞིང་དེར་སེམས་\nཅན་གང་དག་སྐྱེས་པར་གྱུར་པ་དེ་དག་ཆོས་བསྟན་<span class='add'>  པ་  </span>རྣམ་པ་ཇི་ལྟ་བུ་ཉན་འཚལ་བར་གྱུར་པ་ཚེས་བསྟན་པ་རྣམ་པ་དེ་ལྟ་བུ་སེམས་བསྐྱེད་མ་ཐག་ཏུ་ཐོས་པར་མ་གྱུར་པ་དེ་སྲིད་དུ་བདག་བླ་ན་མེད་པ་ཡང་\nདག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་<span class='add'>  པར་  </span>རྫོགས་པར་འཚང་རྒྱ་བར་མི་བགྱིའོ། །བཅོམ་ལྡན་འདས་གལ་ཏེ་བདག་བྱང་ཆུབ་ཐོབ་པའི་ཚེ་སངས་རྒྱས་ཀྱི་ཞིང་དག་ཏུ་བྱང་ཆུབ་སེམས་དཔའ་གང་"
 ],
 [
  "78.289b",
  "དག་གིས་བདག་གི་མིང་ཐོས་པ་དེ་དག་བདག་གི་མིང་ཐོས་མ་ཐག་ཏུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་མ་གྱུར་པ་དེ་སྲིད་དུ་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་\nམངོན་<span class='add'>  པར་  </span>རྫོགས་པར་འཚང་རྒྱ་བར་མི་བགྱིའོ། །བཅོམ་ལྡན་འདས་གལ་ཏེ་བདག་བྱང་ཆུབ་ཐོབ་པའི་ཚེ་སངས་རྒྱས་ཀྱི་ཞིང་གཞན་དག་ཏུ་བྱང་ཆུབ་སེམས་དཔའ་གང་དག་གིས་བདག་གི་མིང་ཐོས་པར་གྱུར་པ་དེ་\nདག་བདག་གི་མིང་ཐོས་མ་ཐག་ཏུ་བཟོད་པ་དང་པོ་དང་། གཉིས་པ་དང་གསུམ་པ་ཐོབ་པར་མ་གྱུར་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ལས་ཕྱིར་མི་ལྡོག་པར་མ་གྱུར་བ་དེ་སྲིད་དུ་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་\nཔའི་བྱང་ཆུབ་མངོན་<span class='add'>  པར་  </span>རྫོགས་པར་འཚང་རྒྱ་བར་མི་བགྱིའོ། ཀུན་དགའ་བོ་དེ་ནས་དགེ་སློང་ཆོས་ཀྱི་འབྱུང་གནས་དེས་སྨོན་ལམ་གྱི་ཁྱད་པར་རྣམ་པ་འདི་ལྟ་བུ་འདི་ལྟ་བུ་འདི་དག་བསྟན་ནས་སངས་རྒྱས་ཀྱི་མཐུས་དེའི་ཚེ་ཚིགས་སུ་\nབཅད་པ་འདི་དག་གསོལ་ཏོ། །གལ་ཏེ་བདག་གིས་བྱང་ཆུབ་ཐོབ་ཚེ་སྨོན་ལམ་མཆོག །ཁྱད་པར་འཕགས་པ་རྣམ་པ་འདི་འདྲར་མ་གྱུར་ན། སྟོབས་བཅུ་མངའ་བ་མཚུངས་པ་མ་མཆིས་སྦྱིན་པའི་གནས་། མི་ཡི་སེང་གེ་\nསེམས་ཅན་སྙིང་པོར་བདག་མ་གྱུར། གལ་ཏེ་བདག་ཞིང་རྣམ་པ་དེ་འདྲར་མ་གྱུར་ལ། སེམས་ཅན་དབུལ་མང་ནོར་མང་སྩལ་བར་མ་གྱུར་ཅིག །སྡུག་བསྔལ་གྱུར་པའི་མི་དག་བདེ་བར་མ་བགྱིས་པར། མི་ཡི་རྒྱལ་པོ་དཀོན་\nམཆོག་ཏུ་ནི་བདག་མ་གྱུར། བདག་ནི་བྱང་ཆུབ་སྙིང་པོར་ཉེ་བར་མཆིས་པའི་ཚེ། ཕྱོགས་མཚམས་དག་གི་ཞིང་རྣམས་མང་པོ་ཐ་གྲུ་ཆེ། མཐའ་ཡས་དག་ཏུ་མིང་ནི་གྲགས་པར་མ་གྱུར་བར། འཇིག་རྟེན་མགོན་པོ་སྟོབས་\nབརྙེས་པར་ནི་བདག་མ་གྱུར་། བྱང་ཆུབ་མཚུངས་མེད་ཞི་བའི་ཡང་དག་ཚོལ་བ་ན། དྲན་དང་བློ་གྲོས་རྟོགས་པ་རྣམ་པར་ཉམས་གྱུར་ཅིང་། གལ་ཏེ་བདག་ནི་འདོད་པའི་ལོངས་སྤྱོད་སྤྱོད་གྱུར་པ། འཇིག་རྟེན་སྟོན་<span class='add'>  པ་སྟོབས་  </span>བརྙེས་པར་"
 ],
 [
  "78.290a",
  "ནི་བདག་མ་གྱུར། ཤིན་དུ་རྒྱས་འོད་མཚུངས་པ་མ་མཆིས་མཐའ་ཡས་བས། ཕྱོགས་དང་ཕྱོགས་མཚམས་མགོན་པོའི་སངས་རྒྱས་ཞིང་ཀུན་ཁྱབ། འདོད་ཆགས་ཞེ་སྡང་གཏི་མུག་ཐམས་ཅད་རབ་ཞི་<span class='add'>  ཞིང་། །  </span>\nསེམས་ཅན་དམྱལ་བར་དོང་བའི་མེ་རྣམས་ཞི་བར་བགྱི། ཤིན་དུ་མཛེས་ཤིང་ཡངས་པའི་མིག་ནི་ཕྱེ་ནས་སུ། མི་རྣམས་ཀུན་གྱི་མུན་གནག་རྣམ་པར་བསལ་བར་བགྱི། དལ་བ་མེད་པ་དག་ནི་མ་ལུས་བསལ་ནས་\nསུ། གཟི་བརྗིད་མཐའ་ཡས་མཐོ་རིས་ལམ་དུ་གཟུང་བར་བགྱི། སྔོན་གྱི་སྤྱོད་པ་ཡོངས་སུ་དག་པར་<span class='add'>  སྤྱད་  </span>ནས་ནི། མཁའ་ལ་ཉི་ཟླའི་འོད་ནི་ལམ་མེ་མ་ལགས་ཤིང་། ནོར་བུའི་ཚོགས་དང་མེ་དང་ལྷ་ཡི་འོང་རྣམས་ཀྱང་། \nམི་ཡི་སེང་གེའི་འོད་ཀྱིས་ཐམས་ཅད་ཟིལ་གྱིས་གནོན། སྐྱེས་བུ་མཆོག་གྱུར་སྡུག་བསྔལ་རྣམས་ཀྱི་<span class='add'>  གཏེར་  </span>གྱུར་ཏེ། ཕྱོགས་མཚམས་ཕྱོགས་ན་དེ་འདྲའི་གཟུགས་ནི་མ་མཆིས་ཤིང་། དགེ་བ་བརྒྱ་སྟོང་དག་ནི་རབ་ཏུ་\nརྫོགས་གྱུར་ནས། འཁོར་ནང་མཆིས་ཏེ་སངས་རྒྱས་སེང་གེའི་སྒྲ་སྒྲག་གོ །སྔོན་གྱི་རྒྱལ་བར་རང་བྱུང་དག་ལ་གུས་བགྱིས་ཏེ། བརཏལ་ཞུགས་དཀའ་ཐུབ་བྱེ་བ་དཔག་ཏུ་མེད་སྤྱད་ནས་ནི། ཡེ་ཤེས་ཕུང་པོ་དམ་པ་མཆོག་\nརབ་བསྩལ་ནས་སུ། སྨོན་ལམ་སྟོབས་ནི་རྫོགས་<span class='add'>  བ  </span>གྱིས་སེམས་ཅན་སྙིང་པོར་འགྱུར། ཇི་ལྟར་བཅོམ་ལྡན་ཡེ་ཤེས་གཟིགས་པ་ཆགས་མི་མངའ་། མི་ཡི་དབང་པོ་འདུས་བྱས་རྣམ་གསུམ་རབ་མཁྱེན་པ། བདག་\nཀྱང་མཚུངས་<span class='add'>  པ་  </span>མ་མཆིས་སྦྱིན་གནས་མཁས་པ་དང་། མི་རྣམས་རང་ན་མི་ཡི་འདྲེན་པ་མཆོག་གྱུར་ཅིག །མི་དབང་བདག་གིས་བྱང་ཆུབ་ཐོབ་ནས་ནི། གལ་ཏེ་སྨོན་ལམ་འདི་འདྲ་འདི་དག་གྲུབ་ཅེ་ན། སྟོང་གི་\nའཇིག་རྟེན་ཁམས་འདི་རབ་ཏུ་གཡོས་གྱུར་ཅིང་། ལྷ་ཡི་ཚོགས་ཀྱིས་མཁའ་ལས་མེ་ཏོག་ཆར་ཕོབ་ཤིག །ས་ཡང་རབ་ཏུ་གཡོས་ཏེ་མེ་ཏོག་ཆར་ཡང་ཕབ། ནམ་མཁའ་ལས་ཀྱང་སིལ་སྙན་རྣམས་ཀྱི་སྒྲ་ཡང་"
 ],
 [
  "78.290b",
  "བྱུང་། ལྷ་ཡི་ཙན་དན་མཛེས་པ་དག་གི་ཕྱེ་མ་ཡང་། མངོན་<span class='add'>  པར་  </span>འཐོར་བར་གྱུར་ཏེ་འཇིག་རྟེན་སངས་རྒྱས་འགྱུར། བམ་པོ་གཉིས་པ། ཀུན་དགའ་བོ་དགེ་སློང་ཆོས་ཀྱི་འབྱུང་གནས་བྱང་ཆུབ་སེམས་དཔའ་\nསེམས་དཔའ་ཆེན་པོ་དེ་སྨོན་ལམ་ཕུན་སུམ་ཚོགས་པ་རྣམ་པ་དེ་ལྟ་བུ་དང་ལྡན་སྟེ། ཀུན་དགའ་བོ་སྨོན་ལམ་ཕུན་སུམ་ཚོགས་པ་རྣམ་པ་འདི་ལྟ་བུ་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་ཉུང་ངོ་། སྨོན་ལམ་རྣམ་པ་འདི་\nལྟ་བུ་དག་འཇིག་རྟེན་དུ་བྱུང་བ་ཉུང་སྟེ། ཉུང་དུ་ཟད་ཀྱི་ཡེ་མེད་པ་ནི་མ་ཡིན་ནོ། །ཀུན་དགའ་བོ་དགེ་སློང་ཆོས་ཀྱི་འབྱུང་གནས་དེས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་འཇིག་རྟེན་དབང་ཕྱུག་རྒྱལ་པོ་དེའི་སྤྱན་\nསྔར་ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་བདུད་དང་བཅས། ཚངས་པ་དང་བཅས་པ། དགེ་སྦྱོང་དང་བྲམ་ཟེའི་སྐྱེ་དགུ་དང་བཅས་པ། ལྷ་དང་མི་དང་། ལྷ་མ་ཡིན་དང་བཅས་པའི་མདུན་དུ་སྨོན་ལམ་གྱི་ཁྱད་པར་རྣམ་པ་\nདེ་ལྟ་བུ་དེ་དག་བསྟན་ནས། ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་སྒྲུབ་པ་ལ་གནས་བར་གྱུར་ཏེ། སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་ཆེ་བ་ཉིད་དང་། སངས་རྒྱས་ཀྱི་ཞིང་ཐ་གྲུ་ཆེན་པོ་རྣམ་པ་དེ་\nལྟ་བུ་དེ་དག་ནི་སྒྲུབ། བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་ཅིང་ལོ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དཔག་ཏུ་མེད། གྲངས་མེད་བསམ་གྱིས་མི་ཁྱབ་མཚུངས་པ་མེད། གཞལ་དུ་མེད། ཚད་མེད། བརྗོད་དུ་མེད་པར་ལན་\nའགའ་ཡང་འདོད་བ་དང་། གནོད་སེམས་དང་། རྣམ་པར་འཚེ་བའི་རྣམ་པར་རྟོག་པས་རྣམ་པར་རྟོག་པར་མ་གྱུར། ལན་འགའ་ཡང་འདོད་པ་དང་། གནོད་སེམས་དང་། རྣམ་པར་འཚེ་བའི་འདུ་ཤེས་སྐྱེད་པར་\nམ་གྱུར། ལན་འགའ་ཡང་གཟུགས་དང་། སྒྲ་དང་། དྲི་དང་། རོ་དང་རེག་བྱའི་འདུ་ཤེས་སྐྱེད་པར་མ་གྱུར་ཏེ། གཞོན་ནུ་དེ་དེས་ཤིང་འགྲོགས་ན་བདེ་བ་དང་། དང་དུ་ལེན་པའི་རང་བཞིན་ཅན་དང་། དགང་སླ་བ་<span class='add'>  དང་།   </span>གསོ་སླ་བ་དང་། འདོད་"
 ],
 [
  "78.291a",
  "པ་ཆུང་བ་དང་། ཆོག་ཤེས་པ་དང་། རབ་ཏུ་དབེན་པ་དང་། ཞེ་སྡང་མེད་པ་དང་། རྨོངས་པ་མེད་པ་དང་། དྲང་བ་དང་། མི་དམན་པ་དང་། གཡོ་མེད་པ་དང་། སྒྱུ་མེད་པ་དང་། ངང་ཚུལ་བཟང་བ་དང་། མཉེན་པ་དང་། \nསྙན་པར་སྨྲ་བ་དང་། རྟག་ཏུ་བརྩོན་པ་དང་། དཀར་པོའི་ཆོས་ཡོངས་སུ་ཚོལ་བ་ལ་བརྩོན་པ་མི་འདོར་བར་གྱུར་ཏེ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་དུ་སྨོན་ལམ་ཆེན་པོ་ཡང་དག་པར་བསྒྲུབས་པར་གྱུར་ཏོ། །\nསངས་རྒྱས་དང་། ཆོས་དང་། དགེ་འདུན་དང་། སློབ་དཔོན་དང་། མཁན་པོ་དང་། དགེ་བའི་བཤེས་གཉེན་ལ་གུས་པ་དང་བཅས་ཤིང་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་རྟག་ཏུ་གོ་ཆ་བགོས་ཏེ་དྲང་བ་དང་། མཉན་\nཔ་དང་། ཚུལ་འཆོས་པ་མེད་པ་དང་། ཁ་གསག་མེད་པ་དང་། ཡོན་ཏན་དང་ལྡན་ཞིང་སེམས་ཅན་ཐམས་ཅད་དགེ་བའི་ཆོས་ཐམས་ཅད་ཡང་དག་པར་འཛིན་དུ་བཅུག་པའི་སྔོན་དུ་ནི་འགྲོ་། སྟོང་པ་ཉིད་དང་། མཚན་\nམ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་<span class='add'>  པར་  </span>འདུ་བྱ་བ་མེད་པ་དང་། སྐྱེ་བ་མེད་པ་དང་། འགས་པ་མེད་པའི་གནས་བས་ནི་གནས་ཏེ། ང་རྒྱལ་མེད་ཅིང་<span class='add'>  ངག་  </span>ལེགས་པར་བསྲུངས་པར་གྱུར་ཏོ། །བྱང་ཆུབ་སེམས་\nདཔའི་སྤྱད་པ་སྤྱོད་པ་ན་དེས་དག་གི་ལས་འབྱུང་བ་གང་བདག་དང་། གཞན་དང་། གཉིས་ཀ་ལ་གནོད་པར་འགྱུར་བ་རྣམ་པ་དེ་ལྟ་བུ་སྤངས་ནས་<span class='add'>  ངག་  </span>གི་ལས་གང་བདག་དང་། གཞན་དང་། གཉིས་ཀ་ལ་ཕན་<span class='add'>  པར་  </span>\nའགྱུར་བ་དེ་དག་བརྩོན་<span class='add'>  པར་  </span>གྱུར་ཏེ། དེ་ལྟར་ཤེས་བཞིན་ཅན་དུ་གྱུར་ཅིང་གྲོང་དང་། གྲོང་ཁྱེར་དང་། གྲོང་རྡལ་དང་། ཡུལ་འཁོར་དང་། རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་རྣམས་སུ་འཇུག་པ་ན་ནམ་ཡང་གཟུགས་དང་། \nསྒྲ་དང་། དྲི་དང་། རོ་དང་། རེག་བྱ་དང་། ཆོས་ལ་རྗེས་སུ་ཆགས་པ་དང་། ཁོང་ཁྲོ་བ་མེད་པར་གྱུར་ཏོ། །དེ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་བདག་ཉིད་ཀྱང་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་གཞན་"
 ],
 [
  "78.291b",
  "ཡང་དེ་ཉིད་ཡང་དག་པར་འཛིན་དུ་བཅུག་གོ །བདག་ཉིད་ཀྱང་ཚུལ་ཁྲིམས་དང་། བཟོད་པ་དང་། བརྩོན་འགྲུས་དང་། བསམ་གཏན་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་གཞན་ཡང་དེ་ཉིད་\nཡང་དག་པར་འཛིན་དུ་བཅུག་གོ །གང་དག་དང་ལྡན་ན་གང་དག་དུ་སྐྱེས་པ་དེ་དང་དེར་གཏེར་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དུ་མ་ས་ལས་འབྱུང་བར་འགྱུར་བ་རྣམ་པ་དེ་ལྟ་བུའི་དགེ་བའི་རྩ་བ་རྣམས་ཡང་\nདག་པར་བསྒྲུབས་པར་གྱུར་ཏོ། །དེ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་སེམས་ཅན་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་གྲངས་མེད་དཔག་ཏུ་མེད་པ་གང་དག་དག་གི་ལས་ཀྱིས་མཐར་ཕྱིན་པར་སླ་བ་མ་\nཡིན་པ་དེ་སྙེད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་བཀོད་དོ། །སངས་རྒྱས་བཅོམ་ལྡན་འདས་གྲངས་མེད་དཔག་ཏུ་མེད་པ་དེ་སྙེད་ལན་བཟའ་དང་། ཞལ་ཟས་དང་། གཟིམས་ཆ་<span class='add'>  དང་།   </span>\nསྙུན་གྱི་གསོས་སྨན་དང་། ཡོ་བྱད་རྣམས་དང་། བདེ་བ་ལ་སྦྱར་བ་ལ་རེག་པར་གནས་པ་ཐམས་ཅད་ཀྱིས་སྟི་སྟང་དུ་བྱས། བླ་མར་བྱས། རིམ་གྲོ་བྱས་སྟེ་མཆོད་པ་བྱས་སོ། །སེམས་ཅན་ཇི་\nསྙེད་རབ་ཏུ་སྦྱིན་པར་བྱས་པ་དང་། <span class='add'>  ཚོང་  </span>དཔོན་དང་། ཁྱིམ་བདག་དང་། བློན་པོ་དང་། རྒྱལ་རིགས་དང་། བྲམ་ཟེའི་རིགས་ཤིང་ས་ལ་ཆེན་པོ་ལྟ་བུ་དག་ལ་རབ་ཏུ་དགོད་པ་དེ་དག་ཀྱང་ཚིག་གིས་བསྟན་པས་\nམཐར་ཕྱིན་པར་བླ་བ་མ་ཡིན་ནོ། །དེ་བཞིན་དུ་འཛམ་བུའི་གླིང་གི་དབང་ཕྱུག་ཉིད་དང་། འཁོར་ལོས་སྒྱུར་བ་ཉིད་དང་། འཇིག་རྟེན་སྐྱོང་བ་ཉིད་དང་། རབ་འཐའ་བྲལ་ཉིད་དང་། ཡོངས་སུ་དགའ་ལྡན་ཉིད་\nདང་། རབ་འཕྲུལ་ཉིད་དང་། དབང་བསྒྱུར་ཉིད་དང་། ལྷའི་རྒྱལ་ཉིད་དང་། ཚངས་པ་ཆེན་པོ་ཉིད་ལ་རབ་ཏུ་བཀོད་དོ། །སངས་རྒྱས་བཅོམ་ལྡན་འདས་གྲངས་མེད་དཔག་ཏུ་མེད་པ་དེ་སྙེད་ལ་སྟི་སྟང་དུ་བྱས། བླ་མར་བྱས་"
 ],
 [
  "78.293a",
  "མཐའི་ཚད་རྟོགས་པར་སླ་བ་མ་ཡིན་ནོ། །ཀུན་དགའ་བོ་འོན་ཀྱང་མདོར་བསྟན་ན། ཤར་ཕྱོགས་སུ་སངས་རྒྱས་ཀྱི་ཞིང་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་བཅོམ་ལྡན་འདས་འོད་དཔག་མེད་དེའི་\nའོད་ཀྱིས་རྟག་ཏུ་ཁྱབ་<span class='add'>  བོ། །  </span>དེ་བཞིན་དུ་ལྷོ་དང་། ནུབ་དང་། བྱང་དང་། སྟེང་དང་། ཕྱོགས་འཚམས་ཀྱི་ཕྱོགས་རེ་རེར་ཡང་སངས་རྒྱས་ཀྱི་ཞིང་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་བཅོམ་ལྡན་འདས་དེ་བཞིན་\nགཤེགས་པ་འོད་དཔག་མེད་དེའི་འོད་ཀྱིས་རྟག་ཏུ་ཁྱབ་སྟེ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་སྔོན་གྱི་སྨོན་ལམ་གྱིས་བྱིན་གྱི་བརླབས་ཀྱིས་འོད་འདོམ་གང་བ་དང་། འདོམ་དོ་བ་དང་། གསུམ་པ་དང་། བཞི་པ་དང་། ལྔ་པ་དང་། བཅུ་པ་དང་། ཉི་ཤུ་བ་\nདང་། སུམ་བཅུ་པ་དང་། བཞི་བཅུ་པ་དང་། ལྔ་བཅུ་པ་དང་། འོད་དཔག་ཚད་བཅུ་པ་དང་། འོད་དཔག་ཚད་བརྒྱ་པ་དང་། འོད་དཔག་ཚད་སྟོང་པ་དང་། འོད་དཔག་ཚད་བརྒྱ་སྟོང་པ་ནས་འོད་དཔག་ཚད་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དུ་\nམའི་འོད་ཀྱིས་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་བར་དུ་ཁྱབ་པར་གྱུར་ཏེ་གནས་པ་ནི་མ་གཏོགས་སོ། །ཀུན་དགའ་བོ་དཔེ་གང་གིས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་འོད་དཔག་མེད་དེའི་འོད་ཀྱི་ཚད་གཟུང་བའི་དཔེ་གཞག་\nཔ་མེད་དེ། ཀུན་དགའ་བོ་རྣམ་གྲངས་དེས་ན་དེ་བཞིན་གཤེགས་པ་དེ་འོད་དཔག་མེད་ཅེས་བྱ་སྟེ། འོད་དཔག་ཏུ་མེད་པ་དང་། སྣང་བ་དཔག་ཏུ་མེད་པ་དང་། འོད་ཐུག་པ་མེད་པ་དང་། འོད་ཆགས་པ་མེད་པ་དང་། \nའོད་ཐོགས་པ་མེད་པ་དང་། འོད་རྟག་ཏུ་གཏོང་པ་དང་། ལྷའི་ནུར་བའི་འོད་དང་། ཐོགས་པ་མེད་པའི་འོད་ཟེར་གྱི་རྒྱལ་པོའི་འོད་དང་། ཆགས་པར་འགྱུར་བའི་འོད་དང་། དགའ་བར་འགྱུར་བའི་འོད་དང་། མཆོག་\nཏུ་དགའ་བར་འགྱུར་བའི་འོད་དང་། ཚིམ་པར་འགྱུར་བའི་འོད་དང་། ལྟ་བར་འགྱུར་བའི་འོད་དང་། འབྲེལ་པར་འགྱུར་བའི་འོད་དང་། བསམ་གྱིས་མི་ཁྱབ་པའི་འོད་དང་། མཚུངས་པ་མེད་པའི་འོད་དང་། མིའི་དབང་པོ་དང་ལྷའི་དབང་"
 ],
 [
  "78.294a",
  "ཕྲག་འདི་སྙེད་ཅིག་ཅེ་འམ། དཀྲིགས་ཕྲག་འདི་སྙེད་ཅིག་ཅེ་འམ། ཁྲག་ཁྲིག་ཕྲག་འདི་སྙེད་ཅིག་ཅེ་འམ། ཐེར་འབུམ་ཕྲག་འདི་སྙེད་ཅིག་ཅེ་འམ། མི་འཁྲུགས་པ་ཕྲག་འདི་སྙེད་ཅིག་ཅེ་འམ། \nརྣམ་འདེག་ཕྲག་འདི་སྙེད་ཅིག་ཅེ་འམ། རྒྱུན་འཐབ་ཕྲག་འདི་སྙེད་ཅིག་ཅེ་འམ། རྒྱལ་བ་ཕྲག་འདི་སྙེད་ཅིག་ཅེ་འམ། དཔག་ཏུ་མེད་པ་ཕྲག་འདི་སྙེད་ཅིག་ཅེ་འམ། གྲངས་མེད་པ་ཕྲག་འདི་སྙེད་ཅིག་ཅེ་འམ། \nབགྲང་དུ་མེད་པ་ཕྲག་འདི་སྙེད་ཅིག་ཅེ་འམ། མཚུངས་པ་མེད་པ་ཕྲག་འདི་སྙེད་ཅིག་ཅེ་འམ། བསམ་གྱིས་མི་ཁྱབ་པ་ཕྲག་འདི་སྙེད་ཅིག་ཅེས་དེའི་ཚད་བཟུང་བར་སླ་བ་མ་ཡིན་ནོ། །ཀུན་དགའ་བོ་འདི་ལྟ་སྟེ་\nདཔེར་ན་དགེ་སློང་<span class='add'>  མཽད་  </span>གལ་གྱི་བུ་ཆེན་པོ་རྫུ་འཕྲུལ་ལ་དབང་ཐོབ་པ་དེ་འདོད་ན། སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ན་སྐར་མའི་གཟུགས་ཇི་སྙེད་ཡོད་པ་དེ་དག་ཐམས་ཅད་ཉིན་ཞག་གཅིག་གིས་\nབགྲང་བ་དེ་ལྟ་བུའི་རྣམ་པའི་རྫུ་འཕྲུལ་དང་ལྡན་<span class='add'>  པ་  </span>བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཡོད་པར་གྱུར་ལ། དེ་དག་ལས་གཞན་མི་བྱེད་<span class='add'>  པར་  </span>ལོ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དུ་དེ་བཞིན་གཤེགས་པ་འོད་དཔག་མེད་ཀྱི་ཉན་ཐོས་\nདང་པོ་འདུས་པ་བགྲངས་ཀྱང་དེ་དག་གིས་བརྒྱའི་ཆར་ཡང་བགྲངས་པར་མི་འགྱུར་ཏེ། སྟོང་དང་། བརྒྱ་སྟོང་དང་། ཆ་དང་། དཔེ་དང་། རྒྱུའི་བར་དུ་ཡང་བགྲང་བར་མི་འགྱུར་རོ། །ཀུན་དགའ་བོ་འདི་ལྟ་\nསྟེ། རྒྱ་མཚོ་ཆེན་པོ་ཟབས་སུ་དཔག་ཚད་བརྒྱད་ཁྲི་བཞི་སྟོང་ཡོད་པ། ཁྱོན་དཔག་ཏུ་མེད་པ་ལ་མི་ལ་ལ་ཞིག་གིས་སྐྲ་ཚལ་པ་བརྒྱར་གཤགས་པའི་རྩེ་མོས་ཆུའི་ཐིགས་པ་གཅིག་བླངས་ན་ཀུན་དགའ་\nབོ་འདི་ཇི་སྙེད་དུ་སེམས་། གང་སྐྲ་ཚལ་པ་བརྒྱར་གཤགས་པའི་རྩེ་མོས་ཆུའི་ཐིགས་པ་གཅིག་བླངས་པ་དང་། གང་རྒྱ་མཚོ་ཆེན་པོའི་ཆུའི་ཕུང་པོ་ཕྱིན་ལས་པ་དེ་གཉིས་གང་མང་། གསོལ་བ།"
 ],
 [
  "78.292b",
  "བའི་ཕ་རོལ་དུ་སོན་པར་གྱུར་ཏོ། །དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་། བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་<span class='add'>  པ་  </span>ཀུན་དགའ་བོས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཅི་ལགས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་\nཔོ་ཆོས་ཀྱི་འབྱུང་གནས་དེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་<span class='add'>  པར་  </span>རྫོགས་པར་སངས་རྒྱས་ཏེ། ཡོངས་སུ་མྱ་ངན་ལས་འདས་ལགས་སམ། འོན་ཏེ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པར་ཡོངས་སུ་མྱ་ངན་\nམ་འདས་སམ། འོན་ཏེ་ད་ལྟར་བྱུང་བ་ན་མངོན་<span class='add'>  པར་  </span>རྫོགས་པར་སངས་རྒྱས་ཏེ། ད་ལྟར་ན་བཞུགས་ལ་འཚོ་ཞིང་གཞེས་ཏེ་ཆོས་ཀྱང་སྟོན། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་དེ་བཞིན་གཤེགས་པ་\nདེ་ནི་འདས་པ་ཡང་མ་ཡིན། མ་འོངས་པ་ཡང་མ་ཡིན་གྱི། དེ་བཞིན་གཤེགས་པ་དེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་<span class='add'>  པར་  </span>རྫོགས་པར་སངས་རྒྱས་ནས་ད་ལྟ་ན་བཞུགས་ཏེ་འཚོ་ཞིང་གཞེས་ལ་ཆོས་ཀྱང་སྟོན་\nཏེ། འདི་ནས་ནུབ་ཕྱོགས་སུ་སངས་རྒྱས་ཀྱི་ཞིང་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ན་འཇིག་རྟེན་གྱི་ཁམས་བདེ་བ་ཅན་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་དཔག་མེད་ཅེས་བྱ་སྟེ། བྱང་\nཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཚད་མེད་པ་དག་དང་། ཉན་ཐོས་མཐའ་ཡས་<span class='add'>  པ་  </span>དག་གིས་ཡོངས་སུ་བསྐོར་ཅིང་མདུན་དུ་བདར་ཏེ། སངས་རྒྱས་ཀྱི་ཞིང་ཕུན་སུམ་ཚོགས་པ་མཐའ་ཡས་པ་དང་ལྡན་ནོ། །དེའི་འོད་ནི་དཔག་ཏུ་\nམེད་དེ། དེ་ནི་སངས་རྒྱས་ཀྱི་ཞིང་འདི་སྙེད་ཅིག་དང་། སངས་རྒྱས་ཀྱི་ཞིང་བརྒྱ་ཕྲག་འདི་སྙེད་ཅིག་དང་། སངས་རྒྱས་ཀྱི་ཞིང་སྟོང་ཕྲག་འདི་སྙེད་ཅིག་དང་། སངས་རྒྱས་ཀྱི་ཞིང་བརྒྱ་སྟོང་ཕྲག་འདི་སྙེད་ཅིག་དང་། སངས་རྒྱས་ཀྱི་ཞིང་བྱེ་བ་ཕྲག་འདི་\nསྙེད་ཅིག་དང་། སངས་རྒྱས་ཀྱི་ཞིང་བྱེ་བ་ཕྲག་འདི་སྙེད་ཅིག་དང་། སངས་རྒྱས་ཀྱི་ཞིང་བྱེ་བ་སྟོང་ཕྲག་འདི་སྙེད་ཅིག་དང་། སངས་རྒྱས་ཀྱི་ཞིང་བྱེ་བ་བརྒྱ་སྟོང་ཕྲག་འདི་སྙེད་ཅིག་དང་། སངས་རྒྱ་ས་ཀྱི་ཞིང་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་འདི་སྙེད་ཅིག་ཁྱབ་པར་བྱས་ཏེ་འདུག་གོ་ཞེས་"
 ],
 [
  "78.294b",
  "བཅོམ་ལྡན་འདས་དཔག་ཚད་སྟོང་ཡང་རྒྱ་མཚོ་ཆེན་པོ་བས་ཉུང་ལགས་ན། སྐྲ་ཚལ་པ་<span class='add'>  རྒྱར་ག  </span><span class='add'>    </span>ཤགས་པའི་རྩེ་མོས་ཆབ་ཐིགས་པ་བླངས་པ་ལྟ་སྨོས་ཀྱང་ཅི་འཚལ། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་\nཔ། ཀུན་དགའ་བོ་ཆུ་ཐིགས་པ་གཅིག་ལྟ་བུར་ནི་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་འོད་དཔག་མེད་ཀྱི་ཉན་ཐོས་དང་པོར་འདུས་པ་ལ་<span class='add'>  མཽད་  </span>གལ་གྱི་བུ་ལྟ་བུའི་དགེ་སློང་རྣམས་ཀྱིས་ལོ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་\nསྟོང་དུ་བགྲངས་ཏེ་འདི་སྙེད་ཅིག་གོ་ཞེས་གྲངས་ཀྱིས་ཆོད་པ་ལྟ་བུ་ཡིན་ནོ། །རྒྱ་མཚོ་ཆེན་པོའི་ཆུའི་ཕུང་པོ་ཕྱིན་ལས་པ་ལྟ་བུའི་གྲངས་ཀྱིས་མཆོད་པར་བལྟ་བ་ཡིན་ན་ཉན་ཐོས་འདུས་པ་གཉིས་པ་དང་གསུམ་པ་\nརྣམས་ལྔ་སྨོས་ཀྱང་ཅི་དགོས་ཏེ། བཅོམ་ལྡན་འདས་དེའི་ཉན་ཐོས་ཀྱི་དགེ་འདུན་ནི་དེ་ལྟར་མཐའ་ཡས་མུ་མེད་དེ། དེ་ནི་དཔག་ཏུ་མེད་དོ་ཞེས་བྱ་བའི་གྲངས་སུ་འགྲོ་བ་ཡིན་ནོ། །ཀུན་དགའ་བོ་བཅོམ་ལྡན་\nའདས་དེ་བཞིན་གཤེགས་པ་འོད་དཔག་མེད་དེའི་ཚེའི་ཚད་དཔག་ཏུ་མེད་དེ། བསྐལ་པ་འདི་སྙེད་ཅིག་ཅེ་འམ། བསྐལ་པ་བརྒྱ་ཕྲག་འདི་སྙེད་ཅིག་ཅེ་འམ། བསྐལ་པ་སྟོང་ཕྲག་འདི་སྙེད་ཅིག་ཅེ་འམ། \nབསྐལ་པ་བརྒྱ་སྟོང་ཕྲག་འདི་སྙེད་ཅིག་ཅེ་འམ། བསྐལ་པ་བྱེ་བ་ཕྲག་འདི་སྙེད་ཅིག་ཅེ་འམ། བསྐལ་པ་བྱེ་བ་ཕྲག་འདི་སྙེད་ཅིག་ཅེ་འམ། བསྐལ་པ་བྱེ་བ་བརྒྱ་ཕྲག་འདི་སྙེད་ཅིག་ཅེ་འམ། །\nབསྐལ་པ་བྱེ་བ་བརྒྱ་སྟོང་ཕྲག་འདི་སྙེད་ཅིག་ཅེས་བྱ་བ་ནས་བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་འདི་སྙེད་ཅིག་གོ་ཞེས་བྱ་བའི་བར་དུ་ཚེའི་ཚད་རྟོགས་པར་སླ་བ་མ་ཡིན་ནོ། །ཀུན་དགའ་བོ་བཅོམ་ལྡན་འདས་\nདེ་བཞིན་གཤེགས་པ་འོད་དཔག་མེད་དེའི་སྐུ་ཚེའི་དེ་ལྟར་དཔག་ཏུ་མེད་དེ། དེའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་དེ་འོད་དཔག་མེད་ཅེས་བྱའོ། །ཀུན་དགའ་བོ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་"
 ],
 [
  "78.295a",
  "འོད་དཔག་མེད་དེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་བར་རྫོགས་པར་སངས་རྒྱས་ནས་ཇི་ལྟར་ད་ལྟར་འཇིག་རྟེན་གྱི་ཁམས་འདི་ན་བསྐལ་པའི་གྲངས་དང་། བསྐལ་\nཔའི་བགྲང་བའི་བརྡར་གཏགས་པ་དེ་ལྟ་བུའི་བསྐལ་པ་བཅུ་ལོན་ནོ། །ཀུན་དགའ་བོ་བཅོམ་ལྡན་འདས་འོད་དཔག་མེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་བདེ་བ་ཅན་ཞེས་བྱ་བ་ནི་འབྱོར་པ་མོད་པ། བདེ་བ་ལོ་ལེགས་\nཔ། ཉམས་དགའ་བ། ལྷ་དང་མི་མང་པོས་གང་བའོ། །ཀུན་དགའ་བོ་འཇིག་རྟེན་གྱི་ཁམས་དེ་ན་སེམས་ཅན་དམྱལ་བ་མེད་དོ། །དུད་འགྲོའི་སྐྱེ་གནས་མེད་དོ། །ཡི་དགས་ཀྱི་ཡུལ་མེད་དོ། །ལྷ་མ་ཡིན་\nགྱི་རིས་མེད་དོ། །མི་ཁོམ་<span class='add'>  པར་  </span>སྐྱེ་བ་མེད་དོ། །འཇིག་རྟེན་གྱི་ཁམས་བདེ་བ་ཅན་ན་སྣང་བའི་རིན་པོ་ཆེ་གང་ཡིན་<span class='add'>  པ་  </span>དེ་དག་ནི་འཇིག་རྟེན་ནི་མི་སྤྱོད་དོ། །ཀུན་དགའ་བོ་འཇིག་རྟེན་གྱི་ཁམས་བདེ་བ་ཅན་དེ་ནི་སྤོས་སྣ་\nཚོགས་དྲི་རབ་ཏུ་ཞི་མ་པའི་<span class='add'>  ངད་  </span>ལྡང་བའོ། །མེ་ཏོག་དང་འབྲས་བུ་སྣ་ཚོགས་འབྱོར་བའོ། །རིན་པོ་ཚེའི་ཤིང་ལྗོན་པས་ལེགས་པར་བརྒྱན་པའོ། །དེ་བཞིན་གཤེགས་པས་སྤྲུལ་པའི་བྱ་རྣམ་པ་སྣ་ཚོགས་སྒྲ་\nཡིད་དུ་འོང་བ་ཅན་གྱི་ཚོགས་ཀྱིས་བརྟན་པའོ། །ཀུན་དགའ་བོ་རིན་པོ་ཚེའི་ཤིང་ལྗོན་པ་དེ་དག་ནི་ཁ་དོག་ཐ་དད་པ། ཁ་དོག་དུ་མ་པ། ཁ་དོག་བརྒྱ་སྟོང་ཕྲག་དུ་མ་ཡོད་པའོ། །ཀུན་དགའ་བོ་དེ་ནི་རིན་པོ་\nཆེའི་ཤིང་ལྗོན་པ་གསེར་གྱི་ཁ་དོག་ལྟ་བུ་དང་། གསེར་གྱི་རང་བཞིན་དག་ཡོད་དོ། །དངུལ་གྱི་ཁ་དོག་ལྟ་བུ་དང་དངུལ་གྱི་རང་བཞིན་དག་ཡོད་དོ། །བཻ་དཱུརྻའི་ཁ་དོག་ལྟ་བུ་དང་བཻ་དཱུརྻའི་རང་བཞིན་དག་ཡོད་དོ། །\nཤེལ་གྱི་ཁ་དོག་ལྟ་བུ་དང་ཤེལ་གྱི་རང་བཞིན་དག་ཡོད་དོ། །སྤུག་གི་ཁ་དོག་ལྟ་བུ་དང་སྤུག་གི་རང་བཞིན་དག་ཡོད་དོ། །མུ་ཏིག་དམར་པོའི་ཁ་དོག་ལྟ་བུ་དང་མུ་ཏིག་དམ་པོའི་རང་བཞིན་དག་ཡོད་དོ། །རྡོའི་"
 ],
 [
  "78.297a",
  "བསྐྱོད་ན་དེ་དག་ལས་སྙན་ཅིང་ཡིད་དུ་འོང་བའི་སྒྲ་འབྱུང་སྟེ། མཉན་པ་དང་། འཐུན་ཞིང་མཉན་བས་ཆོག་མི་ཤེས་པའོ། །ཀུན་དགའ་བོ་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ནི་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་ཤིང་ལྗོན་\nཔ་རྣམ་པ་དེ་ལྟ་བུ་དག་གིས་གང་སྟེ། མཐའ་ནི་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་ཆུ་ཤིང་གི་སྡོང་པོ་དང་། རིན་པོ་ཆེའི་ཤིང་ཏ་ལའི་ཕྲེང་གིས་ཡོངས་སུ་བསྐོར་ཏོ། །ཐམས་ཅད་ཀྱང་གསེར་གྱི་<span class='add'>  དྲ་  </span>བས་ཁེབས་པའོ། །ཀུན་དུ་རིན་\nཔོ་ཆེ་སྣ་བདུན་གྱི་པད་མ་རྣམས་ཀྱིས་ཁེབས་པའོ། །དེ་ན་པད་མའི་ཚད་དཔག་ཚད་ཕྱེ་ཙམ་ཡང་ཡོད། དཔག་ཚད་ཀྱི་ཚད་ཙམ་ཡང་ཡོད། དཔག་ཚད་གཅིག་དང་། གཉིས་དང་། གསུམ་དང་། བཞི་དང་། \nལྔའི་ཚད་ཙམ་ཡང་ཡོད་དོ། །དཔག་ཚད་བཅུའི་བར་གྱི་ཚད་ཙམ་དག་ཀྱང་ཡོད་དོ། །རིན་པོ་ཆེའི་པད་མ་ཐམས་ཅད་ལས་ཀྱང་འོད་ཟེར་བྱེ་བ་སྟོང་ཕྲག་སུམ་བཅུ་རྩ་དྲུག་འབྱུང་ངོ་། །འོད་ཟེར་གྱི་རྩེ་མོ་\nཐམས་ཅད་ལས་ཀྱང་སངས་རྒྱས་ཀྱི་སྐུ་གསེར་གྱི་ཁ་དོག་ཅན་སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་བཅུ་རྩ་གཉིས་མདའ་བ་བྱེ་བ་ཕྲག་སུམ་བཅུ་རྩ་དྲུག་འབྱུང་སྟེ། དེ་དག་ཤར་ཕྱོགས་སུ་འཇིག་རྟེན་གྱི་ཁམས་གྲངས་\nམེད་དཔག་ཏུ་མེད་པ་དག་ཏུ་གཤེགས་ནས་སེམས་ཅན་རྣམས་ལ་ཆོས་སྟོན་ཏོ། །དེ་བཞིན་དུ་ལྷོ་དང་། ནུབ་དང་། བྱང་གི་ཕྱོགས་དང་། འོག་དང་། སྟེང་དང་། ཕྱོགས་མཚམས་རྣམས་སུ་འཇིག་རྟེན་གྱི་\nཁམས་ཐ་དད་པ་གྲངས་མེད་དཔག་ཏུ་མེད་པ་དག་ཏུ་གཤེགས་ནས་སེམས་ཅན་རྣམས་ལ་ཆོས་སྟོན་ཏོ། །ཀུན་དགའ་བོ་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན་རི་ནག་པོ་རྣམས་ཡེ་མེད་དོ། །རི་ཐམས་ཅད་ཀྱང་རིན་པོ་ཆེའི་རི་ཤ་\nསྟག་གོ །རིའི་རྒྱལ་པོ་རི་རབ་ཐམས་ཅད་དང་། ཁོར་ཡུག་དང་། རིའི་རྒྱལ་པོ་ཁོར་ཡུག་ཆེན་པོ་ཐམས་ཅད་དང་། རྒྱ་མཚོ་ཆེན་པོ་རྣམས་མེད་དོ། །སངས་རྒྱས་ཀྱི་ཞིང་དེ་ནི་ཀུན་དུ་མཉམ་པ། ཉམས་"
 ],
 [
  "78.297b",
  "དགའ་བ་ལག་མཐིལ་ལྟར་མཉམ་པ། ས་ཕྱོགས་རིན་པོ་ཆེ་རྣམ་པ་སྣ་ཚོགས་ཀྱིས་སྤྲས་པའོ། །དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་། བཅོམ་ལྡན་འདས་ལ་ཆེ་དང་ལྡན་<span class='add'>  པ་  </span>ཀུན་དགའ་བོས་འདི་སྐད་ཅེས་གསོལ་\nཏོ། །བཅོམ་ལྡན་འདས་རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷ་རི་རབ་ཀྱི་ངོས་ལ་གནས་པ་དང་། སུམ་བཅུ་རྩ་གསུམ་པའི་ལྷ་རི་རབ་ཀྱི་རྩེ་མོ་ལ་གནས་པ་དེ་དག་གང་ན་གནས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་\nཔ། ཀུན་དགའ་བོ་འདི་ཇི་སྙམ་དུ་སེམས། འདི་ནི་རིའི་རྒྱལ་པོ་རི་རབ་ཀྱི་གོང་མ་ཡང་འཐབ་བྲལ་གྱི་ལྷ་རྣམས་དང་། དགའ་ལྡན་དང་། འཕྲུལ་དགའ་དང་། གཞན་འཕྲུལ་དབང་བྱེད་དང་། ཚངས་རིས་དང་\nཚངས་པའི་འདུན་ན་འདོན་དང་། ཚངས་ཆེན་ནས་འོག་མིན་གྱི་བར་གྱི་ལྷ་རྣམས་གང་ན་གནས། གསོལ་པ། བཅོམ་ལྡན་འདས་ལས་ཀྱི་རྣམ་པར་སྨིན་པ་དང་། ལས་མངོན་<span class='add'>  པར་  </span>འདུ་བགྱིད་པ་བསམ་གྱིས་མི་\nཁྱབ་བོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་ལས་ཀྱི་རྣམ་པར་སྨིན་པ་དང་། ལས་མངོན་<span class='add'>  པར་  </span>འདུ་བྱེད་པ་བསམ་གྱིས་མི་ཁྱབ་པ་ནི་སྙེད་<span class='add'>  པར་  </span>རུང་གི །སངས་རྒྱས་བཅོམ་ལྡན་\nའདས་རྣམས་ཀྱི་དགེ་བ་དང་། རྫུ་འཕྲུལ་དང་། བྱིན་གྱི་བརླབས་བསམ་གྱིས་མི་ཁྱབ་པ་ནི་སུས་ཀྱང་མཐའ་འམ། ཚད་རྟོགས་པའམ། བསམ་<span class='add'>  པར་  </span>མི་ནུས་ཏེ། གཞན་དུ་ན་སངས་རྒྱས་ཀྱི་ཡུལ་\nབསམ་གྱིས་མི་ཁྱབ་བོ་ཞེས་རབ་ཏུ་འབྱེད་དོ། །དེ་ལྟར་སེམས་ཅན་བསོད་ནམས་བྱས་པ་དང་། དགེ་བའི་རྩ་བ་བསྐྱེད་པ་བསོད་ནམས་དང་། ཡེ་ཤེས་དང་། རྫུ་འཕྲུལ་དང་། འབྱོར་བ་བསམ་\nགྱི་མི་ཁྱབ་བ་དག །སངས་རྒྱས་ཀྱི་ཞིང་དེར་འབྱུང་ངོ། །གསོལ་པ། བཅོམ་ལྡན་འདས་བདག་ནི་དེ་ལ་དོགས་པའམ། ཡིད་གཉིས་སམ། ཐེ་ཙོམ་མ་མཆིས་ཏེ། བདག་ནི་མ་འོངས་"
 ],
 [
  "78.299b",
  "སྡུག་བསྔལ་དང་སྡུག་བསྔལ་གྱི་སྒྲ་ཡང་ལྟ་ག་ལ་ཡོད། ཀུན་དགའ་བོ་མདོར་བསྡུ་ན་རྣམ་གྲངས་འདིས་འཇིག་རྟེན་གྱི་ཁམས་བདེ་བ་ཅན་ཞེས་བྱ་སྟེ། རྒྱས་པར་ནི་མ་ཡིན་ནོ། །ཀུན་དགའ་བོ་རྒྱས་པར་བྱས་ན་བསྐལ་པ་\nའམ་སྐལ་པ་ལས་ལྷག་<span class='add'>  པ་ཟད་ཟད་  </span><span class='add'>    </span>དུ་འཇིག་རྟེན་གྱི་ཁམས་བདེ་བ་ཅན་གྱི་བདེ་བའི་རྒྱུ་ཡོངས་སུ་བརྗོད་ཀྱང་བདེ་བའི་རྒྱུ་དེ་དག་གི་མཐའ་རྟོགས་པར་མི་ནུས་སོ། །ཀུན་དགའ་བོ་འཇིག་རྟེན་གྱི་ཁམས་བདེ་བ་ཅན་དེར་སེམས་ཅན་གང་དག་\nསྐྱེས་པ་དང་། སྐྱེ་བ་དང་། སྐྱེ་བར་འགྱུར་བ་དེ་དག་ཐམས་ཅད་ཀྱང་གཟུགས་དང་། ཁ་དོག་དང་། སྟོབས་དང་། མཐུ་དང་། ཆུ་ཞེང་དང་། དབང་དང་། བསོད་ནམས་བསགས་པ་དང་། མངོན་<span class='add'>  པར་  </span>ཤེས་པ་དག་དང་། གོས་\nདང་། རྒྱན་དང་། བསྐྱེད་མོས་ཚལ་དང་། གཞལ་མེད་ཁང་དང་། <span class='add'>  ཁང་པ་  </span>བརྩེགས་པ་ཡོངས་སུ་སྤྱད་པ་རྣམ་པ་དེ་ལྟ་བུ་དག་དང་། གཟུགས་དང་། སྒྲ་དང་། དྲི་དང་། རོ་དང་། རེག་བྱ་ཡོངས་སུ་སྤྱད་པ་རྣམ་པ་དེ་ལྟ་བུ་དག་དང་། ལོངས་\nསྤྱོད་དང་ ཡོངས་སུ་སྤྱད་པ་རྣམ་<span class='add'>  པ་  </span>དེ་ལྟ་བུ་ཐམས་ཅད་དང་ལྡན་ཏེ། དཔེར་ན་གཞན་འཕྲུལ་དབང་བྱེད་ཀྱི་ལྷ་རྣམས་དང་འདྲའོ། ཀུན་དགའ་བོ་འཇིག་རྟེན་གྱི་ཁམས་བདེ་བ་ཅན་གྱི་སེམས་ཅན་དག་ཁམ་གྱིས་\nཟ་བ་རགས་པའི་ཁ་ཟས་མི་ཟའི། ཁ་ཟས་རྣམ་པ་ཇི་ལྟ་བུ་འདོད་པ་རྣམ་པ་དེ་ལྟ་བུ་འབྱོར་བ་ཉིད་དུ་ཤེས་ཏེ། ལུས་ཚིམ་<span class='add'>  པར་  </span>འགྱུར། ལུས་གཟུགས་ཚིམ་པར་འགྱུར་རོ། །དེ་དག་ཡང་ལུས་ལ་འཇུག་པར་མི་བྱེད་\nདོ། །དེ་དག་ལུས་ཚིམ་ནས་སྤོས་ཀྱི་རྣམ་པ་ཇི་ལྟ་བུ་འདོད་པ་དེ་ལྟ་བུའི་ལྷའི་སྤོས་ཀྱི་རྣམ་པ་དག་གིས་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་བདུགས་པར་འགྱུར་རོ། །དེ་ན་གང་དྲི་དེ་ལ་སྣོམ་<span class='add'>  པར་  </span>མི་འདོད་པ་དེ་ལ་སྤོས་དྲིའི་འདུ་ཤེས་\nདང་། བསྒོམ་པ་ཙམ་ཡང་འབྱུང་བར་མི་འགྱུར་རོ། །དེ་ལྟར་གང་དག་སྤོས་དང་། ཕྲེང་བ་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དང་། སིལ་<span class='add'>  སྙན་  </span>རྣམ་པ་ཇི་ལྟ་བུ་དག་འདོད་པ་དེ་"
 ],
 [
  "78.299a",
  "དུ་འོང་བའི་སྒྲ་འབྱུང་བ་གང་ཡིན་<span class='add'>  པ་  </span>དེས་སངས་རྒྱས་ཀྱི་ཞིང་དེར་ཐམས་ཅད་དང་ལྡན་<span class='add'>  པའི་  </span>འཁོར་ལ་གོ་བར་བྱེད་དོ། །དེ་ན་སེམས་ཅན་གང་དག་ཆ་དོགས་ན་འཁོད་པ་དག་སྒྲ་འདི་བདག་ཅག་གི་རྣ་\nབའི་དབང་པོ་ལ་གྲག་པར་མ་གྱུར་ཅིག་ཅེས་འདོད་ན་དེ་དག་གི་ལྷའི་དབང་པོ་ལ་གྲག་པར་མི་འགྱུར་རོ། །གང་སྒྲ་རྣམ་པ་ཇི་ལྟ་བུ་ཐོས་བར་འདོད་བ་དེ་རྣམ་པ་དེ་ལྟ་བུའི་སྒྲ་ཡིད་དུ་འོང་བ་ཐོས་སོ། །འདི་ལྟ་སྟེ། \nསངས་རྒྱས་ཀྱི་སྒྲ་དང་། ཆོས་ཀྱི་སྒྲ་དང་། དགེ་འདུན་གྱི་སྒྲ་དང་། ཕ་རོལ་དུ་ཕྱིན་པའི་སྒྲ་དང་། སའི་སྒྲ་དང་། སྟོབས་ཀྱི་སྒྲ་དང་། མི་འཇིགས་པའི་སྒྲ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པའི་སྒྲ་དང་། མངོན་པར་ཤེས་པའི་\nསྒྲ་དང་། སོ་སོ་ཡང་དག་རིག་པའི་སྒྲ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་འདུ་བྱ་བ་མེད་པ་དང་། མ་སྐྱེས་པ་དང་། མ་བྱུང་བ་དང་། དངོས་པོ་མེད་པ་དང་། འགག་པ་མེད་པའི་\nསྒྲ་དང་། ཞི་བ་དང་། རབ་ཏུ་ཞི་བ་དང་། ཉེ་བར་ཞི་བའི་སྒྲ་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། དགའ་བ་ཆེན་པོ་དང་། བཏང་སྙོམས་ཆེན་པོའི་སྒྲ་དང་། མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་དང་། དབང་བསྐུར་བའི་\nས་རབ་ཏུ་ཐོབ་པའི་སྒྲ་དག་ཐོས་སོ། །དེས་སྒྲ་རྣམ་པ་དེ་ལྟ་བུ་ཐོས་ནས་དགའ་བ་དང་། མཆོག་ཏུ་དགའ་བ་རྒྱ་ཆེན་པོ་ཐོབ་བོ། །དབེན་པ་དང་ལྡན་པ་དང་། འདོད་ཆགས་དང་བྲལ་བ་དང་ལྡན་<span class='add'>  པ་  </span>དང་། ཞི་བ་དང་ལྡན་<span class='add'>  པ་  </span>དང་། \nའགོག་པ་དང་ལྡན་<span class='add'>  པ་  </span>དང་། ཆོས་དང་ལྡན་<span class='add'>  པ་  </span>དང་། བྱང་ཆུབ་ཡོངས་སུ་འགྲུབ་པའི་དགེ་བའི་རྩ་བ་དང་ལྡན་པའི་སྒྲ་འབྱུང་ངོ་། །ཀུན་དགའ་བོ་འཇིག་རྟེན་གྱི་ཁམས་བདེ་བ་ཅན་ན་མི་དགེ་བའི་མིང་<span class='add'>  ཡོང་  </span>མེད་དོ། །སྒྲིབ་པའི་\nསྒྲ་<span class='add'>  ཡོང་  </span>མེད་དོ། །ངན་སོང་ངན་འགྲོ་རྣམ་པར་ལྟུང་བའི་སྒྲ་ཡང་<span class='add'>  ཡོང་  </span>མེད་དོ། །སྡུག་བསྔལ་གྱི་སྒྲ་ཡང་<span class='add'>  ཡོང་  </span>མེད་དོ། །ཀུན་དགའ་བོ་དོན་སྡུག་བསྔལ་ཡང་མེད། བདེ་བ་ཡང་མ་ཡིན་བའི་ཚོར་བའི་སྒྲ་ཡང་མེད་ན་"
 ],
 [
  "78.298a",
  "བའི་སེམས་ཅན་རྣམས་ཀྱི་དོགས་པའམ། ཡིད་གཉིས་དང་། ཐེ་ཙོམ་བསལ་བའི་སླད་དུ་དེ་བཞིན་གཤེགས་པ་ལ་དོན་འདི་ཡོངས་སུ་ཞུའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། \nཀུན་དགའ་བོ་ལེགས་སོ་ལེགས་སོ། །དེ་ལྟ་བུ་ནི་ཁྱོད་ཀྱི་བྱ་བ་ཡིན་ནོ། །ཀུན་དགའ་བོ་འཇིག་རྟེན་གྱི་ཁམས་བདེ་བ་ཅན་དེ་ན་ཆུ་ཀླུང་རྣམ་པ་སྣ་ཚོགས་དག་འབབ་སྟེ། དེ་ན་ཆུ་ཀླུང་ཆེན་པོ་ཁ་ཚོན་དཔག་ཚད་ཙམ་དག་\nཀྱང་ཡོད། དཔག་ཚད་བཅུ་དང་། ཉི་ཤུ་དང་། སུམ་བཅུ་དང་། བཞི་བཅུ་དང་། ལྔ་བཅུའི་བར་དང་། ཁ་ཚོན་དཔག་ཚད་བརྒྱ་སྟོང་གི་ཚད་ཙམ་དག་ཀྱང་ཡོད་དེ། ཟབས་སུ་ནི་དཔག་ཚད་བཅུ་གཉིས་བ་དག་ཡོད་\nདོ། །ཆུ་ཀླུང་དེ་དག་ཐམས་ཅད་ཀྱང་སྤོས་དྲི་རབ་ཏུ་ཞིམ་པ་སྣ་ཚོགས་ཀྱི་ཆུར་འབབ་ཅིང་རིན་པོ་ཆེའི་མེ་ཏོག་སིལ་མའི་ཚོགས་དགའ་འབབ་པ་དག་གོ །སྒྲ་དབྱངས་སྙན་<span class='add'>  པ་  </span>ཐ་དད་པ་སྣ་ཚོགས་དང་ཡང་ལྡན་པ་དག་གོ །\nཀུན་དགའ་བོ་ཆུ་ཀླུང་ཆེན་པོ་དེ་དག་ལས་ལྷའི་གླུ་དབྱངས་ཡན་ལག་བྱེ་བ་བརྒྱ་སྟོང་དང་ལྡན་བའི་སིལ་སྙན་དག་མཁས་པ་རྣམས་ཀྱིས་བྱས་པ་བས་ལྷག་པའི་སྒྲ་ཡིད་དུ་འོང་བར་འབྱུང་སྟེ། ཆུ་ཀླུང་ཆེན་པོ་དེ་དག་ལས་\nརྣམ་པ་འདི་ལྟ་བུའི་སྒྲ་འབྱུང་བ་ནི་ཟབ་པ་དང་། ཀུན་ཤེས་པར་བྱ་བ་དང་། རྣམ་པར་ཤེས་པར་བྱ་བ་དང་། བརྫུན་<span class='add'>  པ་  </span>མ་ཡིན་བ་དང་། རྣམ་པར་བདེ་བ་དང་། སྙིང་དུ་འོང་བ་དང་། དགའ་བར་བྱ་བ་དང་། སྙན་པ་\nདང་། ཡིད་དུ་འོང་བ་དང་། མཉན་པས་ཆོག་མི་ཤེས་པ་དང་། མཉན་པ་དང་འཐུན་པ་དང་། མི་རྟག་པ་དང་། ཞི་བ་དང་། བདག་མེད་ཅེས་བྱ་བ་དང་། མཉན་ན་བདེ་བ་སྟེ། དེ་དག་སེམས་ཅན་དེ་དག་གི་རྣ་བའི་\nདབང་པོ་ལ་གྲག་གོ །ཀུན་དགའ་བོ་ཆུ་ཀླུང་ཆེན་པོ་དེ་དག་ནི་འགྲམ་གཉིས་ནི་རིན་པོ་ཆེའི་སྤོས་ཀྱི་ཤིང་ལྗོན་པ་དག་གིས་གང་སྟེ། དེ་དག་ལ་ཡལ་ག་དང་། ལོ་མ་དང་། མེ་ཏོག་དང་། དོག་པ་སྣ་ཚོགས་འཕྱང་"
 ],
 [
  "78.298b",
  "ངོ་། དེ་ན་སེམས་ཅན་གང་དག་ཆུ་ཀླུང་གི་འགྲམ་དེ་དག་ཏུ་ཟང་ཟིང་མེད་པ་ལྷའི་དགའ་བ་དང་། རྩེ་བ་མྱོང་བར་འདོད་པ་དེ་དག་ཆུ་ཀླུང་དེ་དག་ཏུ་འཇུག་པའི་ཚེ་འདོད་ན་ཆུ་ལོང་བུ་ནུབ་ཙམ་དུ་གནས་སོ། །འདོད་ན་པོས་\nམོ་ནུབ་ཙམ་དང་། འདོད་ན་མཆན་ཁུང་ནུབ་ཙམ་དང་། འདོད་ན་མིང་པ་ནུབ་ཙམ་དུ་ཆུ་གནས་པར་གྱུར་ཏེ། ལྷའི་དགའ་བ་དག་ཀྱང་འབྱུང་ངོ་། །དེར་སེམས་ཅན་གང་དག་ཆུ་གྲང་བར་\nགྱུར་ཅིག་སྙམ་དུ་འདོད་ན་ཡང་དེ་དག་ལ་བསིལ་བར་འགྱུར་རོ། །གང་དག་དྲོ་བར་གྱུར་ཅིག་སྙམ་དུ་འདོད་ན་ཡང་དེ་དག་ལ་ལ་དྲོ་བར་འགྱུར་རོ། །གང་དག་བསལ་བ་དང་དྲོ་བར་གྱུར་ཅིག་སྙམ་དུ་འདོད་ན་ཡང་དེ་དག་ལ་ཆུ་དེ་\nབསིལ་བ་དང་དྲོ་བར་འགྱུར་ཏེ་བདེ་བར་འགྱུར་རོ། །ཆུ་ཀླུང་ཆེན་པོ་དེ་དག་ནི་ལྷའི་ཤིང་ཏ་མ་ལའི་ལོ་མ་དང་། ཨ་ག་རུ་དང་། དུས་ཀྱི་རྗེས་སུ་འབྲང་བ་དང་། རྒྱུ་སྤོས་དང་། ཙན་དན་སྤྲུལ་གྱི་སྙིང་པོ་དང་། སྤོས་མཆོག་\nགིས་བསྒོས་པའི་ཆུས་ཡོངས་སུ་གང་སྟེ་འབབ་པ་ལྷའི་མེ་ཏོག་ཨུད་པ་ལ་དང་། པད་མ་དང་། ཀུ་མུ་ད་དང་། པད་མ་དཀར་པོ་དང་། དྲི་རབ་ཏུ་ཞིམ་པ་དག་གི་མེ་ཏོག་གིས་ཁེབས་པ། ཁོལ་ཁོལ་དག་ན་བྱ་ངང་པ་དང་། \nགཞན་དང་། ཁྲུང་ཁྲུང་དང་། ངུར་བ་དང་། ཀ་རན་ད་བ་དང་། ནེ་ཙོ་དང་། རི་སྐེགས་དང་། ཁུ་བྱུག་དང་། <span class='add'>  ཀུ་ན་  </span>ལ་དང་། ཀ་ལ་པིང་ཀ་དང་། རྨ་བྱ་ལ་སོགས་པ་སྒྲ་ཡིད་དུ་འོང་བ་དང་ལྡན་བ་། དེ་བཞིན་གཤེགས་པས་\nསྤྲུལ་པའི་བྱའི་ཚོགས་བསྟེན་པ། ངང་པ་དང་། ངང་པའི་རྒྱལ་པོ་རྣམས་ཀྱིས་མཛེས་པར་བྱས་པ། འབབ་སྟེགས་བདེ་བ། འདམ་རྫ་བ་མེད་པ་གསེར་གྱི་བྱེ་མ་བདལ་བ་དག་གོ །དེ་ན་གང་གི་ཚེ་སེམས་ཅན་\nདེ་དག་བདག་ཅག་གི་བསམ་པ་འདི་འདྲ་བ་ཡོངས་སུ་རྫོགས་པར་གྱུར་ཅིག་སྙམ་དུ་འདོད་པ་དེའི་ཚེ་དེ་དག་གི་བསམ་པ་དེ་ལྟ་བུ་དག་ཆོས་དང་ལྡན་བར་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ། །ཀུན་དགའ་བོ་ཆུ་དེ་ལས་ཡིད་"
 ],
 [
  "78.300b",
  "ལྷན་ནེ་མ་ཡིན་། ལྷང་དེ་མ་ཡིན་ཞིང་མི་འཇིགས་པ་མ་ཡིན་ལ་འོད་གསལ་བ་མ་ཡིན་ནོ། །དེ་བཞིན་དུ་གཞན་འཕྲུལ་དབང་བྱེད་ཀྱི་ལྷ་རྣམས་ཀྱི་མདུན་ན་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་ཡང་འདི་ལྟ་སྟེ། བསྐྱེད་མོས་ཚལ་དང་། གཞལ་\nམེད་ཁང་དང་། གོས་དང་། རྒྱན་དང་། དབང་དང་། རྫུ་འཕྲུལ་དང་། ཆོ་འཕྲུལ་དང་། དབང་ཕྱུག་གིས་ལམ་མེ་མ་ཡིན། ལྷན་ནེ་མ་ཡིན་ ལྷང་དེ་མ་ཡིན་ཏེ། ཆོས་མངོན་པར་རྟོགས་པ་དང་། ཆོས་ལ་ཡོངས་སུ་སྤྱོད་པ་\nནི་མ་གཏོགས་སོ། །ཀུན་དགའ་བོ་དེ་ལ་གཞན་འཕྲུལ་དབང་བྱེད་ཀྱི་ལྷ་རྣམས་རྣམས་ཅི་འདྲ་བ་དེ་འདྲ་བར་བདེ་བ་ཅན་གྱི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་མི་རྣམས་བལྟ་བར་བྱའོ། །ཀུན་དགའ་བོ་འཇིག་རྟེན་གྱི་ཁམས་བདེ་བ་ཅན་དེ་ན་\nསྔ་དྲོའི་དུས་ཉེ་བར་གནས་པའི་ཚེ་ཕྱོགས་བཞི་ཀུན་ནས་འཁྲུགས་ཤིང་ཀུན་དུ་འཁྲུགས་པའི་རླུང་ལྡང་སྟེ། དེ་དག་གིས་རིན་པོ་ཆེའི་ཤིང་ལྗོན་པ་བཀྲ་བ། བལྟ་ན་སྡུག་པ། ཁ་དོག་ཐ་དད་པ། ཁ་དོག་དུ་མ་ཡོད་\nཔ། ལྷའི་སྤོས་དྲི་རབ་ཏུ་ཞིམ་པ་སྣ་ཚོགས་ཀྱིས་བསྒོས་པ་དེ་དག་བསྐྱོད། ཀུན་དུ་བསྐྱོད། བསྒུལ་ཀུན་དུ་བསྒུལ་ནས་དེ་དག་ལས་མེ་ཏོག་རྣམ་པ་མང་པོའི་དྲི་ཡིད་དུ་འོང་བའི་བསུང་ཅན་བལྟ་ན་སྡུག་པ་དག་\nརིན་པོ་ཆེའི་ས་ཆེན་པོ་དེ་ལ་འབྲུལ་ཏེ། མེ་ཏོག་དེ་དག་གིས་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ཀུན་དུ་མི་འགྲེང་བདུན་སྲིད་ཙམ་དུ་བཀྲམ་པར་འགྱུར་རོ། །འདི་ལྟ་སྟེ། དཔེར་ན་སྐྱེས་བུ་ས་ལ་མེ་ཏོག་འགྲེམས་\nམཁས་པ་ཞིག་གིས་ལག་པ་གཉིས་བཀྲམ་སྟེ། མཉམ་<span class='add'>  པར་  </span>བཀོད་ན་ཤིན་དུ་བཀྲ་ཞིང་བལྟ་ན་སྡུག་གོ །དེ་བཞིན་དུ་མེ་ཏོག་བསུང་དང་། བདོག་ཐ་དད་པ་དང་ལྡན་<span class='add'>  པ་  </span>དེ་དག་གིས་སངས་རྒྱས་ཀྱི་\nཞིང་དེ་ཀུན་དུ་མི་འགྲེང་བདུན་ཙམ་ཁྱབ་པར་འགྱུར་རོ། །མེ་ཏོག་གི་རྣམ་པ་དེ་དག་ནི་འཇམ་པ་སྟེ། དཔེ་ཙམ་དུ་ན་གོས་ཀ་ཙ་ལིན་དེ་ལྟར་རེག་ན་བདེ་བའོ། །དེ་དག་ནི་རྐང་པ་འཇོག་པ་ན་སོར་བཞི་"
 ],
 [
  "78.301a",
  "ཙམ་གྱིས་དམའ་བར་འགྱུར་ཞིང་རྐང་པ་འདེག་པ་ན་སོར་བཞི་ཙམ་གྱིས་མཐོ་བར་འགྱུར་རོ། །སྔ་དྲོའི་དུས་འདས་ནས་ནི་མེ་ཏོག་དེ་དག་ཀྱང་མ་ལུས་པ་མེད་པར་འགྱུར་ཏེ། །དེའི་\nའོག་ཏུ་སངས་རྒྱས་ཀྱི་ཞིང་དེ་དབེན་པ་དང་། ཉམས་དགའ་བད་ང་། དག་པར་འགྱུར་ཞིང་མེ་ཏོག་སྔ་མ་རྣམས་ཀྱིས་<span class='add'>  བརྙོགས་  </span><span class='add'>    </span>པ་མེད་པར་འགྱུར་རོ། །དེ་ནས་ཡང་ཕྱོགས་བཞི་ཀུན་ནས་རླུང་ལངས་\nཏེ། གང་སྔོན་མ་བྱུང་བའི་མེ་ཏོག་སར་པ་དག་མངོན་<span class='add'>  པར་  </span>མཐོར་རོ། །སྔ་དྲོ་ཇི་ལྟ་བར་ཉི་མའི་གུང་དང་། ཕྱི་དྲོའི་དུས་ཀྱི་ཚེ་དང་། མཚན་མོ་དང་། སྲོང་དང་། ནམ་གྱི་གུད་དང་། ཐོ་\nརངས་ཀྱང་དེ་བཞིན་ནོ། །སྤོས་དྲི་སྣ་ཚོགས་ཀྱིས་བསྒོས་པའི་རླུང་དེ་དག་ལངས་ནས་སེམས་ཅན་དེ་དག་ལ་རེག་ན་འདི་ལྟ་སྟེ། དཔེར་ན་དགེ་སློང་འགོག་པ་སྙོམས་པར་ཞུགས་པ་ལྟ་བུའི་\nབདེ་བ་དང་ལྡན་<span class='add'>  པར་  </span>འགྱུར་རོ། །ཀུན་དགའ་བོ་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན་དེ་བཞིན་གཤེགས་པས་བསྙད་<span class='add'>  པ་  </span>མ་གཏོགས་པར་མེད་དང་། ཉི་མ་དང་། ཟླ་བ་དང་། གཟའ་དང་། རྒྱུ་སྐར་དང་། \nསྐར་མའི་གཟུགས་དང་། མུན་པ་མུན་གནག་གི་མིང་དུ་གདགས་པ་ཡོད་མེད་དོ། །ཉིན་མོ་དང་། མཚན་མོ་གདགས་པ་ཡང་ཡོད་མེད་དོ། །ཁྱིམ་ཡོངས་སུ་འཛིན་པའི་འདུ་ཤེས་ཀྱང་\nམེད་དོ། །ཀུན་དགའ་བོ་འཇིག་རྟེན་གྱི་ཁམས་བདེ་བ་ཅན་དེ་ན་དུས་དུས་སུ་ལྷའི་སྤོས་ཆུའི་སྤྲིན་གྱི་ཆར་མངོན་བར་འབབ་བོ། །ལྷའི་མེ་ཏོག་ཁ་དོག་ཐམས་ཅད་དང་ལྡན་བ་དག་དང་། ལྷའི་རིན་\nཔོ་ཆེ་སྣ་བདུན་དང་། ལྷའི་ཙན་དན་གྱི་ཕྱེ་མ་དང་། ལྷའི་གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་གྱི་ཆར་མངོན་བར་འབབ་བོ། །ལྷའི་བླ་དེ་དག་ཀྱང་འཛིན་ཏོ། ལྷའི་རིན་པོ་ཆེའི་"
 ],
 [
  "78.302a",
  "གང་གིས་བདེ་བ་ཅན་གྱི་འཇིག་རྟེན་གྱི། མིང་ཐོས་པ་ཡི་བསོད་ནམས་དེ་ལ་ནི། ཞིང་མཆོག་ཐ་གྲུ་ཆེན་པོ་དེ་དག་ཀུན། ཆ་དང་དཔེར་ཡང་འགྱུར་བ་མ་ཡིན་ནོ། །གང་དག་རྒྱལ་བའི་བཀའ་དད་ཤེས་རབ་<span class='add'>  ཅན། །  </span>དེ་དག་དེ་བས་\nབསོད་ནམས་མང་དུ་འགྱུར། དོན་དམ་ཐོབ་ཕྱིར་དད་པ་རྩ་བ་སྟེ། དེ་ལྟ་བས་ན་ཐོས་ནས་ཡིད་གཉིས་སོལ། ཀུན་དགའ་བོ་འཇིག་རྟེན་གྱི་ཁམས་བདེ་བ་ཅན་གྱི་ཡོན་ཏན་དང་། བསྔགས་པ་དེ་ལྟར་དཔག་ཏུ་མེད་དོ། །ཀུན་དགའ་བོ་ཕྱོགས་བཅུའི་\nཕྱོགས་རེ་རེར་ཡང་སངས་རྒྱས་ཀྱི་ཞིང་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་ན་སངས་རྒྱས་བཅོམ་ལྡན་འདས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་འོད་དཔག་མེད་དེའི་མཚན་ཡོངས་སུ་བརྗོད་དོ། །བསྔགས་པ་གསུང་ངོ་། །གྲགས་པ་\nརབ་ཏུ་སྒྲོགས་སོ། །ཡོན་ཏན་བརྗོད་དོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། སེམས་ཅན་གང་དག་ཁ་ཅིག་གིས་བཅོམ་ལྡན་འདས་འོད་དཔག་མེད་དེའི་ཚན་ཐོས་ལ་ཐོས་ནས་ཀྱང་ཐ་ན་སེམས་བསྐྱེད་<span class='add'>  པ་  </span>གཅིག་ཙམ་ཞིག་བསམ་པ་ཐག་པ་ནས་དད་<span class='add'>  པ་  </span>དང་དགའ་བ་བསྐྱེད་པ་དེ་དག་\nཐམས་ཅད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པའི་ཕྱིར་རོ། །ཀུན་དགའ་བོ་སེམས་ཅན་གང་དག་ཁ་ཅིག་ནི་དེ་བཞིན་གཤེགས་པ་དེ་རྣམ་པས་ཡང་དང་ཡང་དུ་ཡིད་ལ་བྱེད་པ་དང་། དགེ་བའི་རྩ་བ་མང་པོ་དཔག་ཏུ་མེད་པ་བསྐྱེད་པ་དང་བྱང་ཆུབ་\nཏུ་སེམས་ཡོངས་སུ་བསྔོས་ཏེ། འཇིག་རྟེན་གྱི་ཁམས་དེར་<span class='add'>  སྐྱེ་  </span>བར་སྨོན་ལམ་འདེབས་པ་དེ་དག་འཆི་བའི་དུས་ཉེ་བར་གནས་པ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་དཔག་མེད་དེ་དགེ་སློང་གི་ཚོགས་དུ་མས་ཡོངས་སུ་བསྐོར་ཅིང་\nམདུན་གྱིས་བལྟས་ནས་བཞུགས་པར་གྱུར་ཏེ། དེ་དག་གིས་བཅོམ་ལྡན་འདས་འོད་དཔག་མེད་དེ་མཐོང་ནས་རབ་ཏུ་དང་བའི་སེམས་ཀྱིས་ཤི་འཕོས་ཏེ། འཇིག་རྟེན་གྱི་ཁམས་བདེ་བ་ཅན་དེ་ཉིད་དུ་སྐྱེ་བར་འགྱུར་རོ། །ཀུན་དགའ་བོ་རིགས་ཀྱི་བུ་འམ་རིགས་ཀྱི་བུ་མོ་\nགང་ལ་ལ་དག་གིས་ཚེ་འདི་ཉིད་ལ་དེ་བཞིན་གཤེགས་པ་འོད་དཔག་མེད་མཐོང་ཡང་ཅི་མ་རུང་སྙམ་དུ་སེམས་བ་དེས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ལ། ལྷག་པའི་བསམ་པའི་རྒྱུད་ཀྱིས་སངས་རྒྱས་ཀྱི་ཞིང་དེར་སྐྱེ་བར་བྱ་བྱའི་"
 ],
 [
  "78.302b",
  "ཕྱིར་སེམས་ཡང་དག་པར་བཏང་སྟེ། དགེ་བའི་རྩ་བ་རྣམས་བསྐྱེད་པར་བྱ་ཞིང་ཡོངས་སུ་བསྔོ་བར་བྱའོ། །ཀུན་དགའ་བོ་གང་དག་ཡང་དེ་བཞིན་གཤེགས་པ་དེ་ཡང་ཡིད་ལ་བྱེད་ཅིང་དགེ་བའི་རྩ་བ་མང་པོ་དཔག་ཏུ་མེད་པ་རྒྱུན་ཏུ་བསྐྱེད་ལ། སངས་རྒྱས་ཀྱི་\nཞིང་དེར་སེམས་ཡང་དག་པར་གཏོང་བ་དེ་དག་འཆི་བའི་དུས་ཉེ་བར་གནས་པ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་དཔག་ཏུ་མེད་པ་དེའི་ཁ་དོག་དང་། དབྱིབས་དང་། ཆུ་ཞེང་དང་། ཞབས་འབྲིང་བ་དགེ་\n<span class='add'>  སློང་  </span>གི་དགེ་འདུན་ཅི་འདྲ་བ་དེ་འདྲ་བའི་སངས་རྒྱས་ཀྱི་སྤྲུལ་<span class='add'>  པ་  </span>དག་མདུན་དུ་གནས་པར་འགྱུར་ཏེ། དེ་དག་དེ་བཞིན་གཤེགས་པ་མཐོང་བས་རབ་ཏུ་དད་<span class='add'>  བ་  </span>ལ། དམིགས་པའི་ཏིང་ངེ་འཛིན་དེ་དང་། རྗེད་པ་མེད་པའི་དྲན་པས་ཤི་འཕོས་ནས་སངས་\nརྒྱས་ཀྱི་ཞིང་དེ་ཉིད་དུ་སྐྱེ་བར་འགྱུར་རོ། །ཀུན་དགའ་བོ་སེམས་ཅན་གང་དག་དེ་བཞིན་གཤེགས་པ་དེ་ཐ་ན་སེམས་བསྐྱེད་པ་གཅིག་ཙམ་རྗེས་སུ་དྲན་<span class='add'>  པར་  </span>བྱེད་ཅིང་སངས་རྒྱས་ཀྱི་ཞིང་དེར་སྐྱེ་བར་ཡང་འདོད་ལ། ཆོས་ཟབ་མོ་དག་འཆད་པ་ན་\nདཀའ་བ་འཐོབ་ཅིང་སྒྱིད་ལུག་པ་མེད་ལ་མི་<span class='add'>  འགོང་  </span>མི་ཞུམ་ཞིང་ཐ་ན་སེམས་བསྐྱེད་པ་གཅིག་ཙམ་དེ་བཞིན་གཤེགས་པ་འོད་དཔག་མེད་དེ་ཡིད་ལ་བྱེད་དེ། འདོད་པ་ཡང་སྐྱེད་ན་དེ་དག་རྨི་ལམ་ན་དེ་བཞིན་གཤེགས་པ་འོད་དཔག་མེད་དེ་མཐོང་ཞིང་\nའཇིག་རྟེན་གྱི་ཁམས་བདེ་བ་ཅན་དེར་སྐྱེ་བར་འགྱུར། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་ཡང་འགྱུར་རོ། །ཀུན་དགའ་བོ་དེ་བཞིན་གཤེགས་པ་དེ་དག་གྱི་དབང་དེ་གཟིགས་ནས་ཕྱོགས་བཅུའི་\nའཇིག་རྟེན་གྱི་ཁམས་གྲངས་མེད་དཔག་ཏུ་མེད་པ་དག་ན་དེ་བཞིན་གཤེགས་པ་འོད་དཔག་མེད་དེའི་མཚན་ཡང་ཡོངས་སུ་བརྗོད། བསྔགས་པ་ཡང་གསུང་བསྟོད་པ་ཡང་སྒྲོགས་སོ། །ཀུན་དགའ་བོ་ཕྱོགས་བཅུའི་ཕྱོགས་རེ་རེ་\nནས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་དེ་བཞིན་གཤེགས་པ་འོད་དཔག་མེད་ལ་བལྟ་བ་དང་། ཕྱག་བྱ་བ་དང་། བསྙེན་བཀུར་བྱ་བ་དང་། ཡོངས་སུ་དྲི་བར་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་དེ་དང་།"
 ],
 [
  "78.301b",
  "གདུགས་རྔ་མའི་བསིལ་ཡབ་དང་བཅས་པ་དག་ཀྱང་ནམ་མཁའ་ལ་འཛིན་ཏོ། །ལྷའི་རོལ་མོའི་དབྱངས་སྒྲ་དག་ཀྱང་སྒྲོགས་ཤིང་ལྷའི་བུ་མོ་དག་ཀྱང་གར་བྱེད་དོ། །ཀུན་དགའ་བོ་སངས་རྒྱས་ཀྱི་ཞིང་\nདེར་སེམས་ཅན་གང་དག་སྐྱེས་པ་དང་། སྐྱེ་བར་འགྱུར་བ་དེ་དག་ཐམས་ཅད་མྱ་ངན་ལས་འདས་ཀྱི་བར་དུ་ཡང་དག་པ་ཉིད་དུ་ངེས་པར་འགྱུར་རོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟ་སྟེ། མ་ངེས་པ་དང་། \nལོག་པ་ཉིད་དུ་ངེས་པ་ཕུང་པོ་གཉིས་རྣམ་པར་གཞག་པའམ་གདགས་པ་མེད་པའི་ཕྱིར་རོ། །ཀུན་དགའ་བོ་མདོར་བསྡུ་ན་རྣམ་གྲངས་འདིས་འཇིག་རྟེན་གྱི་ཁམས་བདེ་བ་ཅན་ཞེས་བྱ་སྟེ་རྒྱས་པར་ནི་མ་\nཡིན་ནོ། །ཀུན་དགའ་བོ་རྒྱས་པར་བསྟན་ན་ནི་བསྐལ་པ་<span class='add'>  ཟད་  </span>ཟད་དུ་འཇིག་རྟེན་གྱི་ཁམས་བདེ་བ་ཅན་གྱི་བདེ་བའི་རྒྱུ་རྣམས་ཡོངས་སུ་བརྗོད་ཀྱང་བདེ་བའི་རྒྱུ་དེ་དག་གི་མཐའ་རྟོགས་པར་མི་ནུས་\nསོ། །དེ་ནས་དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱིས་ཚིགས་སུ་བཅད་པ་འདི་དག་བཀའ་སྩལ་ཏོ། །སེམས་ཅན་ཐམས་ཅད་བདེ་བར་གཤེགས་གྱུར་ལ། དམ་པའི་<span class='add'>  དོན་  </span>མཁས་ཡེ་ཤེས་རྣམ་དག་སྟེ། དེ་དག་བསྐལ་པ་འམ་འོན་ཏེ་ལྷག་པར་ནི། \nབདེ་བ་ཅན་གྱི་བསྔགས་པ་རབ་བརྗོད་ཀྱང་། བསྔགས་པའི་ཕྲེང་བ་རབ་ཏུ་བརྗོད་པ་ན། བསྐལ་པ་བྱེ་བ་དེ་དག་ཟད་འགྱུར་གྱི། བདེ་བ་ཅན་གྱི་བསྔགས་པ་མཐར་མི་ཕྱིན། དེ་དག་སྤོབས་པ་འང་ཟད་པར་འགྱུར་མ་ཡིན། གང་གིས་ཕྲ་རབ་རྡུལ་སྙེད་\nའཇིག་རྟེན་ཁམས། བཤིག་ཅིང་བཏགས་ཏེ་རྡུལ་དུ་བྱས་གྱུར་པ། དེ་བས་མང་བའི་འཇིག་རྟེན་ཁམས་ཀྱི་རྣམས། རིན་ཆེན་བཀང་སྟེ་སྦྱིན་པ་བྱིན་བས་ནི། གང་གིས་དཔག་ཏུ་མེད་པའི་འོད་མཚན་དང་། བདེ་བ་ཅན་གྱི་ཡོན་ཏན་བྱང་འཕགས་<span class='add'>  རྣམས། །  </span>\nཐོས་ནས་དགའ་སྟེ་ཐལ་མོ་སྦྱོར་བྱེད་པ། བསོད་ནམས་འདི་ཡི་ཆར་ཡང་འགྱུར་མ་ཡིན། དེ་ལྟ་བས་ན་དེ་བཞིན་གཤེགས་པ་དེའི་། ཡོན་ཏན་ཐོས་ནས་མགུ་<span class='add'>  དང་དད་  </span><span class='add'>    </span>སྐྱེད་ལ། བདེ་བ་ཅན་གྱི་འཇིག་རྟེན་ཁམས་<span class='add'>  མཆོག་  </span>ཏུ། འགྲོ་བར་བྱ་ཕྱིར་མོས་པ་དྲག་པོ་བསྐྱེད།"
 ],
 [
  "78.303b",
  "རྨི་ལམ་ལྟ་བུའི་ཞིང་ནི་ཅི་འདྲ་ལྟོས། འོད་ནི་དཔག་མེད་གཟི་བརྗིད་དཔག་མེད་པ། སྐུ་ཚེ་དཔག་མེད་དགེ་འདུན་དམག་མེད་པ། བྱང་ཆུབ་སེམས་དཔས་བསྐོར་ཅིང་མཛེས་གྱུར་པ། སངས་རྒྱས་བསོད་ནམས་ཕུང་པོ་མཆོག་ལ་ལྟོས། དེ་ནས་ཚེ་དཔག་མེད་\nཀྱིས་མཛུམ་མཛད་ནས། འོད་འཕྲོ་བྱེ་བ་ཁྲག་ཁྲིག་སུམ་བཅུ་དྲུག །དེ་དག་ཞལ་གྱི་དཀྱིལ་འཁོར་ནས་ཕྱུང་སྟེ། ཞིང་སྟོང་བྱེ་བ་དག་ནི་ཁྱབ་པར་མཛད་། འོད་འཕྲོ་དེ་དག་ཐམས་ཅད་སླར་ལོག་སྟེ། འདྲེན་པའི་སྤྱི་གཙུག་དེར་ནི་\nནུབ་པར་འགྱུར། དེ་ཚེ་འོད་འཕྲོ་ནུབ་པར་གྱུར་ནས་ནི། ལྷ་དང་མི་རྣམས་དགའ་<span class='add'>  བ་  </span>རབ་ཏུ་སྐྱེད། དེ་ནས་སངས་རྒྱས་སྲས་པོ་གྲགས་ཆེན་པོ། སྤྱན་རས་གཟིགས་ཀྱི་དབང་ཕྱུག་དེ་ལངས་ཏེ། གང་སླད་འཇིག་རྟེན་མགོན་པོ་འཛུམ་མཛད་པ། \nབཅོམ་ལྡན་འདས་དེ་ཡི་རྒྱུ་དང་རྐྱེན་གང་ལགས། སེམས་ཅན་མང་འགྲོ་ལ་ཕན་པ་ཐུགས་བརྩེ་ཅན། དོན་དམ་མཁས་པ་དེ་ནི་ལུང་བསྟན་གསོལ། གསུང་མཆོག་ཡིད་དུ་མཆི་བ་དེ་ཐོས་ན་སེམས་ཅན་དག་ནི་དགའ་བའི་སེམས་སུ་\nའགྱུར། འཇིག་རྟེན་ཁམས་མང་བྱང་ཆུབ་སེམས་དཔའ་དག །སངས་རྒྱས་བལྟ་སླད་བདེ་ཅན་འདིར་མཆི་བ། དེ་དག་ཐོས་ན་དགའ་བ་ཆེར་སྐྱེད་དེ། མྱུར་དུ་ཞིང་འདི་རྣམ་པར་ལྟ་བར་འགྱུར། རྒྱ་ཆེན་ཞིང་འདི་ལྷགས་པར་གྱུར་ནས་\nཀྱང་། ལྷ་ཡི་མིག་དང་ལྷ་ཡི་རྣ་བ་དང་། ཚེ་རབས་དྲན་དང་བློ་གྲོས་མཁས་མཆོག་དང་། རྫུ་འཕྲུལ་སྟོབས་ཀྱང་མྱུར་དུ་ཐོབ་པར་འགྱུར། སངས་རྒྱས་ཚེ་དཔག་མེད་ཀྱིས་ལུང་བསྟན་པ། ངས་ནི་སྔོན་ཚེ་སྨོན་ལམ་འདི་སྐད་བཏབ། སེམས་ཅན་དག་\nགིས་ང་ཡི་མིང་ཐོས་ན། ང་ཡི་ཞིང་དུ་རྟག་ཏུ་འོང་བར་ཤོག །ང་ཡི་སྨོན་ལམ་བཟང་པོ་དེ་རྫོགས་པས། འཇིག་རྟེན་ཁམས་མང་དག་ནས་སེམས་ཅན་འོང་། དེ་དག་ང་གི་ཞིང་དུ་ལྷགས་ནས་ནི། དེ་དག་སྐྱེ་བ་གཅིག་ལས་ཕྱིར་མི་ལྡོག །དེ་ཕྱིར་བྱང་\nཆུབ་སེམས་དཔའ་གང་ཞིག་འདིར། བདག་གི་ཞིང་ཡང་འདི་འདྲར་འགྱུར་པ་དང་། བདག་གི་མིང་དང་སྒྲ་དང་ལྟ་བས་ཀྱང་། སེམས་ཅན་མང་པོ་དགྲོལ་བར་བྱ་འདོད་པ། དེ་ནི་མྱུར་དུ་རིངས་པར་ལ་གོར་དུ། བདེ་བ་ཅན་གྱི་འཇིག་རྟེན་ཁམས་སོ། ང་ལ་"
 ],
 [
  "78.304a",
  "འོད་དཔག་མེད་ཀྱི་གན་དུ་སོང་ནས་ནི། སངས་རྒྱས་བྱེ་བ་སྟོང་ལ་མཆོད་པ་གྱིས། རྫུ་འཕྲུལ་སྟོབས་ཀྱིས་ཞིང་མང་སོད་ནས་ནི། །སངས་རྒྱས་བྱེ་བ་མང་ལ་མཆོད་བྱས་ཏེ། བདེ་བར་གཤེགས་ལ་མཆོད་པ་བྱས་ནས་ཀྱང་། དྲོ་ཁར་\nབདེ་བ་ཅན་དུ་སླར་ཡང་འོང་། །། །།བམ་པོ་གསུམ་པ། ཀུན་དགའ་བོ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་དཔག་མེད་དེའི་བྱང་ཆུབ་ཀྱི་ཤིང་ནི་འཕང་དུ་དཔག་ཚད་སྟོང་དྲུག་\nབརྒྱ་ཡོད་པ། ཡལ་ག་དང་། ལོ་མ་དང་། འདབ་མ་དཔག་ཚད་བརྒྱད་བརྒྱ་ཚུན་ཚད་དུ་འཕྱང་བ། རྩ་བའི་སྦོམས་དང་། ཁྲུན་དཔག་ཚད་ལྔ་བརྒྱ་ཡོད་པ། རྟག་ཏུ་ལོ་མ་ཆགས་པ། རྟག་ཏུ་མེ་ཏོག་ཆགས་པ། རྟག་ཏུ་འབྲས་བུ་ཆགས་པ། ཁ་\nདོག་ཐ་དད་པ། ཁ་དོག་བརྒྱ་<span class='add'>  སྟོང་  </span>དུ་མ་ཡོད་པ། ལོ་མ་ཐ་དད་པ། མེ་ཏོག་ཐ་དད་པ། འབྲས་བུ་ཐ་དད་པ། རྒྱན་སྣ་ཚོགས་ཀྱིས་བརྒྱན་པ་། ཟླ་བ་ལྟ་བུར་སྣང་བའི་ནོར་བུ་རིན་པོ་ཆེས་ཡོངས་སུ་གསལ་པ། བརྒྱ་བྱིན་ཐོགས་པའི་ནོར་བུ་རིན་པོ་\nཆེས་རྣམ་པར་སྤྲས་པ། ཡིད་བཞིན་གྱི་ནོར་བུ་རིན་པོ་ཆེས་གང་བ། རྒྱ་མཚོའི་ནོར་བུ་རིན་པོ་ཆེ་མཆོག་གིས་ཤིན་ཏུ་རྣམ་པར་སྤྲས་པ། ཁ་དོག་ལྷའི་ལས་འདས་པ། གསེར་གྱི་སྐུད་པ་འཕྱང་བ། སེ་མོ་དོ་མཛེས་པ་དང་། རིན་པོ་ཆེའི་ཆུན་པོ་དང་། \nརྒྱན་ཕྲེང་དང་དོ་ཤལ་ཆིག་ཀྱང་དང་། མུ་ཏིག་དམར་པོའི་རྒྱན་ཕྲེང་དང་། མུ་ཏིག་སྔོན་པོའི་རྒྱན་ཕྲེང་དང་། སེང་གེའི་ཁ་ནས་འཕྱང་བའི་སྐ་རགས་ཀྱི་ཚོགས་ཡོད་པ། རིན་པོ་<span class='add'>  ཆེའི་  </span>སྐུད་པ་དང་། རིན་པོ་ཆེ་ཐམས་ཅད་དང་། དུད་གིས་མངོན་\nཔར་སྤྲས་པ། གསེར་གྱི་དྲ་<span class='add'>  བ་  </span>དང་། མུ་ཏིག་གི་དྲ་བ་དང།་ རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་དྲ་བ་དང།་ དྲིལ་བུ་གཡེར་ཀའི་དྲ་བས་བླ་རེ་བྲེས་པ། ཆུ་སྲིན་དང་། བཀྲ་ཤིས་དང་། གཡུང་དྲུང་འཁྱིལ་པ་དང་། ཟླ་གམ་ལྟ་བུས་ལེགས་\nཔར་བརྒྱན་པ། ནོར་བུ་འཁྲོལ་བ་དང་། གསེར་དང་། རིན་པོ་ཆེའི་རྒྱན་ཐམས་ཅད་ཀྱིས་བརྒྱན་པ། སེམས་ཅན་གྱི་བསམ་པའི་རྣམ་པར་རིག་པ་ཇི་ལྟ་བ་བཞིན་དུ་ལེགས་<span class='add'>  པར་  </span>བརྒྱན་པའོ། །ཀུན་དགའ་བོ་བྱང་ཆུབ་ཀྱི་ཤིང་དེ་ནི་རླུང་གིས་"
 ],
 [
  "78.304b",
  "བསྐྱོད་པ་ན་སྒྲ་དབྱངས་འབྱུང་བ་གང་ཡིན་པ་དེས་འཇིག་རྟེན་གྱི་ཁམས་ཚད་མེད་པ་གོ་བར་བྱེད་དོ། །ཀུན་དགའ་བོ་དེ་ལ་བྱང་ཆུབ་ཀྱི་ཤིང་གི་སྒྲ་དེ་སེམས་ཅན་གང་དག་གི་རྣ་ལམ་དུ་གྲག་པ་དེ་དག་བྱང་ཆུབ་ཀྱི་མཐའི་བར་དུ་རྣ་ནད་ཀྱིས་མི་བཏབ་པར་ཤེས་\nཔར་བྱའོ། །སེམས་ཅན་དཔག་ཏུ་མེད། གྲངས་མེད་། བསམ་གྱི་མི་ཁྱབ། མཚུངས་པ་མེད། གཞལ་དུ་མེད། ཚད་མེད། བརྗོད་དུ་མེད་པ་གང་དག་གི་མིག་ལམ་དུ་བྱང་ཆུབ་ཀྱི་ཤིང་དེ་སྣང་བ་དེ་དག་བྱང་ཆུབ་ཀྱི་མཐའི་བར་དུ་མིག་ནད་ཀྱིས་མི་བཏབ་\nཔར་ཤེས་པར་བྱའོ། །ཀུན་དགའ་བོ་སེམས་ཅན་གང་དག་བྱང་ཆུབ་ཀྱི་ཤིང་དེའི་དྲི་ཚོར་བ་དེ་དག་ཀྱང་བྱང་ཆུབ་ཀྱི་མཐའི་བར་དུ་ནམ་ཡང་སྣ་ནད་ཀྱིས་མི་བཏབ་པར་ཤེས་པར་བྱའོ། །སེམས་ཅན་གང་དག་བྱང་ཆུབ་ཀྱི་ཤིང་དེའི་འབྲས་བུའི་རོ་མྱོང་བ་དེ་\nདག་ཀྱང་བྱང་ཆུབ་ཀྱི་མཐའི་བར་དུ་ནམ་ཡང་ལྕེ་ནད་ཀྱིས་མི་བཏབ་པར་ཤེས་པར་བྱའོ། བྱང་ཆུབ་ཀྱི་ཤིང་དེའི་འོད་ཀྱིས་སེམས་ཅན་གང་དག་ལ་ཁྱབ་པར་གྱུར་པ་དེ་དག་ཀྱང་བྱང་ཆུབ་ཀྱི་མཐའི་བར་དུ་ནམ་ཡང་ལུས་ལ་ནད་ཀྱིས་མི་བཏབ་པར་ཤེས་\nཔར་བྱའོ། །ཀུན་དགའ་བོ་སེམས་ཅན་གང་དག་བྱང་ཆུབ་ཀྱི་ཤིང་དེ་ཆོས་ཉིད་དུ་ངེས་པར་སེམས་བ་དེ་དག་ཀྱང་དེད་ནས་བཟུང་སྟེ། བྱང་ཆུབ་ཀྱི་མཐའི་བར་དུ་ནམ་ཡང་སེམས་མི་གཡེང་བར་ཤེས་པར་བྱའོ། །སེམས་ཅན་དེ་དག་ཐམས་ཅད་\nནི་བྱང་ཆུབ་ཀྱི་ཤིང་དེ་མཐོང་མ་ཐག་ཏུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་འགྱུར་རོ། །དེ་བཞིན་གཤེགས་པ་ཚེ་དཔག་མེད་ཀྱི་སྔོན་གྱི་སྨོན་ལམ་གྱི་བྱིན་གྱི་བརླབས་དང་། སྔོན་གྱི་རྒྱལ་བ་\nལ་ལྷག་པར་བྱ་བ་བྱས་པ་དང་། སྔོན་གྱི་སྨོན་ལམ་དང་། སྤྱོད་པ་ཤིན་དུ་རྫོགས་པ་དང་། ཤིན་དུ་བསྒོམས་པ་དང་། མི་ཉུང་བ་དང་། མ་<span class='add'>  ཚང་  </span>པ་མེད་པས་འདི་ལྟ་སྟེ། སྒྲའི་རྗེས་སུ་འགྲོ་བ་དང་། རྗེས་སུ་འཐུན་པ་དང་། \nམི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་དང་། བཟོད་པ་གསུམ་འཐོབ་བོ། །ཀུན་དགའ་བོ་བྱང་ཆུབ་སེམས་དཔའ་གང་དག་སངས་རྒྱས་ཀྱི་ཞིང་དེར་སྐྱེས་པ་དང་། སྐྱེ་བ་དང་། སྐྱེ་བར་འགྱུར་བ་དེ་དག་ཐམས་ཅད་སྐྱེ་བ་གཅིག་གིས་ཐོགས་པར་གྱུར་ནས་བླ་ན་མེད་པ་"
 ],
 [
  "78.306b",
  "མི་དགའ་བ་མི་བསྐྱེད་དོ། །འགྲོ་བ་ན་ཡང་ལྟོས་བ་མེད་པ་ཉིད་དུ་འགྲོའི་ལྟོས་བ་དང་བཅས་བར་མ་ཡིན་ནོ། །འདི་ལྟ་སྟེ། དངོས་པོ་ཡོངས་སུ་འཛིན་པ་དང་། གནས་ཀྱི་སེམས་དང་། སེམས་དེ་ལྟ་བུ་དགལ་ཡོད་མེད་<span class='add'>  དོ། །  </span>\nཀུན་དགའ་བོ་བྱང་ཆུབ་སེམས་དཔའ་གང་དག་འཇིག་རྟེན་གྱི་ཁམས་བདེ་བ་ཅན་དེར་སྐྱེས་པ་དེ་དག་ལ་གཞན་གྱི་འདུ་ཤེས་མེད། རང་གི་འདུ་ཤེས་མེད། བདག་གི་འདུ་ཤེས་མེད། འཐབ་པ་མེད། རྩོད་པ་མེད། མི་འཐུན་པ་\nམེད། མི་མཉམ་བའི་སེམས་མེད་དེ། དེ་དག་ནི་སེམས་ཅན་ཐམས་ཅད་ལ་སེམས་མཉམ་པ་དང་། ཕན་པའི་སེམས་དང་། བྱམས་པའི་སེམས་དང་། མཉེན་པའི་སེམས་དང་། འཇམ་པའི་སེམས་དང་། དགེ་བའི་\nསེམས་དང་། རབ་ཏུ་དང་བའི་སེམས་དང་། བརྟན་པའི་སེམས་དང་། སྒྲིབ་པ་མེད་པའི་སེམས་དང་། འཁྲུགས་པ་མེད་པའི་སེམས་དང་། རྙོག་པ་མེད་པའི་སེམས་དང་། ཤེས་རབ་ཀྱི་ཕ་\nརོལ་དུ་ཕྱིན་པ་ལ་སྤྱད་པ་སྤྱོད་པའི་སེམས་དང་། སེམས་ཀྱི་རྒྱུད་སྒྱུ་མའི་རང་བཞིན་ལ་བློ་རབ་ཏུ་ཞུགས་པ། ཤེས་རབ་རྒྱ་མཚོ་ཆེན་པོ་དང་མཉམ་པ། བློ་རི་རབ་དང་མཚུངས་པ། ཡོན་ཏན་དུ་མ་བསགས་པ་\nབྱང་ཆུབ་ཀྱི་ཡན་ལག་ཡང་དག་པར་འགྲོ་བས་རྣམ་པར་རྩེན་པ། སངས་རྒྱས་ཡང་དག་པར་འགྲོ་བ་ལ་མངོན་བར་བརྩོན་པ། ཤའི་མིག་རབ་ཏུ་རྣམ་པར་འབྱེད་པ། ལྷའི་མིག་མངོན་བར་སྒྲུབ་པ། ཤེས་\nརབ་ཀྱི་མིག་རྟོགས་པར་ཁོང་དུ་ཆུད་པ། ཆོས་ཀྱི་མིག་གི་ཕ་རོལ་དུ་སོན་<span class='add'>  པ།   </span>སངས་རྒྱས་ཀྱི་སྤྱན་སྒྲུབ་ཅིང་འཆད་དེ་སྟོན་བརྒྱ་ཆེར་ཡང་དག་པར་རབ་ཏུ་སྟོན་ཅིང་ཆགས་པ་མེད་པའི་ཡེ་ཤེས་མངོན་བར་\nསྒྲུབ་པ། ཁམས་གསུམ་མཉམ་པ་ཉིད་དུ་མངོན་བར་བརྩོན་བ། སེམས་དུལ་བ། སེམས་ཞི་བ། ཆོས་ཐམས་ཅད་མི་དམིགས་པ་དང་ལྡན་བ། ཀུན་འབྱུང་བའི་ངེས་པའི་ཚིག་ལ་མཁས་པ། ཆོས་ཀྱི་ངེས་པའི་"
 ],
 [
  "78.303a",
  "སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་གྱི་རྒྱན་བཀོད་པ་ཕུན་སུམ་ཚོགས་པའི་ཁྱད་པར་དེ་དག་བལྟ་བའི་ཕྱིར་སངས་རྒྱས་ཀྱི་ཞིང་དེར་<span class='add'>  འདོང་ངོ་། །  </span><span class='add'>    </span>དེ་ནས་དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱིས་དོན་འདི་ཉིད་རྒྱས་པར་གསུང་ཞིང་ཚིགས་\nསུ་བཅད་པ་འདི་དག་བཀའ་སྩལ་པ། འདྲེན་པ་འོད་དཔག་མེད་ཀྱི་སངས་རྒྱས་ལ། ཕྱག་བྱའི་ཕྱིར་ནི་ཤར་གྱི་སངས་རྒྱས་ཞིང་། མཐའ་ཡས་གང་གཱའི་ཀླུང་གི་བྱེ་སྙེད་ནས། རྫོགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ལྷགས། དེ་\nདག་མེ་ཏོག་ཁ་དོག་ཐ་དད་པ། དྲི་ཞིམ་ཡིད་འོང་མང་མོ་སྙིམ་ཐོགས་ཏེ། ཚེ་དཔག་མེད་པ་ལྷ་དང་མིས་མཆོད་པ། མི་ཡི་འདྲེན་པ་མཆོག་ལ་རབ་ཏུ་འཐོར། འདྲེན་པ་འོད་དཔག་མེད་ཀྱིས་སངས་རྒྱས་ལ། ཕྱག་བྱ་བའི་ཕྱིར་ནི་དེ་བཞིན་\nལྷོ་ནུབ་དང་། བྱང་ཕྱོགས་སངས་རྒྱས་ཞིང་རྣམས་ཇི་སྙེད་ནས། རྫོགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ལྷགས། དེ་དག་སྤོས་ཀྱི་ཁ་དོག་ཐ་དད་པ། དྲི་ཞིམ་ཡིད་འོང་མང་པོ་སྙིམ་ཐོགས་ཏེ། ཚེ་དཔག་མེད་པ་ལྷ་དང་མིས་མཆོད་པ་། \nམི་ཡི་འདྲེན་པ་མཆོག་ལ་རབ་ཏུ་འཐོར། བྱང་ཆུབ་སེམས་དཔའ་མང་པོ་དེ་དག་གིས། མཆོད་པ་བྱས་ཏེ་དཔག་མེད་འོད་ཞབས་ལ། ཕྱག་འཚལ་བསྐོར་བ་བྱས་ནས་འདི་སྐད་དུ། སངས་རྒྱས་ཞིང་ནི་ངོ་མཚར་མཛེས་ཤེས་འཛེར། \nདགའ་ཞིང་མགུ་བའི་སེམས་ནི་གཞལ་ཡས་ཀྱིས། དེ་དག་གིས་ནི་མེ་ཏོག་སྙིམ་གཏོར་ནས། འདྲེན་པ་དེ་ཡི་སྤྱན་སྔར་འདི་སྐད་དུ། བདག་ཅག་ཞིང་ཡང་འདི་འདྲར་གྱུར་ཅེས་སྨྲས་། དེ་དག་མེ་ཏོག་སྙིམ་བ་གཏོར་མ་ཐག །དེ་ཚེ་\nདཔག་ཚད་བརྒྱ་པའི་གདུགས་གྱུར་ཏེ། ལེགས་པར་བརྒྱན་ཅིང་ཡུ་བ་བཀྲ་བས་མཛེས། སངས་རྒྱས་སྐུ་ལ་ཀུན་དུ་ཁེབས་བར་གནས། བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་དེ་བཞིན་དུ། བསྙེན་བཀུར་བྱས་ནས་དགའ་སྟེ་འདི་སྐད་དུ། \nགང་དག་གིས་ནི་མི་མཆོག་མཚན་ཐོས་པ། སེམས་ཅན་དེ་དག་རྙེད་པ་ལེགས་རྙེད་འཛེར། སངས་རྒྱས་ཞིང་འདི་བདག་ཅན་ལྷགས་པས་ན། བདག་ཅན་གིས་ནི་སྔོན་རྙེད་ལེགས་པར་རྙེད། བསྐལ་པ་སྟོང་དུ་སྟོན་པས་གང་བསྒྲུབས་པ།"
 ],
 [
  "78.307a",
  "ཚིག་དང་ལྡན་པ་། གསལ་བ་དང་མི་གསལ་བ་ལ་མཁས་པ། ཚུལ་དང་ཚུལ་མ་ཡིན་བའི་གནས་ལ་མཁས་པ་། འཇིག་རྟེན་བའི་གཏམ་ལ་མི་ལྟ་བར་གནས་པ། འཇིག་རྟེན་ལས་འདས་པའི་གཏམ་རྣམས་ཀྱིས་སྙིང་པོ་རྟོགས་\nཔ་ཆོས་ཐམས་ཅད་ཡོངས་སུ་ཚོལ་བ་ལ་མཁས་པ། ཆོས་ཐམས་ཅད་རང་བཞིན་གྱི་ཉེ་བར་ཞི་བར་ཤེས་པས་གནས་པ། དམིགས་པ་མེད་པའི་སྤྱོད་ཡུལ་བ་། ཅི་ཡང་མེད་པ། ལེན་པ་མེད་པ། སེམས་པ་མེད་པ། ཕུང་པོ་\nམེད་པ། ལེན་པ་མེད་བས་ཤིན་དུ་རྣམ་པར་གྲོལ་བ། ཉོན་མོངས་པ་མེད་བ། མངོན་བར་ཤེས་པ་རྣམས་ལ་ཐུག་པ་མེད་པར་གནས་པ། རྩ་བ་མེད་པ་ལ་གནས་པ། སེམས་ཆགས་པ་མེད་པ། ཞུམ་པ་མེད་པ། ཆོས་ཟབ་\nཔ་རྣམས་ལ་མངོན་བར་བརྩོན་པ། སྒྱིད་ལུག་པ་མེད་པ། སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་རྟོགས་བར་དཀའ་བལ་འཇུག་པས་འཕགས་པ་། བགྲོད་<span class='add'>  པ་  </span>གཅིག་པུའི་ལམ་རྗེས་སུ་ཐོབ་པ་ཐེ་ཙོམ་མེད་པ། དོགས་པ་ལས་རྒལ་བ། \nཤེས་པ་གཞན་གྱི་དྲི་ང་ལ་མི་འཇོག་པ། ལྷག་པའི་ང་རྒྱལ་མེད་པ། ཡེ་ཤེས་ཀྱིས་མངོན་བར་འཕགས་ཏེ་རི་རབ་དང་མཚུངས་པ། འཁྲུགས་པ་མེད་པའི་བློས་རྒྱ་མཚོ་དང་འདྲ་བ། ཤེས་རབ་ཀྱི་འོད་དང་། དཀར་ཞིང་\nཤིན་དུ་དཀར་ལ་དག་ཅིང་དགེ་བའི་སེམས་དང་། གསེར་བཙོ་མའི་ཁ་དོག་འདྲ་བར་སྣང་ཞིང་འོད་འབྱུང་བའི་ཡོན་ཏན་གྱི་མཆོག་གིས་ཉི་ཟླའི་འོད་ལས་ཤིན་དུ་འདས་བ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་དགེ་བ་དང་། མི་\nདགེ་བ་བཟོད་པས་ས་དང་མཚུངས་པ། ཉོན་མོངས་པའི་དྲི་མ་འཁྲུ་བར་འབབ་པས་ཆུ་དང་འདྲ་བ། ཆོས་ཐམས་ཅད་ལ་རློམ་སེམས་སུ་བྱེད་པ་དང་། ཉོན་མོངས་པ་སྲེག་པའི་ཕྱིར་མེའི་རྒྱལ་པོ་དང་མཚུངས་པ་། \nའཇིག་རྟེན་ཐམས་ཅད་ལ་མི་ཆགས་པའི་ཕྱིར་རླུང་དང་འདྲ་བ། ཆོས་ཐམས་ཅད་ངེས་པར་ཕིགས་པ་དང་། ཐམས་ཅད་དུ་ཅི་ཡང་མེད་པའི་ཕྱིར་ནམ་མཁའ་དང་མཚུངས་པ་། འཇིག་རྟེན་ཐམས་ཅད་ཀྱི་མི་གོས་"
 ],
 [
  "78.307b",
  "བའི་ཕྱིར་པད་མ་དང་འདྲ་བ། ཆོས་དང་ཆོས་མ་ཡིན་བ་ལ་མངོན་བར་སྒྲོགས་པས་དུས་ཀྱི་རྗེས་སུ་འབྲང་བའི་འབྲུག་ཆེན་པོ་དང་མཚུངས་པ། ཆོས་ཀྱི་ཆུའི་ཆར་མངོན་བར་འབེབས་བས་ཆར་བ་ཆེན་པོ་དང་འདྲ་བ་ཚོགས་\nཆེན་པོ་ཟིལ་གྱིས་གནོན་པས་ཁྱུ་མཆོག་དང་མཚུངས་པ། སེམས་ཤིན་དུ་མཆོག་ཏུ་དུལ་བས་གླང་པོ་ཆེན་པོ་དང་འདྲ་བ་ཤིན་དུ་དུལ་བས་རྟ་ཅང་ཤེས་<span class='add'>    </span>བཟང་པོ་དང་མཚུངས་པ། རྩལ་<span class='add'>  དང་  </span>མི་འཇིགས་པས་སྐྲག་པ་མེད་པའི་\nཕྱིར་རི་དགས་ཀྱི་རྒྱལ་པོ་སེང་གེ་དང་འདྲ་བ། སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྐྱོབ་བས་ཤིང་གི་རྒྱལ་པོ་ནྱ་གྲོ་དྷ་དང་མཚུངས་པ། ཕས་ཀྱི་རྒོལ་བ་ཐམས་ཅད་ཀྱིས་མི་གཡོས་པས་རིའི་རྒྱལ་བོ་རི་རབ་དང་\nའདྲ་བ། བྱམས་པ་ཚད་མེད་པ་བསྒོམས་བས་ནམ་མཁའ་དང་མཚུངས་པ། དགེ་བའི་ཆོས་ཐམས་ཅད་ཀྱི་དབང་དུ་བྱ་བའི་སྔོན་དུ་འགྲོ་བས་ཚངས་པ་ཆེན་པོ་དང་འདྲ་<span class='add'>  བ།   </span>གནས་སུ་སྩོགས་པ་མེད་པས་བྱ་དང་\nམཚུངས་པ། ཕས་ཀྱི་རྒོལ་བ་ཐམས་ཅད་རྣམ་པར་འཇོམས་བས་བྱ་འི་རྒྱལ་པོ་ནམ་མཁའ་ལྡིང་དང་འདྲ་བ། འབྱུང་བར་དཀའ་བའི་ཕྱིར་ཨུ་དུམ་བ་རའི་མེ་ཏོག་དང་མཚུངས་པ། གླང་པོ་ཚེ་ལྟར་ཤིན་དུ་\nམཉམ་པར་གཞག་པས་རྣམ་པར་གཡེང་བ་མེད་པ། དབང་པོ་རྨུགས་པ་མེད་པ། རྣམ་པར་གཏན་ལ་འབེབས་པ་ལ་མཁས་པ། བཟོད་པ་དང་ངེས་པ་མང་བ། ཕ་རོལ་ཕུན་སུམ་ཚོགས་པར་སྨོན་པས་ཕྲག་\nདོག་མེད་པ། ཆོས་ཀྱི་གཏམ་རྣམས་ལ་འཇིག་པ་མེད་པ་ཆོས་ཡོངས་སུ་ཚོལ་བས་ངོམས་མི་མྱོང་བ་ཚུལ་ཁྲིམས་ཀྱིས་བཻ་དཱུརྻ་དང་འདྲ་བ། ཐོས་བས་རིན་པོ་ཆེའི་འབྱུང་གནས་དང་མཚུངས་པ་ཆོས་ཀྱི་རྔ་སྒྲ་ཆེན་པོས་སྒྲ་སྙན་པ། ཆོས་ཀྱི་རྔ་ཆེན་པོ་\nརྡུང་བ་ཆོས་ཀྱི་དུང་ཆེན་པོ་འབུད་པ། ཆོས་ཀྱི་རྒྱལ་མཚན་ཆེན་པོ་བསྒྲེངས་བ། ཆོས་ཀྱི་བ་དན་ཆེན་པོ་འཛིན་བ། ཆོས་ཀྱི་སྒྲོན་མ་ཆེན་པོ་རབ་ཏུ་འབར་བར་བྱེད་པ། ཤེས་རབ་ཀྱིས་རྣམ་པར་ལྟ་བ་"
 ],
 [
  "78.308a",
  "རྨོངས་པ་མེད་པ། ཞེ་སྡང་མེད་པ། ཐབ་བཏུལ་བ། དག་པ་དྲི་ང་བ་མེད་པ། བརྐམ་པ་མེད་པ། ཡང་དག་པར་འགེད་པ་ལ་དགའ་བ། གཏོང་བ་བཏང་བ། སྦྱིན་བ་ལ་ལག་བརྐྱང་བ། ཆོས་དང་ཟང་ཟིང་ཡང་དག་པར་\nའགྱེད་པ་ལ་དགའ་བ། སྦྱིན་བ་ལ་སེར་སྣ་མེད་པ། འདྲེས་པ་མེད་པ། ཡིད་འཇིགས་པ་མེད་པ། ཆགས་པ་མེད་པ། བརྟན་པ། དཔའ་བ། གཅེས་པ་འཛིན་པ། མོས་པ་དང་ལྡན་བ། <span class='add'>  ངོ་ཚ་  </span><span class='add'>    </span>ཤེས་པ་དང་ལྡན་བ། \nཟུག་རྔུ་ཕྱུང་བ། གཏན་པ་མེད་པ། མངོན་བར་ཤེས་པ་ཐོབ་བ། དེས་པ། འགྲོགས་ན་བདེ་བ། དོན་བྱེད་པ། འཇིག་རྟེན་གསལ་བ་མེད་པ་འདྲེན་པ། དགའ་བའི་འདོད་ཆགས་དང་། རྗེས་སུ་ཆགས་པ་དང་། ཁོང་\nཁྲོ་བ་སྤངས་པ། དག་པ། མྱ་ངན་དང་བྲལ་བ། དྲི་མ་མེད་པ། དྲི་མ་གསུམ་སྤངས་བ། མངོན་བར་ཤེས་པས་རྣམ་པར་རྩེན་བ། རྒྱུའི་སྟོབས་ཅན། སྨོན་ལམ་གྱི་སྟོབས་ཅན། མི་དམན་བ། གྱ་གྱུ་མེད་པ་། སངས་\nརྒྱས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་མང་པོ་ལ་དགེ་བའི་རྩ་བ་བསྐྱེད་པ། ང་རྒྱལ་གྱི་ཟུག་རྔུ་བཏོན་པ། འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་དང་བྲལ་བ། དག་པ། དགེ་བ་ལ་མོས་། རྒྱལ་བ་དམ་\nབས་བསྔགས་པ། འཇིག་རྟེན་རྟེན་ལ་མཁས་པ། སྦྱངས་བའི་ཡེ་ཤེས་ཡང་དག་པར་བསྒྲུབས་པ། རྒྱལ་བས་བསྟོད་པ། སེམས་དགའ་བ་དང་ལྡན་བ། རཏལ་ཕོད་པ། སྲན་ཐུབ་པ། མཉམ་པ་མེད་པ། ཐ་བ་མེད་པ་། \nགཞལ་དུ་མེད་པ། རྡུལ་མེད་པ། འདུས་པ་རྒྱ་ཆེ་བ། ཁྱུ་མཆོག་ཏུ་གྱུར་པ། བདེན་པ་སྨྲ་བ། བློ་དང་ལྡན་བ། དྲན་པ་དང་ལྡན་བ། བློ་གྲོས་དང་ལྡན་བ། རྟོགས་བ་དང་ལྡན་བ། ཤེས་རབ་ཀྱི་མཚོན་ཚའི་ལག་ཆ་ཅན་། \nབསོད་ནམས་དང་ལྡན་བ། འོད་དང་ལྡན་བ། ཐ་བ་དང་། དྲི་མ་དང་། ཁོང་ཁྲོ་བ་དང་བྲལ་བ། ཆོས་ལ་རྟག་ཏུ་བརྩོན་པ། ཆོས་ཐམས་ཅད་ལ་ཐོས་པ་རྒྱ་མཚོ་ལྟ་བུར་གྱུར་པ་ཤ་སྟག་གོ །ཀུན་དགའ་བོ་"
 ],
 [
  "78.308b",
  "མདོར་བསྡུ་ན་སངས་རྒྱས་ཀྱི་ཞིང་དེའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་འདི་ལྟ་བུ་ཤ་སྟག་སྟེ། རྒྱས་པར་བྱ་ན་གལ་ཏེ་དེ་བཞིན་གཤེགས་པའི་ཚེའི་ཚད་བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དུ་གནས་པས་བསྟན་ཀྱང་\nསྐྱེས་བུ་དམ་པ་དེ་དག་གི་ཡོན་ཏན་གྱི་མཐའ་བསྟན་བར་མི་ནུས་ལ། དེ་བཞིན་གཤེགས་བའི་མི་འཇིགས་པའི་ཡང་རྒྱུན་ཆད་བར་མི་འགྱུར་རོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཀུན་དགའ་བོ་འདི་ལྟ་སྟེ། བྱང་ཆུབ་སེམས་དཔའ་\nདེ་དག་གི་ཡོན་ཏན་རྣམས་དང་། དེ་བཞིན་གཤེགས་བའི་ཤེས་རབ་ཀྱི་སྤོབས་བ་བླ་ན་མེད་པ་དེ་གཉིས་ཀ་ཡང་བསམ་གྱིས་མི་ཁྱབ་ཅིང་མཚུངས་པ་མེད་པའི་ཕྱིར་རོ། །ཀུན་དགའ་བོ་ལོངས་ལ་ནུབ་ཕྱོགས་སུ་ཕྱོགས་\nཏེ་མེ་ཏོག་གཏོར་ལ་ཐལ་མོ་སྦྱར་ཏེ། གང་ན་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་དཔག་མེད་རྡུལ་མེད་ཅིང་རྣམ་པར་དག་པ་བཞུགས་ཤིང་<span class='add'>  འཚོ་ལ་  </span>གཞེས་\nཤིང་ཆོས་གང་སྟོན་པའི་ཕྱོགས་དེར་ཕྱག་འཚོལ་ཅིག །དེའི་མཚན་དེ་ཡང་སྒྲིབ་བ་མེད་པར་ཕྱོགས་བཅུར་གྲགས་ཏེ། ཕྱོགས་རེ་རེ་ན་ཡང་སངས་རྒྱས་བཅོམ་ལྡན་འདས་གསུང་ཆགས་པ་མི་མངའ་ཞིང་\nགསུང་ཐོགས་པ་མི་མངའ་བ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་ལན་འགའ་མ་ཡིན་<span class='add'>  པར་  </span>བསྔགས་པ་བརྗོད་ཅིང་བསྟོད་དེ། སྙན་བར་གསུང་ངོ་། དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་། བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་བ་\nཀུན་དགའ་བོས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བདག་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་དཔག་ཏུ་མེད་པ་དེ་དང་། ཚེ་དཔག་ཏུ་མེད་བ་དེ་དང་། བྱང་ཆུབ་\nསེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སངས་རྒྱས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་མང་པོ་ལ་དགེ་བའི་རྩ་བ་བསྐྲུན་བ་དེ་དག་ལ་ལྟ་འཚལ་ལོ། །ཚེ་དང་ལྡན་བ་ཀུན་དགའ་བོས་ཚིག་འདི་སྨྲས་མ་ཐག་ཏུ་དེ་ནས་དེའི་མོད་ལས་དེ་བཞིན་"
 ],
 [
  "78.309a",
  "གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེའི་ཕྱག་གི་མཐིལ་ནས་འོད་གང་གིས་སངས་རྒྱས་ཀྱི་ཞིང་བྱེ་བ་བརྒྱ་སྟོང་སྣང་བས་ཁྱབ་པར་འགྱུར་བ་དེ་ལྟ་བུའི་འོད་ཕྱུང་ངོ། །དེའི་ཚེ་\nསངས་རྒྱས་ཀྱི་ཞིང་བྱེ་བ་བརྒྱ་སྟོང་ཐམས་ཅད་ན་རི་ནག་པོ་འམ། རིན་པོ་ཆེའི་རི་འམ། ལྷུན་པོའམ། ལྷུན་པོ་ཆེན་པོའམ། བཏང་ཟུང་ངམ། བཏང་ཟུང་ཆེན་པོ་འམ། ཁོར་ཡུག་གམ། ཁོར་ཡུག་ཆེན་པོ་འམ། བརྩིགས་\nཔ་འམ། ཀ་བ་འམ། ཤིང་ལྗོན་པ་སྟུག་པོའམ། བསྐྱེད་མོས་ཚལ་ལམ། གཞལ་མེད་ཁང་ངམ། ལྷ་དང་མི་གང་སུ་དག་ཡོད་པ་དེ་དག་ཐམས་ཅད་ལས་དེ་བཞིན་གཤེགས་པ་འོད་དཔག་མེད་དེའི་འོད་ཀྱིས་ཐལ་\nབར་གྱུར་ཅིང་ཟིལ་གྱིས་ནོན་པར་གྱུར་ཏོ། །འདི་ལྟ་སྟེ། དཔེར་ན་ཉི་མ་ཤར་ནས་མི་ཞིག་འདོམ་གང་ཙམ་ན་འདུག་པ་ལ་མི་ཞིག་ལྟ་བར་དེ་བཞིན་དུ་དེའི་ཚེ་འདི་ལྟ་སྟེ། སངས་རྒྱས་ཀྱི་མཐུ་དང་། འོད་དེ་ཡོངས་སུ་\nདག་པའི་ཕྱིར་དགེ་སློང་དང་། དགེ་སློང་མདང་། དགེ་བསྙེན་དང་། དགེ་བསྙེན་མ་དང་། ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མི་འམ་ཅི་དང་། ལྟོ་འབྱེ་ཆེན་པོ་དང་། མི་དང་\nམི་མ་ཡིན་བ་དག་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་བ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་དཔག་མེད་རིའི་རྒྱལ་པོ་རི་རབ་ལྟར་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ནས་མངོན་བར་འཕགས་\nཏེ། ཕྱོགས་ཐམས་ཅད་ཟིལ་གྱིས་མནན་ནས། ལམ་མེ། ལྷན་ནེ་ལྷང་ངེ་མཛེས་པ་དེ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་ཆེན་པོ་དེ་དང་། དགེ་སློང་གི་དགེ་འདུན་དེ་ལ་ལྟའོ། །འདི་ལྟ་སྟེ། དཔེར་ན་ས་ཆེན་པོ་\nའདི་ཆུ་གཅིག་ཏུ་གྱུར་ན་དེ་ལ་ཤིང་ལྗོན་པ་རྣམས་མེད། རི་རྣམས་མེད། གླིང་རྣམས་མེད། རྩྭ་དང་། ཤིང་གེལ་པ་དང་། སྨན་དང་། ནགས་ཚལ་རྣམས་མེད་། ཆུ་ཀླུང་རྣམས་མེད་ཅིང་<span class='add'>  ངམ་  </span>གྲོག་དང་། གཡང་ས་རྣམས་མི་སྣང་སྟེ།"
 ],
 [
  "78.309b",
  "གཞན་དུ་ན་ས་ཆེན་པོ་རྒྱ་མཚོ་གཅིག་ཏུ་གྱུར་པ་ནི་མ་གཏོགས་སོ། །དེ་བཞིན་དུ་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན་ཉན་ཐོས་རྣམས་ཀྱི་ལུས་ལས་མངོན་བར་གྲུབ་པའི་འོད་འདོམ་གང་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་འོད་དཔག་ཚད་\nབྱེ་བ་བརྒྱ་སྟོང་ཡོད་པ་མ་གཏོགས་པར་གཞན་རྟགས་སམ། མཚན་མ་ཅུང་ཟད་ཀྱང་མེད་དོ། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་དཔག་མེད་དེས་ཉན་\nཐོས་ཀྱི་ཚོགས་དེ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་དེ་ཟིལ་གྱིས་མནན་ནས་ཕྱོགས་ཐམས་ཅད་དུ་གསལ་བར་ཀུན་དུ་སྣང་ངོ་། དེའི་ཚེ་འཇིག་རྟེན་གྱི་ཁམས་བདེ་བ་ཅན་དེར་བྱང་ཆུབ་སེམས་དཔའ་དང་། ཉན་ཐོས་\nདང་། རང་སངས་རྒྱས་ཐམས་ཅད་དང་། ལྷ་དང་མི་དེ་དག་ཐམས་ཅད་དང་། འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་འདི་དང་། དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོས་བསྐོར་ཅིང་ཆོས་སྟོན་\nཔ་ཡང་སྣང་ངོ། དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མི་ཕམ་པ་ལ་བཀའ་སྩལ་པ། མི་ཕམ་པ་ཁྱོད་ཀྱིས་སངས་རྒྱས་ཀྱི་ཞིང་དེའི་ཡོན་ཏན་གྱི་རྒྱན་བཀོད་པ་ཕུན་སུམ་\nཚོགས་པ་འདི་དང་། སྟེང་གི་བར་སྣང་ལ་ཀུན་དགའི་ར་བ་ཉམ་དགའ་བདག་དང་། ནགས་ཚལ་ཉམས་དགའ་བ་དག་དང་། བསྐྱེད་མོས་ཚལ་ཉམས་དགའ་བ་དག་དང་། ཆུ་ཀླུང་དང་། རྫིང་བུ་ཉམས་དགའ་བ་\nདག་དང་། རིན་པོ་ཆེའི་མེ་ཏོག་པད་མ་དང་། ཀུ་<span class='add'>  མུ་ད་  </span>དང་། པད་མ་དཀར་པོས་གང་བ་དང་། འོག་ཏུ་སའི་སྟེང་ནས་བཟུང་སྟེ། འོག་མིན་གྱི་གནས་ཀྱི་པར་གྱི་ནམ་མཁའི་ངོས་ལ་མེ་ཏོག་བཀྲམ་པ་དང་། མེ་ཏོག་གི་\nཕྲེང་བས་ཀུན་དུ་མཛེས་པར་བྱས་པ་དང་། རིན་པོ་<span class='add'>  ཆེ་  </span>སྣ་ཚོགས་བཀྲ་བའི་ཕྲེང་<span class='add'>  གིས་  </span>གང་བ་དང་། དེ་བཞིན་གཤེགས་པས་སྤྲུལ་པའི་བྱ་སྣ་ཚོགས་ཀྱིས་བསྟན་པ་མཐོང་ངམ། གསོལ་པ། བཅོམ་ལྡན་འདས་མཐོང་"
 ],
 [
  "78.310b",
  "བཅོམ་ལྡན་འདས་ཁ་ཅིག་པད་མའི་མངལ་ན་གནས་པ་དང་། ཁ་ཅིག་པད་མ་ལ་སྐྱིལ་མོ་དཀྲུང་བཅས་ནས་བརྫུས་ཏེ་འབྱུང་བ་དེའི་རྒྱུ་ནི་གང་ལགས། རྐྱེན་ནི་གང་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། མི་ཕམ་པ་\nབྱང་ཆུབ་སེམས་དཔའ་གང་དག་སངས་རྒྱས་ཀྱི་ཞིང་གཞན་དག་ན་གནས་ཏེ། ཐེ་ཚོམ་དུ་ལྟུང་བའི་སེམས་ཀྱིས་འཇིག་རྟེན་གྱི་ཁམས་བདེ་བ་ཅན་དུ་སྐྱེ་བར་བྱ་བའི་ཕྱིར་དགེ་བའི་<span class='add'>  རྩ་  </span>བ་རྣམས་བསྐྱེད་པ་དེ་དག་ནི་དེ་ན་\nམངལ་གནས་སོ། །གང་དག་ཐེ་ཙོམ་མེད་ཅིང་སོམ་ཉི་མེད་དེ། འཇིག་རྟེན་གྱི་ཁམས་བདེ་བ་ཅན་དུ་སྐྱེ་བར་བྱ་བའི་ཕྱིར་དགེ་བའི་རྩ་བ་རྣམས་བསྐྱེད་ལ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་ཡེ་ཤེས་ཆགས་པ་\nམེད་པ་ལ་ཡིད་ཆེས་ཤིང་དད་ལ་མོས་པ་དེ་དག་ནི་པད་མ་རྣམས་ལ་སྐྱིལ་མོ་དཀྲུང་བཅས་ནས་བརྫུ་ཏེ་བྱུང་ངོ་། མི་ཕམ་པ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སངས་རྒྱས་ཀྱི་ཞིང་གཞན་ན་གནས་\nཔ་གང་དག་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་དཔག་མེད་ལ་བལྟ་བ་དང་། ཕྱག་བྱ་བ་དང་། བསྙེན་བཀུར་བྱ་བར་སེམས་བསྐྱེད་ཅིང་ཐེ་ཙོམ་མི་བསྐྱེད་ལ། སངས་རྒྱས་\nཀྱི་ཡེ་ཤེས་ཆགས་པ་མེད་པ་ལ་སོམ་ཉི་མེད་ཅིང་རང་གི་དགེ་བའི་རྩ་བ་ཡང་སྩོགས་པ་དེ་དག་ནི་སྐྱིལ་མོ་དཀྲུང་བཅས་ནས་བརྫུས་ཏེ་འབྱུང་བར་འགྱུར་ཏེ། འདི་ལྟ་སྟེ། དཔེར་ན་བྱང་ཆུབ་སེམས་དཔའ་སྐྱེས་ནས་རིང་པོ་\nམ་ལོན་པ་གཞན་དག་དང་འདྲ་བར་ཡུད་ཙམ་གྱིས་ལུས་རྣམ་པ་དེ་ལྟ་བུར་འགྱུར་རོ། །མི་ཕམ་པ་ཤེས་རབ་ཀྱི་ཁྱད་པར་དང་། ཤེས་རབ་ཀྱི་རིམ་པ་དང་། འདི་ལྟ་སྟེ། ཐེ་ཙོམ་དུ་ལྟུང་བའི་འདུ་ཤེས་ཡིད་ལ་\nབྱེད་པས་འདི་ལྟར་ལོ་ལྔ་བརྒྱར་སངས་རྒྱས་མཐོང་བ་ལས་ཡོངས་སུ་ཉམས་ཤིང་བྱང་ཆུབ་སེམས་དཔའ་མཐོང་བ་དང་། ཆོས་མཉན་པ་དང་། ཆོས་ཀྱི་གཏམ་དང་། དགེ་བའི་སྤྱོད་པ་དང་། དགེ་བ་ཕུན་སུམ་ཚོགས་"
 ],
 [
  "78.311b",
  "དང་། \tཁམས་ཀྱི་རྒྱལ་པོ་འམ། གང་གིས་ཁྲི་མོན་དེ་ལས་ཡོངས་སུ་ཐར་བར་གྱུར་པ་ཡོངས་སུ་ཚོལ་ཏེ། བཅོམ་ལྡན་འདས་རྒྱལ་པོའི་བུ་དེ་བཙོན་ར་དེ་ན་དགའ་བ་མ་མཆིས་ཤིང་རྒྱལ་པོས་མ་གནང་གི་བར་དུ་མི་\nཐར་རོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། མི་ཕམ་པ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་གང་དག་ཐེ་ཙོམ་དུ་ལྟུང་བས་དགེ་བའི་རྩ་བ་བསྐྱེད་ཅིང་སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་མི་མཉམ་བ་དང་མཉམ་བའི་ཡེ་ཤེས་ལ་\nསོམ་ཉི་ཟ་བདེ་དག་སངས་རྒྱས་ཀྱི་མཚན་ཐོས་པ་དེ་དང་། སེམས་དང་བ་ཙམ་དེས་འཇིག་རྟེན་གྱི་ཁམས་བདེ་བ་ཅན་དེར་སྐྱེ་བ་ཡང་པད་མ་རྣམས་ལ་སྐྱིལ་མོ་དཀྲུང་བཅས་ཤིང་བརྫུས་ཏེ་འབྱུང་བ་མ་ཡིན་གྱི། པད་\nམ་རྣམས་ཀྱི་མངལ་ན་གནས་པ་མྱོང་སྟེ། དེ་དག་དེ་ལས་བསྐྱེད་མོས་ཚལ་དང་། གཞལ་མེད་ཁང་དུ་འདུ་ཤེས་ཤིང་གནས་ཏེ། བཤང་གཅི་མེད། མཆིལ་མ་མེད་། སྣབས་མེད། ཡིད་དང་མི་\nམཐུན་བ་མི་འབྱུང་མོད་ཀྱི། ལོ་ལྔ་བརྒྱར་སངས་རྒྱས་མཐོང་བ་དང་། ཆོས་ཉན་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་མཐོང་བ་དང་། འབེལ་བའི་ཆོས་ཀྱི་གཏམ་རྣམ་པར་ངེས་པ་དང་། དགེ་བའི་ཆོས་སྤྱོད་པ་\nཐམས་ཅད་དང་བྲལ་བ་ཡིན་ཏེ། དེ་དག་དེ་ན་མངོན་བར་མི་དགའ་ཞིང་མགུ་བ་མི་འཐོབ་ཀྱི་ཉེས་པ་ཟད་ནས་དེ་དག་པད་མའི་མངལ་རྣམས་ནས་འབྱུང་སྟེ། དེ་དག་དེ་ནས་བྱུང་ཡང་སྟེང་ངམ། འོག་གམ། ཐད་ཀར་བྱུང་\nབ་མི་ཤེས་སོ། མི་ཕམ་པ་འདི་ལྟར་ལོ་ལྔ་བརྒྱར་སངས་རྒྱས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་མང་པོ་ལ་བསྙེན་བཀུར་བྱ་བ་དང་། དགེ་བའི་རྩ་བ་མང་པ་གྲངས་མེད། ཚད་མེད་དཔག་ཏུ་མེད་པ་དག་བསྐྱེད་པར་བྱ་<span class='add'>    </span>\nསངས་རྒྱས་ཀྱི་ཆོས་དཔག་ཏུ་མེད་པ་ཡོངས་སུ་གཟུང་བར་བྱ་བ་དེ་ཐམས་ཅད་ཀྱང་ཐེ་ཙོམ་ཟ་བའི་ཉེས་པས་བསྒྲུབས་པར་མ་གྱུར་པ་ལ་ལྟོས། མི་ཕམ་པ་ཐེ་ཙོམ་གྱིས་བྱང་ཆུབ་སེམས་"
 ],
 [
  "78.312a",
  "དཔའ་རྣམས་ལ་གནོད་པ་ཆེན་པོ་ཇི་ཙམ་དུ་འགྱུར་བ་ལ་ལྟོས། མི་ཕམ་པ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་དག་གི་ཐེ་ཙོམ་ཡོངས་སུ་སྤངས་ཏེ། བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ལ་མྱུར་དུ་\nསེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པ་དང་། བདེ་བའི་སྟོབས་བསྐྱེད་པའི་མཐུ་ཐོབ་པར་བྱ་བའི་ཕྱིར་གང་ན་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་དཔག་\nམེད་བཞུགས་པའི་འཇིག་རྟེན་གྱི་ཁམས་བདེ་བ་ཅན་དུ་སྐྱེ་བར་བྱ་བའི་ཕྱིར་དགེ་བའི་རྩ་བ་རྣམས་ཡོངས་སུ་སྔོ་བར་བྱའོ། །དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་། བཅོམ་ལྡན་འདས་ལ་བྱང་ཆུབ་སེམས་དཔའ་མི་\nཕམ་བས། འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཡོངས་ས་གྲུབ་པ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་གཞན་དག་གིས་སངས་རྒྱས་བཅོམ་ལྡན་\nའདས་རྣམས་ཀྱི་གན་ནས་ཇི་སྙེད་ཅིག་འཇིག་རྟེན་གྱི་ཁམས་བདེ་བ་ཅན་དུ་སྐྱེ་བར་འགྱུར། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། མི་ཕམ་བ་བྱང་ཆུབ་སེམས་དཔའ་ཡོངས་སུ་གྲུབ་པ་བྱེ་\nབ་ཁྲག་ཁྲིག་ཕྲག་བདུན་བཅུ་རྩ་གཉིས་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནས་འཇིག་རྟེན་གྱི་ཁམས་བདེ་ན་ཅན་དུ་སྐྱེ་བར་འགྱུར་ཏེ། སངས་རྒྱས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་མང་པོ་ལ་དགེ་བའི་རྩ་བ་\nསྐྱེད་པས། ཕྱིར་མི་ལྡོག་པར་ཡོངས་སུ་འགྲུབ་ན་དགེ་བའི་རྩ་བ་དེ་བས་ཆུང་<span class='add'>  ངུ་  </span>རྣམས་ལྟ་སྨོས་ཀྱང་ཅི་དགོས། དེ་བཞིན་གཤེགས་པ་བཟོད་པར་དཀའ་བའི་གན་ནས་བྱང་ཆུབ་\nསེམས་དཔའ་བྱེ་བ་ཁྲག་ཁྲིག་ཕྲག་བཅྭོ་བརྒྱད་འཇིག་རྟེན་གྱི་ཁམས་བདེ་བ་ཅན་དུ་སྐྱེ་བར་འགྱུར་རོ། །བྱང་ཤར་གྱི་ཕྱོགས་མཚམས་ན་དེ་བཞིན་གཤེགས་པ་དཀོན་མཆོག་"
 ],
 [
  "78.312b",
  "འབྱུང་གནས་ཞེས་བྱ་བ་བཞུགས་ཏེ། དེའི་གན་ནས་བྱང་ཆུབ་སེམས་དཔའ་བྱེ་བ་ཕྲག་དགུ་བཅུ་འཇིག་རྟེན་གྱི་ཁམས་བདེ་བ་ཅན་དུ་སྐྱེ་བར་འགྱུར་རོ། །དེ་བཞིན་གཤེགས་པ་སྐར་མའི་\nའོད་ཀྱི་གན་ནས་བྱང་ཆུབ་སེམས་དཔའ་བྱེ་བ་ཕྲག་ཉི་ཤུ་རྩ་གཉིས་འཇིག་རྟེན་གྱི་ཁམས་བདེ་བ་ཅན་དུ་སྐྱེ་བར་འགྱུར་རོ། །དེ་བཞིན་གཤེགས་པ་དབྱངས་དཔག་མེད་ཀྱི་གན་ནས། བྱང་ཆུབ་\nསེམས་དཔའ་བྱེ་བ་ཕྲག་ཉི་ཤུ་རྩ་ལྔ་འཇིག་རྟེན་གྱི་ཁམས་བདེ་བ་ཅན་དུ་སྐྱེ་བར་འགྱུར་རོ། །དེ་བཞིན་གཤེགས་པ་འཇིག་རྟེན་གྱི་སྒྲོན་མའི་གན་ནས་བྱང་ཆུབ་སེམས་དཔའ་བྱེ་བ་ཕྲག་\nདྲུག་བཅུ་འཇིག་རྟེན་གྱི་ཁམས་བདེ་བ་ཅན་དུ་སྐྱེ་བར་འགྱུར་རོ། །དེ་བཞིན་གཤེགས་པ་ཀླུ་ཟིལ་གྱིས་གནོན་བའི་གན་ནས་བྱང་ཆུབ་སེམས་དཔའ་བྱེ་བ་ཕྲག་དྲུག་བཅུ་རྩ་བཞི་འཇིག་རྟེན་\nགྱི་ཁམས་བདེ་བ་ཅན་དུ་སྐྱེ་བར་འགྱུར་རོ། །དེ་བཞིན་གཤེགས་པ་རྡུལ་བྲལ་འོད་ཀྱིས་གན་ནས་བྱང་ཆུབ་སེམས་དཔའ་བྱེ་བ་ཕྲག་ཉི་ཤུ་རྩ་ལྔ་འཇིག་རྟེན་གྱི་ཁམས་བདེ་བ་ཅན་དུ་སྐྱེ་བར་འགྱུར་\nརོ། །དེ་བཞིན་གཤེགས་པ་སེང་གེའི་གན་ནས་བྱང་ཆུབ་སེམས་དཔའ་<span class='add'>  ཁྲི་  </span>བརྒྱད་སྟོང་འཇིག་རྟེན་གྱི་ཁམས་བདེ་བ་ཅན་དུ་སྐྱེ་བར་འགྱུར་རོ། །དེ་བཞིན་གཤེགས་པ་དཔལ་\nབརྩེགས་ཀྱི་གན་ནས་བྱང་ཆུབ་སེམས་དཔའ་བྱེ་བ་ཕྲག་བརྒྱད་བཅུ་རྩ་གཅིག་འཇིག་རྟེན་གྱི་ཁམས་བདེ་བ་ཅན་དུ་སྐྱེ་བར་འགྱུར་རོ། །དེ་བཞིན་གཤེགས་པ་མིའི་དབང་པོ་འི་\nགན་ནས་བྱང་ཆུབ་སེམས་དཔའ་བྱེ་བ་ཁྲག་ཁྲིག་ཕྲག་བཅུ་འཇིག་རྟེན་གྱི་ཁམས་བདེ་བ་ཅན་དུ་སྐྱེ་བར་འགྱུར་རོ། །དེ་བཞིན་གཤེགས་པ་སྟོབས་"
 ],
 [
  "78.316a",
  "<span class='add'>    </span>དེའི་ཚེ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་རྣམ་པ་དྲུག་ཏུ་གཡོས་ཏེ། ཆོ་འཕྲུལ་རྣམ་པ་སྣ་ཚོགས་ཀྱང་ཀུན་དུ་སྣང་ངོ། །མེ་ཏོག་མན་\nདཱ་ར་བ་དག་ཀྱང་ས་ལ་པུས་མོ་ནུབ་རྩམ་དུ་བཀྲམ་པར་གྱུར་ཏོ། །ལྷ་དང་མིའི་སིལ་སྙན་རྣམས་ཀྱང་རབ་ཏུ་གྲག་པར་གྱུར་ཏོ། །འོག་མིན་གྱི་གནས་ཀྱི་བར་དུ་ཡང་རྗེས་སུ་ཡི་རང་\nངོ་ཞེས་བྱ་བའི་སྒྲ་གྲག་པར་གྱུར་ཏོ། །བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མི་ཕམ་པ་དང་། \nཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་དང་། ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དེ་དང་། ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དང་། དྲི་ཟར་བཅས་པའི་འཇིག་རྟེན་ཡི་རངས་ཏེ། \nབཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ། མངོན་པར་བསྟོད་དོ།། །།འཕགས་པ་དཀོན་མཆོག་བརྩེགས་པ་ཆེན་པོའི་ཆོས་ཀྱི་\nརྣམ་གྲངས་ལེའུ་སྟོང་ཕྲག་བརྒྱ་པ་ལས། དེ་བཞིན་གཤེགས་པ་འོད་དཔག་ཏུ་མེད་པའི་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་བཀོད་པ་ཞེས་བྱ་བ་སྟེ། །\nལེའུ་ལྔ་པ་རྫོགས་སོ།།  །།རྒྱ་གར་གྱི་མཁན་པོ་ཛི་ན་མི་ཏྲ་དང་། དཱ་ན་ཤཱི་ལ་དང་། ཞུ་ཆེན་གྱི་ལོ་ཙྪ་བ་བན་དེ་ཡེ་ཤེས་སྡེས་བསྒྱུར་ཅིང་\nཞུས་ཏེ། སྐད་གསར་ཆད་ཀྱིས་ཀྱང་བཅོས་ནས་གཏན་ལ་ཕབ་པ།།  །།  །།  །།"
 ],
 [
  "78.313a",
  "མངོན་བར་ཤེས་པའི་གན་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཉི་ཁྲི་ཉིས་སྟོང་འཇིག་རྟེན་གྱི་ཁམས་བདེ་བ་ཅན་དུ་སྐྱེ་བར་འགྱུར་རོ། །དེ་བཞིན་གཤེགས་པ་མེ་ཏོག་རྒྱལ་མཚན་གྱི་གན་\nནས་བྱང་ཆུབ་སེམས་དཔའ་བརྩོན་འགྲུས་ཐོབ་པ། འཇུག་པ་གཅིག་གིས་ཡང་དག་པར་ཞུགས་པ། ཉི་མ་བརྒྱད་པ་གཅིག་གིས་བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དགུ་\nབཅུ་རྩ་དགུའི་འཁོར་བ་བསྙིལ་བ་བྱེ་བ་ཕྲག་ཉི་ཤུ་རྩ་ལྔ་འཇིག་རྟེན་གྱི་ཁམས་བདེ་བ་ཅན་དུ་སྐྱེ་བར་འགྱུར་རོ། །དེ་བཞིན་གཤེགས་པ་འབར་བའི་བདག་པོའི་གན་ནས་བྱང་ཆུབ་སེམས་དཔའ་\nབྱེ་བ་ཕྲག་བཅུ་གཉིས་འཇིག་རྟེན་གྱི་ཁམས་བདེ་བ་ཅན་དུ་སྐྱེ་བར་འགྱུར་རོ། །དེ་བཞིན་གཤེགས་པ་མི་འཇིགས་པ་བརྙེས་པའི་གན་ནས་བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་སེམས་དཔའ་བྱེ་བ་ཕྲག་དྲུག་བཅུ་རྩ་དགུ་དེ་བཞིན་\nགཤེགས་པ་འོད་དཔག་མེད་ལ་ལྟ་བ་དང་། ཕྱག་བྱ་བ་དང་། བསྙེན་བཀུར་བྱ་བ་དང་། ཡོངས་སུ་དྲི་བ་དང་། ཡོངས་སུ་དྲི་བར་བྱ་བའི་ཕྱིར་འཇིག་རྟེན་གྱི་ཁམས་བདེ་བ་ཅན་དུ་སྐྱེ་བར་འགྱུར་\nརོ། །མི་ཕམ་པ་རྣམ་<span class='add'>  གྲངས་དེ་ལྟ་བུས་  </span>དེ་བཞིན་གཤེགས་པ་གང་དག་གིས་གན་ནས་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་འཇིག་རྟེན་གྱི་ཁམས་བདེ་བ་ཅན་དུ་དེ་བཞིན་གཤེགས་པ་འོད་དཔག་མེད་མེད་དེ་ལ་\nབལྟ་བ་དང་། ཕྱག་བྱ་བ་དང་། བསྙེན་བཀུར་བྱ་བའི་ཕྱིར་འདོང་བའི་དེ་བཞིན་གཤེགས་པ་དེ་དག་གིས་མཚན་བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་ཚང་བར་བརྗོད་ཀྱང་མཐའ་རྟོགས་པར་མི་\nནུས་སོ། །མི་ཕམ་པ་གང་དག་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་དཔག་མེད་ཀྱི་མཚན་ཐོས་པའི་སེམས་ཅན་དེ་དག་རྙེད་ཅིག་ལེགས་པར་"
 ],
 [
  "78.315a",
  "རྫོགས་པའི་སངས་རྒྱས་མཐོང་ནས་ནི། །གུས་དང་བཅས་པས་ཆོས་ཐོས་པ། །དེ་དག་དགའ་བ་དམ་པ་འཐོབ། །ལྟ་བ་ཅན་དང་དམན་དང་ཞུམ་རྣམས་ཀྱིས། །སངས་\nརྒྱས་ཆོས་ལ་དང་བ་རྙེད་མི་ནུས། །གང་དག་སྔོན་གྱི་སངས་རྒྱས་མཆོད་བྱས་པ། །དེ་དག་འཇིག་རྟེན་མགོན་གྱིས་<span class='add'>  སྤྱད་  </span>ལ་སློབ། །དཔེར་ན་སྐྱེས་བུ་ལོང་བ་མུན་ཁང་ན། །ལམ་ཡང་མི་ཤེས་\nབསྟན་པར་ག་ལ་ནུས། །དེ་ལྟར་ཉན་ཐོས་ཐམས་ཅད་སངས་རྒྱས་ཀྱི། །ཡེ་ཤེས་མི་རྟོགས་སེམས་ཅན་གཞན་ཅི་སྨོས། །སངས་རྒྱས་ཀྱིས་ནི་སངས་རྒྱས་ཡོན་ཏན་མཁྱེན། །ལྷ་ཀླུ་ལྷ་\nམིན་གནོད་སྦྱིན་ཉན་ཐོས་མིན། །སངས་རྒྱས་ཡེ་ཤེས་རབ་ཏུ་བཤད་པ་ནི། །རང་སངས་རྒྱས་ཀྱི་ལམ་ཡང་འདི་མ་ཡིན། །གལ་ཏེ་སེམས་ཅན་ཐམས་ཅད་བདེ་བར་གཤེགས། \nཡེ་ཤེས་རྣམ་དག་དོན་དམ་མཁས་གྱུར་ཏེ། །དེ་དག་བསྐལ་པའམ་འོན་ཏེ་ལྷག་པར་ནི། སངས་རྒྱས་གཅིག་གི་ཡོན་ཏན་རྗོད་བྱེད་ཀྱང་། །དེ་དག་རབ་ཏུ་མྱ་ངན་འདས་གྱུར་གྱི། \nབསྐལ་པ་བྱེ་བ་མང་པོར་རབ་བརྗོད་ཀྱང་། །སངས་རྒྱས་ཡེ་ཤེས་ཚད་རྙེད་མི་འགྱུར་ཏེ། དེ་ལྟར་རྒྱལ་བའི་ཡེ་ཤེས་ངོ་མཚར་ཏོ། །དེ་བས་མཁས་པ་རིག་པའི་རང་བཞིན་མིན། །གང་\nཞིག་ང་ཡི་ཚིག་ལ་ཡིད་ཆེས་ཏེ། །རྒྱལ་བའི་ཡེ་ཤེས་ཕུང་པོ་དབང་བྱས་ཏེ། །སངས་རྒྱས་ཉིད་ཀྱིས་མཁྱེན་ཅེས་ཚིག་ཏུ་བསྟོད། །བརྒྱ་ལམ་ན་ནི་མི་ཡི་ལུས་རྙེད་ལ། བརྒྱ་ལམ་ན་ནི་སངས་\nརྒྱས་འབྱུང་བར་འགྱུར། །དད་དང་ཤེས་རབ་ཡུན་རིང་རྙེད་པར་འགྱུར། དེ་བས་དོན་ཐོབ་བྱ་ཕྱིར་བརྩོན་འགྲུས་བསྐྱེད། །གང་ཞིག་ཆོས་མཆོག་འདི་འདྲ་ཐོས་ནས་ནི། །བདེ་གཤེགས་དྲན་པ་དགའ་"
 ],
 [
  "78.315b",
  "བ་ཐོབ་པར་འགྱུར། །གང་ཞིག་སངས་རྒྱས་བྱང་ཆུབ་མོས་སྐྱེད་པ། །དེ་དག་འདས་པའི་དུས་ན་<span class='add'>  དེང་  </span>དང་བཤེས། །ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བཤད་པ་ན་སེམས་ཅན་བྱེ་བ་ཕྲག་བཅུ་གཉིས་ཆོས་རྣམས་ལ་ཆོས་\nཀྱི་མིག་རྡུལ་དང་བྲལ་ཞིང་དྲི་མ་མེད་པ་རྣམ་པར་དག་གོ །བྱེ་བ་ཕྲག་ཉི་ཤུ་རྩ་བཞིས་ནི་ཕྱིར་མི་འོང་བའི་འབྲས་བུ་ཐོབ་བོ། །དགེ་སློང་བརྒྱད་བརྒྱ་ནི་ལེན་པ་མེད་པར་ཟག་པ་རྣམས་ལས་སེམས་རྣམ་པར་གྲོལ་ལོ། །\nབྱང་ཆུབ་སེམས་དཔའ་བྱེ་བ་ཕྲག་ཉི་ཤུ་རྩ་ལྔ་ནི་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་བོ། །ལྷ་དང་མིའི་སྐྱེ་དགུ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་བྱེ་བ་ཕྲག་བཞི་བཅུ་ནི་སྔོན་སེམས་མ་བསྐྱེད་པ་ལས་བླ་ན་མེད་པ་ཡང་དག་པར་\nརྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ནས། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་འོད་དཔག་མེད་ལ་བལྟ་བ་དང་། ཕྱག་བྱ་བ་དང་། བསྙེན་བཀུར་བྱ་བའི་ཕྱིར་བདེ་བ་ཅན་དུ་སྐྱེ་བར་དགེ་བའི་རྩ་བ་རྣམས་\nཡོངས་སུ་བསྔོ་བར་བྱེད་དོ། །དེ་དག་ཐམས་ཅད་དེར་སྐྱེས་ནས་ཀྱང་མཐར་གྱིས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཡོངས་སུ་རྫོགས་པར་བྱས་ཏེ། །སངས་རྒྱས་ཀྱི་ཞིང་གཞན་དག་ཏུ་དེ་བཞིན་གཤེགས་པ་འཇམ་\nཔའི་དབྱངས་ཞེས་བྱ་བར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་རོ། །དེ་བཞིན་གཤེགས་པ་མར་མེ་མཛད་ལས་བཟོད་པ་ཐོབ་སྟེ། བླ་ན་མེད་པ་\nཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པ་བྱེ་བ་ཁྲག་ཁྲིག་ཕྲག་བརྒྱད་བཅུ་དེ་བཞིན་གཤེགས་པ་འོད་དཔག་མེད་ཀྱིས་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་བླ་ན་མེད་པ་ཡང་\nདག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྨིན་པར་བྱས་པ་དེ་དག་ཀྱང་འཇིག་རྟེན་གྱི་ཁམས་བདེ་བ་ཅན་དུ་སྐྱེས་ཏེ། སྔོན་གྱི་སྨོན་ལམ་དང་། སྤྱོད་པ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ། །"
 ]
]