[
 [
  "78.112b",
  "གཟུངས་ཀྱི་རྒྱལ་པོ་བསྟན་པ་ཞེས་བྱ་བར་ཡང་ཟུང་ཤིག །སྤོབས་པ་ཚད་མེད་པ་ཞེས་བྱ་བར་ཡང་ཟུང་ཤིག །གཟུངས་ཀྱི་ཕྱག་རྒྱ་སྦྱོང་བ་ཞེས་བྱ་བར་ཡང་ཟུང་ཤིག །སྡེ་སྣོད་གསུམ་ཡང་དག་པར་སྡུད་པ་ལ་མཁས་པ་ཞེས་བྱ་བར་\nཡང་ཟུང་ཤིག །སྤོབས་པ་མཐའ་ཡས་འདི་ནི་དོན་ཐམས་ཅད་ཡང་དག་པར་སྡུད་པ་ལ་མཁས་པའི་ཆོས་ཀྱི་སྒོ་ཡིན་ཏེ། དེས་ན་ཆོས་ཐམས་ཅད་སྣང་བར་འགྱུར་རོ། །ཆོས་ཀྱི་སྒོ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཐེ་ཙོམ་ཐམས་\nཅད་གཅོད་པར་འགྱུར་བ་ཡིན། འདི་ནི་ངའི་རྗེས་སུ་སྟོན་པ་ཡིན་ནོ། །དེ་ནས་ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དེས་བཅོམ་ལྡན་འདས་ལ་མེ་ཏོག་ཁ་དོག་ལྔ་པས་མངོན་པར་གཏོར་ཏོ། །བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་\nསྩལ་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་དང་། ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དེ་དང་། ལྷ་དང་། དྲི་ཟ་དང་། མི་དང་། ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་ཡི་རངས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་བསྟོད་\nདོ། །འཕགས་པ་དཀོན་མཆོག་བརྩེགས་པ་ཆེན་པོའི་ཆོས་ཀྱི་རྣམ་གྲངས་ལེའུ་སྟོང་ཕྲག་བརྒྱ་པ་ལས་འཕགས་པ་སྒོ་མཐའ་ཡས་པ་རྣམ་པར་སྦྱོང་བ་ཞེས་བྱ་བ་ལེའུ་གཉིས་པ་རྫོགས་སོ། །།\nརྒྱ་གར་གྱི་མཁན་པོ་སུ་རེན་དྲ་བོ་དྷི་དང་། ཞུ་ཆེན་གྱི་ལོ་ཙྪ་བ་བན་དེ་དཔལ་<span class='add'>  བརྩེགས་  </span>རཀྵི་ཏས་བསྒྱུར་ཅིང་ཞུས་ཏེ་གཏན་ལ་ཐབ་པ། འཕགས་པ་དཀོན་མཆོག་བརྩེགས་པ་ཆེན་པོ་ཆོས་ཀྱི་རྣམ་\nགྲངས་སྟོང་ཕྲག་བརྒྱ་པ་ལས། ལེའུ་གསུམ་པ་སྟེ། ལག་ན་རྡོ་རྗེས་ཞུས་པ་ཞེས་བྱ་བ་དེ་བཞིན་གཤེགས་པའི་གསང་བ་བསམ་གྱིས་མི་ཁྱབ་པ་བསྟན་པ།།   །།བམ་པོ་དང་པོ།      །།\n༄༅། །རྒྱ་གར་སྐད་དུ་། <span class='add'>  ཨཱ  </span>རྻ་ཐཱ་ག་ཏ་ཨ་ཙིན་ཏྱ་གུ་་ནིར་དེ་ཤ་ནཱ་མ་མ་ཧཱ་ཡཱ་ན་<span class='add'>  སཱུ་ཏྲ།   </span>བོད་སྐད་དུ། འཕགས་པ་དེ་བཞིན་གཤེགས་པའི་གསང་བ་བསམ་གྱིས་མི་ཁྱབ་པ་བསྟན་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་<span class='add'>    </span>"
 ],
 [
  "78.113a",
  "བམ་པོ་དང་པོ། སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ། །འདི་སྐད་བདག་གིས་ཐོས་པའི་དུས་གཅིག་ན། བཅོམ་ལྡན་འདས་རྒྱལ་པོའི་ཁབ་ན། བྱ་རྒོད་ཀྱི་ཕུང་པོའི་རི་ལ་\nདགེ་སློང་བཞི་ཁྲི་ཉིས་སྟོང་གི་དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའི་ཆེན་པོ་མངོན་པར་ཤེས་པ་མངོན་པར་ཤེས་པ་ཕལ་ཆེར་སངས་རྒྱས་ཀྱི་ཞིང་གཞན་ནས་འདུས་པའི་བྱང་ཆུབ་སེམས་དཔའ་\nསེམས་དཔའ་བརྒྱད་ཁྲི་བཞི་སྟོང་དང་ཐབས་གཅིག་ཏུ་བཞུགས་ཏེ། ཐམས་ཅད་ཀྱང་བཟོད་པ་ཐོབ་པ། ཕྱིར་མི་ལྡོག་པ་སྐྱེ་བ་གཅིག་གིས་ཐོགས་པ། གཟུངས་ཐོབ་པ། ཏིང་ངེ་འཛིན་ཐོབ་པ། སྤོབས་པ་ཐོགས་པ་མེད་པ། ཕྱོགས་བཅུ་\nམཐའ་ཡས་བའི་སངས་རྒྱས་ཀྱི་ཞིང་དུ་འགྲོ་བ་ལ་མཁས་པ། མངོན་པར་ཤེས་པའི་ཡེ་ཤེས་ཀྱིས་རྣམ་པར་རྩེན་པ། ཕས་ཀྱིས་རྒོལ་བ་ཐམས་ཅད་ཀྱིས་ཟིལ་གྱིས་མི་ནོན་པ། བདུད་དང་ཕྱིར་རྒོལ་བ་བཅོམ་པ། སེམས་ཅན་\nཐམས་ཅད་ཀྱི་སེམས་དང་བསམ་པ་དང་སྤྱོད་པའི་བསྒྲུབ་པ་ཤེས་པ། དབང་པོ་མཆོག་དང་མཆོག་མ་ཡིན་པ་ཤེས་པ་ལ་མཁས་པ་ཕ་རོལ་དུ་ཕྱིན་པ་ཐམས་ཅད་ཀྱི་ཚུལ་ལ་འཇུག་པར་རབ་ཏུ་ཞུགས་དང་། ཐབས་ལ་\nམཁས་པའི་དམ་པའི་ཕ་རོལ་དུ་སོན་པ། སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་བསྟོད་ཅིང་བསྔགས་ཏེ། བཀུར་ལ་རབ་ཏུ་བསྔགས་པ། བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དཔག་ཏུ་མེད་པར་བྱང་ཆུབ་ཀྱི་ལམ་མཐའ་ཡས་\nཔ་མཐར་གཏུགས་<span class='add'>  པ།   </span>སེམས་དང་། ཆུ་དང་། མེ་<span class='add'>  དང་།   </span>རླུང་དང་མཚུངས་པ། ནམ་མཁའ་ལྟར་མཐའ་ཡས་པའི་བྱམས་པ་བསྒོམ་པའི་རྣལ་འབྱོར་ལ་བརྩོན་པ། ཆགས་པའི་གནས་སྒྲིབ་པ་དང་། ཚོད་པ་དང་། \nཀུན་ནས་ལྡང་བ་ཐམས་ཅད་ལས་ཡང་དག་པ་འདས་པ་། མཐུ་བོ་ཆེའི་ལུས་ཐོབ་པ་། རྡོ་རྗེ་ལྟར་སྲ་ཞིང་མི་ཚུགས་པའི་ལུས་དང་ལྡན་པ། སེང་གེའི་སྒྲ་ཆེན་པོ་སྒྲོགས་པ། འཁོར་ཐམས་ཅད་ཟིལ་གྱིས་གནོན་པ་ལ་འཇིགས་པ་"
 ],
 [
  "78.113b",
  "མེད་པར་མཁས་པ། ཟླ་བ་དང་ཉི་<span class='add'>  མ་  </span><span class='add'>  མོག་མོག་  </span>པོར་བྱེད་པ་། ཆོས་ཐམས་ཅད་ཇི་ལྟ་བ་བཞིན་དུ་དུས་གསུམ་མཉམ་པ་ཉིད་ཐོབ་པ། ཆོས་ཟབ་མོ་རྣམ་པར་ངེས་པ། ཡེ་ཤེས་ཀྱིས་སྟོན་པ་ལ་མཁས་པ། རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་ལ་\nཞུགས་པས་རྟག་པ་དང་ཆད་པར་ལྟ་བའི་མཐའ་གཉིས་ཡོངས་སུ་སྤངས་པ། བསམ་གཏན་དང་། རྣམ་པར་ཐར་པ་དང་། ཏིང་ངེ་འཛིན་དང་། སྙོམས་པར་འཇུག་པ་དང་། མཉམ་པར་བཞག་པ་དང་། ལྡང་བ་ཤེས་པ་ལ་མཁས་པ་\nཕྱོགས་བཅུར་སྒྲ་གྲགས་པ། དམ་པའི་ཆོས་དཀོན་མཆོག་གི་མཛོད་ཡང་དག་པར་འཛིན་པ། དཀོན་མཆོག་གསུམ་གྱི་རིགས་རྒྱུན་མི་ཆད་པར་བྱེད་པ། བསོད་ནམས་དང་ཡེ་ཤེས་ཀྱི་ཚོགས་དཔག་ཏུ་མེད་པ་བསགས་པ་ཤ་\nསྟག་ལ་འདི་ལྟ་སྟེ། བྱང་ཆུབ་སེམས་དཔའ་ཟླ་བའི་བླ་མ་ཞེས་བྱ་བ་དང་། ཟླ་བའི་ཏོག་དང་། རི་བོང་ཅན་གྱི་ཏོག་དང་། འོད་ཀྱི་ཏོག་དང་། འོད་དཔལ་དང་། དཔལ་བརྩེགས་དང་། དཔལ་སྦས་དང་། མཐུ་བོ་ཆེ་དང་། ཀླུ་དགའ་དང་། ཀླུའི་\nབླ་མ་དང་། ཀླུས་བྱིན་དང་། གཟུགས་འཛིན་དང་། མྱ་<span class='add'>  ངམ་  </span>གྱི་ལྷ་དང་། ཡོན་ཏན་སྒྲོན་པའི་རྒྱལ་པོ་དང་། ལག་ན་སྒྲོན་མ་དང་། རྟག་ཏུ་ལག་འདེག་དང་། རྟག་ཏུ་ལག་བརྐྱང་དང་། ལག་ན་ཕྱག་རྒྱ་རིན་པོ་ཆེ་དང་། ལག་ན་རིན་པོ་ཆེ་དང་། \nཀུན་དུ་སྣང་དང་། སྐར་མའི་རྒྱལ་པོ་དང་། ལག་ན་རྡོ་རྗེ་དང་། རྡོ་རྗེའི་བློ་གྲོས་དང་། རྡོ་རྗེའི་བློ་གྲོས་ཆེན་པོ་དང་། རྡོ་རྗེས་རྣམ་པར་གནོན་དང་། མི་གཡོ་བའི་གོམ་པར་འགྲོ་བ་དང་། འཇིག་རྟེན་གསུམ་རྣམ་པར་གནོན་དང་། མཐའ་\nཡས་བློ་གྲོས་དང་། བློ་གྲོས་མཐའ་ཡས་དང་། བློ་གྲོས་རྒྱ་མཚོ་དང་། བརྟན་པའི་བློ་གྲོས་དང་། ནོར་གྱི་བློ་གྲོས་དང་། བླ་མའི་བློ་གྲོས་དང་། ཁྱད་པར་བློ་གྲོས་དང་། འཕེལ་བའི་བློ་གྲོས་དང་། རྟག་ཏུ་མོས་དང་། རྟག་ཏུ་དགོད་ཅིང་\nརབ་ཏུ་དགའ་བའི་དབང་པོ་དང་། ངན་སོང་སྤོང་དང་། སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་སེལ་བ་དང་། ཤིན་དུ་རྣམ་པར་སྦྱངས་པ་དྲི་མ་མེད་པའི་གཟི་བརྗིད་འཆང་བ་དང་། བརྩོན་འགྲུས་<span class='add'>  འབར་  </span>དང་། ཤེས་རབ་བརྩེགས་དང་། རྟག་པར་ལྟ་དང་།"
 ],
 [
  "78.114a",
  "སྤྱན་རས་གཟིགས་དབང་ཕྱུག་དང་། མཐུ་ཆེན་ཐོབ་དང་། ལྷུན་པོ་བརྩེགས་དང་། ནམ་མཁའི་མཛོད་དང་། མི་འཛུམས་པ་དང་། བརྗོད་མེད་དང་། རིན་ཆེན་དམ་པ་དང་། རིན་ཆེན་སེམས་དཔའ་དང་། དོན་ལེགས་པར་\nརྣམ་པར་བསམས་པ་དང་། ཤིན་ཏུ་ངེས་པའི་བློ་གྲོས་དང་། གཟུངས་ཀྱི་དབང་ཕྱུག་གི་རྒྱལ་པོ་དང་། ས་འཛིན་དང་། བཀོད་པའི་རྒྱལ་པོ་དང་། ཞིང་ཡང་དག་པར་བསྟན་པ་དང་། རིན་ཆེན་འབྱུང་གནས་དང་། ཕུག་སྦས་དང་། \nདབང་པོའི་ལྷ་དང་། ཆུ་ལྷ་དང་། ཚངས་པ་དྲ་བ་ཅན་དང་། བྱང་ཆུབ་སེམས་དཔའི་འདྲ་བ་ཅན་གྱི་འོད་ཅེས་བྱ་བ་དང་། ལྷའི་ཅོད་པན་དང་། ལག་བཟངས་དང་། མིག་བཟངས་དང་། སྤོས་ཀྱི་གླང་པོ་དང་། བལ་གླང་སྤོས་ཀྱི་གླང་པོ་ཆེ་དང་། སེང་\nགེའི་ཏོག་དང་། དོན་གྲུབ་བློ་གྲོས་དང་། ཁ་ལོ་སྒྱུར་དང་། ཞི་བའི་བློ་གྲོས་དང་། བྱམས་པ་དང་། འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་དང་། དེ་དག་ལ་སོགས་པ་བྱང་ཆུབ་སེམས་དཔའ་བརྒྱད་ཁྲི་བཞི་སྟོང་དང་། གང་དག་སྟོང་གསུམ་\nགྱི་སྟོང་ཆེན་<span class='add'>  པོའི་  </span>འཇིག་རྟེན་གྱི་ཁམས་འདི་ན་བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། འཇིག་རྟེན་སྐྱོང་བ་དང་། དེ་མ་ཡིན་པའི་ལྷའི་དབང་པོ་འམ། ཀླུའི་དབང་པོ་འམ། གནོད་སྦྱིན་གྱི་དབང་པོ་འམ། དྲི་ཟའི་དབང་པོ་འམ། ལྷ་མ་ཡིན་\nགྱི་དབང་པོའམ། ནམ་མཁའ་ལྡིང་གི་དབང་པོ་འམ། མི་འམ་ཅིའི་དབང་པོ་འམ། ལྟོ་<span class='add'>  འཕྱེད་  </span>ཆེན་པོའི་དབང་པོ་དབང་ཆེ་བར་གྲགས་པ་ཡོད་པ་དེ་དག་ཐམས་ཅད་ཀྱང་འཁོར་དེ་ཉིད་དུ་འདུས་པར་གྱུར་པ་ལ་འདི་ལྟ་སྟེ། ཀླུའི་རྒྱལ་\nཔོ་མ་དྲོས་པ་ཞེས་བྱ་བ་དང་། ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོ་དང་། ཆུ་ལྷ་དང་། གཟི་ཅན་དང་། འཇོག་པོ་དང་། གསེར་མདོག་དང་། ཁ་དོག་མཐའ་ཡས་དང་། ཀླུའི་རྒྱལ་པོ་ལ་མཚམས་བཟངས་དང་། དེ་དག་དང་གཞན་ཡང་ཀླུའི་རྒྱལ་པོ་འཁོར་\nདང་བཅས་པ་བརྒྱ་སྟོང་ཕྲག་མང་པོ་བཅོམ་ལྡན་འདས་ལ་ལྟ་བ་དང་། ཕྱག་བྱ་བ་དང་། མཆོད་པ་དང་། བསྙེན་བཀུར་བྱ་བ་དང་། ཆོས་མཉན་པའི་ཕྱིར་འཁོར་དེ་ཉིད་དུ་འདུས་པར་གྱུར་ཏོ། །ལྷ་མ་ཡིན་གྱི་དབང་པོ་སྒྲ་གཅན་དང་།"
 ],
 [
  "78.115b",
  "སེམས་དང་། ཆོས་ལ་སོ་སོར་རྟོག་པར་འགྱུར་རོ། །ཡང་དག་པའི་སྤོང་བའི་ཚོགས་ནི་མི་དགེ་བའི་ཚོགས་ཐམས་ཅད་སྤོང་བ་དང་། དགེ་བའི་ཆོས་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ། །རྫུ་འཕྲུལ་གྱི་རྐང་པའི་ཚོགས་\nནི་ལུས་དང་སེམས་ཡང་དག་པར་འགྱུར་རོ། །དབང་པོའི་ལྔའི་ཚོགས་ནི་དབང་པོ་མཆོག་དང་མཆོག་མ་ཡིན་པ་ཤེས་པར་འགྱུར་རོ། །སྟོབས་ལྔའི་ཚོགས་ནི་ཉོན་མོངས་པ་ཅན་ཐམས་ཅད་ཀྱིས་མི་རྫི་བར་འགྱུར་རོ། །བྱང་ཆུབ་ཀྱི་ཡན་\nལག་གི་ཚོགས་ནི་ཆོས་ཐམས་ཅད་ཇི་ལྟ་བ་བཞིན་དུ་ཁོང་དུ་ཆུད་པར་འགྱུར་རོ། །ལམ་གྱི་ཚོགས་ནི་ལམ་ངན་པ་ཐམས་ཅད་ལས་ཡོངས་སུ་དག་པར་འདའ་བར་འགྱུར་རོ། །བདེན་པའི་ཚོགས་ནི་མི་འཁྲུགས་པའི་ཆོས་ཉིད་ཏུ་འགྱུར་རོ། །\nསོ་སོ་ཡང་དག་པར་རིག་པའི་ཚོགས་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཐེ་ཙོམ་གཅོད་པར་འགྱུར་རོ། །རྟོན་པའི་ཚོགས་ནི་གཞན་ལ་རག་མ་ལས་པའི་ཡེ་ཤེས་སུ་འགྱུར་རོ། །དགེ་བའི་བཤེས་གཉེན་གྱི་ཚོགས་ནི་ཡོན་\nཏན་ཐམས་ཅད་སྐྱེ་བའི་སྒོར་འགྱུར་རོ། །བསམ་པའི་ཚོགས་ནི་འཇིག་རྟེན་ཐམས་ཅད་ལ་མི་སླུ་བར་འགྱུར་རོ། །ལྷག་པའི་བསམ་པའི་ཚོགས་ནི་ཁྱད་པར་དུ་འགྲོ་བར་འགྱུར་རོ། །སྦྱོར་བའི་ཚོགས་ནི་རྩོམ་པ་ཐམས་ཅད་\nཉམས་འོག་ཏུ་<span class='add'>  ཆུད་  </span><span class='add'>  པར་  </span>འགྱུར་རོ། །ནང་དུ་ཡང་དག་འཇོག་གི་ཚོགས་ནི་ཇི་སྐད་ཐོས་པའི་ཆོས་ཆུད་མི་གཟོན་པར་འགྱུར་རོ། །བསྡུ་བའི་དངོས་པོའི་ཚོགས་ནི་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པར་འགྱུར་རོ། །དམ་པའི་\nཆོས་ཡོངས་སུ་འཛིན་པའི་ཚོགས་ནི་དཀོན་མཆོག་གསུམ་གྱི་རིགས་རྒྱུན་མི་གཅོད་པར་འགྱུར་རོ། །བསྔོ་བ་ལ་མཁས་པའི་ཚོགས་ནི་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་འགྱུར་རོ། །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་\nཐབས་ལ་མཁས་པའི་ཚོགས་ནི་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་དེ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ། །དེ་ལྟར་བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ལ་ཚོགས་རྣམ་པར་དག་པའི་སྒོ་"
 ],
 [
  "78.119a",
  "ལུས་ལ་མི་ལྟ་བས་ཤ་ཟ་བའི་སེམས་ཅན་ཇི་སྙེད་ཡོད་པ་ཤའི་ལོངས་སྤྱོད་གང་དང་གང་འདོད་པ་དེ་ལྟ་བུའི་ཤ་རྣམས་བདག་གི་ལུས་ལས་དེ་དག་ལ་བསྟན་ནས་བདག་སྲོག་དང་ཕྲལ་ཏེ་སེམས་ཅན་དེ་དག་ལ་སྦྱིན་<span class='add'>  པར་  </span>བྱེད་\nདོ། །ཁྲག་འཐུང་བ་རྣམས་ལ་ཁྲག་སྦྱིན་པར་བྱེད་དོ། །རྐང་ཟ་བ་རྣམས་ལ་རྐང་སྦྱིན་པར་བྱེད་དོ། །གཟི་བྱིན་ཟ་བ་རྣམས་ལ་གཟི་བྱིན་སྦྱིན་པར་བྱེད་དོ། །ཞི་བའི་བློ་གྲོས་དེ་ལྟར་ཤའི་ལོངས་སྤྱོད་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་བདག་གི་ལུས་\nལས་བསྟབས་ཏེ་སྲོག་དང་ཕྲལ་ནས་སེམས་ཅན་དེ་དག་ལ་སྦྱིན་པར་བྱེད་དོ། །དེའི་ལུས་ཚད་མེད་པ་ནི་ཆོས་ཀྱི་དབྱིངས་ཚད་མེད་པའི་རྗེས་སུ་འགྲོ་བས་མི་ཟད་དོ། །དེའི་ལུས་མི་ཟད་པ་མངོན་པར་སྒྲུབ་པ་ནི་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་\nམི་ཟད་པ་མངོན་པར་སྒྲུབ་པས་རབ་ཏུ་རིག་པར་འགྱུར་རོ། །དེ་ལུས་ཀྱིས་སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱེད་དེ། གང་དག་འདོད་ཆགས་ལ་སྤྱོད་པའི་སྡུག་པའི་རྣམ་པ་དང་། མཚན་མར་འཛིན་པའི་སེམས་ཅན་དེ་དག་གི་མདུན་\nདུ་བུད་མེད་གཟུགས་བཟང་ཞིང་མཛེས་པ་བལྟ་ན་སྡུག་པ་སྟོན་ཏེ། དེ་ལ་སེམས་ཅན་དེ་དག་ཆགས་པ་སྐྱེས་<span class='add'>  ནས་  </span>བྱུགས་ཤིང་ཀུན་དུ་བྱུགས་ཏེ་དེ་དག་<span class='add'>  པང་  </span>ཏུ་འཇོག་གོ །དེ་དག་སྐྱེས་བུ་དེ་དག་གི་པང་དུ་སོང་བ་དང་རྙིས་ཤིང་སྐམས་ནས་\nའཆི་བའི་དུས་བྱེད་དོ། །མི་གཙང་ཞིང་དྲི་མི་ཞིམ་པར་གྱུར་པས་སྐྱེས་བུ་དེ་དག་དེས་ཡིད་བྱུང་ནས་པོར་ཏེ་སོང་བ་དང་། ཤི་བའི་རོ་དེ་དག་ཉིད་<span class='add'>  ལས་ལ  </span>སྐྱེས་བུ་དེ་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མ་ལྡོག་པར་\nའགྱུར་བའི་ཆོས་བསྟན་པ་དེ་ལྟ་བུ་ཡང་འབྱུང་ངོ་། །ཡང་ཞི་བའི་བློ་གྲོས་བྱང་ཆུབ་སེམས་དཔའ་དེ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ལུས་ཀྱིས་ཁྱབ་པར་བྱས་ཏེ་སོར་མཱི་རྩེ་མོས་ཡུངས་འབྲུ་ལ་བྱ་བ་བཞིན་དུ་རིན་\nཔོ་ཆེའི་གདུགས་ཀྱིས་ཁེངས་པར་བྱེད་དོ། །སྲེག་པའི་བསྐལ་པའི་མེ་ལག་པའི་སོར་མོས་གཡོགས་ཀྱང་དེའི་ལུས་ཉམས་པར་མི་འགྱུར་རོ། །དེ་ལུས་ཀྱིས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ལ་མཆོད་ཅིང་རིམ་འགྲོ་བྱེད་དེ་། མེ་"
 ],
 [
  "78.116b",
  "ཅན་གྱིས་ཐུལ་བར་དཀའོ། །བདུད་ཀྱི་ལམ་ལས་ཡང་དག་པར་འདས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་འགྱུར་ཏེ། ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་\nདཔའ་ལ་ནི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་དེ་བཞིན་གཤེགས་པའི་གསང་བ་ཐམས་ཅད་སྟོན་ཏེ་མི་འཆབ་བོ། །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཞི་བའི་བློ་གྲོས་ཀྱིས་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེ་ལ་འདི་སྐད་ཅེས་\nསྨྲས་སོ། །གསང་བ་པའི་བདག་པོ་ཁྱོད་ནི་དེ་བཞིན་གཤེགས་པའི་ཞབས་འབྲིང་ཉེ་བ་ན་འདུག་པ་ཡིན་ན་གསང་པའི་བདག་པོ་དེ་བཞིན་གཤེགས་པའི་གསང་བའི་གནས་གང་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་\nཅད་ཀྱིས་ཡང་མ་ཡིན་ན། དེ་མ་ཡིན་པའི་སེམས་ཅན་ཐ་མལ་ལྟ་སྨོས་ཀྱང་ཅི་དགོས་པ་ལས་རྩོམས་ཏེ། ཁྱོད་སྤོབས་པར་གྱིས་ཤིག །དེ་སྐད་ཅེས་སྨྲས་པ་དང་། གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེས་ཅང་མི་སྨྲ་བས་\nཁས་བླངས་སོ། །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཞི་བའི་བློ་གྲོས་ཀྱིས་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེས་ཅང་མི་སྨྲ་བས་ཁས་བླངས་པར་རིག་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་\nའདས་གང་དག་ཐོས་པས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་རབ་ཏུ་དགའ་བར་འགྱུར་ཏེ། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་ཡང་དག་པར་སྒྲུབ་པ་དང་། དེ་བཞིན་གཤེགས་པའི་གསང་བ་ཡོངས་སུ་རྫོགས་\nཔར་བགྱི་བའི་སླད་ཏུ་བརྩོན་བར་བགྱིད་པར་དེ་བཞིན་གཤེགས་པའི་གསང་བ་འཁོར་འདི་ལ་འཆད་པར་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེ་སྤྲོ་བར་མཛད་དུ་གསོལ། དེ་སྐད་ཅེས་གསོལ་བ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་\nགསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །གསང་བ་པའི་བདག་པོ་བྱང་ཆུབ་སེམས་དཔའི་གསང་བ་དང་། དེ་བཞིན་གཤེགས་པའི་གསང་བ་འཁོར་<span class='add'>  འདི་  </span>ཉན་པར་འདོད་དེ་ཁྱོད་ལ་ངས་"
 ],
 [
  "78.117a",
  "བསྐུལ་གྱིས་དེ་བཞིན་གཤེགས་པའི་གསང་བ་ལས་རྩོམས་ཏེ་འཁོར་འདིར་སྤོབས་པར་གྱིས་ཤིག །དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་། གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་\nགསོལ་ཏོ། །བཅོམ་ལྡན་འདས་འདི་ལྟར་སངས་རྒྱས་ཀྱི་མཐུ་དང་། སངས་རྒྱས་ཀྱི་བྱིན་གྱིས་བརླབས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའི་གསང་བ་རྣམས་དང་། དེ་བཞིན་གཤེགས་པའི་གསང་བ་རྣམས་ལ་གང་ཅུང་ཟད་འཇུག་པར་\nབགྱི་བ་ཙམ་ཞིག་བསྟན་པ་བདག་གིས་བསྟན་པར་བགྱིའོ། །བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ་དཔེར་བགྱི་ན་མཚན་མོ་མུན་པ་<span class='add'>  མུན་  </span>གནག་གི་ནང་ན་མར་མེའི་མཐུས་གཟུགས་སུ་གྱུར་པའི་རྣམ་པ་ཐམས་ཅད་གདའ་བ་དེ་བཞིན་<span class='add'>  དུ།   </span>\nབཅོམ་ལྡན་འདས་སངས་རྒྱས་མཐུ་དང་། སངས་རྒྱས་ཀྱིས་བྱིན་གྱིས་བརླབས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའི་གསང་བ་རྣམས་དང་། དེ་བཞིན་གཤེགས་པའི་གསང་བ་རྣམས་གང་ཅུང་ཟད་འཇུག་པར་བགྱི་བ་ཙམ་བསྟན་\nཔར་བགྱིའོ། །དེ་ནས་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཞི་བའི་བློ་གྲོས་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་དེའི་ཕྱིར་ཅི་ནས་བྱང་ཆུབ་སེམས་དཔའི་གསང་བ་རྣམས་\nདང་། དེ་བཞིན་གཤེགས་པའི་གསང་བ་རྣམས་ཐོས་ནས་མི་དངང་། མི་སྐྲག །སྐྲག་པར་མི་འགྱུར་བར་འཁོར་དེར་ལེགས་པར་འཁོར་ཅིག །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཞི་བའི་བློ་གྲོས་ཀྱིས་ཐམས་\nཅད་དང་ལྡན་པའི་འཁོར་ལ་སྨྲས་པ། གྲོགས་པོ་དག་དེ་བཞིན་གཤེགས་པས་བསམ་གྱིས་མི་ཁྱབ་པ་འདི་བཞི་གསུངས་ཏེ། བཞི་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ལས་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། ཀླུ་བསམ་གྱིས་མི་ཁྱབ་པ་<span class='add'>  དང་།   </span>\nབསམ་གཏན་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། སངས་རྒྱས་བསམ་གྱིས་མི་ཁྱབ་<span class='add'>  པའོ། །  </span>ཡང་གྲོགས་པོ་དག་གང་གི་ཕྱིར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་བསམ་གྱིས་མི་ཁྱབ་པ་འདི་"
 ],
 [
  "78.117b",
  "བཞི་རྣམ་པར་བཀོད་དེ་བསམ་གྱིས་མི་ཁྱབ་པ་འདི་བཞི་འི་ནང་ན་དེ་བཞིན་གཤེགས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་མཆོག་ཏུ་གསུངས་སོ། །གྲོགས་པོ་དག་དེ་ལ་ཁྱེད་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། དེ་བཞིན་\nགཤེགས་པའི་བསམ་གྱིས་མི་ཁྱབ་པ་ཐོས་ནས་མི་དངང་། མི་སྐྲག སྐྲག་པར་མི་འགྱུར་བར་བྱའོ། །ཐོས་ནས་ལྷག་པར་དགའ་བ་དང་། དད་པ་དང་། མཆོག་ཏུ་དགའ་བ་རྒྱ་ཆེར་བསྐྱེད་པར་བྱའོ། །དེ་ནས་བྱང་ཆུབ་སེམས་\nདཔའ་ཆེན་པོ་ཞི་བའི་བློ་གྲོས་ཀྱིས་ཇི་ལྟར་ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དེ་བཞིན་གཤེགས་པའི་གསང་བ་ཉན་པ་ལ་མོས་པར་གྱུར་ཅིང་། ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་ཀྱི་དཀྱིལ་འཁོར་དུ་ལྷའི་མེ་ཏོག་\nགིས་པུས་མོ་ནུབ་ཙམ་དུ་བཀྲམ་<span class='add'>  པར་  </span>གྱུར་པ་དེ་ལྟ་བུའི་བྱིན་གྱིས་བརླབས་ཀྱིས་བྱིན་གྱིས་བརླབས་སོ། །དེ་ནས་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཞི་བའི་བློ་གྲོས་ལ་འདི་སྐད་\nཅེས་སྨྲས་སོ། །ཞི་བའི་བློ་གྲོས་དེའི་ཕྱིར་ཤིན་དུ་ལེགས་པར་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག་དང་། བྱང་ཆུབ་སེམས་དཔའི་གསང་པའི་གནས་རྣམས་བཤད་པར་བྱའོ། །ཞི་བའི་བློ་གྲོས་གང་ཚུན་ཅད་བཅོམ་ལྡན་འདས་དེ་\nབཞིན་གཤེགས་པ་མར་མེ་མཛད་ཀྱིས་དེ་བཞིན་གཤེགས་པ་བྱང་ཆུབ་སེམས་དཔར་གྱུར་པ་ན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་པ་དེ་ཚུན་ཅད་ཁོ་བོ་བྱང་ཆུབ་སེམས་དཔའི་ཞབས་འབྲིང་ན་\nའདུག་འདུག་ན་བྱང་ཆུབ་སེམས་དཔའི་ལུས་འགྱུར་བའམ། ལུས་ཚུལ་འཆོས་པ་ཁོ་བོས་ནམ་ཡང་མ་མཐོང་ངོ་། །ངག་འགྱུར་བ་འམ། ངག་གི་ཁ་གསག་ཀྱང་མ་ཐོས། སེམས་འགྱུར་བ་འམ། སེམས་གཡོ་བ་\nཡང་མ་མཐོང་ངོ་། །དེ་ལུས་དང་ལུས་ཀྱི་སྤྱོད་ལམ་གྱིས་སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱེད་དེ་ཚིག་ཏུ་ནི་མི་སྨྲའོ། །སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་དེའི་ལུས་ཀྱི་སྤྱོད་ལམ་མཐའ་ཡས་མུ་མེད་པར་"
 ],
 [
  "78.119b",
  "ཏོག་གི་གདུགས་རི་རབ་ཙམ་དག་ཀྱང་འབུལ་ལོ། །དེ་བཞིན་གཤེགས་པ་རྣམས་ལ་མཆོད་པ་བྱ་བའི་ཕྱིར་མེ་ཏོག་གི་སྐོན་བུ་དག་ཀྱང་མཐོར་རོ། །དེ་བཞིན་གཤེགས་པ་རྣམས་ལ་མཆོད་པ་བྱ་བའི་ཕྱིར་དེ་སྟོང་གསུམ་ །།\nགྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་སྤོས་ཀྱི་འབྲུ་མར་གྱིས་གང་བའི་སྣོད་གཅིག་ཏུ་མོས་ཏེ། རི་རབ་ཙམ་གྱི་སྙིང་པོ་འབར་བར་བྱས་པའི་མར་མེ་འབར་བར་བྱེད་དོ། །དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པ་བྱ་བའི་ཕྱིར་གང་གཱི་ཀླུང་གི་\nབྱེ་མ་སྙེད་ཀྱི་མར་མེ་འབར་བར་བྱེད་དོ། །དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པ་བྱ་བའི་ཕྱིར་རང་གི་ལུས་ཀྱང་རས་བཅོས་བུས་དཀྲིས་ནས་མར་དང་འབྲུ་མར་གྱིས་བསྐུས་ཏེ་མར་མེ་འབུད་དོ། །དེ་འབར་བར་གྱུར་པ་དེ། སངས་རྒྱས་\nཀྱི་ཞིང་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་སྣང་བ་ཆེན་པོས་ཁྱབ་པར་གྱུར་ཏེ། སེམས་ཅན་དག་གིས་ཀྱང་མཐོང་ཞིང་ཤེས་ཏེ། བྱང་ཆུབ་སེམས་དཔའི་ཁྱུ་མཆོག་ཏུ་གྱུར་པ་དེ་མཐོང་ནས་ཀྱང་སེམས་ཅན་ཚད་མེད་གྲངས་མེད་པ་དག་ནི་བླ་\nན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ། །ང་རྒྱལ་དང་། རྒྱགས་པ་དང་། དྲེགས་པས་རློམ་པའི་སེམས་ཅན་རྣམས་ལ་ཡང་བདག་གི་གཟུགས་ཚན་པོ་ཆེ་ཆེན་པོ་དང་། སྲེད་མེད་ཀྱི་བུ་དང་། ལག་ན་རྡོ་རྗེའི་\nགཟུགས་སུ་སྟོན་ཏེ། དེར་སེམས་ཅན་དེ་དག་སྤྲུལ་པས་འཇིགས་སྐྲག་ནས་བྱང་ཆུབ་སེམས་དཔའ་དེ་ལ་མངོན་པར་འདུད་ཅིང་ཕྱག་འཚལ་ལོ། །དེ་ལ་ཆོས་ཀྱང་ཉན་<span class='add'>  པར་  </span>འདོད་དོ། །གང་ཡང་གྲོང་ཁྱེར་ཆེན་པོ་དག་གི་དུར་ཁྲོད་ཆེན་པོ་\nསྲོག་ཆགས་བརྒྱ་སྟོང་དུ་མས་གང་བར་གྱུར་<span class='add'>  པ་  </span>དེར་ཡང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེས་བདག་གི་ལུས་ཆེན་པོ་ཤི་ཞིང་དུས་ལས་འདས་པར་སྟོན་ཏེ། དེར་ཡང་སེམས་ཅན་དུད་འགྲོའི་སྐྱེས་གནས་སུ་གྱུར་\nཔ་དེ་དག་གིས་ཅི་ཙམ་འདོད་པར་ཤ་ལ་ཟོས་ནས་ཚེའི་མཐར་ཕྱིན་ཏེ་འཆི་བའི་དུས་སུ་གྱུར་ཅིང་ཤི་ནས་བདེ་འགྲོ་མཐོ་རིས་ཀྱི་འཇིག་རྟེན་དུ་ལྷའི་ནད་དུ་སྐྱེའོ། །དེ་ཡང་དེ་དག་གི་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའི་བར་དུ་རྒྱུར་འགྱུར་རོ། །"
 ],
 [
  "78.120a",
  "དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་དེ་ཉིད་སྔོན་གྱི་སྨོན་ལམ་ཡོངས་སུ་དག་པའི་ཕྱིར་ཏེ་བདག་འཆི་བའི་དུས་སུ་གྱུར་ནས། ཤི་བའི་དུ་ལ་སེམས་ཅན་གང་དག་གིས་ཟོས་པ་དེ་དག་ལ་དེ་ཉིད་མཐོ་རིས་སུ་སྐྱེ་བ་ནས་ཡོངས་སུ་མྱ་\nངན་ལས་འདའ་བའི་བར་གྱི་རྒྱུད་གྱུར་ཅིག་ཅེས་ཡུན་རིང་པོ་ནས་སྨོན་ལམ་བཏབ་སྟེ། ཚུལ་ཁྲིམས་དང་ལྡན་བདེ་བསམ་པ་འགྲུབ། འདོད་པ་འགྲུབ། སྨོན་པ་འགྲུབ་བོ། །ཞི་བའི་བློ་གྲོས་རྣམ་གྲངས་འདིས་ཇི་ལྟར་བྱང་ཆུབ་སེམས་\nདཔའི་ལུས་ཚད་མེད་ཅིང་མཐའ་ཡས་པར་ཁྱོད་ཀྱིས་འདི་ལྟར་རིག་པར་བྱ་སྟེ། ཞི་བའི་བློ་གྲོས་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན་འཛམ་བུའི་གླིང་དུ་གཏོགས་པ་ནམ་མཁས་བསྐོར་བ་འདི་ཉིད་དུ་གྲོང་ཁྱེར་བརྒྱད་ཁྲི་བཞི་སྟོང་པ་ཕྲག་\nབཞི་བྱུང་སྟེ། དེ་ན་གྲོང་དང་།ཚོང་དུས་དང་། རི་ཁྲོད་སྟོང་ཕྲག་མང་པོ་སྲོག་ཆགས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་མང་པོ་གནས་པ་ཡོད་དེ། ཞི་བའི་བློ་གྲོས་དེའི་ཚེ་དེའི་དུས་ན། ནད་ཆེན་པོའི་བསྐལ་པ་བར་མ་བྱུང་སྟེ། \nདེར་སེམས་ཅན་དག་ནད་སྣ་ཚོགས་ཀྱིས་བཏབ་པར་གྱུར་ནས་ཕལ་ཆེར་ལུས་ཤུ་བ་ཅན་དང་། ལུས་རྣག་པ་དང་། འབྲས་དང་། ཕོལ་མིག་དང་། མེ་དཔལ་དང་། ཐོར་བུ་དང་། རླུང་དང་། མཁྲིས་པ་དང་། བད་ཀན་གྱི་<span class='add'>  ནད་  </span>ཀྱིས་\nརྒྱས་པར་གྱུར་ཏོ། །དེའི་ཆེ་སྨན་པ་སྟོང་ཕྲག་དུ་མ་སེམས་ཅན་དེ་དག་གི་ནད་དེ་ཞི་བར་བྱ་བའི་ཕྱིར་བརྩོན་<span class='add'>  པར་  </span>གྱུར་ཀྱང་སེམས་ཅན་དེ་དག་གི་ནད་དེ་བསལ་བར་མ་ནུས་སོ། །དེར་སེམས་ཅན་དེ་དག་གིས་གསོ་བའི་དཔྱད་\nམ་རྙེད་དེ། སྐྱབས་མེད་རྟེན་མེད་ནས་འདི་སྐད་དུ། ནད་འདི་ལས་ནི་ཐར་བྱེད་པ། ལྷ་འམ་ཀླུ་འམ་དྲི་ཟ་འམ། གནོད་སྦྱིན་དང་ནི་མི་ཡང་རུང་། མི་མ་ཡིན་པ་སུ་ཞིག་ཡོད། སྡུག་བསྔལ་འདི་ལས་ཐར་བྱེད་པ། དེ་ལ་ནོར་\nརྣམས་ཐམས་ཅད་གཏང་། རྗེས་སུ་བསྟན་པ་བཞིན་དུ་བྱ། བྱས་པ་དག་ཀྱང་གཟོ་བར་བྱ། ཞེས་ཀུ་ཆོ་ཆེར་བཏོན་ཏོ། །ཞི་བའི་བློ་གྲོས་འདི་ལྟར་བཅོམ་ལྡན་འདས་ཤཱ་ཀྱ་ཐུབ་པ་འདི་དེའི་ཚེ་དེའི་དུས་ན་ལྷའི་དབང་པོ་བརྒྱ་"
 ],
 [
  "78.121a",
  "ཅིང་ཁྱེར་ཡང་། དེའི་ལུས་ལས་བྲི་བའམ། གང་བར་མི་མངོན་ཏེ་ཡང་བཅད་ཡང་བཅད་ཀྱང་ཕྱིར་སྐྱེ་བར་གྱུར་ཏོ། །ཞི་བའི་བློ་གྲོས་དེ་ལྟར་སེམས་ཅན་ཇི་སྙེད་ཀྱིས་སྲོག་ཆགས་ཀྱི་རྣམ་པ་ངེས་པའི་ཤ་ཟོས་པ་དེ་དག་\nཟོས་མ་ཐག་ཏུ་ནད་ཐམས་ཅད་ཞི་བར་གྱུར་ཏེ། ནད་མེད་ཅིང་བདེ་བ་དང་། ཉམས་པ་མེད་པར་གྱུར་ཏོ། །དེ་ནས་མཐར་གྱིས་འཛམ་བུའི་གླིང་གི་སེམས་ཅན་གྱི་ནད་ཐམས་ཅད་བསལ་བར་གྱུར་ཏོ། །ཞི་བའི་བློ་གྲོས་དེ་ནས་\nའཛམ་བུ་གླིང་གི་སྐྱེས་པ་དང་། བུད་མེད་དང་། བྱེའུ་དང་། བུ་མོ་དག་འདི་སྙམ་དུ་སེམས་ཏེ་སྲོག་ཆགས་ཀྱི་རྣམ་པ་དེས་པ་དེས་བདག་ཅག་ནད་ལས་ཡོངས་སུ་ཐར་ཅིང་ནད་མེད་པར་བྱས་ཏ་ེ་བདེ་ཞིང་འགྱུར་<span class='add'>  བ་  </span>མེད་པར་བྱས་\nཀྱིས་བདག་ཅག་གིས་དེ་ལ་མཆོད་པའི་གནས་ཤིག་བྱའོ་སྙམས་གནས་དེ་དག་ཐམས་ཅད་གཅིག་ཏུ་འདུས་ཏེ་སྲོག་ཆགས་ཀྱི་རྣམ་པ་<span class='add'>  དེས་  </span>པ་ག་ལ་བ་དེར་སོང་ནས་ཐལ་མོ་སྦྱར་ཏ་སྲོག་ཆགས་ཀྱི་རྣམ་པ་<span class='add'>  དེས་  </span>པ་ལ་ཚིགས་སུ་བཅད་\nཔས་སྨྲས་པ། ཁྱོད་ནི་བདག་<span class='add'>  ཅག་  </span>གནས་དང་སྐྱབས། ཁྱོད་ནི་བདག་ཅག་སྨན་པ་སྨན། ཁྱོད་ལ་མཆོད་པ་གང་<span class='add'>  བགྱི་  </span>པ། ཁྱོད་ཀྱིས་བདག་ཅག་བཀའ་སྩོལ་ཅིག། དེ་ནས་སྲོག་ཆགས་ཀྱི་རྣམ་པ་<span class='add'>  དེས་  </span>པས་ལུས་དེ་མི་སྣང་\nབར་བྱས་ཏེ་བདག་ཅག་གིས་བརྒྱ་བྱིན་གྱིས་བརྒྱ་བྱིན་གྱི་ལུས་དུ་འདུག་ནས་སྐྱེ་བོའི་ཚོགས་ཆེན་པོ་དེ་ལ་ཚིགས་སུ་བཅད་པས་སྨྲས་པ། ང་ལ་ནོར་དང་ཟས་སྐོམ་དང་། གསེར་<span class='add'>  དང་  </span>འབྲུ་རྣམས་དགོས་པ་མེད་། ཐམས་ཅད་ལྷན་ཅིག་\nའཐུན་པར་ནི། དགེ་བ་བཅུའི་ལས་ལམ་སྲུངས། སེམས་ཅན་ཀུན་ལ་ཕན་པའི་ཕྱིར། བྱང་ཆུབ་སྨོན་ལམ་བརྟན་པ་ཐོབ། ཕན་པའི་དངོས་པོ་ཉིད་ཀྱི་སེམས། གཅིག་ལ་གཅིག་ཀྱང་བྱམས་པ་བསྐྱེད། །\nབརྒྱ་བྱི་ལས་ནི་ཚིག་འདི་ཐོས། སེམས་ཅན་དེ་དག་རབ་དགའ་སྟེ། ཤིན་ཏུ་ཡོངས་སུ་དག་པ་ཡི། དགེ་བ་བཅུ་ཡི་ལས་ལམ་བླངས་། ཞི་བའི་བློ་གྲོས་དེ་ལྟར་དེ་ཚུན་ཆད་<span class='add'>  འཛམ་  </span>བུའི་གླིང་ཐམས་ཅད་དུ་སྐྱེས་པ་དག་། བུད་མེད་དང་། ཁྱེའུ་དང་། བུ་མོ་དེ་སྙེད་"
 ],
 [
  "78.121b",
  "ལས་ཐ་ན་སེམས་ཅན་གཅིག་ཀྱང་ལོག་པར་ལྟུང་བར་སོང་བ་མི་དྲན་ནོ། །དེ་ཚུན་ཆད་དེ་དག་ཐམས་ཅད་ཤི་འཕོས་ཏེ་ཤི་བའི་དུས་བྱས་ནས་ཀྱང་བདེ་འགྲོ་མཐོ་རིས་ཀྱི་འཇིག་རྟེན་དུ་སུམ་བཅུ་རྩ་གསུ་གྱི་ལྷ་རྣམས་དང་སྐལ་པ་མཉམ་\nཔར་སྐྱེས་ཏེ་། དེ་དག་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་དེས་ཆོས་ཀྱི་གཏམ་གྱིས་ཡང་དག་པར་དགའ་བ་བྱས། ཡང་དག་པར་འཛིན་དུ་བཅུག །ཡང་དག་པར་གཟེངས་<span class='add'>  སྟོད་  </span>ནས་དེ་ལ་ཁ་ཅིག་གིས་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་\nསེམས་བསྐྱེད་དོ། །ཁ་ཅིག་ནི་ཆོས་རྣམས་ལ་ཆོས་ཀྱི་རིག་རྡུལ་མེད་ཅིང་དྲི་མ་དང་བྲལ་བ་རྣམ་པར་དག་གོ །ཞི་བའི་བློ་གྲོས་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་ལུས་ཀྱི་གསང་བ་དང་། ལུས་ཀྱི་ལས་ཡོངས་སུ་དག་པ་སྟེ། དེ་ལྟར་ལུས་གཅིག་ཡོངས་\nསུ་བཏང་བས་ན་སེམས་ཅན་ཚད་མེད་གྲངས་མེད་པ་དག་ཡོངས་སུ་སྨིན་པར་བྱས་སོ། །གཞན་ཡང་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེས་བྱང་ཆུབ་སེམས་དཔའ་ཞི་བའི་བློ་གྲོས་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཞི་བའི་བློ་གྲོས་བྱང་ཆུབ་\nསེམས་དཔའི་ལུས་ནི་མི་ཤིགས་པ། སྲ་བ། བརྟན་<span class='add'>  པ།   </span>འཆི་འཕོ་མེད་པ། རྫུས་ཏེ་སྐྱེ་བ་སྟེ། ལུས་དེ་ནི་འཇིག་པས་འདུལ་བའི་སེམས་ཅན་རྣམས་འདུལ་<span class='add'>  བའི་  </span>དབང་གི་ཕྱིར་འཇིག་གོ །ལུས་མི་འཇིག་པས་འདུལ་བའི་སེམས་ཅན་རྣམས་། \nའདུལ་བའི་དབང་གི་ཕྱིར་ཐམས་ཅད་ཀྱི་ཐམས་ཅད་དུ་མི་འཇིག་སྟེ། མེས་མི་<span class='add'>  ཚིག །  </span>མཚོན་གྱི་མི་ཚུགས་ཤིང་། དངོས་རྡོ་རྗེ་ལྟར་སྲ་ཞིང་བརྟན་ཏེ། མི་ཤིགས་པའོ། །ཞི་བའི་བློ་གྲོས་དེ་ལྟར་བྱང་བྱང་ཆུབ་སེམས་དཔའ་ནི་ལུས་ཀྱིས་སེམས་ཅན་\nཡོངས་སུ་སྨིན་པར་བྱེད་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་མི་སེམས་མི་རྟོག་སྟེ། ལུས་ལ་ལུས་ཀྱི་དབེན་པའི་མཚན་ཉིད་ཀྱང་རབ་ཏུ་ཤེས་སོ། །ལུས་ཀྱི་དབེན་པའི་མཚན་ཉིད་ཀྱིས་ཀྱང་ཆོས་ཀྱི་དབེན་པའི་མཚན་ཉིད་ཤེས་སོ། །ལུས་ཀྱི་དབེན་པའི་མཚན་ཉིད་དང་\nཆོས་ཐམས་ཅད་ཀྱི་དབེན་པའི་མཚན་ཉིད་ཀྱང་གཉིས་སུ་མི་འབྱེད་དེ། ལུས་ཀྱི་དབེན་པའི་མཚན་ཉིད་ཀྱི་མཚན་ཉིད་གང་ཡིན་པ་དེ་ནི་ཆོས་ཀྱི་དབེན་པའི་མཚན་ཉིད་ཀྱིས་མཚན་ཉིད་དོ། །དེ་ལྟར་ན་དབེན་པའི་མཚན་ཉིད་ཀྱིས་རྗེས་སུ་འཇུག་གོ ། །དེ་"
 ],
 [
  "78.122a",
  "རང་གི་ལས་ཀྱི་དབེན་པའི་མཚན་ཉིད་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱིས་ལུས་ཀྱི་དབེན་པའི་མཚན་ཉིད་མཉམ་<span class='add'>  པར་  </span>བྱེད་དོ། །དེ་རང་གི་ལུས་ཀྱི་དབེན་པའི་མཚན་ཉིད་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་ལུས་ཀྱི་དབེན་པའི་མཚན་ཉིད་ཀྱང་ཆོས་ཀྱི་དབྱིངས་ཀྱི་\nདབེན་པའི་མཚན་ཉིད་ཏུ་ཤེས་སོ། །ཆོས་ཕྲ་རབ་ཙམ་ཡང་མི་དམིགས་པས་ཆོས་ཀྱི་དབྱིངས་ཀྱི་དབེན་པའི་མཚན་ཉིད་དང་།ཆོས་ཐམས་ཅད་ཀྱི་དབེན་པའི་མཚན་ཉིད་ཀྱང་རྗེས་སུ་འཐོབ་བོ། །དེ་རང་གི་ལུས་ཀྱི་དེ་བཞིན་ཉིད་ཀྱིས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ལུས་\nཀྱི་དེ་བཞིན་ཉིད་ཤེས་སོ། །སེམས་ཅན་ཐམས་ཅད་ཀྱི་ལུས་ཀྱི་དེ་བཞིན་ཉིད་ཀྱིས་རང་གི་ལུས་ཀྱི་དེ་བཞིན་ཉིད་ཤེས་སོ། །དེ་རང་གི་ལུས་ཀྱི་དེ་བཞིན་ཉིད་ཀྱིས་ཆོས་ཐམས་ཅད་ཀྱི་དེ་བཞིན་ཉིད་ཤེས་སོ། །ཆོས་ཐམས་ཅད་ཀྱི་དེ་བཞིན་ཉིད་ཀྱིས་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་\nདེ་བཞིན་ཉིད་ཤེས་སོ། །དེ་རང་གི་ལུས་ཀྱི་དེ་བཞིན་ཉིད་ཀྱིས་འདས་པ་དང་། །མ་འོངས་པ་དང་། ད་ལྟར་བྱུང་བའི་དེ་བཞིན་ཉིད་ཤེས་ཏེ། འདས་པའི་དེ་བཞིན་ཉིད་ཀྱང་མ་འོངས་པའི་དེ་བཞིན་ཉིད་དང་འགལ་བར་མི་བྱེད་དོ། །འདས་པ་དང་། མ་འོངས་པ་དང་། ད་ལྟར་བྱུང་\nབའི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་ཕུང་པོ་དང་། ཁམས་དང་། སྐྱེ་མཆེད་ཀྱི་དེ་བཞིན་ཉིད་དོ། །ཕུང་པོ་དང་། ཁམས་དང་། སྐྱེ་མཆེད་ཀྱི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་ཉིད་ཀུན་ནས་ཉོན་མོངས་པ་དང་། རྣམ་པར་བྱང་བའི་དེ་བཞིན་ཉིད་དོ། །ཀུན་ནས་ཉོན་\nམོངས་པ་དང་། རྣམ་པར་བྱང་བའི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་འཁོར་བ་དང་མྱ་ངན་ལས་འདས་པའི་དེ་བཞིན་ཉིད་དོ། །འཁོར་བ་དང་མྱ་ངན་ལས་འདས་པའི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་མངོན་པར་འདུ་མི་བྱེད་པའི་དེ་བཞིན་ཉིད་དོ། །མངོན་པར་འདུ་མི་བྱེད་\nཔའི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་མངོན་པར་འདུ་བྱེད་པ་ཐམས་ཅད་ཀྱི་དེ་བཞིན་ཉིད་ཀྱང་དེ་ཉིད་ཡིན་ནོ། །རིགས་ཀྱི་བུ་དེ་བཞིན་ཉིད་ཅེས་བྱ་བ་ནི་དེ་ཁོ་ན་ཉིད་དག་། དེ་ལྟ་བུ་ཉིད་དག་། གཞན་མ་ཡན་པ་ཉིད་དང་། མི་འགྱུར་བ་ཉིད་དང་། མི་འབྱུང་བ་ཉིད་དང་། \nརྩོད་པ་མེད་པ་ཉིད་དང་། གཟུགས་མེད་པ་ཉིད་དོ། །དེ་བཞིན་ཉིད་ལ་གཟུགས་གང་ཡང་མེད་དེ། གཟུགས་མེད་པ་ནི་དེ་བཞིན་ཉིད་ཅེས་བྱའོ། །ཇི་ལྟར་དེ་བཞིན་ཉིད་གཟུགས་མེད་པ་དེ་བཞིན་དུ་གཟུགས་ཐམས་ཅད་ཀྱང་གཟུགས་མེད་པ་<span class='add'>  སྟེ།  </span>"
 ],
 [
  "78.120b",
  "བྱིན་མིང་གཟངས་ཞེས་བྱ་བར་གྱུར་ཏེ། དེས་ལྷའི་མིག་རྣམ་པར་དག་པ་མིའི་ལས་འདས་པ་སེམས་ཅན་དེ་དག་ནད་སྣ་ཚོགས་མང་པོ་བཏབ་པ་ཡང་མཐོང་། ལྷའི་རྣ་བ་རྣམ་པར་དག་པ་མི་ལས་འདས་པ་ཀུ་ཆོ་<span class='add'>  ཆེ  </span>ན་པོ་\nའདོན་པའི་སྒྲ་ཡང་ཐོས་སོ། །དེས་དེ་དག་མཐོང་ཞིང་ཐོས་ནས་ཀྱང་སྙིང་རྗེ་ཆེན་པོ་བསྐྱེད་དེ། དེ་འདི་སྙམ་དུ་བདག་ཅི་ནས་སེམས་ཅན་གནས་མེད་པ་འདི་དག་གནས་སུ་འགྱུར་བར་བྱའོ། །སྐྱབས་མེད་པ་དང་། རྟེན་མེད་པ་རྣམས་\nཀྱི་སྐྱབས་དང་རྟེན་དུ་འགྱུར་བར་བྱའོ་སྙམ་དུ་བསམས་ནས་<span class='add'>  དེས་  </span>དེ་མ་ཐག་ཏུ་འཛམ་བུའི་གླིང་གི་དབུས་ན་གྲོང་ཁྱེར་ཆེན་པོ་ཀུ་རུ་ཞེས་བྱ་བ་ཞིག་ཡོད་པ་དང་ཧ་ཅང་ཡང་མི་རིང་བ་ཞིག་ཏུ་སྲོག་ཆགས་དེས་པ་ཞེས་བྱ་བར་རྫུས་ཏེ་སྐྱེས་\nནས་སྟེང་གི་བར་སྣང་ལ་འདུག་སྟེ་འཛམ་བུའི་གླིང་གི་མི་ཐམས་ཅད་ལ་ཚིགས་སུ་བཅས་པས་བསྐུལ་པ། ཀུ་རུའི་གྲོང་ཁྱེར་ཉེ་བ་ན་། སྲོག་ཆགས་དེས་བ་ཞེས་བྱ་ཡོད། དེ་ཡི་<span class='add'>  ཤ་ལ་  </span>སུས་ཟོས་པ། དེ་ནི་ནད་ལས་ཐར་བར་འགྱུར། \nའཇིགས་པར་མ་བྱེད་སྐྲག་པར་མ་བྱེད་པར། ཇི་ལྟར་འདོད་པ་དེའི་ཤ་ལོང་ཤིག། དེ་ལ་ཁྲ་མེད་གཤེ་མེད་གནོད་སེམས་མེད། འཛམ་བུའི་གླིང་འདིར་དེ་ནི་སྨན་ཡིན་ནོ། །ཞི་བའི་བློ་གྲོས་དེ་ལྟར་གྲོང་དང་། གྲོང་ཁྱེར་དང་། \nགྲོང་རྡལ་དང་། ཚོང་དུས་དང་། རི་ཁྲོད་དེ་དག་ན་སེམས་ཅན་ནད་པ་ཇི་སྙེད་ཡོད་པ་དེ་དག་གིས་སྒྲ་དེ་ཐོས་ནས་གྲོང་ཁྱེར་ཆེན་པོ་ཀུ་རུ་ག་ལ་བ་དང་། སྲོག་ཆགས་ཀྱི་རྣམ་པ་དེས་པ་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས་སྲོག་ཆགས་དེས་པའི་\nལས་ལས་ཤ་བཅད་ཅིང་བཅད་ཅིང་ཁྱེར་ཡང་དེའི་ལུས་ལ་ཤ་ཟད་པར་མ་གྱུར་ནས་དེས་པས་ཚིགས་སུ་བཅད་པ་འདི་སྨྲས་སོ། །བདེན་པ་གང་གིས་བྱང་ཆུབ་ཐོབ་འགྱུར་ཞིང་། བདག་གི་ཡེ་ཤེས་ཟད་པར་མི་འགྱུར་བ། །བདེན་\nཔ་དེས་ནི་བདག་གིས་ལུས་ལས་ཤ། <span class='add'>  འདིར་  </span>ནི་ནམས་ཀྱང་ཟད་པར་མ་གྱུར་ཅིག། ཞི་བའི་བློ་གྲོས་དེ་ལྟར་ཕྱོགས་བཞིའི་སེམས་ཅན་ནད་པ་ཇི་སྙེད་ཡོད་པ་དེ་དག་གིས་སྲོག་ཆགས་ཀྱི་རྣམ་པ་དེས་པའི་ལུས་ལས་ཤ་བཅད་ཅིང་བཅད་"
 ],
 [
  "78.122b",
  "བྱང་ཆུབ་སེམས་དཔའ་སེམས་ཅན་ཐམས་ཅད་གཟུགས་དེ་སྟོན་ཀྱང་དེ་བཞིན་ཉིད་གཟུགས་སུ་མི་བྱེད་དོ། །དེ་གཟུགས་མེད་ཅིང་རྩོད་པ་མེད་ཀྱང་ལུས་དང་གཟུགས་ཐམས་ཅད་ཀྱང་སྟོན་ཏེ་དེ་བཞིན་ཉིད་ཀྱང་འཁྲུགས་པར་མི་བྱེད་དོ། །དེ་བཞིན་ཉིད་ཀྱི་ཡེ་ཤེས་\nཀྱིས་དེ་བཞིན་གཤེགས་པའི་སྐུ་ལ་རྟོག་གོ །དེ་བཞིན་གཤེགས་པའི་སྐུ་མཉམ་པ་ཉིད་ཀྱིས་བདག་གི་ལུས་མཉམ་པ་ཉིད་ལ་རྟོག་གོ །ལུས་ནི་ཤིན་དུ་མ་སྐྱེས་པ་ཉིད་ཡིན་པས་ན་ལུས་ཐམས་ཅད་ནི་ལུས་མེད་པར་ཡང་དག་པར་མཐོང་ངོ་། །\nལུས་ཐམས་ཅད་ནི་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བར་རབ་ཏུ་ཤེས་སོ། །ཤེས་ནས་ཆོས་ཀྱི་སྐུ་མངོན་པར་སྒྲུབ་བོ། དེ་ཆོས་ཀྱི་སྐུ་མངོན་པར་བསྒྲུབས་པས་ཆོས་ཀྱི་སྐུ་ཉིད་ཏུ་འགྱུར་ཏེ། ཕུང་པོ་དང་། ཁམས་དང་། སྐྱེ་མཆེད་ཀྱི་ལུས་ནི་མ་\nཡིན་ནོ། །དེ་ཆོས་ཀྱི་སྐུས་རབ་ཏུ་ཕྱེ་བས་ན་མཐོང་བས་ཀྱང་སེམས་ཅན་མཐོང་བས་ཀྱང་སེམས་ཅན་རྣམས་ཀྱི་དོན་བྱེད་དོ། །ཐོས་པ་དང་། རེག་པས་ཀྱང་སེམས་ཅན་རྣམས་ཀྱི་དོན་བྱེད་དོ། །ཞི་བའི་བློ་གྲོས་འདི་ལྟ་སྟེ། སྨན་པའི་རྒྱལ་པོ་འཚོ་<span class='add'>  བྱེད་  </span>ཀྱིས་རྩི་\nཐམས་ཅད་བསྡུས་སྟེ། རྩིའི་ཤིང་མང་པོ་ལས་བུ་མོའི་གཟུགས་བཟང་ཞིང་མཛེས་པ་། བལྟ་ན་སྡུག་པ་ལེགས་པར་བྱས་ཏེ། ལེགས་པར་ཟིན་ཅིང་ལེགས་པར་བྱི་དོར་བྱས་པ་དེ་འོང་བ་འམ། འགྲོ་བ་འམ། འགྲེང་ངམ། འདུག་གམ། ཉལ་\nཡང་རྟོག་པ་མེད་ཅིང་རྣམ་པར་རྟོག་པ་མེད་དོ། །དེར་ནད་པ་གང་བཙུན་པ་འམ་རྒྱལ་པོའམ། རྒྱལ་པོའི་བློན་<span class='add'>  པོ་  </span>ཆེན་པོ་འམ། རྒྱལ་པོའི་བུ་འམ། ཚོང་དཔོན་ནམ། ཁྱིམ་བདག་གམ། བློན་པོ་འམ། རྒྱལ་ཕྲན་གང་དག་འོང་བ་དེ་དག་སྨན་པའི་རྒྱལ་\nཔོ་འཚོ་བྱེད་ཀྱིས་སྨན་གྱི་བུ་མོ་དེ་<span class='add'>  དང་  </span>ཕྲད་ནས་དེ་དག་ཕྲད་མ་ཐག་ཏུ་ནད་ཐམས་ཅད་བྱུང་སྟེ། ནད་མེད་ཅིང་བདེ་ལ་ཉམས་པ་མེད་པར་འགྱུར་རོ། །ཞི་བའི་བློ་གྲོས་གང་སྨད་པ་གཞན་ལ་མ་<span class='add'>    </span>སྨན་པའི་རྒྱལ་པོ་འཚོ་བྱེད་ཀྱི་འཇིག་རྟེན་གྱི་\nནད་གསོ་བའི་ཤེས་པ་ལ་བལྟོས། ཞི་བའི་བློ་གྲོས་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཀྱི་སྐུས་རབ་ཏུ་ཕྱེ་བ་ཡང་སེམས་ཅན་བུད་མེད་དང་། སྐྱེས་པ་དང་། ཁྱེའུ་དང་། བུ་མོ་འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་གིས"
 ],
 [
  "78.123b",
  "ཟླའི་ངོ་བོ་ཉིད་ཀྱི་སྐུ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་ངེས་པར་བརྟགས་པའི་སྐུ། ཕྱོགས་བཅུ་མ་ལུས་པའི་ནམ་མཁའ་ཁྱབ་པའི་སྐུ། སེམས་ཅན་ཐམས་ཅད་ལ་མཉམ་པའི་སྐུ། མཐའ་ཡས་\nམུ་མེད་པའི་སྐུ། འགྱུར་བ་མེད་ཅིང་རྣམ་པར་རྟོག་པ་མེད་པའི་སྐུ་མི་གཡོ་ཞིང་། རློམ་སེམས་མེད་པའི་སྐུ་གནས་པ་དང་། མི་གནས་པ་དང་། མི་གཡོ་བ་ཐོབ་པའི་སྐུ། གཟུགས་ཀྱི་རང་བཞིན་མ་ཡིན་པའི་<span class='add'>  སྐུ།   </span>\nཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པའི་རང་བཞིན་མ་ཡིན་པའི་སྐུ་སྟེ། སའི་ཁམས་ཀྱིས་རབ་ཏུ་ཕྱེ་བ་མ་ཡིན་། ཆུའི་ཁམས་ཀྱིས་མ་ཡིན། མེའི་ཁམས་ཀྱིས་མ་ཡིན་། \nརླུང་གི་ཁམས་ཀྱིས་ཀྱང་རབ་ཏུ་ཕྱེ་བ་མ་ཡིན་ཏེ། མ་བྱུང་བ་ཀུན་ནས་མ་བྱུང་བའོ། །འབྱུང་བ་ཆེན་པོ་རྣམས་ཀྱིས་རབ་ཏུ་ཕྱེ་བ་མ་ཡིན་པའོ། །འབྱུང་བ་མ་ཡིན། འབྱུང་བའི་\nཆོས་མ་ཡིན་པའོ། །འཇིག་རྟེན་ཐམས་ཅད་དང་མི་མཐུན་པའོ། མིག་ལས་མ་བྱུང་བའོ། །རྣ་བ་ལས་མི་གནས་པའོ། །སྣས་ཤེས་པར་བྱ་བ་མ་ཡིན་ནོ། །\nལྕེས་རབ་ཏུ་ཕྱེ་བའོ། །ལུས་དང་ལྡན་པ་མ་ཡིན་པའོ། །ཡིད་ཀྱིས་ཉེ་བ་སྤྱད་པ་མ་ཡིན་པའོ། །སེམས་དང་མི་། འཇུག་པའོ། །ཡིད་ཀྱི་རྣམ་པར་ཤེས་པ་དང་མི་འཇུག་མི་ལྡོག་རྗེས་སུ་མི་འཇུག་པ་\nསྟེ། ཞི་བའི་བློ་གྲོས་དེ་བཞིན་གཤེགས་པའི་སྐུ་ནི་དེ་འདྲའོ། །དེ་ལ་བྱང་ཆུབ་སེམས་དཔས་དེ་བཞིན་གཤེགས་པའི་སྐུ་མཉམ་པ་ཉིད་ཐོབ་ནས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཡོངས་སུ་དག་པ་ལ་སྤྱོད་ཅིང་། སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ན་གླིང་བཞི་<span class='add'>  པའང་  </span>རུང་\nའཛམ་བུའི་གླིང་ཡང་རུང་། གྲོང་དང་། གྲོང་ཁྱེར་དང་། གྲོང་རྡལ་དང་། ཡུལ་འཁོར་དག་། ཕོ་བྲང་འཁོར་ཇི་སྙེད་ཡོད་པ་ཐམས་ཅད་དུ་བྱང་ཆུབ་སེམས་དཔའ་མཐོང་བར་ཡང་བྱེད་ལ་བདུད་ཐམས་ཅད་ཀྱིས་མི་མཐོང་བ་དང་སྣང་བར་འགྱུར་རོ། །དེ་མཐོང་བར་ཡང་བྱེད་ལ་མཐོང་"
 ],
 [
  "78.124a",
  "བར་སྣང་བ་ཡང་མེད་དོ། །མཐོང་བར་མི་<span class='add'>  བྱེད་  </span>པས་ཀྱང་མཐོང་བར་སྣང་ངོ། །མཐོང་བ་དང་། ཐོས་པ་དང་། རྟོགས་པ་དང་། རྣམ་པར་རིག་པས་རབ་ཏུ་ཕྱེ་བ་ཡང་མི་ཡིན་ནོ། །སེམས་ཅན་ཡོངས་སུ་སྨིན་\nཔར་བྱས་པས་རབ་ཏུ་ཕྱེ་བ་ཡིན་ཡང་ལུས་སུ་གཏོག་པའི་དྲན་<span class='add'>  པ་  </span>ཉེ་བར་གཞག་པ་ལས་ཀྱང་མི་ཉམས་ཡོངས་སུ་མི་ཉམས་སོ། །དེ་ལུས་མི་རྟག་པ་དང་། ལུས་སྡུག་བསྔལ་བ་དང་། ལུས་བདག་མེད་པར་ཡང་སེམས་ཅན་\nརྣམས་ལ་སྟོན་ལ། ལུས་ཀྱི་ཞི་བའི་ཆོས་ཉིད་ཀྱང་རབ་ཏུ་ཤེས་སོ། །དེ་ལུས་རབ་ཏུ་དབྱེ་བ་ཡང་སེམས་ཅན་རྣམས་ལ་སྟོན་ལ། རྒྱུ་གང་དང་། དམིགས་པ་གང་དག་གིས་ལུས་མངོན་པར་འགྲུབ་པའི་རྒྱུ་དེ་དག་དང་། \nདམིགས་པ་དེ་དག་ཀྱང་། བྱེད་པ་པོ་མེད་པ་དང་། ཚོར་བ་པོ་མེད་པར་ཡང་དག་པར་རྗེས་སུ་མཐོང་ངོ་། །ལུས་རྩྭ་དང་། ཤིང་དང་། རྩིག་པ་དང་། རྨི་ལམ་དང་། མི་ཡོར་ལྟ་བུར་ཡང་རབ་ཏུ་ཤེས་ཤིང་དེ་ལུས་ཀྱི་\nལས་ཡོངས་སུ་དག་པར་ཡང་སེམས་ཅན་རྣམས་ལ་སྟོན་དེ་ཞི་བའི་བློ་གྲོས་འདི་ནི་དེ་བཞིན་གཤེགས་པ་མར་མེ་མཛད་ཚུན་ཅད། བྱང་ཆུབ་སེམས་དཔའི་ལུས་ཀྱི་གསང་བ་དང་། ལུས་ཀྱི་ལས་ཡོངས་སུ་དག་པའོ། །\nདེ་བས་ལྷག་པར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ལུས་ཀྱི་ལས་ཡོངས་སུ་དག་པ་བསྐལ་པ་བརྒྱ་སྟོང་ངམ། དེ་བས་ཀྱང་ལྷག་པར་བསྟན་ཏོ། །ཞི་བའི་བློ་གྲོས་གལ་ཏེ་དེ་བཞིན་གཤེགས་པ་ཉིད་\nཀྱིས་བྱང་ཆུབ་སེམས་དཔའི་ལུས་ཀྱི་གསང་བ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱི་བསྐལ་པར་བསྟན་ཀྱང་ཟད་པར་མི་འགྱུར་ཏེ། བྱང་ཆུབ་སེམས་དཔའི་ལུས་ཀྱི་གསང་བ་བསྟན་པ་དེ་ནི་དེ་ཙམ་དུ་ཚད་མེད་པ་བསམ་གྱིས་མི་ཁྱབ་བོ། །དེས་\nཔའི་ལེའུ་སྟེ་དང་པའོ། །བམ་པོ་གཉིས་པ། གཞན་ཡང་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེས་བྱང་ཆུབ་སེམས་དཔའ་ཞི་བའི་བློ་གྲོས་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཞི་བའི་བློ་གྲོས་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་<span class='add'>  ངག་  </span>གི་"
 ],
 [
  "78.124b",
  "གསང་བ་དང་། དག་གིས་ལས་ཡོངས་སུ་དག་པ་གང་ཞེ་ན། ཞི་བའི་བློ་གྲོས་སེམས་ཅན་རྣམས་ཀྱི་སྐྱེ་བའི་གནས་ཇི་སྙེད་<span class='add'>  པར་  </span>བྱང་ཆུབ་སེམས་དཔའི་སྐྱེས་པའི་རབས་ཀྱང་དེ་སྙེད་དོ། །བྱང་ཆུབ་སེམས་དཔའི་སྐྱེས་པའི་རབས་ཇི་སྙེད་པར་སྒྲ་ལ་འཇུག་པའང་དེ་\nསྙེད་དོ། །སེམས་ཅན་དེ་དག་གི་སྒྲ་བརྗོད་པ་དང་། ཚིག་གི་ལམ་བརྗོད་པ་དང་། <span class='add'>  ངེས་  </span>པའི་ཚིག་དང་། བརྡ་<span class='add'>  དང་།   </span>སྨྲ་བ་དང་། ཡང་དག་པར་སྨྲ་བ་དང་། མཚན་མ་དང་། སྤྱོད་པ་དང་། བདེ་བ་དང་། སྡུག་བསྔལ་བརྗོད་<span class='add'>  པ་  </span>ཇི་སྙེད་པའི་སྒྲ་ལ་འཇུག་པ་དེ་དག་ཐམས་ཅད་ལ་\nབྱང་ཆུབ་སེམས་དཔའི་ཡེ་ཤེས་མཐོང་བ་ཐོགས་པ་མེད་པར་འཇུག་སྟེ། ཐ་ན་སྲིན་བུ་དང་། སྦྲང་བུ་དང་། ཤ་སྦྲང་དང་། ཕྱེ་མ་ལེབ་ཀྱི་སྒྲ་དག་ལ་ཡང་ཡེ་ཤེས་མཐོང་བ་འཇུག་གོ །སྒྲའི་རྣམ་པར་རིག་པ་བསྒྲག་པ་ཇི་ལྟ་བུས་སེམས་ཅན་དེ་དག་གི་\nལུས་ཤིན་དུ་སྦྱངས་<span class='add'>  པ་  </span>དང་། སེམས་ཤིན་དུ་སྦྱངས་པ་སྐྱེ་བར་འགྱུར་བ་དེ་ལྟ་བུའི་སྒྲ་རྣམ་པར་རིག་པ་བསྒྲག་པ་བྱང་ཆུབ་སེམས་དཔའ་དེའི་ཁའི་སྒོ་ནས་འབྱུང་<span class='add'>  ངོ་། །  </span>དེ་ལ་འདི་ནི་ཆོས་ཉིད་ཡིན་ཏེ་དེ་ལ་འདི་སྐད་ཅེས་བྱའོ། །ཇི་ལྟར་སེམས་ཅན་མཐའ་མ་གང་\nཡང་མེད། དེ་ལྟར་སྐྱེས་པའི་རབས་སྟེ་དཔག་ཏུ་མེད། བསྐལ་པ་བརྒྱ་སྙེད་བཤད་ཀྱང་མཐའ་མ་མེད། བསམ་ཡས་དེ་དག་ཇི་ལྟར་བཤད་པར་བྱ། སྐྱོན་རྣམས་མེད་པ་བདག་ཉིད་ཆེ་བ་བའི་ཚིག། སེམས་དང་བསམ་<span class='add'>  པ་རྒྱ་  </span>ཆེན་རབ་སྟོན་པ། ནམ་མཁའ་\nལྟ་བུའི་གང་མེད་བྲི་མེད་པ། འོན་ཀྱང་དཔེ་དོན་ལྡན་བ་བཤད་པར་བྱ། ཞི་བའི་བློ་གྲོས་བྱང་ཆུབ་སེམས་དཔའི་ཚིག་ནི་ཚངས་པའི་སྒྲ་སྐད་དུ་འབྱིན་པ་དང་། བརྒྱ་བྱིན་གྱི་སྒྲ་སྐད་དུ་འབྱིན་པ་དང་། འཇིག་རྟེན་སྐྱོང་བའི་སྒྲ་སྐད་དུ་འབྱིན་པ་དང་། ལྷ་དང་། ཀླུ་དང་། \nགནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མི་འམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་ཐམས་ཅད་ཀྱི་སྒྲ་སྐད་དུ་འབྱིན་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྒྲ་སྐད་དུ་འབྱིན་པ་དང། སེམས་ཅན་ཐམས་ཅད་ཀྱི་བསམ་<span class='add'>  པ་  </span>ཚིམ་པར་\nབྱེད་པའོ། །དེ་ལ་འདི་སྐད་ཅེས་བྱ་སྟེ། བདག་ཉིད་ཆེན་པོ་རྣམས་ཀྱི་མ་སྨད་ཚིག། གང་བ་མེད་ཅིང་བྲི་མེད་ནམ་མཁའ་བཞིན། སེམས་དང་བསམ་བརྒྱ་ཆེན་བསྟན་པ་དག། དེ་དག་བརྗོད་པ་རྣམས་ལ་ནན་ཏན་ཉོན། བྱམས་ལ་སྦྱོར་དང་སྙིང་རྗེར་འཇུག་"
 ],
 [
  "78.125a",
  "པ་དང་། དགའ་བ་དང་ནི་བཏང་སྙོམས་<span class='add'>  རབ་  </span>བཤད་དེ། ཚངས་པ་ལས་ཀྱང་འདས་པའི་སྒྲ་ཕྱུང་བས། ལེགས་བཤད་དེས་ནི་ཚངས་པ་ཚིམ་པར་བྱེད་། གང་དག་བརྒྱ་བྱིན་རོལ་མོ་ཡིད་འོང་སྒྲ། དེ་དག་དེ་ཡི་སྒྲ་བརྗོད་ཟིལ་གྱིས་ནོན། རོལ་\nམོ་སྒྲ་དབྱངས་བྱུང་བ་དེ་ལས་ནི། ཆོས་རྣམས་རབ་ཏུ་དབྱེ་བ་དཔག་མེད་འབྱུང་། མི་འམ་ཅི་ཡི་སྒྲ་དག་གང་ཡོད་པ། དེ་བས་དེ་ཡི་སྒྲ་མཆོག་ཕུན་སུམ་ཚོགས། དེ་ནི་འདོད་ཆགས་འབར་བར་མི་བྱེད་དེ། དེ་ཡི་ཚིག་གིས་མི་ཅི་དགའ་བར་འགྱུར། \nའདོད་པའི་ཁམས་ན་ཡིད་འོང་སྒྲ་ཡོད་པ། རོལ་མོའི་སྒྲ་དང་ལྷ་ཡི་སྒྲ་མང་པོ། ཆོས་ཀྱི་དོན་འབྱོར་དགེ་བར་ལྡན་པ་ཡི། དེ་ཡི་ཚིག་གིས་ཀུན་དུ་ཚིམ་པར་བྱེད། མི་ཡི་འདྲེན་པ་ཡིན་ཚིག་ཐོས་ནས། འདོད་ཆགས་ཞི་ཞིང་ཞེ་སྡང་རབ་ཏུ་ཞི་། གཏི་མུག་\nགཡོ་དང་ང་རྒྱལ་དྲེགས་པ་ཞི། དོན་རྣམས་གཏན་ལ་ཕེབས་ཤིང་ཐེ་ཙོམ་མེད། གཟུགས་ཀྱི་ཁམས་ན་ལྷ་རྣམས་གང་གནས་པ། དེ་དག་ཡིད་ནི་དེ་ཡིས་ཚིམ་པར་བྱེད། མི་ཡི་གཙོ་<span class='add'>  བོའི་  </span>ཚིག་རྣམས་ཐོས་ནས་ནི། འཇིག་རྟེན་སངས་\nརྒྱས་གྱུར་ཅེས་བྱང་ཆུབ་ཚོ་ལ། <span class='add'>  ཀླུ་  </span>བར་དྲི་ཟ་ལྟོ་འཕྱེ་ཆེ་རྣམས་ཀྱི། རོལ་མོ་སྣ་ཚོགས་སྒྲ་ཡོད་དེ་དག་པས། ཡོན་ཏན་རྒྱ་མཚོ་ལྡན་བའི་སྒྲ་བསྒྲགས་པ། ཐམས་ཅད་རབ་ཏུ་དགའ་བ་རྒྱ་ཆེན་བྱེད། འཛམ་གླིང་འདི་ན་ཐ་དད་ཕྱོགས་རྣམས་\nསུ་། ཀུན་ན་སྒྲ་སྐད་མཐའ་ཡས་གྱུར་མོད་ཀྱི། དེ་ཡི་སྐད་ཀྱི་རྣམ་པ་བསྒྲགས་གྱུར་ན། དེ་ཐོས་མི་རྣམས་ཐར་པ་རྗེས་སུ་འཐོབ། ས་ལྷའི་ལྷ་དང་དེ་བཞིན་བར་སྣང་ལྷ། དེ་དག་སྒྲ་སྐད་འཇུག་པ་ཅི་འདྲ་བ། དེ་ལྟར་དེ་ལ་དེ་ཡི་སྒྲ་ཡང་\nའཇུག་། རྣམ་པར་དེས་དབེན་གཏམ་ཡང་དེ་འདུའོ། །<span class='add'>  ངང་  </span>པ་ཁྲུང་ཁྲུང་ཀ་ལ་བིང་ཀ་དང་། རྨ་བྱ་ནེ་ཙོ་ཁུ་ཕྱུག་ཤད་ཤད་ཏེའུ། རི་སྐེགས་དང་ནི་དུར་བ་ཀུན་ལ་ཀུན། ཇི་ལྟའི་སྐད་ཀྱིས་དེ་ནི་ཚིམ་པར་བྱེད། སྟག་དང་སེང་གེ་དེ་བཞིན་\nདོམ་དང་སྤྲེའུ། གཟིག་དང་བྱི་ལ་རི་དགས་གླ་ཆེན་བསེ། རྟ་དང་ཁྱི་དང་ཕག་དང་འུག་པ་ཀུན། ཇི་ལྟའི་སྐད་ཀྱིས་དེས་ནི་ཚིམ་བར་བྱེད། གང་དག་རྐང་བཞི་པ་དང་རྐང་གཉིས་པ། རྐང་མངས་དང་ནི་དེ་བཞིན་རྐང་མེད་རྣམས། བསྐུལ་དང་"
 ],
 [
  "78.125b",
  "ཆད་པས་བཅད་དང་ཕན་གདགས་ཕྱིར། ཀུན་ལ་དེ་ཡི་སྒྲ་སྐད་ཤེས་པ་འཇུག། སེམས་ཅན་གང་དག་སྟོང་གསུམ་འཇིག་རྟེན་ན། རབ་བམ་འབྲིང་དམ་འོན་ཏ་ཐ་མའམ། དམྱལ་བ་དུད་འགྲོ་གཤིན་རྗེའི་འཇིག་རྟེན་དང་། ལྟ་མི་རྣམས་དང་\nདེ་ནི་སྐད་ཀྱང་འཐུན། ཇི་ལྟར་རིགས་པར་བྱེད་པ་སྟན་ཀྱང་ནི། མི་སེམས་འདུ་ཤེས་མེད་ཅིང་རྟོག་པ་མེད། མཚན་མ་མེད་ཅིང་འཛིན་མེད་འཆིང་བ་མེད། མཉམ་པར་བཞག་<span class='add'>  པས་  </span>སེམས་ནི་འཁྲུལ་<span class='add'>  པ་  </span>མེད། དག་པའི་སེམས་ཅན་གལ་ཏེ་འདོད་ན་ཡང་། \nདེ་ལ་འབད་དང་སེམས་འཛིན་མེད་པར་ནི། བྱེ་བའི་ཞིར་དང་དེ་ཡི་གོང་དུ་ཡང་། གང་གཱའི་བྱེ་སྙེད་དབྱངས་ཀྱིས་གོ་བར་བྱེད། སྟོང་གསུམ་འཇིག་རྟེན་བདུད་གང་ཅི་ཡོད་པ། དེ་དག་དེ་ཡི་འཇིགས་ཆེན་སྒྲ་ཐོས་ནས།།ཆུང་མར་བཅས་ཏེ་འཇིགས་\nསྐྲག་ལ་གོར་དུ། ཐལ་མོ་སྦྱར་ཏེ་གུས་པར་འདུད་པར་བྱེད། སེམས་ཅན་གང་དག་རབ་ཏུ་སྨྲ་འདོད་དང་། ང་རྒྱལ་ཟིལ་ནོན་སུ་ལའང་མི་འདུད་པ། དེ་དག་དེ་ཡི་གསལ་བའི་ཚིག་ཐོས་ནས། ཐལ་མོ་སྦྱར་ཏེ་གུས་<span class='add'>  པར་  </span>འདུད་པར་བྱེད། །\nའོན་བ་གླེན་པ་དག་དང་ལྕེ་མེད་དང་། དགེ་<span class='add'>  པ་  </span>རྣམས་དང་གང་དག་སྐད་འཛེར་བ། དེ་དག་དེ་ཡི་ལེགས་སྨྲས་སྙན་ཐོས་ནས། སྒྲ་སྐད་ཡིད་དུ་འོང་བ་འབྱིན་པར་བྱེད། ཉོན་མོངས་གདུངས་ཤིང་ཉོན་མོངས་གཟིར་བ་དང་། ཉེས་པའི་\nའགྱོད་པ་བརྒྱ་ཡིས་བཀྲིས་པ་རྣམས། དེ་དག་དེ་ཡི་དགེ་ཚིག་དག་ཐོས་ནས། འགྱོད་པ་བཏུལ་བར་གྱུར་ཅིང་བསིལ་བར་གྱུར། སངས་རྒྱས་དང་ནི་ཆོས་དང་དགེ་འདུན་སྒྲ། མི་རྟག་སྒྲ་ཐོས་ནས་ནི་སེམས་ཅན་རྣམས། \nསྦྱིན་དང་ཐོས་དང་ཚུལ་ཁྲིམས་བཟོད་པ་དང་། བརྩོན་འགྲུས་བསམ་གཏན་བློ་གྲོས་རྩོམ་པར་བྱེད། སངས་རྒྱས་དབྱངས་དང་བར་མེད་གང་གནས་པ། མཐའ་ཡས་དབྱངས་ལྡན་མཐའ་ཡས་ཡེ་ཤེས་ཅན། དེ་དག་རྣམས་ཀྱི་ཡོན་ཏན་ཐམས་ཅད་\nནི་། བསྐལ་པ་བྱེ་མང་བརྗོད་ཀྱང་ཟད་མི་ནུས། ཞི་བའི་བློ་གྲོས་བྱང་ཆུབ་སེམས་དཔའི་དག་ནི་ཆགས་པའམ། སྡང་བ་འམ། རྨོངས་པ་འམ། ཉོན་མོངས་པའམ། ཐོགས་པ་དང་། ཉེ་བར་ཐོགས་པའམ། དམན་པ་འམ། རབ་ཏུ་དམན་པའམ།བརླང"
 ],
 [
  "78.126a",
  "བའམ། ཞེར་འདེབས་པའམ། མི་རྫོགས་པའམ། རྩུབ་བའམ། རྗེས་སུ་ཆགས་པའམ། ཁོང་ཁྲོ་བའམ། བྱུང་རྒྱལ་ལམ། བག་ལ་ཉལ་བའམ། འགལ་བར་འགྱུར་བའི་ཚིག་གམ། ཉོན་མོངས་པ་སྣ་ཚོགས་བག་ལ་ཉལ་བའམ། \nམི་བརྟན་པའམ། གཅམ་པའམ། ཁེངས་པའམ། འགྱིད་པའམ། མྱུར་བའམ། དུས་མ་ཡིན་པར་སྨྲ་བའམ། འདོད་པ་དང་ལྡན་བའམ། སྡུག་པ་ལ་མངོན་པར་དགའ་བར་འགྱུར་བའམ། མངོན་པར་ཆེ་བའམ། ཤིན་དུ་ཆགས་པའམ། །རབ་ཏུ་ལྷོད་\nབའམ། རབ་ཏུ་དངངས་པའམ། རབ་ཏུ་<span class='add'>  ངལ་  </span>བ་འམ། དབང་པོ་ཉམས་པའམ། གདངས་ཉམས་པའམ། སེམས་ཉམས་པའམ། ཡོ་བའམ། དམན་པའམ། མི་གསལ་བ་འམ། སྐད་<span class='add'>  སུབ་སུབ་  </span><span class='add'>    </span><span class='add'>    </span><span class='add'>    </span>པོ་འམ། ངོས་བྱས་ཏེ་སྨྲ་འམ། འགལ་བར་སྨྲ་བའམ། གླགས་པ་འམ། \nའབྱུང་བ་<span class='add'>  མ་  </span>ཡིན་པའམ། གཤེ་བར་བྱེད་པའམ། གཞན་ལ་གནོད་པར་འགྱུར་བའམ། བདག་དང་ཕ་རོལ་གདུང་བར་བྱེད་པའམ། ཚིག་བླང་བར་འོས་པ་མ་ཡིན་པའམ། ཚིག་གཟུང་བར་འོས་པ་མ་ཡིན་པའམ། ཚིག་དང་བ་མ་ཡིན་བའམ། \nརིགས་པའི་ཚིག་མ་ཡིན་པའམ། འབྱོར་བའི་ཚིག་མ་ཡིན་པའམ། མི་དགེ་བའི་ཚིག་གམ། ཡང་དག་པ་མ་ཡིན་པའི་ཚིག་གམ། གཞོགས་འདྲིད་ཟེར་བའམ། ཆོས་དང་མི་ལྡན་པའམ། འགལ་བའམ། གནོད་པ་འམ། དུས་ལས་ཡོལ་\nབའམ། ཚོད་ལས་འདའ་བའམ། ལུང་བསྟན་པ་ལ་ཐོགས་པའམ། ཚུལ་འཚོས་པ་དང་། ཁ་གསག་དང་ལྡན་བའམ། རྙེད་<span class='add'>  པས་  </span>རྙེད་པ་འདོད་པའི་<span class='add'>  ཚིག་  </span>གམ། འབྱུང་བ་མ་ཡིན་བ་སྟོན་པའམ། མིག་འཁྲུལ་བར་གྱུར་བའམ། རྨོངས་\nཔར་འགྱུར་བ་འམ། སིམ་ཉིའི་ཚིག་གམ། སྡུད་པར་བྱེད་པའི་ཚིག་གམ། མི་སྡུག་ཅིང་གནད་དུ་འབེབས་པའི་ཚིག་ཁྱད་ཏུ་གསོད་པའི་ཚིག་གམ། རང་གི་ཕྱོགས་སྟོད་པར་བྱེད་པའི་ཚིག་གམ། གཞན་གྱི་ཕྱོགས་ཚར་གཅད་པའི་ཚིག་\nགམ། བདག་སྟོད་པ་ལ་རྗེས་སུ་ཆགས་པའི་ཚིག་གམ། གཞན་གྱི་སྟོད་པ་ལ་བར་དུ་གཅོད་པ་སྨྲ་བ་འམ། ཐིང་སླད་དང་། གཞོགས་འདྲིད་ཀྱི་ཚིག་གམ། གཞན་ལ་རབ་ཏུ་རློམ་པའི་ཚིག་གམ། བྱ་བ་མ་ཡིན་པའི་ཚིག་གམ། བྱ་བ་དང་འགལ་བའི་ཚིག་གམ།"
 ],
 [
  "78.126b",
  "གསང་བ་རྟོག་པའི་ཚིག་གམ། དག་བསྲུངས་པ་མ་ཡིན་པའི་ཚིག་གམ། མཁས་པས་སྨད་པའི་ཚིག་གམ། འཕགས་པ་ལ་སྐུར་འདེབས་པའི་ཚིག་གམ། ཀླང་འདེབས་པའི་ཚིག་གམ། ངོར་མངོན་དུ་སྟོན་པའི་ཚིག་གམ། གཞན་གྱི་ཉེས་པ་དུས་མ་\nཡིན་བར་གླེང་བའི་ཚིག་གམ། ཟུག་རྔུས་<span class='add'>  གནད་  </span>དུ་འདེབས་པའི་ཚིག་གམ། གཞན་གྱི་ཉེས་པ་ཀུན་བརྗོད་པའི་ཚིག་གམ། ཁ་འོག་ཏུ་ལུས་འཁྲུས་<span class='add'>  པར་  </span>མི་བྱེད་པའི་ཚིག་གམ། མངོན་པའི་ང་རྒྱལ་གྱི་བརྡ་<span class='add'>  སྤྲོད་  </span>པའི་ཚིག་གམ། ལས་དང་འགལ་བའི་ཚིག་<span class='add'>  གམ།   </span>\nརྗེས་སུ་འཐུན་བ་མ་ཡིན་<span class='add'>  པའི་  </span>ཚིག་མི་འབྱོན་ཏོ། །ཞི་བའི་བློ་གྲོས་ཡང་བྱང་ཆུབ་སེམས་དཔའི་དག་ནི་སྒྲའི་མངོན་པར་ཤེས་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་དང་། བསོད་ནམས་རྣམ་<span class='add'>  པར་  </span>སྨིན་པའི་འབྲས་བུ་གྲུབ་བས་བདེན་པའི་རྗེས་སུ་འབྲང་བ་དང་ལྡན་པ་ཡིན་ཏེ། དེ་གང་\nསྨྲ་བ་དེ་དེ་ལྟ་བུ་ཉིད་ཡིན་ནོ། །གལ་ཏེ་དེ་ཤིང་དྲུང་ན་འདུག་གམ། འཆག་གམ། འདུག་གམ། ཉལ་ཡང་རུང་། ལ་ལ་ཞིག་འོངས་ནས་ཀྱེ་སྐྱེས་བུ་ཤིང་ལྗོན་<span class='add'>  པ་  </span>འདི་དག་ལ་འདབ་མ་ཇི་སྙེད་ཅིག་ཡོད་ཅེས་ཟེར་ན་དེ་ཤིང་ལྗོན་བ་དེ་ལ་ཡང་མི་ལྟ། འདབ་མ་ལ་ཡང་མི་\nབགྲང་བར་ཤིང་ལྗོན་པ་དེ་ལ་འདབ་མ་ཇི་སྙེད་ཡོད་པ་བཞིན་དུ་མི་ཉུང་མི་མང་བར་འདི་སྙེད་ཅིག་གོ་ཞེས་བྱང་ཆུབ་སེམས་དཔའ་དེའི་<span class='add'>  ངག་  </span>འབྱུང་ངོ་། །ཡང་གང་གཱའི་བྱེ་མའི་འབྲུ་དེ་བརྒྱ་ཕྲག་ཇི་སྙེད་ཅིག་ཡོད། སྟོང་ཕྲག་ཇི་སྙེད་ཅིག་ཡོད། \nའབུམ་ཕྲག་ཇི་སྙེད་ཅིག་ཡོད། བྱེ་བ་ཕྲག་ཇི་སྙེད་ཅིག་ཡོད། ཐེར་འབུམ་ཕྲག་ཇི་སྙེད་ཅིག་ཡོད། ཁྲག་ཁྲིག་ཕྲག་ཇི་སྙེད་ཅིག་ཡོད། དཀྲིགས་ཕྲག་ཇི་སྙེད་ཅིག་ཡོད། གཏམས་ཕྲག་ཇི་སྙེད་ཅིག་ཡོད། \nཁྱེད་ཕྱིན་ཇི་སྙེད་ཅིག་ཡོད། མི་འཁྲུགས་པ་ཇི་སྙེད་ཅིག་ཡོད། དཔག་ཏུ་མེད་པ་ཇི་སྙེད་ཅིག་ཡོད། གྲངས་མེད་པ་ཇི་སྙེད་ཅིག་ཡོད། གཏན་པ་ཇི་སྙེད་ཅིག་ཡོད། ཕྱིན་བྱེད་ཕྲག་ཇི་སྙེད་ཅིག་ཡོད་སྟོབས་\nཕྲག་ཇི་སྙེད་ཅིག་ཡོད། གླང་པོ་ཚེའི་སྟོབས་ཕྲག་ཇི་སྙེད་ཅིག་ཡོད། བགྲང་བ་ཕྲག་ཇི་སྙེད་ཅིག་ཡོད་ཅེས་འདྲི་ན་དེ་བྱེ་མ་དག་ལ་ཡང་མི་ལྟ་མི་བགྲང་བར་བྱེ་མའི་འབྲུ་དེ་དག་ཇི་སྙེད་ཡོད་པ་བཞིན་དུ་འདི་སྙེད་ཅིག་གོ་ཞེ་བྱང་ཆུབ་"
 ],
 [
  "78.127a",
  "སེམས་དཔའ་དེའི་<span class='add'>  ངག་  </span>འབྱུང་སྟེ། བྱེ་མ་དེ་ནི་དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་ཀྱིས་འདི་སྙེད་ཅིག་ཡོད་དོ་ཞེས་མཁྱེན་པ་ཡིན་<span class='add'>  ནོ། །  </span>ཞི་བའི་བློ་གྲོས་དེ་ལ་དེ་བཞིན་གཤེགས་པ་ཉིད་མངོན་སུམ་དུ་གྱུར་པ་མ་གཏོགས་\nཔར་<span class='add'>  ལྷ་  </span>འམ། ཀླུ་འམ། གནོད་སྦྱིན་ནམ། དྲི་ཟ་འམ། ལྟ་མ་ཡིན་ནམ། རླུང་ལྟའམ། ནམ་མཁའ་ལྡིང་ངམ། མི་འམ་ཅི་འམ། ལྟོ་འཕྱེ་ཆེན་པོ་འམ། ཉན་ཐོས་སམ། རང་སངས་རྒྱས་ཀྱི་མངོན་སུམ་ནི་མ་ཡིན་ནོ། །\nཞི་བའི་བློ་གྲོས་རྣམ་གྲངས་འདིས་<span class='add'>  འདི་  </span>ལྟར་རིག་པར་བྱ་སྟེ། ཞི་བའི་བློ་གྲོས་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན། དྲང་སྲོང་སྣང་བ་ཞེས་བྱ་བ་ཞིག་བྱུང་སྟེ། དེའི་དུས་ན་བྲམ་ཟེ་སྔོ་སངས་ཞེས་བྱ་བ་ཞིག་ཀྱང་བྱུང་ངོ་། །ཡང་དེའི་\nདུས་ན་ཤིང་ནྱ་གྲོ་དྷ་འི་རྒྱལ་པོ་བཟང་པོ་ཞེས་བྱ་བ་ཡལ་ག་དང་འདབ་མ་མང་པོས་ཡོག་པ། ཁོར་ཡུག་ཏུ་ཚང་རྒྱང་གྲགས་གཅིག་ཡོད་པ་ཞིག་བྱུང་སྟེ་དེར་དྲང་སྲོང་སྣང་བ་དེ་གནས་སོ། །དེ་ན་གནས་པའི་ཚེ་དེས་\nམངོན་པར་ཤེས་པའི་སྟོབས་ཀྱིས་ཤིང་ནྱ་གྲོ་དྷ་འི་རྒྱལ་པོ་བཟང་པོ་དེའི་ཡལ་ག་གྲངས་དུ་ཡོད་པ། ལོ་བཅུ་གཉིས་དང་ཞག་བདུན་གྱི་བར་དུ་བགྲངས་ཏེ་རྟོགས་པར་བྱས་ཤེས་པར་བྱས་སོ། །དེ་ནས་དུས་གཞན་\nཞིག་ན་བྲམ་ཟེ་སྔོ་སངས་ཞེས་བྱ་བ་གྲོང་ཁྱེར་ནས་ཁ་ཟས་བསླངས་ཏེ། ཉིན་མོ་གནས་པའི་ཕྱིར་ཤིང་ནྱ་གྲོ་དྷ་འི་རྒྱལ་པོ་བཟང་པོ་ཞེས་བྱ་ག་ལ་བ་དེར་སོང་ནས་ཟས་ཀྱི་བྱ་བ་བྱས་ཏེ་དྲང་སྲོང་སྣང་བ་ཞེས་བྱ་བ་ག་ལ་བ་\nདེར་སོང་ནས་མངོན་སུམ་དུ་ཡང་དག་པར་མགུ་<span class='add'>  བར་  </span>འགྱུར་བ་དང་། ཡང་དག་པར་ཆགས་པར་འགྱུར་བའི་གཏམ་མང་པོ་བྱས་ཏེ་ཕྱོགས་གཅིག་ཏུ་འདུག་གོ །དེ་ནས་དྲང་སྲོང་སྣང་བ་ཞེས་བྱ་བས་བྲམ་ཟེ་སྔོ་སངས་ཞེས་\nབྱ་བ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཀྱེ་བྲམ་ཟེ་མིའི་འཇིག་རྟེན་སེམས་ཅན་གྱི་རིས་ན་གང་ཤིང་ནྱ་གྲོ་དྷ་འི་རྒྱལ་པོ་འདིའི་འདབ་མའི་གྲངས་དུ་ཡོད་པ་རྩི་བ་འམ། རྟོགས་པར་བྱེད་པའམ། ཤེས་པར་བྱེད་ནུས་པའི་སེམས་ཅན་"
 ],
 [
  "78.127b",
  "འགའ་ཡོད་དམ། སྨྲས་པ་བཙུན་པ་མཆིས་སོ། །དྲང་སྲོང་གིས་སྨྲས་པ། བྲམ་ཟེ་དེ་གང་ཡིན། བྲམ་ཟེས་སྨྲས་པ། བཙུན་པ་བདག་གིས་བགྲང་<span class='add'>  བར་  </span>བགྱིའོ། །དྲང་སྲོང་གིས་སྨྲས་པ། ཀྱེ་བྲམ་ཟེ་དེའི་ཕྱིར་གྲོངས་ཤིག །\nདེ་ནས་བྲམ་ཟེ་སྔོ་སངས་དེ་ཤིང་ལྗོན་པ་དེ་ལ་ཡང་མི་ལྟ། འདབ་མ་རྣམས་ལ་ཡང་མི་བགྲང་པར་སྐད་ཅིག་ལ་འདབ་མ་རྟོགས་པ་ལ་ཞུགས་ནས་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ། །མི་འཁྲུགས་དྲུག་བཅུ་པད་སྟེང་\nཕྲག །བཅུ་དྲུག་དང་ནི་ཁྱད་ཕྱིན་ཕྲག། བཅུ་གསུམ་དང་ནི་དཀྲིགས་པ་ཕྲག །དགུ་བཅུ་རྩ་དྲུག་ཁྲག་ཁྲིག་ཕྲག །སུམ་བཅུ་དང་ནི་ཐེར་འབུམ་ཕྲག །བརྒྱད་སྟོང་དང་ཡང་བྱེ་བ་ཕྲག །དགུ་བཅུ་རྩ་གཉིས་འདབ་འདི་\nམཆིས། བྲམ་ཟེ་དམ་པ་བདག་གིས་འཚལ། དེ་སྐད་ཐོས་ནས་སྔོ་སངས་ལ། སྣང་བས་སྨྲས་པ་བྲམ་ཟེའི་མཆོག །ཁྱོད་ནི་བདེན་པའི་ཚིག་སྨྲ་པ། ལེགས་སོ་ལེགས་སོ་འདི་བདེན་ནོ། །ལོ་ནི་ཁྱུད་ཀོར་བཅུ་གཉིས་དང་། ཉི་\nམ་བདུན་དུ་མངོན་ཤེས་ཀྱིས། འདབ་མ་རྣམས་ནི་བདག་གིས་བགྲངས། གཙོ་བོས་ཁྱོད་ཀྱིས་སྐད་ཅིག་མཁྱེན། ཁྱེད་ནི་གཟིགས་པ་མི་མཛད་ཅིང་། བགྲང་བ་མི་མཛད་སྐད་ཅིག་ཏུ། འདབ་རྟོགས་པ་ཡི་རྗེས་སུ་ཞུགས། མཁྱེན་འདི་\nཉིད་ཀྱི་འམ་ལྷ་ཡིས་བསྟན། བྲམ་ཟེ་བདག་ལ་དོན་འདི་གསུངས། སྔོ་སངས་ཀྱིས་སྨྲས་པ། ཀྱེ་བཙུན་པ་གསོན་ཅིག །འདི་ནི་ལྷ་ཡིས་མིན་མི་ཡི་སྟེ། བདག་<span class='add'>  ཚིག་  </span>བདེན་པའི་རྗེས་སུ་འབྲང་དོན་བཞིན་འཇུག །ནམ་མཁའ་ཟད་\nཔར་གྲུམ་པར་འགྱུར་སྲིད་ཀྱི། ཁོ་བོ་བརྫུན་དུ་སྨྲ་བ་མ་སྲིད་དོ། །སྣང་པར་གྱུར་པ་བདག་ཉིད་ཆེན་པོ་ཤཱ་རིའི་བུ། བྲམ་ཟེ་སྔོ་སངས་གྱུར་པ་<span class='add'>  ཤཱ  </span>ཀྱ་སེང་གེ་སྟེ། ཡོན་ཏན་རྒྱ་མཚོ་ལྡན་པ་རྣམས་ཀྱི་<span class='add'>  ངག་  </span>འདི་འདྲ། བདེན་ལ་གནས་ཤིང་\nདོན་དང་ཆོས་དང་ལྡན་པ་ཡིན། ཞི་བའི་བློ་གྲོས་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་<span class='add'>  ངག་  </span>ཡོངས་སུ་དག་པ་ཡིན་ཏེ། འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་<span class='add'>  ངག་  </span>གི་གསང་བ་དང་། <span class='add'>  ངག་  </span>ཡོངས་སུ་དག་པ་ལ་འཇུག་པ་ཅུང་ཟད་ཙམ་ཞིག་"
 ],
 [
  "78.128a",
  "བསྟན་པར་ཟད་ཀྱི། དེ་བས་གོང་དུ་བསྟན་ན་བྱང་ཆུབ་སེམས་དཔའི་ངག་ཡོངས་སུ་དག་པ་ཚད་ཟིན་པ་འམ་མཐར་ཕྱིན་པར་མི་འགྱུར་རོ། །བྱང་ཆུབ་སེམས་དཔའི་དག་གི་གསང་བའི་ལེའུ་ཞེས་བྱ་བ་སྟེ་། གཉིས་པའོ། །\nགཞན་ཡང་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེས་བྱང་ཆུབ་སེམས་དཔའ་ཞི་བའི་བློ་གྲོས་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཞི་བའི་བློ་གྲོས་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་སེམས་ཀྱི་གསང་བ་དང་། སེམས་ཀྱི་ལས་ཡོངས་\nསུ་དག་པ་གང་ཞེ་ན། ཞི་བའི་བློ་གྲོས་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་ཡེ་ཤེས་ཀྱིས་བྱས་པའི་ལས་རྣམས་བྱེད་ཀྱི་ང་རྒྱལ་བྱས་པ་རྣམས་མི་བྱེད་དོ། །མངོན་པར་ཤེས་པ་ལས་ཀྱང་མ་ཉམས་ལ་ཡེ་ཤེས་ཀྱིས་\nབྱས་པའི་ལས་རྣམས་ཀྱང་བྱེད་དོ། མངོན་པར་ཤེས་པས་ཀྱག་རྣམས་པར་རྩེན་ལ་བྱ་བ་ཐམས་ཅད་ཀྱང་སྟོན་ཏོ། མངོན་པར་ཤེས་པ་ལ་ཡང་གནས་ལ་འཇུག་པ་ཆེན་པོ་ལ་ཡང་<span class='add'>    </span>གནས་སོ། །དེ་དག་གི་མངོན་པར་ཤེས་པ་དེ་ནི་ཡེ་\nཤེས་ཀྱི་རྣམ་པ་སྟེ་རྣམ་པ་ཐམས་ཅད་ཀྱི་མཆོག་དང་ལྡན་པའོ། །དེ་དག་གི་མངོན་པར་ཤེས་པ་དེ་ནི་ཤེས་རབ་ཀྱི། རྣམ་པ་སྟེ་ཆོས་ཐམས་ཅད་མངོན་སུམ་དུ་མཐོང་བའོ། །དེ་དག་གི་མངོན་པར་ཤེས་པ་དེ་ནི་མི་ཟད་པའི་རྣམ་པ་སྟེ་\nཐམས་ཅད་ཀྱི་རྗེས་སུ་འབྲང་བའོ། །དེ་དག་གི་མངོན་པར་ཤེས་པ་དེ་ནི་གཟུགས་ཐམས་ཅད་གཟུགས་མ་ཡིན་པའི་ཕྱིར་གཟུགས་ཐམས་ཅད་མཐོང་བའོ། །དེ་དག་གི་མངོན་པར་ཤེས་པ་དེ་ནི་སྔོན་གྱི་མཐའ་དང་། ཕྱི་མའི་མཐའ་\nསྒྲ་མཉམ་པ་ཉིད་ཀྱི་ཕྱིར་སྒྲ་ཐམས་ཅད་ཀྱི་རྗེས་སུ་སོང་བའོ། །དེ་དག་གི་མངོན་པར་ཤེས་པ་དེ་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་ལ་ལྟ་བ་དང་། སེམས་ཀྱི་རང་བཞིན་ལ་སོ་སོར་རྟོག་ཅིང་ལྟ་བའོ། །དེ་དག་གི་མངོན་པར་ཤེས་པ་དེ་ནི་\nབསྐལ་པ་མཐའ་ཡས་པ་རྗེས་སུ་དྲན་པ་དང་། སྔོན་གྱི་མཐའ་དང་ཕྱི་མའི་མཐའ་ཡོངས་སུ་མ་ཆད་པའོ། །དེ་དག་གི་མངོན་པར་ཤེས་པ་དེ་ནི་རྫུ་འཕྲུལ་དང་། རྣམ་པར་འཕྲུལ་པ་ཐམས་ཅད་མངོན་དུ་གྱུར་ཅིང་མངོན་པར་འདུ་བྱ་བ་མེད་པའི་"
 ],
 [
  "78.129a",
  "ཀྱིས་ཀྱང་ཕུན་སུམ་ཚོགས་སོ། །ཕྱོགས་བཅུར་སངས་རྒྱས་ཀྱི་ཆོས་དེ་དག་ཡོངས་སུ་ཚོལ་ཡང་མི་རྙེད་མི་དམིགས་སོ། །དེས་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་དང་། ཆོས་ཐམས་ཅད་ཀྱང་སངས་རྒྱས་ཀྱི་ཆོས་སུ་རྟོགས་\nསོ། །དེ་ལྟར་ན་སངས་རྒྱས་ཀྱི་ཆོས་དང་ཆོས་ཐམས་ཅད་ཀྱང་ཆོས་མ་ཡིན་ལ་ཆོས་མ་ཡིན་པ་ཡང་མ་ཡིན་པར་ཁས་ལེན་ཏོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཆོས་ཐམས་ཅད་ནི་ཀུན་དུ་བཙལ་ན་ཡང་མི་རྙེད་དོ། །མི་དམིགས་སོ། །ཆོས་གང་ཡང་དག་\nཔ་ཇི་ལྟ་བ་བཞིན་དུ་བཙལ་ན་མི་རྙེད་ཅིང་མི་དམིགས་པ་དེ་ལ་ནི་བགྲང་པ་གང་ཡང་མེད་དེ། ཆོས་ཐམས་ཅད་ནི་བགྲང་པའི་ལམ་ལས་ཡང་དག་པར་འདས་པའོ། །གང་ཆོས་ཐམས་ཅད་མཉམ་པ་<span class='add'>  ཉིད་  </span>དུ་ཤེས་པ་དེ་ནི་ཆོས་\nསམ་ཆོས་མ་ཡིན་པ་ལ་མངོན་པར་ཞེན་པ་མེད་དེ་མངོན་པར་ཞེན་པ་མེད་པ་ནི་ཆོས་རྣམས་ཀྱི་དོན་ཏོ། །དོན་ལ་རློམ་སེམས་སུ་བྱེད་པ་གང་ཡིན་པ་དེ་ཉིད་དེའི་གནོད་པ་ཆེན་པོར་འགྱུར་རོ། །གང་ཡང་རློམ་སེམས་མེད་པ་ལ་\nནི་དོན་ནམ་དོན་མ་ཡན་པ་དེའི་མདུན་ན་མི་འདུག་གོ །དོན་དུ་མི་ལྟ་བཱི་བློ་ནི་གང་དུ་ཡང་ཐོགས་པ་མེད་དོ། །དེ་ནི་བློ་ཐོགས་པ་མེད་པའོ། །གང་བློ་ཐོགས་པ་མེད་པ་དེ་ནི་ཆགས་པ་མེད་པའོ། །གང་ཆགས་པ་མེད་པ་དེ་ནི་རྒྱུན་ཆད་\nཔ་མེད་པའོ། །གང་རྒྱུན་ཆད་པ་མེད་པ་དེ་ནི་ཉམས་པ་མེད་པའོ། །གང་ཉམས་པ་མེད་པ་དེའི་བཙལ་བ་དོན་མེད་པར་མི་འགྱུར་རོ། །གང་གི་བཙལ་བ་དོན་མེད་པར་མི་འགྱུར་བ་དེ་ལ་སྐྱོན་མེད་དོ། །གང་ལ་སྐྱོན་མེད་པ་དེ་ལ་བདག་གི་བ་\nམེད་དོ། །གང་ལ་བདག་གི་བ་མེད་པ་དེ་ལ་ཡོངས་འཛིན་པ་མེད་དོ། །གང་ལ་ཡོངས་སུ་འཛིན་པ་མེད་པ་དེ་ལ་རྩོད་པ་མེད་དོ། །གང་ལ་རྩོད་པ་མེད་པ་དེ་ལ་འགྱེད་པ་མེད་དོ། །གང་ལ་འགྱེད་པ་མེད་པ་དེ་ནི་མི་རྩོད་པ་སྟེ་དགེ་སྦྱོང་གི་ཆོས་\nདང་ལྡན་པ་ཞེས་བྱའོ། །གང་དགེ་སྦྱོང་གི་ཆོས་དང་ལྡན་པ་དེ་ནམ་མཁའ་དང་ལག་མཐིལ་དུ་མཉམ་པའོ། །གང་ནམ་མཁའ་དང་ལག་མཐིལ་དུ་མཉམ་པ་དེ་ནི་འདོད་པའི་ཁམས་སུ་མི་གཏོགས་། གཟུགས་ཀྱི་ཁམས་སུ་མི་གཏོགས།"
 ],
 [
  "78.130a",
  "མཉམ་པ་ཤེས་པའི་སེམས་ཉིད་ཀྱང་ཡིན། ཤེས་རབ་ཀྱི་དབང་པོ་ཡང་ཡིན་ལ་། དབང་པོ་མེད་པའི་སེམས་ཉིད་ཀྱང་ཡིན། དབང་པོ་རྣམས་ཀྱང་ཡིན་ལ། ཆོས་ཐམས་ཅད་ལ་དབང་པོ་མེད་པའི་\nསེམས་ཉིད་ཀྱང་ཡིན། སྟོབས་རྣམས་ཀྱང་ཡིན་ལ། མི་རྫི་བའི་སེམས་ཉིད་<span class='add'>  ཀྱང་  </span>ཡིན། བྱང་ཆུབ་ཀྱི་ཡན་ལག་རྣམས་ཀྱང་ཡིན་ལ། བྱང་ཆུབ་ཀྱི་ཡན་ལག་རྣམས་ཀྱང་ཡིན་ལ། བློས་རབ་ཏུ་འབྱེད་པའི་སེམས་ཉིད་\nཀྱང་ཡིན་། ལམ་སྒོམ་པ་ཉིད་ཀྱང་ཡིན་ལ། སྒོམ་པ་མེད་པའི་སེམས་ཉིད་ཀྱང་ཡིན། ཞི་གནས་ཀྱང་ཡིན་ལ། སེམས་ཉེ་བར་ཞི་བ་ཉིད་<span class='add'>  ཀྱང་  </span>ཡིན། ལྷག་མཐོང་ཡང་ཡིན་ལ། རྗེས་སུ་མི་མཐོང་བའི་སེམས་ཉིད་ཀྱང་ཡིན། འཕགས་པའི་\nབདེན་པ་སྒོམ་པ་ཡང་ཡིན་ལ། ཤིན་དུ་ཡོངས་སུ་ཤེས་པའི་སེམས་ཉིད་ཡང་ཡིན་། སངས་རྒྱས་ཡིད་ལ་བྱེད་པ་ཡང་ཡིན་ལ། ཡིད་ལ་བྱེད་པ་མེད་པའི་སེམས་ཉིད་ཀྱང་ཡིན། ཆོས་ཡིད་ལ་བྱེད་པ་ཡང་ཡིན་ལ་། \nཆོས་ཀྱི་དབྱིངས་སུ་མཉམ་པའི་སེམས་ཉིད་ཀྱང་ཡིན། དགེ་འདུན་ཡིད་ལ་བྱེད་པ་ཡང་ཡིན་ལ། མི་གནས་པའི་སེམས་ཉིད་ཀྱང་ཡིན། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་ཡང་བྱེད་ལ། གཟོད་མ་ནས་དག་པའི་སེམས་\nཉིད་ཀྱང་ཡིན་། དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པ་ཡང་ཡིན་ལ། ཆོས་ཀྱི་དབྱིངས་དང་དབྱེར་མེད་པའི་སེམས་ཉིད་ཀྱང་ཡིན། སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པ་ཡང་ཡིན་ལ། སེམས་ནམ་མཁའ་དང་\nམཉམ་པ་ཉིད་ཀྱང་ཡིན། མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཡང་ཡིན་ལ། མི་དམིགས་པའི་སེམས་ཉིད་ཀྱང་ཡིན། ཕྱིར་མི་ལྡོག་པའི་ས་ཡང་ཡིན་ལ། ལྡོག་པ་དང་འཇུག་པ་མེད་པའི་སེམས་ཉིད་ཀྱང་ཡིན་ལ། མཚན་\nམ་རབ་ཏུ་ཐོབ་པ་ཡང་ཡིན་ལ། མཚན་མ་མེད་པའི་སེམས་ཉིད་ཀྱང་ཡིན། བྱང་ཆུབ་ཀྱི་སྙིང་པོའི་རྒྱན་ཉིད་ཀྱང་ཡིན་ལ། ཁམས་གསུམ་གྱི་སྙིང་པོའི་སེམས་ཉིད་ཀྱང་ཡིན། བདུད་ཚར་གཅོད་པ་ཡང་ཡིན་ལ།"
 ],
 [
  "78.130b",
  "སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་འདོགས་པའི་སེམས་ཉིད་ཀྱང་ཡིན། བྱང་ཆུབ་ཀྱང་ཡིན་ལ། ཆོས་ཐམས་ཅད་ནི་དངོས་པོ་མེད་པར་ཁོང་དུ་ཆུད་པའི་སེམས་ཉིད་ཀྱང་ཡིན། ཆོས་ཀྱི་འཁོར་ལོ་སྐོར་བ་ཡང་ཡིན་ལ་། \nམི་འཇུག་མི་ལྡོག་པའི་སེམས་ཉིད་ཀྱང་ཡིན། ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་ཆེན་པོ་ཡང་སྟོན་ལ། འཁོར་བའི་རང་བཞིན་དང་མཉམ་པའི་སེམས་ཉིད་ཀྱང་ཡིན་ཏེ། ཞི་བའི་བློ་གྲོས་འདི་ནི་བཟོད་པ་ཐོབ་\nཔའི་བྱང་ཆུབ་སེམས་དཔའི་སེམས་ཀྱི་གསང་བ་དང་། སེམས་ཀྱི་ལས་ཡོངས་སུ་དག་པའོ། །སེམས་དག་པ་དེས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་ཡོངས་སུ་དག་པར་རྟོགས་ཏེ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་\nསེམས་ལ་བྱང་ཆུབ་ཀྱི་སེམས་དེ་རྗེས་སུ་ཞུགས་པ་ཡིན་ནོ། །བྱང་ཆུབ་ཀྱི་སེམས་དེ་ལ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་ཀྱང་སྣང་བར་གྱུར་པ་ཡིན་ནོ། །ཞི་བའི་བློ་གྲོས་། འདི་ལྟ་སྟེ་དཔེར་ན་ནམ་མཁའ་ནི་\nཐམས་ཅད་ཀྱི་རྗེས་སུ་སོང་བ་དང་། ཐམས་ཅད་ཀྱི་རྗེས་སུ་ཞུགས་པ་ཡིན་ནོ། །ཞི་བའི་བློ་གྲོས་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའི་སེམས་ནི་ཐམས་ཅད་ཀྱི་རྗེས་སུ་སོང་བ་དང་ཐམས་ཅད་ཀྱི་རྗེས་སུ་ཞུགས་\nཔ་ཡིན་ནོ། །གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེ་བྱང་ཆུབ་སེམས་དཔའི་ལུས་དང་། ངག་དང་། སེམས་ཀྱི་གསང་བ་བསྟན་པ་འདི་བཤད་པ་ན། ལྷ་དང་མིའི་<span class='add'>  སྐྱེ་  </span><span class='add'>  དགུའི་  </span>སྲོག་ཆགས་ལས་སྟོང་ཕྲག་བདུན་ཁྲི་ཉིས་སྟོང་གིས་\nབླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ། །བྱང་ཆུབ་སེམས་དཔའ་སུམ་ཁྲི་ཉིས་སྟོང་གིས་ནི་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་པར་གྱུར་ཏོ། །སྲོག་ཆགས་བརྒྱད་ཁྲི་བཞི་སྟོང་ནི་ཆོས་རྣམས་ལ་\nཆོས་ཀྱི་མིག་རྡུལ་མེད་ཅིང་དྲི་མ་དང་བྲལ་བ་རྣམ་པར་དག་གོ །དགེ་སློང་བརྒྱད་སྟོང་ནི་ལེན་པ་མེད་པར་ཟག་པ་རྣམས་ལས་སེམས་རྣམ་པར་གྲོལ་ལོ། །སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་"
 ],
 [
  "78.132b",
  "བ་། ལྷ་དང་མི་མང་པོས་བ། ལག་མཐིལ་ལྟར་མཉམ་པར་གྱུར་པ་། གསེག་མ་དང་གྱོ་མོ་མེད་<span class='add'>    </span>རྩྭ་དག་དེར་སྐྱེས་པ་ཡང་འཇམ་པ་གོས་ཀ་ཙ་ལིན་དི་ཀ་ལྟར་རེག་ན་བདེ་བ། རྨ་བྱའི་མགྲིན་པ་ལྟར་སྔོ་ཞིང་\nགཡུང་དྲུང་འཁྱིལ་པར་གཡས་སུ་འཁྱིལ་པ། ཁ་དོག་དང་ལྡན་པ་། དྲི་དང་ལྡན་པ། ཡིད་དུ་འོང་བ། གོམ་པ་བོར་ན་སོར་བཞི་མཐུར་དུ་དམའ་བ། རྐང་པ་བཏེག་ན་སོར་བཞི་གྱེན་དུ་མཐོ་བ། ཧ་ཅང་ཡང་མི་\nགྲང་། ཧ་ཅང་ཡང་མི་ཚ་བའི་<span class='add'>  རླུང་  </span>ཆུང་<span class='add'>  ངུ་  </span>བསིལ་བ། འདོད་པ་དང་འཐུན་པར་ལྡང་བའོ། །ས་ཆེན་པོ་དེ་ཡང་བཻ་དཱུ་རྻ་སྔོན་པོས་བརྒྱན་པའོ། །སེམས་ཅན་དེ་རྣམས་ཀྱང་རྣམ་པ་བཟང་ཞིང་མཁས་པ་དང་\nལྡན་པར་གྱུར་ཏེ། འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་ཆུང་བ་། ཉོན་མོངས་པ་ཐམས་ཅད་ཆུང་བ། ལེགས་པར་བཤད་པའི་དོན་ཀུན་ཤེས་པར་བྱེད་ནུས་པའི་མཐུ་དང་ལྡན་པ་ཤ་སྟག་གོ །བཅོམ་ལྡན་\nའདས་ཡོན་ཏན་མཐའ་ཡས་རིན་ཆེན་སྣ་ཚོགས་བཀོད་པའི་རྒྱལ་པོ་དེ་བཞིན་གཤེགས་པ་དེའི་<span class='add'>  ཉན་  </span>ཐོས་ཀྱི་དགེ་སློང་གི་དགེ་འདུན་ནི་ཁྲག་ཁྲིག་ཕྲག་བཅུ་གཉིས་ཡོད་དོ། །བྱང་ཆུབ་སེམས་དཔའི་དགེ་འདུན་\nནི་བྱེ་བ་ཕྲག་སུམ་བཅུ་རྩ་གཉིས་ཡོད་<span class='add'>  དོ། །  </span>དེའུ་སྐུ་ཚེའི་ཚད་ནི་ལོ་བྱེ་བ་ཕྲག་སུམ་བཅུ་རྩ་དྲུག་ཐོབ་བོ། །མི་རྣམས་ཀྱང་དུས་མ་ཡིན་པར་གློ་བུར་དུ་འཆི་བ་མེད་དོ། །ཞི་བའི་བློ་གྲོས་དེའི་ཚེ་དེའི་དུས་ན་རྣམ་\nཔར་བརྒྱན་པའི་འཇིག་རྟེན་ཀྱི་ཁམས་དེ་ན། མཛེས་པར་སྣང་བ་ཞེས་བྱ་བ་གླིང་བཞི་པའི་འཇིག་རྟེན་བར་མ་རབ་ཏུ་འབྱོར་པ། རྒྱས་པ། བདེ་བ་རབ་ཏུ་ལོ་ལེགས་པ། ཡངས་ཤིང་ཐ་གྲུ་ཆེ་བ་བྱུང་སྟེ། གླིང་བཞི་\nཔ་རེ་རེ་ཡང་དཔག་ཚད་བརྒྱད་ཁྱི་བཞི་སྟོང་བརྒྱད་ཁྲི་བཞི་སྟོང་པར་གྱུར་ཏོ། །དེར་གྲོང་ཁྱེར་ཆེན་པོ་ཡང་བར་བར་ན་དཔག་ཚད་གཅིག་ཡོད་པ། གྲོང་དང་། ཚོང་འདུས་དང་། རི་ཁྲོད་སྟོང་གིས་བསྐོར་བ་བྱུང་<span class='add'>  ངོ་། །  </span>ཞི་བའི་"
 ],
 [
  "78.132a",
  "དབྱངས་བསྒྲགས་པ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །རིགས་ཀྱི་བུ་ཁྱོད་ལེགས་པར་འོངས་སོ། །ཁྱོད་འདིར་འོངས་པ་ལེགས་སོ། །ཁྱོད་ཀྱིས་དེ་བཞིན་ག་གཤེགས་པའི་གསང་བ་\nབསམ་གྱིས་མི་ཁྱབ་པའི་ལེའུ་སྟེ་གསང་བ་པའི་བདག་པོ་ལས་ཐོས་པར་འགྱུར་རོ། །སྒྲ་དབྱངས་བསྒྲགས་པ་འོངས་པའི་ལེའུ་ཞེས་བྱ་སྟེ་བཞི་པའོ། །དེ་ནས་འཁོར་དེ་ལས་\nབྱང་ཆུབ་སེམས་དཔའ་ཁ་ཅིག་འདི་སྙམ་དུ་སེམས་ཏེ། གསང་བ་པའི་བདག་པོ་འདིས་<span class='add'>  དགེ་  </span>བའི་རྩ་བ་གང་དུ་<span class='add'>  བསྐྱེད།   </span>སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཇི་སྙེད་ཅིག་ལ་འདིས་བསྙེན་བཀུར་བྱས་། འདིས་\nསྨོན་ལམ་ཅི་འདྲ་བ་ཞིག་བཏབ་ན་གང་གི་ཕྱིར་འདི་འདྲ་བའི་སྤོབས་པ་དང་ལྡན་པར་གྱུར་སྙམ་མོ། །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་གི་སེམས་ཀྱི་རྟོག་པ་<span class='add'>  ཐུགས་  </span>ཀྱིས་མཁྱེན་ནས་བྱང་ཆུབ་\nསེམས་དཔའ་ནི་བློ་གྲོས་ལ་བཀའ་སྩལ་པ། ཞི་བའི་བློ་གྲོས་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན་བསྐལ་པ་གྲངས་མེད་པའི་ཡང་ཆེས་གྲངས་མེད་པ། རྒྱ་ཆེན་པོ་ཚད་མེད་པ་བསམ་གྱིས་མི་ཁྱབ་པ། དཔག་\nཏུ་མེད་པར་གྱུར་པ་དེའི་ཚེ་དེའི་དུས་ན་བསྐལ་པ་མཛེས་པར་སྣང་བ་ཞེས་བྱ་བ་ལ་འཇིག་རྟེན་གྱི་ཁམས་རྣམ་པར་བརྒྱན་པ་ཞེས་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་\nརིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ་འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་པའི་ཁ་ལོ་སྒྱུར་བ་བླ་ན་མེད་པ་ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཡོན་ཏན་མཐའ་\nཡས་རིན་ཆེན་སྣ་ཚོགས་བཀོད་པའི་རྒྱལ་པོ་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་ངོ་། །ཞི་བའི་བློ་གྲོས་འཇིག་རྟེན་གྱི་ཁམས་རྣམ་པར་བརྒྱན་པ་དེ་ཡང་འབྱོར་པ། རྒྱས་པ། བདེ་བ། ལོ་ལེགས་པ། ཉམས་དགའ་"
 ],
 [
  "78.131a",
  "འདི་ཡང་རྣམ་པ་དྲུག་ཏུ་རབ་ཏུ་གཡོས་ཏེ། འཇིག་རྟེན་གྱི་ཁམས་འདི་ཐམས་ཅད་སྣང་བ་ཆེན་པོས་ཁྱབ་པར་གྱུར་ཏེ་སྟེང་གི་བར་སྣང་ལས་ཀྱང་མེ་ཏོག་གི་ཆར་མངོན་པར་བབ་བོ། །མ་བསྐྱོད་\nཔར་སིལ་སྙན་དང་རོལ་མོའི་སྒྲ་སྟེང་སྙེད་རབ་ཏུ་གྲག་པར་གྱུར་ཏེ། སིལ་སྙན་དང་རོལ་མོའི་སྒྲ་དེ་དག་ལས་ཀྱང་གང་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེས་བསྟན་པ་འདི་ཉན་པ་དང་། ཐོས་ནས་ཀྱང་འཛིན་ཅིང་མོས་\nཔར་བྱེད་པ་དང་། འཆད་པ་དང་། ཀློག་པ་དང་། ཀུན་ཆུབ་པར་བྱེད་པ་དང་། གཞན་དག་ལ་ཡང་རྒྱ་ཆེར་ཡང་དག་པར་རབ་ཏུ་སྟོན་པའི་སེམས་ཅན་དེ་དག་ནི་བྱང་ཆུབ་ཀྱི་སེམས་ལ་རྨོངས་པ་མེད་པའི་བསམ་པ་\nདང་ལྡན་ཏེ། དགེ་བའི་རྩ་བ་ཆུང་ངུ་དང་ལྡན་<span class='add'>  པ་  </span>མ་ཡིན་ནོ། །དེ་དག་ནི་སངས་རྒྱས་མང་པོ་ལ་བསྙེན་བཀུར་བྱས་པར་རིག་པར་བྱ་སྟེ། དགེ་བའི་རྩ་བ་བསྐྱེད་པ། བསོད་ནམས་ཀྱི་ཚོགས་ཀྱིས་ཉེ་བར་བརྟན་པའོ། །\nསེམས་ཅན་དེ་དག་ནི་སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་ཐོགས་པར་གྱུར་བ་ཡིན་ཏེ་སེམས་ཅན་དེ་དག་ནི་ལུང་བསྟན་པའི་ས་<span class='add'>  ཐོབ་  </span>པར་འགྱུར་རོ་ཞེས་དེ་ལྟ་བུའི་སྒྲ་བྱུང་ངོ་། །བྱང་ཆུབ་སེམས་དཔའི་\nསེམས་ཀྱི་གསང་བའི་ལེའུ་ཞེས་བྱ་སྟེ། གསུམ་པའོ། །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་ཆེན་པོ་ཞི་བའི་བློ་གྲོས་ལ་བཀའ་སྩལ་པ། ཞི་བའི་བློ་གྲོས། \nསིལ་སྙན་དང་། རོལ་མོའི་སྒྲ་ལས་འདི་ལྟ་བུའི་སྒྲ་བྱུང་བ་ཁྱོད་ཀྱིས་ཐོས་སམ། གསོལ་པ། བཅོམ་ལྡན་འདས་ཐོས་ལགས་ཏེ་འདི་ལྟ་བུའི་སྒྲ་བྱུང་བ་དེ་སུའི་མཐུ་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་\nསྩལ་པ། ཞི་བའི་བློ་གྲོས་འདི་ནི་འཇིག་རྟེན་གྱི་ཁམས་སྤྲིན་ལྡན་ཞེས་བྱ་བ་ན་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྤྲིན་དབྱངས་རྒྱལ་པོ་ཞེས་བྱ་བའི་དྲུང་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་"
 ],
 [
  "78.133a",
  "བློ་གྲོས་གླིང་བཞི་པ་མཛེས་པར་སྣང་བ་དེའི་དབུས་ན་ཕོ་བྲང་གྲོང་ཁྱེར་རྣམ་པར་དག་པ་ཅན་ཞེས་བྱ་བ་ཡངས་ཤིང་རྒྱ་ཆེ་བ། བྱང་དང་ལྷོར་ནི་དཔག་ཚད་དྲུག་བཅུ་རྩ་བཞི། ཤར་དང་ནུབ་\nཏུ་ནི་དཔག་ཚད་བཞི་བཅུ་རྩ་གཉིས་ཡོད་པ། བསྐྱེད་མོས་ཚལ་ཁྲིས་རབ་ཏུ་བརྒྱན་པ། གྲོང་དང་། ཚོང་འདུས་དང་། རི་ཁྲོད་ཁྲིས་ཀུན་ནས་བསྐོར་བ་ཡོད་དོ། །ཞི་བའི་བློ་གྲོས་རྒྱལ་པོའི་ཕོ་བྲང་རྣམ་པར་དག་པ་\nཅན་ཞེས་བྱ་བ་དེར་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་ཡུལ་འཁོར་སྲུང་ཞེས་བྱ་བ་རིན་པོ་ཆེ་སྣ་བདུན་དང་ལྡན་པ། གླིང་བཞི་ལ་དབང་བ། སྔོན་གྱི་རྒྱལ་བ་ལ་ལྷག་པར་བྱ་བ་བྱས་པ། དགེ་བའི་རྩ་བ་བསྐྱེད་པ། བསོད་\nནམས་ཀྱི་གཟི་བརྗིད་ཀྱིས་གཟི་དང་ལྡན་པ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པ་ཞིག་བྱུང་ངོ་། །ཞི་བའི་བློ་གྲོས་རྒྱལ་པོ་ཡུལ་འཁོར་སྲུང་གི་གྲོང་ཁྱེར་གྱི་དབུས་ན་ཁང་པ་རྒྱ་ཆེ་ཞིང་ཡངས་\nཔ་ཆུ་ཞེང་དུ་དཔག་ཚད་བཅུ་དྲུག་ཡོད་པ་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་ར་བ་རིམ་བདུན་དང་། རྟ་བབས་དང་། དྲིལ་བུ་གཡེར་ཀའི་དྲ་བ་རིམ་བདུན་གྱིས་ཀུན་ནས་བསྐོར་བ་བརྩིགས་སོ། །ར་བའི་ནང་ན་བསྐྱེད་མོས་ཚལ་ཆེན་པོ་\nབཞི་བྱས་ཏེ། འདི་ལྟ་སྟེ། མེ་ཏོག་སྣ་ཚོགས་ཞེས་བྱ་བའི་བསྐྱེད་མོས་ཚལ་ཆེན་པོ་དང་། ཡོན་ཏན་གྱིས་མངོན་པར་དགའ་བ་ཞེས་བྱ་བ་དང་། རྨ་བྱས་མངོན་པར་དགའ་བ་ཞེས་བྱ་བ་དང་། དུས་ཀྱི་བདེ་བ་ཞེས་བྱ་བའོ། །\nརྫིང་ཁྱོན་དཔག་ཚད་ཕྱེད་པ་རིན་པོ་ཆེའི་ཁ་ཁྱེར་གྱིས་བསྐོར་བ་འཛམ་བུ་ཆུ་བོའི་གསེར་གྱི་གླེགས་མའི་འབབ་སྟེགས་ཅན། གསེར་གྱི་བྱེ་མ་བདལ་བ། ཡན་ལག་བརྒྱད་དང་ལྡན་པའི་ཆུས་གང་བ། རིན་པོ་ཆེའི་པདྨས་\nཀུན་ནས་ཁེབས་པ། ངང་<span class='add'>  པ་  </span>དང་། ཆུ་སྐྱར་དང་། བྱ་གར་དང་། དུར་པ་དག་སྒྲ་འབྱིན་པ་བཞི་བྱས་ཏེ། འདི་ལྟ་སྟེ་དགའ་བ་ཞེས་བྱ་བ་དང་། དགའ་མཆོག་ཅེས་བྱ་བ་དང་། སྤོས་མཆོག་ཅེས་བྱ་བ་དང་། ཆུ་རྒྱུན་རྗེས་སུ་འབབ་"
 ],
 [
  "78.133b",
  "པ་ཞེས་བྱའོ། ཞི་བའི་བློ་གྲོས་རྒྱལ་པོ་ཡུལ་འཁོར་སྲུང་གི་བཙུན་མོའི་འཁོར་བདུན་འབུམ་ཡོད་དེ་ཐམས་ཅད་ཀྱང་མཚན་དང་ལྡན་པའི་ན་ཆུང་བུད་མེད་རིན་པོ་ཆེའི་ཡོངས་སྤྱོད་དང་འདྲ་བ་ཤ་སྟག་གོ །དེ་དག་ཐམས་\nཅད་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡང་དག་པར་རབ་ཏུ་ཞུགས་པར་གྱུར་པ་དག་གོ །དེ་ལ་བུ་སྟོང་དུ་ཚང་བ་ཡོད་དེ། དཔའ་བ། རཏལ་ཕོད་པ། ཡན་ལག་མཆོག་གི་གཟུགས་དང་ལྡན་པ། ཕ་རོལ་གྱི་\nསྡེ་རབ་ཏུ་འཇོམས་པ། སྐྱེས་བུ་ཆེན་པོའི་མཚན་ཉི་ཤུ་རྩ་བརྒྱད་ཀྱིས་བརྒྱན་པ། ལྷག་པའི་བསམ་བས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཞུགས་པ་ཤ་སྟག་གོ །ཞི་བའི་བློ་གྲོས་དེའི་ཚེ་དེའི་དུས་ན་བཅོམ་\nལྡན་འདས་ཡོན་ཏན་མཐའ་ཡས་རིན་ཆེན་སྣ་ཚོགས་བཀོད་པའི་རྒྱལ་པོ་དེ་བཞིན་གཤེགས་པ་དེ་རྣམ་པར་དག་པ་དང་ལྡན་པའི་རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་དུ་རྟེན་ཅིང་བཞུགས་ཏེ། རྒྱལ་པོ་དང་། རྒྱལ་པོའི་བློན་པོ་ཆེན་\nཔོ་དང་། བྲམ་ཟེ་དང་། ཁྱིམ་བདག་དང་ གྲོང་རྡལ་<span class='add'>  པ་  </span>དང་། ཡུལ་འཁོར་གྱི་མིས་སྟི་སྟང་བྱས་། བླ་མར་བྱས། རི་མོར་བྱས། མཆོད་པ་བྱས་སོ། །ཞི་བའི་བློ་གྲོས་རྒྱལ་པོ་ཆེན་པོ་ཡུལ་འཁོར་སྲུང་གིས་བཅོམ་ལྡན་འདས་ཡོན་\nཏན་མཐའ་ཡས་རིན་ཆེན་སྣ་ཚོགས་བཀོད་པའི་རྒྱལ་པོ་དེ་བཞིན་གཤེགས་པ་དེ་ལ་དགེ་སློང་གི་དགེ་འདུན་དང་<span class='add'>  ཐབས་  </span>གཅིག་ཏུ་ལོ་བྱེ་བ་ཚང་བར་ཡིད་དུ་འོང་བའི་བཟའ་བ་དང་། བཏུང་བ་དང་། ན་བཟང་<span class='add'>  ་དང་།   </span>གཙུག་ལག་ཁང་\nདང་། འཆག་སའི་ལོངས་སྤྱོད་ཀྱིས་བསྙེན་བཀུར་བྱས་ཏེ། དགེ་སློང་རེ་རེ་ལ་ཡང་རིམ་གྲོ་བྱ་བ་དང་སྤྱོད་པའི་ཕྱིར་གཡོག་གསུམ་གསུམ་ཕུལ་ལོ། །ཞི་བའི་བློ་གྲོས་རྒྱལ་བུ་གཞོན་ནུ་དེ་དག་ཀྱང་དེ་བཞིན་གཤེགས་པ་ལ་སྟི་\nསྟང་བྱ་བ་དང་། མཆོད་པ་བྱ་བར་མོས་པ་དང་། ཆོས་<span class='add'>  མཉན་  </span>པ་དོན་དུ་གཉེར་བས་བག་ཡོད་པར་གྱུར་ཏེ། འདོད་པའི་ཡོན་ཏན་དོན་དུ་མི་གཉེར་རོ། །དེ་བག་བག་ཡོད་ཅིང་དམ་པའི་ཆོས་ཉན་པ་དང་། སེམས་ཀྱིས་ངེས་པར་སེམས་"
 ],
 [
  "78.135a",
  "དེ་བཞིན་གཤེགས་པ་ག་ལ་བ་དེར་དོད་ནས་ཕྱིན་པ་དང་ཁང་པ་བརྩེགས་པ་དེ་ས་ལ་བཞག་སྟེ། བཅོམ་ལྡན་འདས་དེའི་ཞབས་གཉིས་ལ་མགོ་བོས་ཕྱག་འཚལ་ནས་དགེ་སློང་གི་དགེ་འདུན་\nལ་ཡང་ཕྱག་འཚལ་ཏེ། ལན་བདུན་བསྐོར་བ་བྱས་ནས་ཕྱོགས་གཅིག་ཏུ་འཁོད་དེ། རྒྱལ་པོ་ཡུལ་འཁོར་སྲུང་གི་བཙུན་མོའི་འཁོར་དང་། གཉེན་གྱི་འཁོར་ཀྱང་ཁང་པ་བརྩེགས་པ་དེ་ལས་བབས་ནས་\nབཅོམ་ལྡན་འདས་དེའི་ཞབས་གཉིས་དང་། དགེ་སློང་གི་དགེ་འདུན་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་ལན་བདུན་བསྐོར་བ་བྱས་ནས་ཆོས་མ་ཉན་པའི་ཕྱིར་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་བཙུན་མོའི་འཁོར་དང་། \nགཉེན་གྱི་འཁོར་དུ་བཅས་ཏེ་འདུག་གོ །བམ་པོ་གསུམ་པ། དེ་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཡོན་ཏན་མཐའ་ཡས་རིན་ཆེན་སྣ་ཚོགས་བཀོད་པའི་རྒྱལ་པོས་\nརྒྱལ་པོ་ཡུལ་འཁོར་སྲུང་ཆོས་མཉན་པའི་ཕྱིར་འོངས་པར་མཁྱེན་ནས་ཆོས་ཀྱི་གཏམ་གྱིས་ཡང་དག་པར་བསྟན། ཡང་དག་པར་འཛིན་དུ་བཅུག །ཡང་དག་པར་གཟེངས་སྟོད། ཡང་དག་པར་དགའ་བར་མཛད་དོ། །\nདེ་ལ་བཅོམ་ལྡན་འདས་དེའི་ཆོས་ཀྱི་གཏམ་ནི་འདི་ཡིན་ཏེ། རྒྱལ་པོ་ཆེན་པོ་ཆོས་བཞི་པོ་འདི་དག་ནི་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པ་རྣམས་ཡོངས་སུ་མི་ཉམས་ཤིང་ཁྱད་པར་དུ་འགྲོ་བར་འགྱུར་བའོ། །\nབཞི་གང་ཞེ་ན། རྒྱལ་པོ་ཆེན་པོ་<span class='add'>  དད་  </span>པ་ནི་ཡོངས་སུ་མི་ཉམས་ཤིང་ཁྱད་པར་དུ་འགྲོ་བར་འགྱུར་བའོ། །དད་པ་དེ་གང་ཞེ་ན། དད་པ་གང་གིས་འཕགས་པའི་དྲུང་དུ་ཉེ་བར་འགྲོ་བ་དང་བྱ་བ་མ་ཡིན་པ་མི་བྱེད་པའོ་། །རྒྱལ་\nཔོ་ཆེན་པོ་གུས་པ་ནི་ཁྱད་པར་དུ་འགྲོ་བར་འགྱུར་བ་སྟེ། གུས་པ་གང་གིས་འཕགས་པ་རྣམས་ཀྱི་ལེགས་པར་བཤད་པ་རྣམས་གུས་པར་ཉན་པ་དང་། རྣ་བླགས་ཏེ་ཆོས་ཉན་པའོ། །རྒྱལ་པོ་ཆེན་པོ་ང་རྒྱལ་མེད་པ་ནི་ཁྱད་"
 ],
 [
  "78.136a",
  "<span class='add'>  དང་  </span>དང་བ་མང་བ་དང་། ཆོས་དོན་དུ་གཉེར་བ་དང་། ཆོས་ཀྱི་ཀུན་དགའ་ལ་དགའ་བ་དང་མོས་པར་བྱའོ། །ཁྱོད་ཆོས་ཡོངས་སུ་བརྩལ་བ་ལ་བརྩོན་<span class='add'>  པ་  </span>དང་། ཆོས་འདོད་པར་བྱའི་ཡུལ་ལ་\nཆགས་པར་མི་བྱའོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རྒྱལ་པོ་ཆེན་པོ་འདོད་པ་རྣམས་ལ་ཆོག་པ་མེད་པའི་ཕྱིར་ཏེ། གང་དག་འཕགས་པའི་ཤེས་རབ་ཀྱིས་ངོམས་པ་དེ་དག་ནི་ངོམས་པའོ། །རྒྱལ་པོ་ཆེན་པོ་མི་རྣམས་\nཀྱི་སྲོག་ནི་ཐུང་བ་ཚེའི་ཚད་ཀྱང་ཐུང་བ་སྟེ། ཚེ་རབས་འཕོ་བར་འགྲོ་བ་ཡིན་གྱིས་ཁྱོད་འཇིག་རྟེན་ཕ་རོལ་<span class='add'>    </span>ལ་འཇིགས་པར་བལྟ་བར་བྱའོ། །རྒྱལ་པོ་ཆེན་པོ་ཁྱོད་ཀྱིས་གང་དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པ་དང་། \nརིམ་གྲོ་བྱས་པའི་དགེ་བའི་རྩ་བ་དེ་ཁྱོད་ཀྱིས་ཡོངས་སུ་བསྔོ་བ་བཞིས་ཡོངས་སུ་བསྔོ་བར་བྱའོ། །བཞི་གང་ཞེ་ན། ལོངས་སྤྱོད་མི་ཟད་པ་དང་། ཆོས་མི་ཟད་པ་དང་། སྤོབས་པ་མི་ཟད་པ་དང་། ཡེ་ཤེས་མི་ཟད་པ་སྟེ་བཞི་པོ་དེ་དག་གོ །\nགཞན་ཡང་བཞི་སྟེ། བཞི་གང་ཞེ་ན། ཚུལ་ཁྲིམས་ཀྱི་ཚོགས་ཀྱིས་ལུས་ཡོངས་སུ་དག་པ་དང་། ཐོས་པའི་ཚོགས་ཀྱིས་དག་ཡོངས་སུ་དག་པ་དང་། ཤེས་རབ་ཀྱི་ཚོགས་ཀྱིས་སེམས་ཡོངས་སུ་དག་པ་དང་། ཡེ་\nཤེས་ཀྱི་ཚོགས་ཀྱིས་ཤེས་རབ་ཡོགས་སུ་དག་པ་སྟེ་བཞི་པོ་དེ་དག་གོ །གཞན་ཡང་བཞི་སྟེ། །བཞི་གང་ཞེ་ན། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པས་ཐབས་ཡོངས་སུ་རྫོགས་པ་དང་། བདུད་ཚར་གཅོད་པས་ཤེས་\nརབ་ཡོངས་སུ་རྫོགས་པ་དང་། ཇི་སྐད་སྨྲས་པ་དེ་བཞིན་བྱེད་པས་སྨོན་ལམ་ཡོངས་སུ་རྫོགས་པ་དང་། སངས་རྒྱས་མཐོང་བ་དང་ཕྲད་པས་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པའོ། །དེ་ནས་བཅོམ་ལྡན་\nའདས་ཀྱིས་རྒྱལ་པོ་ཡུལ་འཁོར་སྲུང་ལ་ཆོས་ཀྱི་གཏམ་དེས་ཡང་དག་པར་བསྟན། ཡང་དག་པར་འཛིན་དུ་བཅུག། ཡང་དག་པར་གཟེངས་སྟོད། ཡང་དག་པར་དགའ་བར་མཛད་པས་ཚིམ་ཞིང་མགུ་ལ་ཡི་རངས་ཏེ་"
 ],
 [
  "78.131b",
  "པོ་སྒྲ་དབྱངས་བསྒྲགས་པ་ཞེས་བྱ་བ་ང་ལ་བལྟ་བ་དང་། ཕྱག་བྱ་བ་དང་། མཆོད་པ་དང་། བསྙེན་བཀུར་བྱ་བ་དང་། ཆོས་མཉན་པ་དང་། ལག་ན་རྡོ་རྗེས་བསྟན་པའི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཡང་མཉན་\nཔ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕྱོགས་བཅུ་ནས་འདུས་པ་འདི་དག་ལ་ཡང་བལྟ་བའི་ཕྱིར་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་འདིར་འོངས་ཏེ། ཞི་བའི་བློ་གྲོས་བྱང་ཆུབ་སེམས་\nདཔའ་སྒྲ་དབྱངས་བསྒྲགས་པ་ཞེས་བྱ་བ་དེ་ལུས་མི་སྣང་བར་སྟེང་གི་བར་སྣང་ལ་གནས་ནས་ང་དང་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལ་མཆོད་པའི་ཕྱིར་འདི་ལྟ་བུའི་མེ་ཏོག་གི་ཆར་མངོན་པར་འབེབས་ཤིང་སིལ་\nསྙན་དང་རོལ་མོའི་སྒྲ་ཡང་རབ་ཏུ་ཕྱུང་ནས་སིལ་སྙན་དང་རོལ་མོའི་སྒྲ་དེ་དག་ལས་སྒྲ་འདི་ལྟ་བུ་བྱུང་ངོ་། །བཅོམ་ལྡན་འདས་ཀྱིས་གསུང་དེ་སྐད་བཀའ་སྩལ་ནས་རིང་པོ་མ་ལོན་པར་དེ་ནས་བྱང་ཆུབ་སེམས་\nདཔའ་སྒྲ་དབྱངས་བསྒྲགས་པ་ཞེ་བྱ་བ་བར་སྣང་དེ་ལས་བབས་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་ལན་བརྒྱ་བསྐོར་བ་བྱས་ནས། བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འདུག་\nསྟེ། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྤྲིན་དབྱངས་རྒྱལ་པོས་བཅོམ་ལྡན་འདས་ལ་སྙུན་གསོལ་ཏེ། གནོད་པ་ཆུང་ངམ། ཉམ་ང་བ་ཉུང་ངམ། བསྐྱོད་པ་\nཡང་ངམ། སྟོབས་དང་བདེ་བ་ལ་རེག་པར་གནས་<span class='add'>  སམ།   </span>ཞེས་སྙུན་གསོལ་ལོ། །ཡང་བཅོམ་ལྡན་འདས་དེ་འདི་སྐད་དུ། འདི་ལྟ་སྟེ་སངས་རྒྱས་ཀྱི་མཐུས་། གསང་བ་པའི་བདག་པོས་བསྟན་པ་ཆེན་པོ་འདི་\nབསྟན་ཏོ་ཞེས་གསུང་ངོ་། བཅོམ་ལྡན་འདས་འདི་འདྲ་བའི་སྤྱོད་པས་སངས་རྒྱས་ཀྱི་ཆོས་ཚད་མ་མཆིས་པ་ཐོབ་པར་<span class='add'>  རྔོ་  </span>ཐོག་ལགས་སམ། དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་སྒྲ་"
 ],
 [
  "78.137b",
  "བདག་ཅག་མཆི་བ་གསན་དུ་གསོལ། །བསྐལ་པ་བྱེ་བར་ཆོས་རྙེད་རབ་ཏུ་དཀའ། དེ་རྙེད་ནས་ནི་བྱང་ཆུབ་མ་ཐོབ་པར། མཁས་པ་དག་ནི་གཞར་ཡང་མི་གཏོང་ངོ་། །སངས་རྒྱས་འབྱུང་བ་རྟག་ཏུ་རབ་རྙེད་དཀའ། \nཕ་མ་དག་ནི་ཆོས་ལ་གནས་པ་དང་། དལ་བ་འབྱོར་དང་ཆོས་འདོང་གྲོགས་པོ་དང་། འཐུན་པར་གནས་དང་བསྟན་ལ་<span class='add'>  དད་  </span>རབ་དཀོན་། འདུན་དང་བརྩོན་འགྲུས་དེ་བཞིན་བག་ཡོད་པ་དང་། རབ་ཏུ་བྱུང་ཐོབ་རྟག་ཏུ་ཤེས་\nབཞིན་ཅན། ཕན་<span class='add'>  པའི་  </span>དངོས་དང་མཉེན་དང་མ་ཁེངས་དང་། ངོ་ཚ་ཁྲེལ་ཡོད་ཐོས་དང་ཚུལ་ཁྲིམས་བཟང་། ཞི་དུལ་སྲོག་ཆགས་རྣམས་ལ་སྙིང་རྗེ་བྱམས། ཟབ་མོའི་ཆོས་ལ་ཆོས་ཀྱི་བཟོད་ལྡན་དང་། བརྩོན་འགྲུས་\nམཐུ་དང་སེམས་ནི་མ་ཞུམ་དང་། བསྡུ་བས་སེམས་ཅན་ཡོངས་སུ་སྨིན་བྱེད་དང་། སེམས་ལས་རུང་ཞིང་དབེན་པར་གནས་པ་དང་། ལུས་དང་དེ་བཞིན་སྲོག་ལ་མི་ལྟ་དང་། མགོ་དང་གོས་ལ་འབར་ལྟར་ཆོས་སེམས་པ། \nདེ་དག་སངས་རྒྱས་ཡོན་ཏན་དེ་འདྲ་འཐོབ། བདག་ཅག་ཆོས་མཆོག་གང་དག་རབ་བརྗོད་པ། ཆོས་མཆོག་དེ་དག་ཡབ་ཅིག་རབ་རྙེད་དཀའ། ཆོས་རྣམས་དེ་དག་དོན་དུ་བདག་ཅག་ལྷགས། ང་ནི་རྒྱལ་བའི་དྲུང་དུ་བཞུད་པར་\nབགྱི། །དཀར་པོའི་ཆོས་རྣམས་ཀྱིས་ནི་ཡོངས་ཟིན་ཅིང་། སྐད་ཅིག་གིས་ནི་མངོན་ཤེས་ལྔ་ཐོབ་པ། རྗེས་སུ་དྲན་པ་སྒོམ་ཞིང་ཡེ་ཤེས་ཅན། བྱང་ཆུབ་སེམས་དཔའ་མཁས་པ་དེ་གཉིས་དོང་། རྒྱལ་པོ་བུ་དང་\nབཅས་ཤིང་བུད་མེད་བཅས། བྱང་ཆུབ་སེམས་དཔའ་མངོན་ཤེས་ཐོབ་མཁས་གཉིས། སྟོན་པ་ཡོན་ཏན་རྒྱལ་མཆོག་ག་ལ་བར། ནམ་མཁའ་ལས་ནི་དེར་ཡང་མངོན་དུ་དོང་། དེ་བཞིན་གཤེགས་པའི་ཞབས་ལ་\nཕྱག་འཚལ་ཏེ། ཐམས་ཅད་འདུས་ནས་གུས་དང་བཅས་པར་གནས། དེ་ནས་རྒྱལ་སྲས་ཆོས་ཀྱི་བློ་གྲོས་སྨྲས། བྱང་ཆུབ་ལམ་དེ་བདག་ཅག་བཤད་དུ་གསོལ། །རྒྱལ་བས་དེ་དག་རྣམས་ཀྱི་བསམ་མཁྱེན་ནས། ཟབ་"
 ],
 [
  "78.138b",
  "ཐམས་ཅད་དང་། བདུག་པ་ཐམས་དང་། བྱུག་པ་ཐམས་ཅད་དང་། རོལ་མོའི་སིལ་སྙན་ཐམས་ཅད་ཀྱིས་མཆོད་དོ། །མིང་དེ་དག་མཆོད་པའི་ཚེ་ན་ལྷའི་བུ་ཁྲི་མཆོད་པའི་ཁས་ཀྱི་ཕྱིར་བརྩོན་བར་གྱུར་ཏོ། ཞག་\nབདུན་དུ་མཆོད་པ་བྱས་ནས་བཙུན་མོའི་འཁོར་དང་། དེའི་བུ་སྟོང་དང་། གཞོན་ནུ་དེ་གཉིས་ཀྱི་མདུན་དུ་ཐམས་ཅད་གསེར་ལས་བྱས་པའི་ཁྲིའུ་བཟང་པོའི་སྟེང་དུ་བྱས་པ་དེ་བཞག་ནས་ནང་གི་མིས་བུམ་པ་དེའི་ནང་\nནས་མིང་དེ་རྣམས་ཕྱུང་ངོ་། ཞི་བའི་བློ་གྲོས་དེའི་ཚེ་ཐམས་ཅད་ཀྱི་ཐོགས་མར་རྒྱལ་བུ་གཞོན་ནུ་རྣམ་པར་དག་པའི་བློ་གྲོས་ཞེས་བྱ་བ་དེའི་མིང་བྱུང་བར་གྱུར་ཏོ། །མིང་དེ་བྱུང་མ་ཐག་ཏུ་སྐད་ཅིག་དེ་ཉིད་<span class='add'>  ལ་ས་  </span>ཆེན་པོ་འདི་རྣམ་པ་\nདྲུག་ཏུ་གཡོས་སོ། །<span class='add'>  བཙུན་  </span>མོའི་འཁོར་ཐམས་ཅད་ཀྱི་པང་ན་སིལ་སྙན་ཡོད་པ་དེ་དག་ཀྱང་མ་དཀྲོལ་པར་བྱེ་བ་ཕྲག་དུ་མའི་སྒྲ་བྱུང་ངོ་། །ཞི་བའི་བློ་གྲོས་འདི་ཇི་སྙམ་དུ་སེམས། ཞི་བའི་བློ་གྲོས་དེའི་ཚེ་དེའི་དུས་ན་ཐམས་\nཅད་ཀྱི་ཐོག་མར་མིང་བྱུང་བ་རྒྱལ་བུ་གཞོན་ནུ་རྣམ་པར་དག་པའི་བློ་གྲོས་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཡིན་པར་དེ་ལྟར་མི་བལྟའོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་བཞིན་གཤེགས་པ་འཁོར་བ་འཇིག་དེ་དེའི་ཚེ་དེའི་དུས་ན་\nརྒྱལ་བུ་གཞོན་ནུ་རྣམ་པར་དག་པའི་བློ་གྲོས་ཞེས་བྱ་བར་གྱུར་ཏོ། །དེའི་འོག་ཏུ་རྒྱལ་བུ་གཞོན་ནུ་རྣམ་པར་རྒྱལ་བའི་སྡེ་ཞེས་བྱ་བ་དེའི་མིང་བྱུང་སྟེ། བཅོམ་ལྡན་འདས་གསེར་ཐུབ་དེ་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་བུ་གཞོན་ནུ་\nརྣམ་པར་རྒྱལ་བའི་སྡེ་ཞེས་བྱ་བར་གྱུར་ཏོ། །དེའི་འོག་ཏུ་རྒྱལ་བུ་གཞོན་ནུ་དབང་པོ་ཞི་བ་ཞེས་བྱ་བ་དེའི་མིང་བྱུང་སྟེ། བཅོམ་ལྡན་འདས་འོད་སྲུང་དེ་དེའི་ཚེ་དུས་ན་རྒྱལ་བུ་གཞོན་ནུ་དབང་པོ་ཞི་བ་ཞེས་བྱ་བར་གྱུར་ཏོ། །\nདེའི་འོག་ཏུ་རྒྱལ་བུ་གཞོན་ནུ་དོན་ཐམས་ཅད་གྲུབ་པ་ཞེས་བྱ་བ་དེའི་མིང་བྱུང་ངོ་། །དེ་ནི་ང་ཡིན་ཏེ་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་བུ་གཞོན་ནུ་དོན་ཐམས་ཅད་གྲུབ་བ་ཞེས་བྱ་བར་གྱུར་ཏོ། །དེའི་འོག་ཏུ་རྒྱལ་བུ་གཞོན་ནུ་སྐ་རགས་ཅན་"
 ],
 [
  "78.138a",
  "མོའི་ཆོས་ཀྱི་གཏམ་ནི་རབ་གསུང་བ། ཆོས་རྣམས་འདི་དག་བརྟེན་ནས་བྱུང་བ་སྟེ། བདག་པོ་མེད་ཅིང་བྱེད་པ་པོ་དང་བྲལ། ནམ་ཡང་སྟོང་ཞིང་ཕྱི་རོལ་རྒྱུ་བ་མེད་། ཆོས་རྣམས་འདི་དག་གསོག་དང་། \nགསོབ་ཡིན་ཏེ། ལྟ་དང་བྱ་བ་དག་ཅིང་ཡོ་བ་མེད། ནམ་མཁའ་ལྟ་བུར་རྟག་ཏུ་གཟུང་དུ་མེད། བདེ་བར་གཤེགས་པས་ཆོས་གཏམ་རྣམ་དག་པ། རྣམ་པ་མང་པོ་དེ་དག་རྣམས་ལ་བཤད། བྱེ་བ་ཕྲག་སུམ་\nཁྲག་ཁྲིག་བདུན་བཅུ་དྲུག་། མི་སྐྱེ་བཟོད་པ་རྗེས་སུ་ཐོབ་པར་གྱུར། ཞི་བའི་བློ་གྲོས་དེ་ལྟར་བཅོམ་ལྡན་འདས་དེ་ལ་རྒྱལ་པོ་ཡུལ་འཁོར་སྲུང་གིས་ཞག་བདུན་གྱི་བར་དུ་མཆོད་པ་བྱས་ནས་བཙུན་མོའི་འཁོར་དང་\nབཅས། གཉེན་གྱི་འཁོར་དང་བཅས་ཏེ་སྐད་ཅིག་ཐང་ཅིག་ཡུད་ཙམ་དེ་ལ་རང་གི་ཁྱིམ་དུ་སླར་ཕྱིན་ཏོ། །ཞི་བའི་བློ་གྲོས་དེ་ནས་རྒྱལ་པོ་ཡུལ་འཁོར་སྲུང་གཅིག་པུ་དབེན་པར་སོང་སྟེ། བཀོད་པ་ཆེན་པོའི་ཁང་པ་བརྩེགས་\n<span class='add'>  པར་  </span>སེང་གེའི་ཁྲི་པདྨའི་འབྱུང་གནས་བཟང་པོ་ལ་འདུག་ནས་ནང་དུ་ཡང་དག་པར་བཞག་ཅིང་འདི་སྙམ་དུ་སེམས་ཏེ། བདག་གི་གཞོན་ནུ་འདི་དག་ཐམས་ཅད་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་ཡང་\nདག་པར་ཞུགས་པ་ཤ་སྟག་ན། གཞོན་ནུ་འདི་དག་ཐམས་ཅད་ཀྱི་ནང་ན་གང་ཐོག་མར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་བ་བདག་གིས་བརྟག་གོ་སྙམ་མོ། །\nདེ་ནས་རྒྱལ་པོ་ཡུལ་འཁོར་སྲུང་གིས་དེའི་མོད་ལ་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་བུམ་པ་བྱེད་དུ་བཅུག་སྟེ། བྱི་དོར་ལེགས་པར་བྱས་ཤིང་ལེགས་པར་ཟིན་པར་བྱས་ནས་གཞོན་ནུ་དེ་དག་ཐམས་ཅད་ཀྱི་མིང་བྲིས་ཏེ་བུམ་\nཔ་དེའི་ནང་དུ་བཅུག་ནས་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་པདྨ་སྣ་ཚོགས་བལྟ་ན་སྡུག་པ་བྱས་ནས་པད་མ་དེའི་སྟེང་དུ་བུམ་པ་དེ་བཞག་སྟེ། ཞག་བདུན་དུ་ལྷའི་མཆོད་པ་མེ་ཏོག་ཐམས་ཅད་དང་། སྤོས་ཐམས་ཅད་དང་། ཕྱེ་མ་"
 ],
 [
  "78.137a",
  "དགའ་མགུར་སྤྱོད་དོ། །ཆུང་མ་དམ་པ་མ་སྨད་པ་ཞེས་བྱ་བ་དང་། དཔེ་མེད་མ་ཞེས་བྱ་བ་དེ་གཉིས་རྫིང་དགའ་བ་ཞེས་བྱ་བར་ཁྲུས་བྱས་ཏེ་སྤོས་ཆུས་གོས་བརླན་ནས་སེང་གེའི་ཁྲི་པདྨའི་འབྱུང་གནས་\nབཟང་པོ་ལ་འདུག་གོ །དེ་གཉིས་དེར་འདུག་པའི་བང་པ་ནས་རྒྱལ་བུ་གཞོན་ནུ་གཟུགས་བཟང་པ། མཛེས་པ། བལྟ་ན་སྡུག་པ། ཁ་དོག་བཟང་པོ་རྒྱས་པ། མཆོག་དང་ལྡན་པ་གཉིས་དཀྱིལ་མོ་དཀྲུང་བཅས་\nཔར་རྫུས་ཏེ་བྱུང་ང་ོ། །དེ་ནས་སྐད་ཅིག་དེ་ཉིད་ལ་སྟེང་གི་བར་སྣང་ལས་ལྷ་རྣམས་ཀྱིས་ཀྱེ་མ་ཁྱེའུ་འདི་ནི་ཆོས་སེམས་པའོ། །ཀྱེ་མ་ཁྱེའུ་འདི་ནི་ཆོས་ཀྱི་བློ་གྲོས་སོ་ཞེ་སྒྲ་བྱུང་ངོ་། །ཞི་བའི་བློ་གྲོས་དེ་ལྟར་འཇིག་རྟེན་\nདུ་ཁྱེའུ་དེ་གཉིས་ཆོས་སེམས་པ་དང་། ཆོས་ཀྱི་བློ་གྲོས་ཞེས་བྱ་བའི་མིང་དུ་གྱུར་ཏོ། །དེ་ལ་ཁྱེའུ་ཆོས་སེམས་པ་ནི་བཙུན་མོ་མ་སྨད་པའི་པང་པ་ནས་བྱུང་ངོ་། །ཆོས་ཀྱི་བློ་གྲོས་ནི་བཙུན་མོ་དཔེ་མེད་པའི་པང་པ་ནས་བྱུང་\nངོ་། །ཁྱེའུ་དེ་གཉིས་བྱུང་མ་ཐག་ཏུ་ཀྱིལ་མོ་དང་ཀྲུང་མ་ཉམས་པར་གཉིས་ཀས<span class='add'>  ་ཚེགས  </span>n class='add'>  ཚིགས་  </span>སུ་བཅད་པ་འདི་དག་སྨྲས་སོ། །གང་དག་བྱང་ཆུབ་ཏུ་ནི་སེམས་སྐྱེད་ཅིང་། འཇིག་རྟེན་མགོན་པོ་ཡུལ་དུ་བྱུང་བ་ལ། རབ་ཏུ་དང་\nབའི་སེམས་ཀྱིས་ཕྱག་འཚལ་བ། དེ་དག་རྙེད་པ་རབ་རྙེད་གྲོགས་པོ་དག །གང་ཞིག་བྱང་ཆུབ་སེམས་ནི་མ་བརྗེད་པ། དེ་ནི་སྲིད་པའི་རྒྱ་མཚོའི་གཏིང་དུ་ཕྱིན། འཁོར་བའི་འཁོར་ལོ་ལས་ནི་ཡིད་ཀྱང་<span class='add'>  ལོག །  </span>\nསེམས་ཅན་རྒྱ་ཆེན་རྣམས་ཀྱིས་ལེགས་པར་གཟུང་། སྟེང་གི་ཕྱོགས་ན་ཡན་ལག་མ་སྨད་པ། འདྲེན་པ་མཚན་ནི་དུས་དཔོག་རྒྱལ་པོ་སྟེ། དེ་ནས་བདག་ཅག་ཆོས་དོན་གཉེར་བ་དང་། འཇིག་མགོན་ཡོན་ཏན་འབྱུང་\nགནས་བལྟ་ཕྱིར་མཆིས། ཁྱེའུ་དེ་གཉིས་ཀྱིས་སྐྱིལ་མོ་དཀྲུང་བཤིག་ནས། དེ་ཡི་ཚེ་<span class='add'>  ན་མ་  </span>ཡི་པང་ནས་བབས། ཡུལ་འཁོར་སྲུང་པོ་ག་ལར་དེ་གཉིས་དོང་། རྐང་པར་ཕྱག་ཚལ་ཐལ་མོ་སྦྱར་ཏེ་འདུག །ཡབ་ཅིག་"
 ],
 [
  "78.139b",
  "པར་འགྱུར་རོ། །དེའི་འོག་ཏུ་རྒྱལ་བུ་གཞོན་ནུ་དཔལ་སྦས་ཞེས་བྱ་བའི་མིང་བྱུང་སྟེ། དེ་ནི་ནོར་དཔལ་ཞེས་བྱ་བའི་དེ་བཞིན་གཤེགས་པར་འགྱུར་རོ། །དེའི་འོག་ཏུ་རྒྱལ་བུ་གཞོན་ནུ་ལུས་ཤིན་དུ་རྣམ་པར་འབྱེད་པ་\nཞེས་བྱ་བའི་མིང་བྱུང་སྟེ། དེ་ནི་ཡེ་ཤེས་འབྱུང་གནས་ཞེས་བྱ་བའི་དེ་བཞིན་གཤེགས་པར་འགྱུར་རོ། །དེའི་འོག་ཏུ་རྒྱལ་བུ་གཞོན་ནུ་དྲག་ཤུལ་ཅན་ཞེས་བྱ་བའི་མིང་བྱུང་སྟེ། དེ་ནི་རིན་པོའི་<span class='add'>  ཆེ་  </span>འབྱུང་གནས་ཞེས་\nབྱ་བའི་དེ་བཞིན་གཤེགས་པར་འགྱུར་རོ། །དེའི་འོག་ཏུ་རྒྱལ་བུ་གཞོན་ནུ་རིན་ཆེན་གྲགས་པ་ཞེས་བྱ་བའི་མིང་བྱུང་སྟེ། དེ་ནི་ཀུན་དུ་སྣང་<span class='add'>  བ་ཞེས་  </span>བྱ་བའི་དེ་བཞིན་གཤེགས་པར་འགྱུར་རོ། །དེ་བཞིན་དུ་རྒྱ་ཆེར་བྱ་\nསྟེ།ཞི་བའི་བློ་གྲོས་དེ་ལྟར་བུ་སྟོང་ཡོད་པ་དེའི་ནད་ནས་གཅིག་བཞག་སྟེ། རྒྱལ་བུ་གཞོན་ནུ་ཅོན་པན་བརྒྱན་པ་ཞེས་བྱ་བའི་མིང་གི་བར་དུ་འབྱུང་ངོ་། །དེ་ནི་ཡོན་ཏན་མཐའ་ཡས་གྲགས་པ་ཞེས་བྱ་བའི་དེ་བཞིན་\nགཤེགས་པར་འགྱུར་རོ། །ཞི་བའི་བློ་གྲོས་དེའི་ཚེ་རྒྱལ་བུ་གཞོན་ནུ་ཐམས་ཅད་ཀྱི་ཐ་མཚུངས་བློ་གྲོས་མཐའ་ཡས་ཞེས་བྱ་བའི་མིང་བྱུང་བར་གྱར་པ་དང་སྣག་གི་གཉེན་མཚམས་ཐམས་ཅད་དང་སྤུན་རྣམས་ན་རེ། \nགང་གི་ཚེ་བདག་ཅན་ཐམས་ཅད་ཀྱིས་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱས་ཤིང་སངས་རྒྱས་ཀྱི་བྱ་བ་ཐམས་ཅད་བྱས་པ་དེའི་འོག་ཏུ་ཁྱོད་ཀྱིས་ཅི་ཞིག་བྱར་ཡོད་ཅེས་དཔྱས་པ་དང་། བློ་གྲོས་མཐའ་ཡས་\nཀྱིས་སྨྲས་པ། སངས་རྒྱས་ཆོས་རྣམས་འདི་དག་ནམ་མཁའ་མཚུངས་ཤིང་འདྲ། བདག་གི་ཡིད་ལ་སེམས་ཅན་ཟད་པ་མེད་སྙམ་བགྱིད་ཚུལ་ཁྲིམས་ཀྱིས་ནི་བདག་གི་སྨོན་ལམ་འདི་དག་<span class='add'>  འགྱུར། །  </span>བདག་གི་སྨོན་ལམ་ཅི་འདྲ་ཐམས་ཅད་འདི་དག་གོས་ན་\n<span class='add'>  ཅིག །  </span>ཁྱེད་ཀྱི་ཚེ་ཚད་ཇི་ཙམ་བདག་སྡོམས་པ་དང་། ཚོགས་ཀྱི་རྒྱལ་པོ་ཇི་སྙེད་དེ་དག་ཏུ་ཀུན་བསྡོམས་པ། ཐམས་ཅད་བསྡོམས་པ་དེ་སྙེད་བདག་གི་ཚེར་འགྱུར་ཏེ། བདག་གི་དགེ་སློད་ཚོགས་ཀྱང་དེ་ཀུན་མ་ལུས་<span class='add'>  སྙེད། །  </span>"
 ],
 [
  "78.139a",
  "ཞེས་བྱ་བའི་མིང་བྱུང་བར་གྱུར་ཏེ། དེ་ནི་བྱམས་པ་ཞེས་བྱ་བའི་དེ་བཞིན་གཤེགས་པར་འགྱུར་རོ། །དེའི་འོག་ཏུ་རྒྱལ་བུ་གཞོན་ནུ་མཆོག་གི་བློ་གྲོས་ཞེས་བྱ་བ་དེའི་མིང་བྱུང་སྟེ། དེ་ནི་སེང་གེ་ཞེས་བྱ་བའི་\nདེ་བཞིན་གཤེགས་པར་འགྱུར་རོ། །དེའི་འོག་ཏུ་རྒྱལ་བུ་གཞོན་ནུ་གློག་གི་ལྷ་ཞེས་བྱ་བ་དེའི་མིང་བྱུང་སྟེ། དེ་ནི་ཏོག་ཅེས་བྱ་བའི་དེ་བཞིན་གཤེགས་པར་འགྱུར་རོ། །དེའི་འོག་ཏུ་རྒྱལ་བུ་གཞོན་ནུ་བཟང་པོའི་རྒྱལ་\nཔོ་ཞེས་བྱ་བའི་མིང་བྱུང་སྟེ། དེ་ནི་མེ་ཏོག་དམ་པ་<span class='add'>  ཞེས་བྱ་  </span>བའི་དེ་བཞིན་གཤེགས་པར་འགྱུར་རོ། །དེའི་འོག་ཏུ་རྒྱལ་བུ་གཞོན་ནུ་འོད་ཀྱི་དཔལ་ཞེས་བྱ་བའི་མིང་བྱུང་སྟེ། དེ་ནི་མེ་ཏོག་ཅེས་བྱ་བའི་དེ་བཞིན་གཤེགས་\nཔར་འགྱུར་རོ། །དེའི་འོག་ཏུ་རྒྱལ་བུ་གཞོན་ནུ་རྣམ་པར་སྣང་བའི་པདྨ་ཞེས་བྱ་བའི་མིང་བྱུང་སྟེ། དེ་ནི་སྐར་མ་རྒྱལ་ཞེས་བྱ་བའི་དེ་བཞིན་གཤེགས་པར་འགྱུར་རོ། །དེའི་འོག་ཏུ་རྒྱལ་བུ་གཞོན་ནུ་དྲི་མ་མེད་པའི་\nའོད་ཅེས་བྱ་བའི་མིང་བྱུང་སྟེ། དེ་ནི་སྤྱན་ལེགས་པ་ཞེས་བྱ་བའི་དེ་བཞིན་གཤེགས་པར་འགྱུར་རོ། །དེའི་འོག་ཏུ་རྒྱལ་བུ་གཞོན་ནུ་རྡུལ་མེད་ཅེས་བྱ་བའི་མིང་བྱུང་སྟེ། དེ་ནི་ལག་བཟངས་ཞེས་བྱ་བའི་དེ་བཞིན་\nགཤེགས་པར་འགྱུར་རོ། །དེའི་འོག་ཏུ་རྒྱལ་བུ་གཞོན་ནུ་བློ་གྲོས་རྒྱལ་པོ་ཞེས་བྱ་བའི་མིང་བྱུང་སྟེ། དེ་ནི་འོད་ཅེས་བྱ་བའི་དེ་བཞིན་གཤེགས་པར་འགྱུར་རོ། །དེའི་འོག་ཏུ་རྒྱལ་བུ་གཞོན་ནུ་དགེ་བ་བཀོད་པའི་རྒྱལ་པོ་\nཞེས་བྱ་བའི་མིང་བྱུང་སྟེ། དེ་ནི་སྐར་མ་ལ་དགའ་བ་ཞེས་བྱ་བའི་དེ་བཞིན་གཤེགས་པར་འགྱུར་རོ། །དེའི་འོག་ཏུ་རྒྱལ་བུ་གཞོན་ནུ་ཕྱོགས་འབྱོར་པ་ཞེས་བྱ་བའི་མིང་བྱུང་སྟེ། དེ་ནི་མངོན་འཕགས་གཤེགས་པ་\nཞེས་བྱ་བའི་དེ་བཞིན་གཤེགས་པར་འགྱུར་རོ། །དེའི་འོག་ཏུ་རྒྱལ་བུ་གཞོན་ནུ་རྣམ་པར་དག་པ་བཀོད་པའི་རྒྱལ་པོ་ཞེས་བྱ་བའི་མིང་བྱུང་སྟེ། དེ་ནི་ཡོན་ཏན་གྱི་མཆོག་མངའ་བ་ཞེས་བྱ་བའི་དེ་བཞིན་གཤེགས་"
 ],
 [
  "78.142a",
  "པ་མེད་པས་མཐོ་དམའ་མེད་པའོ། །ལམ་དེ་ནི་གནོད་སེམས་དང་། ཐ་བ་དང་། ཁྲོ་བ་མེད་པས་རྡུལ་དང་ཕྲལ་ལོ། །ལམ་དེ་ནི་མི་དགེ་བའི་ཆོས་ཐམས་ཅད་དང་བྲལ་བས་བདེ་འགྲོར་འགྲོ་བའོ། །\nལམ་དེ་ནི་མྱ་ངན་ལས་འདས་པའི་མཐར་འགྲོ་བས་བདེ་བའི་ཕྱོགས་སུ་འགྲོ་བའོ། །ཞི་བའི་བློ་གྲོས་དེ་ལྟར་ན་གང་ལ་ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་འགྲོ་བ་མེད་པ་དང་། ལམ་མ་ཡིན་པ་དེ་འདྲ་བ་\nདེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་ལམ་སྟེ། ལམ་དེ་ལ་གནས་ན་བྱང་ཆུབ་སེམས་དཔའ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་<span class='add'>  རྒྱ  </span>འོ། །བྱང་ཆུབ་ཀྱི་ལམ་གྱི་ལེའུ་སྟེ་དྲུག་པའོ། །\nདེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཞི་བའི་བློ་གྲོས་ཀྱིས་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །གསང་བ་པའི་བདག་པོ་དེ་བཞིན་གཤེགས་པའི་གསང་བ་ཅི་འདྲ། དེ་བཞིན་གཤེགས་པའི་\nགསང་བ་བའི་ཕྱོགས་ཙམ་ཞིག་ལ་ཁྱོད་སྤོབས་པར་གྱིས་ཤིག་ །དེ་སྐད་ཅེས་སྨྲས་པ་དང་། གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེས་བྱང་ཆུབ་སེམས་དཔའ་ཞི་བའི་བློ་གྲོས་ལ་འདི་སྐད་ཅེས་སྨྲ་ས་སོ། །སངས་རྒྱས་\nཀྱི་མཐུ་དང་། སངས་རྒྱས་ཀྱི་བྱིན་གྱི་བརླབས་ཀྱིས་བསྟན་གྱིས་རིགས་ཀྱི་བུ་ཉོན་ཅིག །ཞི་བའི་བློ་གྲོས་གསུམ་པོ་འདི་དག་ནི་དེ་བཞིན་གཤེགས་པའི་གསང་བའོ། །གསུམ་གང་ཞེ་ན་འདི་ལྟ་སྟེ། སྐུའི་གསང་བ་\nདང་། གསུང་གི་གསང་བ་དང་། ཐུགས་ཀྱི་གསང་བ་འོ། །ཞི་བའི་བློ་གྲོས་དེ་ལ་དེ་བཞིན་གཤེགས་པའི་སྐུའི་གསང་བ་གང་ཞེ་ན། ཞི་བའི་བློ་གྲོས་འདི་ལ་དེ་བཞིན་གཤེགས་པ་ནི་མི་དགོངས་ཤིང་རབ་ཏུ་མི་རྟོག་\n<span class='add'>  པར་  </span>སྤྱོད་ལམ་ཐམས་ཅད་ཀྱང་ཀུན་ཏུ་སྟོན་ཏེ། རིགས་ཀྱི་བུ་དེ་ལ་ལྷ་དང་མི་ཁ་ཅིག་འདུག་པ་གཙོ་བོར་བྱེད་པ་དེ་དག་གིས་ནི་དེ་བཞིན་གཤེགས་པ་བཞུགས་པར་མཐོང་ང་ོ། །ལྷ་དང་མི་ཁ་ཅིག་འཆག་པ་"
 ],
 [
  "78.142b",
  "གཙོ་བོར་བྱེད་པ་དེ་དག་གིས་ནི་དེ་བཞིན་གཤེགས་པ་འཆག་པར་མཐོང་<span class='add'>  ངོ་། །  </span>ལྷ་དང་མི་ཁ་ཅིག་འགྲེང་བ་གཙོ་བོར་བྱེད་པ་དེ་དག་གིས་ནི་དེ་བཞིན་གཤེགས་པ་འགྲང་བར་མཐོང་ངོ་། །ལྷ་དང་མི་ཁ་ཅིག་ཉལ་བ་\nགཙོ་བོར་བྱེད་པ་དེ་དག་གིས་ནི་དེ་བཞིན་གཤེགས་པ་མནལ་བར་མཐོང་ང་ོ། ལྷ་དང་མི་ཁ་ཅིག་ཆོས་སྟོན་པ་གཙོ་བོར་བྱེད་པ་དེ་དག་གིས་ནི་དེ་བཞིན་གཤེགས་པ་ཆོས་སྟོན་པར་མཐོང་<span class='add'>  ངོ་། །  </span>ལྷ་དང་མི་ཁ་ཅིག་མི་\nསྨྲ་བར་གཙོ་བོར་བྱེད་པ་དེ་དག་གིས་ནི་དེ་བཞིན་གཤེགས་པ་མི་གསུང་བར་གྱུར་བར་མཐོང་ངོ་། །ལྷ་དང་མི་ཁ་ཅིག་བསམ་གཏན་གཙོ་བོར་བྱེད་པ་དེ་དག་གིས་ནི་དེ་བཞིན་གཤེགས་པ་བསམ་གཏན་ལ་སྙོམས་པར་\nཞུགས་པར་མཐོང་ངོ་། །ལྷ་དང་མི་ཁ་ཅིག་ལངས་པ་གཙོ་བོར་བྱེད་པ་དེ་དག་གིས་ནི་དེ་བཞིན་གཤེགས་པ་བཞེངས་པར་མཐོང་<span class='add'>  ངོ་། །  </span>ལྷ་དང་མི་ཁ་ཅིག་མིག་མི་འཛུམས་པར་ལྟ་བ་གཙོ་བོར་བྱེད་པ་དེ་དག་གིས་ནི་\nདེ་བཞིན་གཤེགས་པ་སྤྱན་མི་འཛུམས་པར་གཟིགས་པར་མཐོང་<span class='add'>  ངོ་། །  </span>ལྷ་དང་མི་ཁ་ཅིག་འཛུམ་པ་བྱེད་པ་གཙོ་བོར་འཛིན་པ་དེ་དག་གིས་ནི་དེ་བཞིན་གཤེགས་པ་འཛུམ་པ་མཛད་པར་མཐོང་ངོ་། །ལྷ་དང་མི་ཁ་ཅིག་\nམདོག་གསེར་གྱི་ཁ་དོག་ལྟ་བུ་གཙོ་བོར་བྱེད་པ་དེ་དག་གིས་ནི་དེ་བཞིན་གཤེགས་པ་སྐུ་མདོག་གསེར་གྱི་ཁ་དོག་ལྟ་བུར་མཐོང་<span class='add'>  ངོ་། །  </span>དེ་བཞིན་དུ་ལ་ལས་ནི་དངུལ་གྱི་མདོག་ཏུ་མཐོང་<span class='add'>  ངོ་། །  </span>དེ་བཞིན་དུ་ཤེས་གྱི་མདོག་\nདང་། བཻ་དཱུ་རྻའི་མདོག་དང་། རྡོའི་སྙིང་པོའི་མདོག་དང་། <span class='add'>  སྤུག་  </span>གི་མདོག་དང་། མུ་ཏིག་དམར་པོའི་མདོག་དང་། མུ་ཏིག་དཀར་པོའི་མདོག་དང་། མདོག་དམར་པོ་དང་། མདོག་དཀར་པོ་དང་། བཙོད་ཀའི་མདོག་དང་། \nམདོག་སྔོན་པོ་དང་། མདོག་སེར་པོ་དང་། ཟླ་བའི་མདོག་དང་། ཉི་མའི་མདོག་དང་། མེའི་མདོག་དང་། འོད་ཀྱི་མདོག་དང་། བརྒྱ་བྱིན་གྱི་མདོག་དང་། ཚངས་པའི་མདོག་དང་། བ་མོའི་མདོག་དང་། སྡོང་རོས་"
 ],
 [
  "78.140a",
  "དེ་ཡིས་ཚིགས་སུ་བཅད་པ་དེ་ནི་སྨྲས་མ་ཐག །དེའི་ཚེ་ན་ལེགས་ཤེས་ལྷ་ཡིས་སྒྲ་བྱུང་སྟེ། སེམས་ཅན་དག་པ་ཁྱོད་ཀྱིས་བསམ་པ་རྫོགས་གྱུར་ཅིག །ཁྱོད་ཀྱིས་ཇི་ལྟར་བསམས་བཞིན་\nསེམས་ཅན་དོན་མཛད་ཅིག །ཞི་བའི་བློ་གྲོས་དེ་ལྟར་རྒྱལ་བུ་གཞོན་ནུ་ཐམས་ཅད་ཀྱི་ཐ་ཆུངས་སུ་གྱུར་པ་བློ་གྲོས་མཐའ་ཡས་ཞེས་བྱ་བ་དེ་ནི་བསྐལ་པ་བཟང་པོ་འདི་ལ་དེ་བཞིན་གཤེགས་པ་ཐམ་པ་\nམོས་པ་ཞེས་བྱ་བར་འགྱུར་ཏེ། ཞི་བའི་བློ་གྲོས་བསྐལ་པ་བཟང་པོའི་དེ་བཞིན་གཤེགས་པ་དེ་དག་ཐམས་ཅད་ཀྱི་ཚེའི་ཚད་ཇི་ཙམ་པ་དང་།ཉན་ཐོས་ཀྱི་དགེ་འདུན་ཇི་སྙེད་པར་འགྱུར་བ་<span class='add'>  དེ་  </span>བཞིན་གཤེགས་\nཔ་མོས་པ་དེའི་ཚེའི་ཚད་ཀྱང་དེ་སྲིད་དུ་འགྱུར། ཉན་ཐོས་ཀྱི་དགེ་འདུན་ཡང་དེ་སྙེད་དུ་འགྱུར་རོ། །བདག་དེ་ལྟར་མོས་<span class='add'>  པས་  </span>ན་དེའི་ཕྱིར་མོས་པ་ཞེས་བྱའོ། །ཞི་བའི་བློ་གྲོས་འདི་ལྟར་སངས་རྒྱས་སྟོང་དུ་གཅིག་\nགིས་མ་ཚང་བ་དག་སངས་རྒྱས་ཀྱི་མཛད་པ་ཇི་སྙེད་མཛད་པ་དེ་སྙེད་དེ་བཞིན་གཤེགས་པ་མོས་པར་བྱེད་པར་འགྱུར་བས་ཐམས་ཅད་མཁས་པའི་ཚུལ་ཁྲིམས་ཕུན་སུམ་ཚོགས་པའི་རྒྱུ་འཐུན་པ། སྨོན་ལམ་ཡོངས་\nསུ་རྫོགས་པའི་ཁྱད་པར་ལ་ལྟོས། ཞི་བའི་བློ་གྲོས་དེ་ནས་གཞོན་ནུ་སྟོང་པོ་དེ་དག་གིས་བྱང་ཆུབ་སེམས་དཔའ་གཞོན་ནུ་ཆོས་སེམས་པ་དང་། ཆོས་ཀྱི་བློ་གྲོས་དང་དེ་གཉིས་ལ་འདི་སྐད་ཅེས་སྨྲས་<span class='add'>  སོ། །  </span>\nརིགས་ཀྱི་བུ་ཁྱེད་གཉིས་ཀྱིས་སྨོན་ལམ་ཇི་ལྟ་བུ་ཞིག་ཏམ། ཆོས་སེམས་པས་སྨྲས་པ། གྲོགས་པོ་དག་བདག་ནི་ཁྱེད་ཐམས་ཅད་ཀྱི་ལག་ན་རྡོ་རྗེར་གྱུར་ཏེ། ནང་ན་སྤྱོད་ཅིང་དེ་བཞིན་གཤེགས་པའི་\nགསང་བ་ཐམས་ཅད་ལས་ཕྱི་རོལ་དུ་མ་གྱུར་ལ་ཕྱི་ནང་གི་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཉན་པ་དང་། མོས་པ་དང་། རྟོགས་པ་དེ་ལྟར་བདག་སྨོན་ལམ་འདེབས་སོ། །ཆོས་ཀྱི་བློ་གྲོས་ཀྱིས་སྨྲས་པ། སྣག་"
 ],
 [
  "78.143a",
  "ཀྱི་མདོག་དང་། མཚལ་གྱི་མདོག་ཏུ་མཐོང་ངོ་། །ལ་ལས་ནི་ཆུའི་མདོག་དང་། ལ་ལས་ནི་མྱ་ངན་འཚང་གི་མེ་ཏོག་གི་མདོག་དང་། ཙམ་པ་ཀའི་མདོག་དང་། གནའ་མའི་མེ་ཏོག་གི་མདོག་\nདང་། བར་ཤི་ཀའི་མདོག་དང་། པདྨའི་མདོག་དང་། ཀུ་མུ་དའི་མདོག་དང་། པདྨ་དཀར་པོའི་མདོག་དང་། དཔལ་གྱི་མདོག་དང་། རྣམ་ཐོས་ཀྱི་བུའི་མདོག་དང་།<span class='add'>  ངང་  </span>པའི་རྒྱལ་པོ་དང་སྐྱའི་མདོག་དང་། པདྨ་སར་\nཔའི་མདོག་དང་། དཔལ་གྱི་སྙིང་པོའི་མདོག་དང་། རིན་པོ་ཆེ་བྱེ་རུའི་མདོག་དང་། ནོར་བུ་རིན་པོ་ཆེའི་མདོག་དང་། ཨན་ད་རྙིལ་གྱི་མདོག་དང་། ནམ་མཁའ་དག་པའི་གཟི་བརྗིད་ཀྱི་མདོག་དང་། ལྷ་དང་མ་ཁ་ཅིག་\nཡོན་ཏན་གྱི་བསྔགས་པ་མཐའ་ཡས་པར་མོས་པ་དེ་དག་གིས་ནི་དེ་བཞིན་གཤེགས་པའི་སྐུའི་ཡོན་ཏན་གྱི་བསྔགས་པ་མཐའ་ཡས་པ་དང་ལྡན་པར་མཐོང་ང་ོ། །ཞི་བའི་བློ་གྲོས་དེ་ལྟར་ཡོངས་སུ་བརྟག་པ་ཉེ་བར་\nབཟུང་སྟེ། སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ན་སེམས་ཅན་ཇི་སྙེད་ཡོད་པ་དང་། གང་ཡང་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་སེམས་ཅན་དེ་དག་མིའི་ལུས་ཐོས་བར་གྱུར་\nལ་། དེའི་ནང་ནས་སེམས་ཅན་གཅིག་གིས་སེམས་ཅན་དེ་དག་ཇི་སྙེད་པ་དེ་སྙེད་ལ་དེ་བཞིན་གཤེགས་པའི་སྐུའི་གཟུགས་དང་། མདོག་དང་། རྟགས་དང་། དབྱིབས་དང་སྤྱོད་ལམ་སེམས་ཤིང་མོས་ཏེ་མངོན་པར་\nསྒྲུབ་ལ་སེམས་ཅན་གཅིག་གིས་ཇི་ལྟར་བ་དེ་བཞིན་དུ་སེམས་ཅན་དེ་དག་ཐམས་ཅད་རེ་རེས་ཀྱང་དེ་སྙེད་ལ་དེ་བཞིན་གཤེགས་པའི་སྐུའི་གཟུགས་དང་། མདོག་དང་རྟགས་དང་དབྱིབས་དང་། སྤྱོད་ལམ་དུ་སེམས་\nཤིང་མོས་ཏེ་མངོན་པར་སྒྲུབ་ལ། སེམས་ཅན་གཅིག་གི་སེམས་ཀྱི་མོས་པ་གང་ཡིན་པ་དེ་སེམས་ཅན་གཉིས་པའི་མ་ཡིན་ཏེ། ཞི་བའི་བློ་གྲོས་རྣམ་གྲངས་དེས་ན་དེ་བཞིན་གཤེགས་པ་སེམས་ཅན་དེ་དག་"
 ],
 [
  "78.144b",
  "ལ་ལས་ནི་མ་བསྒྲིམས་ན་མཐོང་ལ་བསྒྲིམས་པ་ན་མ་ཡིན་ནོ། །ཞི་བའི་བློ་གྲོས་དེ་ལྟར་དེ་བཞིན་གཤེགས་པའི་སྐུ་ནི་འདི་དག་དང་། གཞན་ཡང་ཚད་མེད་པའི་རྣམ་པར་སྟོན་པ་མཛད་དོ། །གང་ཡང་གཟུགས་\nན་སྤྱོད་པའི་ལྷ་བུ་ལུས་དང་། སྤྱོད་པ་དང་སྤྱོད་ལམ་རབ་ཏུ་ཞི་བ། མཉམ་པར་བཞག་པ། ལུས་ཞི་བ་དུལ་བ་དེ་དག་གི་མིང་ཀྱང་འཁྲུལ་པར་འགྱུར་ཏེ་། དེ་བཞིན་གཤེགས་པའི་སྐུ་ལ་དཔག་པར་བྱ་བ་\nའམ། མཚན་མ་གཟུང་བར་མི་ནུས་སོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཞི་བའི་བློ་གྲོས་དེ་བཞིན་གཤེགས་པའི་སྐུ་ནི་ཁ་དོག་ཐ་དད་པས་ཚད་མེད་པའོ། །ཆོས་ཀྱི་སྐུས་རབ་ཏུ་ཕྱེ་བའི་ཕྱིར་ནམ་མཁའ་དང་མཚུངས་\nསོ། །ཞི་བའི་བློ་གྲོས་ནམ་མཁའ་ཇི་ཙམ་དུ་ཁྱབ་པ་དེ་ཙམ་དུ་དེ་བཞིན་གཤེགས་པའི་སྐུས་ཁྱབ་བོ། །ཞི་བའི་བློ་གྲོས་འདི་ལྟ་སྟེ་དཔེར་ན་ནམ་མཁའ་ནི་ཐམས་ཅད་རྗེས་སུ་སོང་བའོ། །ཞི་བའི་\nབློ་གྲོས་དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པའི་སྐུ་ཡང་ཐམས་ཅད་ཀྱི་རྗེས་སུ་སོང་བའོ། ཞི་བའི་བློ་གྲོས་འདི་ལྟ་སྟེ་དཔེར་ན་ནམ་མཁའ་ནི་སྤྲོས་པ་མེད་པའོ། །ཞི་བའི་བློ་གྲོས་དེ་བཞིན་དུ་དེ་བཞིན་\nགཤེགས་པའི་སྐུ་ཡང་སྤྲོས་པ་མི་མངའ་བའོ། །ཞི་བའི་བློ་གྲོས་འདི་ལྟ་སྟེ། དཔེར་ན་ནམ་མཁའ་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཉེ་བར་འཚོ་བའོ། །ཞི་བའི་བློ་གྲོས་དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པའི་\nསྐུ་ཡང་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཉེ་བར་འཚོ་བའོ། །ཞི་བའི་བློ་གྲོས་འདི་ལྟ་སྟེ་དཔེར་ན་ནམ་མཁའ་ནི་འགྱུར་བ་མེད་ཅིང་རྣམ་པར་རྟོག་པ་མེད་དོ། །ཞི་བའི་བློ་གྲོས་དེ་བཞིན་གཤེགས་པའི་སྐུ་\nཡང་འགྱུར་བ་མི་མངའ་ཞིང་རྣམ་པར་རྟོག་པ་མི་<span class='add'>  མངའོ། །  </span><span class='add'>    </span>ཞི་བའི་བློ་གྲོས་འདི་ལྟ་སྟེ་དཔེར་ན་ནམ་མཁའ་ནི་གཟུགས་སུ་སྣང་བ་ཐམས་ཅད་དུ་ཞུགས་པའོ། །ཞི་བའི་བློ་གྲོས་དེ་བཞིན་དུ་དེ་བཞིན་"
 ],
 [
  "78.143b",
  "ཐམས་ཅད་ཀྱི་སེམས་ཀྱི་མོས་པ་ཚིམ་པར་མཛད་དེ། ཇི་ལྟར་མོས་པ་བཞིན་དུ་སེམས་ཅན་བདེ་དག་གིས་དེ་བཞིན་གཤེགས་པའི་སྐུའི་གཟུགས་དང་། མདོག་དང་རྟགས་དང་དབྱིབས་དང་སྤྱོད་ལམ་དུ་ཤེས་མོད་\nཀྱི། དེ་ལ་དེ་བཞིན་གཤེགས་པའི་སྐུ་འམ། ཐུགས་ཀྱི་མཛད་<span class='add'>  པ་  </span>ནི་མ་ཡིན་ཏེ། དེ་བཞིན་གཤེགས་པ་སྔོན་གྱི་སྤྱོད་པ་ཡོངས་སུ་སྦྱངས་པའི་ཁྱད་པར་གྱིས་ལྷུན་གྱིས་གྲུབ་པས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་\nཀྱི་བསམ་པ་ཚིམ་པར་མཛད་པའི་གཟུགས་དང་། མདོག་དང་རྟགས་དང་དབྱིབས་དང་སྤྱོད་ལམ་གྱིས་ཀུན་དུ་བཞུགས་པའོ། །ཞི་བའི་བློ་གྲོས་འདི་ལྟ་སྟེ་དཔེར་ན་། མེ་ལོང་གི་དཀྱིལ་འཁོར་ཡོངས་སུ་\nདག་པ་ལ་གཟུགས་སུ་སྣང་བ་ཅི་འདྲ་བ་ཉེ་བར་གཞག་པ་དེ་འདུ་བ་ཉིད་ཀྱི་གཟུགས་བརྙན་དེ་ན་ལྷག་ཆད་མེད་པར་མཚུངས་པར་སྣང་ཡང་མེ་ལོང་གི་དཀྱིལ་འཁོར་ནི་མི་སེམས་མི་རྟོག་གོ །ཞི་བའི་བློ་གྲོས་\nདེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པ་ཡང་མི་དགོང་མི་རྟོག་པར་ལྷུན་གྱི་གྲུབ་པས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་ཀྱི་བསམ་པའི་རྣམ་པར་རིག་པ་ཚིམ་པར་མཛད་དེ། །ཞི་བའི་བློ་གྲོས་འདི་ནི་དེ་བཞིན་\nགཤེགས་པའི་སྐུའི་གསང་བའོ།།ཞི་བའི་བློ་གྲོས་གཞན་ཡང་དེ་བཞིན་གཤེགས་པའི་སྐུའི་ནི་ཕུང་པོས་རབ་ཏུ་ཕྱེ་བ་མ་ཡིན། ཁམས་ཀྱིས་རབ་ཏུ་ཕྱེ་བ་མ་ཡིན། སྐྱེ་མཆེད་ཀྱིས་རབ་ཏུ་ཕྱེ་བ་མ་ཡིན། ལས་\nལས་བྱུང་བ་མ་ཡིན་། ཉོན་མོངས་པ་ལས་བྱུང་བ་མ་ཡིན། ཕ་མ་ལས་བྱུང་བ་མ་ཡིན། འབྱུང་བ་ཆེན་པོའི་ནུར་ནུར་པོ་ལས་བྱུང་བ་མ་ཡིན། ཤ་དང་ཁྲག་གིས་གཡོགས་པ་མ་ཡིན། རུས་པ་དང་ཆུ་བའི་\nཔོག་རེས་<span class='add'>  སྦྲེལ་  </span>པ་མ་ཡིན། དབུགས་ཕྱིན་དུ་རྒྱུ་བ་དང་། སྲོག་དང་འབྲེལ་པ་མ་ཡིན་ཏེ། ཞི་བའི་བློ་གྲོས་དེ་བཞིན་གཤེགས་པའི་སྐུ་ནི་སྐུ་མེད་པ་སྟེ། ཆོས་ཀྱི་སྐུ་དང་།༤ གཟུགས་དང་མཚན་མ་མེད་པའི་"
 ],
 [
  "78.146b",
  "ནི་དེ་བཞིན་གཤེགས་པ་ལ་སྐུར་བ་འདེབས་པའོ། །དཔེ་གཅིག་ནི་མ་གཏོགས་ཏེ། འདི་ལྟར་དཔེ་ནམ་མཁའོ། །ནམ་མཁའ་ཇི་ཙམ་པར་དེ་བཞིན་གཤེགས་པའི་ཚུལ་ཁྲིམས་ཀྱང་དེ་ཙམ་མོ། །ཏིང་ངེ་\nའཛིན་ཀྱང་དེ་ཙམ་མོ། །ཤེས་རབ་ཀྱང་དེ་ཙམ་མོ། །རྣམ་པར་གྲོལ་བ་ཡང་དེ་ཙམ་མོ། །རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་མཐོང་བ་ཡང་དེ་ཙམ་མོ། །སྐུ་ཡང་དེ་ཙམ་མོ། །གསུང་ཡང་དེ་ཙམ་མོ། །ཐུགས་ཀྱང་\nདེ་ཙམ་མོ། །གཟུགས་ཀྱང་དེ་ཙམ་མོ། །མཚན་ཀྱང་དེ་ཙམ་མོ། །དེ་བས་ན་ནམ་མཁའ་ཚད་མེད་པས་དེ་བཞིན་གཤེགས་པའི་སྐུ་ཚད་མེད་པར་ཁོང་དུ་ཆུད་པར་བྱའོ་ཞེས་བསྟན་ཏོ། །ཞི་བའི་བློ་གྲོས་\nདེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཤུགས་<span class='add'>  འཆང་  </span>གིས་བཅོམ་ལྡན་འདས་དེ་ལས་བསྟན་པ་འདི་ཐོས་ནས་ངོ་མཚར་དུ་གྱུར་ཏེ། ཚིམ་ཞིང་མགུ་ལ་ཡི་རང་ནས་རབ་ཏུ་དགའ་སྟེ་། དགའ་བ་དང་ཡིད་བདེ་བ་\nསྐྱེས་ནས་བཅོམ་ལྡན་འདས་དེའི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། ལན་བདུན་བསྐོར་བ་བྱས་ནས་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ཉིད་ནས་མི་སྣང་བར་གྱུར་བ་དང་། སངས་རྒྱས་ཀྱི་མཐུ་དང་། རང་གི་རྫུ་འཕྲུལ་\nགྱི་སྟོབས་ཀྱིས་སེམས་ཀྱི་རྣམ་པར་རྟོག་པ་ཙམ་གྱིས་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་འདིར་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པའི་སྤྱན་སྔར་ཕྱིན་ཏེ། དེས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་\nའཚལ་ནས་བཅོམ་ལྡན་འདས་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་ཏེ་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འདུག་ནས་ཐལ་མོ་སྦྱར་ཏེ་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་གསོལ་ཏོ། །ནམ་མཁའ་མཚུངས་\nཤིང་འདུ་བ་ཡི། སངས་རྒྱས་ཆོས་ལ་མི་གང་ཞིག །ཕ་རོལ་ཏུ་ནི་འཆི་འཚལ་བ། དེ་ནི་ཉམ་ཐག་འགྱུར་བ་ལགས། སངས་རྒྱས་སྐུ་ནི་བལྟ་སླད་དུ། གང་གཱ་བྱེ་བ་ཕྲག་བརྒྱ་ཡི། བྱེ་མ་ཇི་"
 ],
 [
  "78.146a",
  "མ་ནུས་ཤིང་། དེ་བཞིན་གཤེགས་པའི་སྐུའི་ཚད་དམ་མཐའ་ཡང་མི་དམིགས་སོ། །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཤུགས་<span class='add'>  འཆང་  </span>བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་པདྨ་མའི་\nདཔལ་གྱི་རྒྱལ་པོའི་སྙིང་པོ་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས་བཅོམ་ལྡན་འདས་པདྨའི་དཔལ་གྱི་རྒྱལ་པོའི་སྙིང་པོ་དེའི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། ལན་བདུན་བསྐོར་བ་བྱས་ནས་བཅོམ་ལྡན་འདས་\nདེའི་སྤྱན་སྔར་འདུག་སྟེ། དེས་བཅོམ་ལྡན་འདས་དེ་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བདག་ཅག་ཇི་སྲིད་ཅིག་ནས་མཆིས། བཅོམ་ལྡན་འདས་དེས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་གང་གཱའི་\nཀླུང་གི་བྱེ་བ་ཕྲག་བརྒྱའི་བྱེ་མ་སྙེད་ཀྱིས་སངས་རྒྱས་ཀྱི་ཞིང་འདས་པ་ནས་ཁྱོད་འཇིག་རྟེན་གྱི་ཁམས་འདིར་འོངས་སོ། །བྱང་ཆུབ་སེམས་དཔའ་ཤུགས་<span class='add'>  འཆང་  </span>གིས་གསོལ་པ། བཅོམ་ལྡན་འདས་བདག་ཅག་\nརིང་མོ་ཞིག་ནས་མཆིས་ཀྱང་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་དེའི་དབུའི་གཙུག་མཐོང་བར་ཡང་རྔོམ་ཐོག་ལ། སྐུའི་ཚད་དམ་མཐའ་རྟོགས་པར་ཡང་རྔོམ་ཐོག་ལགས་སོ། །\nབཅོམ་ལྡན་འདས་དེས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་ཁྱོད་གལ་ཏེ་ཤུགས་འདི་ཉིད་དང་། རྫུ་འཕྲུལ་གྱི་སྟོབས་བསྐྱེད་པ་འདི་ཉིད་ཀྱིས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱི་བསྐལ་པར་སྟེང་གི་ཕྱོགས་\nལོགས་སུ་སོང་དུ་ཟིན་ཀྱང་བཅོམ་ལྡན་འདས་དེའི་སྐུའི་མཐའ་རྟོགས་པར་མི་ནུས་སོ། །རིགས་ཀྱི་བྱ་གང་ཡང་དཔེ་གཞན་པ་ཇི་སྙེད་པ་དེ་བཞིན་གཤེགས་པའི་ཚུལ་ཁྲིམས་ཀྱི་དཔེ་བྱ་བ་འམ། ཏིང་\nངེ་འཛིན་དང་། ཤེས་རབ་དང་། རྣམ་པར་གྲོལ་བ་དང་། རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་མཐོང་བ་དང་། སྐུ་དང་གསུང་དང་ཐུགས་དང་། གཟུགས་དང་མཚན་གི་དཔེར་བྱ་བའི་དཔེ་དགོད་པ་དེ་དག་ཐམས་ཅད་"
 ],
 [
  "78.147b",
  "མཆིས་ན། ནམ་མཁའི་ཁམས་ནི་ཀུན་གང་སྟེ། དེ་ནི་དེ་བས་ལྷག་པར་འགྱུར། སེམས་ཅན་ཀུན་གྱི་བསོད་ནམས་ཀྱི། ཕུང་པོ་ཇི་སྙེད་ཡོངས་བཟུང་བ། དེ་སྙེད་བྱང་ཆུབ་སེམས་དཔའ་ཡི། བྱང་\nཆུབ་སེམས་ལས་རབ་ཏུ་བྱུང་། བྱང་ཆུབ་སེམས་ཀྱི་བསོད་ནམས་ཀྱི། ཕུང་པོ་ཇི་སྙེད་བརྗོད་པ་བས། དམ་པའི་ཆོས་ནི་ཡོངས་འཛིན་ན། དེ་བས་བསོད་ནམས་ཆེས་མང་ངོ་། །དམ་ཆོས་འཛིན་\nཔའི་བསོད་ནམས་ནི། སངས་རྒྱས་ཀུན་གྱིས་ནན་ཏན་དུ། བསྐལ་པ་བྱེ་བར་བརྗོད་མཛད་ཀྱང་། མཐའ་མར་ཕྱིན་པར་འགྱུར་མ་ལགས། དམ་པའི་ཆོས་ནི་འཛིན་པ་དང་། བྱང་ཆུབ་སེམས་\nཀྱི་བསོད་ནམས་དེ། སྟོང་པ་ཉིད་ལ་མོས་པ་ཡིས། བཅུ་དྲུག་ཆ་ཡང་མི་རི་ལགས། སྟོང་པ་ཉིད་ལ་འདིར་མོས་ནས། བྱང་ཆུབ་སེམས་ཀྱང་མི་གཏོང་དང་། དམ་པའི་ཆོས་ནི་འཛིན་\nབགྱིད་པ། དེ་ནི་བསོད་ནམས་སྡུད་པ་ལགས། བྱང་ཆུབ་སེམས་དཔའ་གྲགས་ཆེན་པོ། ཆོས་ཀྱི་རྟོགས་པ་འདི་ཐོས་ནས། དེ་ཡིས་བྱང་ཆུབ་སྤྱད་སྤྱོད་ཅིང་། སངས་རྒྱས་ཡོན་ཏན་\nཐོབ་པར་འགྱུར། ཚིགས་སུ་བཅད་པ་བརྗོད་པ་ན། ཞིང་རྣམས་བྱེ་བ་རབ་ཏུ་གཡོས། ལྷ་ནི་བྱེ་བ་ཕྲག་སྟོང་གིས། རོལ་མོ་སིལ་སྙན་བྱེ་བ་བླངས། སངས་རྒྱས་ཀྱི་ནི་ཆེ་བ་ཉིད། ཤུགས་\n<span class='add'>  འཆང་  </span>གིས་ནི་བཤད་ཐོས་ནས། སྲོག་ཆགས་བྱེ་བ་ཕྲག་སྟོང་དག །བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །སངས་རྒྱས་ཐམས་ཅད་གཟིགས་པ་པོ། །རང་འབྱུང་རྣམས་ཀྱི་གསང་<span class='add'>  བའི་  </span><span class='add'>  གནས། །  </span><span class='add'>    </span>གནས་\nའདི་བསམ་གྱིས་མི་ཁྱབ་སྟེ། དཔག་ཡས་བླ་ན་མ་མཆིས་ལགས། ཞི་བའི་བློ་གྲོས་འདི་ཡང་དེ་བཞིན་གཤེགས་པའི་སྐུའི་གསང་བའོ། །བམ་པོ་བཞི་པ"
 ],
 [
  "78.148a",
  "ཞི་བའི་བློ་གྲོས་དེ་ན་སེམས་ཅན་དུ་མ་འཁོར་གཅིག་ཏུ་འདུས་པ་དག་ལས་ཁ་ཅིག་གིས་ནི་དེ་བཞིན་གཤེགས་པའི་སྐུ་མཐོང་ངོ་། །ཁ་ཅིག་གིས་ནི་མ་མཐོང་ངོ་། །དེ་ལ་གང་དག་གིས་\nམཐོང་བ་དེ་དག་ནི་དགའ་བ་སྐྱེས་ནས་ལྷའོ། །གང་དག་གིས་མ་མཐོང་བ་དེ་དག་ནི་ཅང་མི་སྨྲ་བར་གྱུར་ཅིང་སྡོད་དོ། །ཞི་བའི་བློ་གྲོས་དེ་བཞིན་གཤེགས་པ་ནི་ཞལ་ཟས་མི་གསོལ་མོད་ཀྱི་སེམས་ཅན་རྣམས་\nཀྱིས་དེ་བཞིན་གཤེགས་པའི་ཞལ་ཟས་གསོལ་བར་མཐོང་<span class='add'>  ངོ་། །  </span>ཞི་བའི་བློ་གྲོས་དེ་ལ་བྱང་ཆུབ་ཀྱི་རིམ་གྲོ་པའི་ལྷ་གཟི་བརྗིད་ཀྱི་སྟོབས་ཞེས་བྱ་བ་དག་རྟག་ཏུ་དེ་བཞིན་གཤེགས་པའི་ཞབས་\nའབྲིང་དུ་འབྲང་ཞིང་དེ་དག་དེ་བཞིན་གཤེགས་པའི་ཞལ་ཟས་སྣོད་དུ་ཟེད་ན་སེམས་ཅན་རྣམས་ཀྱིས་དེ་བཞིན་གཤེགས་པས་ཁམ་ཚད་དུ་བླངས་ཏེ་གསོལ་བར་མཐོང་ང་<span class='add'>    </span>དེ་བཞིན་གཤེགས་པས་ཁམས་\nཚད་དུ་བླངས་པ་དེ་ཡང་སྣོད་དེ་ཉིད་ན་འདུག་པ་དེ་ལྷ་དེ་དག་གིས་ཁྱེར་ནས་དེ་བཞིན་གཤེགས་པས་འདུལ་བའི་སེམས་ཅན་སྔོན་དགེ་བའི་རྩ་བ་བསྐྱེད་པ། ལས་ཀྱི་སྒྲིབ་པའི་དབང་གིས་སྐྱེ་གནས་\nདེ་དང་དེ་དག་ཏུ་འཕངས་པ། བཟའ་བ་དང་། བཏུང་བ་དང་། ཟས་མི་རྙེད་པ། བཀྲེས་པས་ཉམ་ཆུང་བར་གྱུར་པ་ཇི་སྙེད་པ་དེ་དག་ལ་དེ་བཞིན་གཤེགས་པའི་བཤོས་ཀྱི་ཕམ་བབས་དེ་བྱིན་ནས་\nསེམས་ཅན་དེ་དག་གིས་ཀྱང་ཟས་དེ་ཟོས་པ་དང། བཀྲེས་སྐོམ་དང་བྲལ་ཏེ། བདེ་ཞིང་དུ་ལུས་ཚིམ་ནས་བསམ་པ་ཐག་པ་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ། །གང་\nདག་ལོག་པར་ལྷུང་པ་ཡི་དགས་སམ་ཤིན་རྗེའི་འཇིག་རྟེན་ན་གནས་པ་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པར་མི་ནུས་པ་དེ་དག་ལ་ཡང་དེ་ཉིད་མྱ་ངན་ལས་འདས་པའི་བར་གྱི་རྒྱུར་འགྱུར་རོ། །ཞི་བའི་བློ་གྲོས་"
 ],
 [
  "78.149a",
  "སྣ་ཅན་གང་དག་གིས་མཐོང་ན་དེ་དག་གཏོད་བ་ལ་མོས་པར་འགྱུར་རོ། །ཚུལ་ཁྲིམས་འཚལ་པ་གང་དག་གིས་མཐོང་ན་དེ་དག་ཚུལ་ཁྲིམས་ལ་མོས་པར་འགྱུར་རོ། །གནོད་སེམས་ཅན་\nགང་དག་གིས་མཐོང་ན་དེ་དག་བཟོད་པ་འཐོབ་བོ། །ལེ་ལོ་ཅན་གང་དག་གིས་མཐོང་ན་དེ་དག་བརྩོན་འགྲུས་ལ་མོས་པར་འགྱུར་རོ། །སེམས་གཡེང་བ་གང་དག་གིས་མཐོང་ན་དེ་དག་ཏིང་ངེ་འཛིན་འཐོབ་བོ། །\nཤེས་རབ་འཆལ་པ་གང་དག་གིས་མཐོང་ན་དེ་དག་ཤེས་རབ་ལ་མོས་པར་འགྱུར་རོ། །རིགས་ཀྱི་བུ་མདོར་ན་སེམས་ཅན་དཀར་པོའི་ཆོས་གང་དང་གང་དག་དང་བྲལ་བ་དག་གིས་དེ་བཞིན་གཤེགས་པའི་སྐུ་\nམཐོང་ན་དེ་དང་དེ་དག་དེ་བཞིན་གཤེགས་པའི་སྐུ་མཐོང་མ་ཐག་ཏུ་མི་དགེ་བའི་རྣམ་པར་རྟོག་པ་ཐམས་ཅད་རྒྱུན་ཆད་ནས་དགེ་བའི་སེམས་ལ་རབ་ཏུ་གནས་པར་འགྱུར་ཏེ་དེ་ལ་ཡང་དེ་བཞིན་གཤེགས་\nཔ་རྣམ་པར་རྟོག་པ་མི་མངའ་ཞིང་བཏང་སྙོམས་པ་སྟེ། ཞི་བའི་བློ་གྲོས་འདི་ཡང་དེ་བཞིན་གཤེགས་པའི་སྐུའི་གསང་བ་འོ། །ཞི་བའི་བློ་གྲོས་དེ་བཞིན་གཤེགས་པས་སྤྲུལ་པ་གང་སྤྲུལ་པ་དེ་\nཡང་ལྷུན་གྱིས་འགྲུབ་ཅིང་བསྒྲིམ་པ་མི་མངའ་བ་དང་། མངོན་པར་འདུ་མཛད་པ་མི་མངའ་བས་མཛད་དེ་དེ་བཞིན་གཤེགས་པ་འདི་སྙམ་དུ་ངས་སྤྲུལ་<span class='add'>  པ་  </span>དག་སྤྲུལ་ཏོ། །སྤྲུལ་ལོ། །སྤྲུལ་པར་བྱའོ་སྙམ་\nདུ་མི་དགོངས་མོད་ཀྱི་འོན་ཀྱང་སྤྲུལ་པས་འདུལ་བའི་སེམས་ཅན་ཇི་སྙེད་པར་འཇིག་རྟེན་གྱི་ཁམས་འདིའམ། འཇིག་རྟེན་གྱི་ཁམས་གྲངས་མེད་པ་བརྒྱ་སྟོང་དེ་དང་དེ་དག་ཏུ་སེམས་ཅན་ཡོངས་སུ་\nསྨིན་པར་མཛད་པའི་དོན་དུ་དེ་བཞིན་གཤེགས་པའི་སྤྲུལ་པ་དེ་སྙེད་དུ་བཞུད་དེ། ཞི་བའི་བློ་གྲོས་འདི་ཡང་དེ་བཞིན་གཤེགས་པའི་སྐུའི་གསང་བའོ། །ཞི་བའི་བློ་གྲོས་དེ་བཞིན་གཤེགས་པས་"
 ],
 [
  "78.150a",
  "གསང་བ་བའི་བདག་པོ་ལག་ན་རྡོ་རྗེས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཞི་བའི་བློ་གྲོས་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཞི་བའི་བློ་གྲོས་དེ་ལ་དེ་བཞིན་གཤེགས་\nཔའི་གསུང་གི་གསང་བ་དང་། གསུང་གི་ཕྲིན་ལས་ཡོངས་སུ་དག་པ་གང་ཞེ་ན། ཞི་བའི་བློ་གྲོས་གང་གི་ནུབ་མོ་དེ་བཞིན་གཤེགས་པས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་\nསངས་རྒྱས་པ་དང་། གང་གི་ནུབ་མོ་ལེན་པ་མི་མངའ་བར་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་འགྱུར་བ་དེའི་བར་དུ་དེ་བཞིན་གཤེགས་པས་ཐ་ན་ཡི་གེའི་འབྲུ་གཅིག་ཀྱང་མ་གསུངས་སོ། །གསུང་བར་མི་\nའགྱུར་རོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཞི་བའི་བློ་གྲོས་དེ་བཞིན་གཤེགས་པ་ནི་རྟག་ཏུ་མཉམ་པར་བཞག་པ་སྟེ། དེ་བཞིན་གཤེགས་པ་ལ་དབུགས་འབྱུང་བ་འམ་རྔུབ་བ་མི་མངའོ། །རྣམ་པར་མི་རྟོག་གོ །\nརྣམ་པར་མི་དཔྱོད་དོ། །རྣམ་པར་རྟོག་པ་དང་རྣམ་པར་<span class='add'>    </span>དཔྱོད་པ་མེད་པ་ན་ངག་མི་འབྱུང་སྟེ། དེ་བཞིན་གཤེགས་པ་དེ་ཡང་རྣམ་པར་མི་རྟོག །རྣམ་པར་མི་དཔྱོད། རྟོག་པར་མི་མཛད། རྣམ་པར་རྟོག་\nཔར་མི་མཛད། མི་གསུང་། མི་རྗོད། གསུང་བར་མི་མཛད་ཀྱང་སེམས་ཅན་རྣམས་འདི་སྙམ་དུ་སེམས་ཏེ། དེ་བཞིན་གཤེགས་པ་ནི་གསུང་ངོ་སྙམ་མོ། །དེ་བཞིན་གཤེགས་པ་ནི་ཤིན་དུ་མཉམ་པར་\nབཞག་པ་སྟེ། ཡི་གེའི་རྣམ་པར་རྟོག་པ་ཐམས་ཅད་ཀྱི་ཐམས་ཅད་དུ་རྣམ་པར་རིག་པར་མི་མཛད་ཀྱང་སེམས་ཅན་ཡི་གེ་ལྷུར་ལེན་པ་རྣམས་འདི་སྙམ་དུ་སེམས་ཏེ། དེ་བཞིན་གཤེགས་པ་ནི་བདག་\nཅག་ལ་ཆོས་སྟོན་ཏོ། བདག་ཅག་ནི་དེ་བཞིན་གཤེགས་པའི་ཆོས་བསྟན་པ་ཀུན་ཤེས་སོ་སྙམ་མོ། །དེ་ལ་ཡང་དེ་བཞིན་གཤེགས་པ་ནི་རྣམ་པར་མི་རྟོག་ཅིང་བཏང་སྙོམས་སུ་མཛད་དོ། །ཞི་བའི་"
 ],
 [
  "78.152b",
  "རྣམས་དང་། དཔེ་བྱེད་བཟང་པོ་རྣམས་དང་སྤུའི་ཁུང་བུ་ཐམས་ཅད་ནས་དེ་བཞིན་གཤེགས་པའི་གསུང་འབྱུང་བར་ཤེས་པའི་སེམས་ཅན་ཁ་ཅིག་ཡོད་དེ། ཞི་བའི་བློ་གྲོས་འདི་ཡང་དེ་བཞིན་གཤེགས་པའི་\nགསུང་གི་གསང་བའོ། །ཞི་བའི་བློ་གྲོས་མོས་པ་ཇི་ལྟ་བ་དང་། ཡོངས་སུ་སྨིན་པ་ཇི་ལྟ་བ་དང་། བསམ་པ་ཇི་ལྟ་བ་དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པའི་གསུང་འབྱུང་བར་ཤེས་ཀྱང་ཞི་བའི་བློ་གྲོས་དེ་ལ་དེ་\nབཞིན་གཤེགས་པ་ནི་རྣམ་པར་རྟོག་པ་མི་མངའ་སྟེ་བཏང་སྙོམས་པའོ། །ཞི་བའི་བློ་གྲོས་འདི་ལྟ་སྟེ་དཔེར་ན་རོལ་མོ་སིལ་སྙན་གྱི་འཁྲུལ་འཁོར་དེ་ཙམ་དུ་ལེགས་པར་སྦྱར་བ་བྱས་པ་གང་དག་ལ་ལག་\nགིས་མ་རེག་པར་རླུང་གིས་སྐྱོད་<span class='add'>  པས་  </span>སྒྲ་སྙན་པ་འབྱུང་བ་དག་ཀྱང་ཡོད་དོ། །འོན་ཀྱང་དེ་ལ་སྒྲ་འབྱིན་པར་སྤྲོ་བ་ནི་གང་ཡང་མེད་མོད་ཀྱི་ཡོངས་སུ་སྦྱང་བ་བྱས་པའི་ཁྱད་པར་གྱིས་སྒྲ་སྙན་པ་ཡང་འབྱུང་\nངོ་། །ཞི་བའི་བློ་གྲོས་དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པའི་གསུང་ཡང་སེམས་ཅན་གྱི་བསམ་པའི་ཤེས་པས་བསྐྱོད་ན་འབྱུང་སྟེ། འོན་ཀྱང་དེ་ལ་དེ་བཞིན་གཤེགས་པའི་གསུང་འབྱིན་པར་སྤྲོ་བ་ཡང་མི་\nམངའ་མོད་ཀྱི་སྔོན་ཡོངས་སུ་སྦྱང་བ་མཛད་པའི་ཁྱད་པར་གྱིས་དེ་བཞིན་གཤེགས་པའི་གསུང་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཡུལ་གྱི་རྗེས་སུ་འཇུག་པར་ཡང་འགྱུར་རོ་། །ཞི་བའི་བློ་གྲོས་འདི་ལྟ་སྟེ་དཔེར་ན་བྲག་\nཆའི་སྒྲ་ནི་གཞན་རྣམ་པར་རིག་པར་བྱེད་པར་ཡང་འབྱུང་ལ་དེ་ནི་ནང་ན་ཡང་མ་ཡིན། ཕྱི་རོལ་ན་ཡང་མ་ཡིན། གཉིས་ག་མེད་པ་ལས་ཀྱང་མི་དམིགས་སོ་ཞི་བའི་བློ་གྲོས་དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པའི་\nགསུང་ཡང་སེམས་ཅན་གྱི་བསམ་པ་རྣམ་པར་རིག་པར་བྱེད་པར་ཡང་འབྱུང་ལ་དེ་ནི་ནང་ན་ཡང་མ་ཡིན། ཕྱི་རོལ་ན་ཡང་མ་ཡིན་ལ་གཉིས་ག་མེད་པར་ཡང་མི་དམིགས་སོ། ཞི་བའི་བློ་གྲོས་འདི་ལྟ་སྟེ།"
 ],
 [
  "78.151b",
  "<span class='add'>    </span>མའི་འཁོར་རམ། དགེ་བསྙེན་གྱི་འཁོར་རམ། དགེ་བསྙེན་མའི་འཁོར་རམ། ལྷ་དང་ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མི་འམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོའི་འཁོར་ཀྱང་རུང་སྟེ། \nདེར་དེ་དག་གི་དབང་པོའི་རིམ་པ་དང་། དེ་དག་ཅི་འདྲ་བའི་ཆོས་ཀྱི་སྦྱིན་པ་ཐོས་པས་དགོས་པར་འགྱུར་བ་དེ་འདྲ་བའི་ཆོས་ཀྱི་སྦྱིན་པའི་ཐོས་པ་དེ་དེ་བཞིན་གཤེགས་པའི་ཞལ་གྱི་སྒོ་ནས་འབྱུང་བར་ཤེས་ཀྱང་ཆོས་\nབསྟན་པ་དེ་ནི་ཕན་ཚུན་གྱི་ངེས་པའི་ཚིག་ཐ་དད་པ་ལ་གནོད་པ་མེད་པར་ཐམས་ཅད་ཀྱང་རང་རང་གི་ཆོས་རྣམས་པར་རིག་པ་ཀུན་དུ་ཤེས་ཏེ། ཞི་བའི་བློ་གྲོས་འདི་ནི་དེ་བཞིན་གཤེགས་པའི་གསུང་གི་གསང་\nབའོ། །ཞི་བའི་བློ་གྲོས་གཞན་ཡང་དེ་བཞིན་གཤེགས་པས་སེམས་ཅན་ཚད་མེད་པ་དག་གི་སྤྱོད་<span class='add'>  པ་  </span>ཚད་མེད་པ་གསུང་ན། སེམས་ཅན་གྱི་སྤྱོད་<span class='add'>  པ་  </span><span class='add'>  བརྒྱད་  </span>ཁྲི་བཞི་སྟོང་ཞེས་འབྱུང་བ་ནི་སེམས་ཅན་དབང་པོ་མཐུ་\nཆུང་བ་རྣམས་གཟུང་པའི་ཕྱིར་བསྟན་པ་འདི་དེ་བཞིན་གཤེགས་པས་བསྟན་ཀྱི་། ཞི་བའི་བློ་གྲོས་སེམས་ཅན་གྱི་<span class='add'>  སྤྱོད་  </span>པ་ནི་ཚད་མེད་དེ་སེམས་ཅན་འདོད་ཆགས་ལ་སྤྱོད་པ་རྣམས་ཀྱི་<span class='add'>  སྤྱོད་  </span>པ་གང་ཡིན་པ་\nདེ་བསྐལ་པ་ཙམ་དུ་བཤད་ཀྱང་དེ་བས་ལྷག་པར་འགྱུར་རོ། །ཞེ་སྡང་ལ་སྤྱོད་པ་རྣམས་ཀྱི་གང་ཡིན་པ་དང་། གཏི་མུག་ལ་སྤྱོད་པ་རྣམས་ཀྱི་གང་ཡིན་པ་དང་། སེམས་ཅན་ཆ་མཉམ་པ་ལ་སྤྱོད་པ་རྣམས་\nཀྱི་སྤྱོད་པ་གང་ཡིན་པ་དེ་དག་བསྐལ་པ་ཙམ་དུ་བསྟན་ཀྱང་དེ་དག་རེ་རེ་ཡང་དེ་བས་ལྷག་པར་འགྱུར་རོ། །ཞི་བའི་བློ་གྲོས་གལ་ཏེ་དེ་བཞིན་གཤེགས་པའི་སྐུ་ཚེའི་ཚད་བསྐལ་པ་བརྒྱ་སྟོང་དུ་བཞུགས་པས་སེམས་\nཅན་རྣམས་ལ་ཆོས་བསྟན་པ་གཞན་གྱི་སྐབས་མི་དབྱེ་བར་སེམས་ཅན་གྱི་སྤྱོད་པ་ཉིད་བསྟན་ཀྱང་དེ་བཞིན་གཤེགས་པའི་སྐུ་ཚེ་མཐར་ཐུག་པར་འགྱུར་གྱི། སེམས་ཅན་གྱི་སྤྱོད་པ་ལ་མཐར་ཐུག་པ་གང་ཡང་"
 ],
 [
  "78.153a",
  "དཔེར་ན་། རྒྱ་མཚོ་ཆེན་པོའི་ནང་ན་ཡིད་བཞིན་གྱི་ནོར་བུ་རིན་པོ་ཆེ་བསམ་པ་ཐམས་ཅད་ཡོངས་སུ་སྐང་བ་ཞེས་བྱ་བ་ཡོད་དེ། དེ་རྒྱལ་མཚན་གྱི་རྩེ་མོ་ལ་བཏགས་ན་སེམས་ཅན་གང་གི་བསམ་\nཔ་ཅི་འདྲ་བར་གྱུར་པ་དེ་འདྲ་<span class='add'>  བའི་  </span><span class='add'>    </span>སྒྲ་དེ་ལས་འབྱུང་ཡང་ནོར་བུ་རིན་པོ་ཆེ་དེ་ནི་རྣམ་པར་མི་རྟོག་གོ །ཞི་བའི་བློ་གྲོས་དེ་བཞིན་གཤེགས་པའི་གསུང་རིན་པོ་ཆེ་ལྷག་པའི་བསམ་པས་ཡོངས་སུ་དག་\nཔ་ཡང་སྙིང་རྗེ་ཆེན་པོའི་རྒྱལ་མཚན་གྱི་རྩེ་མོ་ལ་བཏགས་ན་སེམས་ཅན་གང་གི་བསམ་པ་ཅི་འདྲ་བར་གྱུར་པ་དེ་འདྲ་བར་དེ་བཞིན་གཤེགས་པའི་གསུང་འབྱུང་བར་དེས་ཤེས་ཀྱང་དེ་ལ་དེ་བཞིན་གཤེགས་\nཔ་ནི་རྣམ་པར་རྟོག་པ་མི་མངའ་ཞིང་བཏང་སྙོམས་པ་སྟེ། ཞི་བའི་བློ་གྲོས་འདི་ཡང་དེ་བཞིན་གཤེགས་པའི་གསུང་གི་གསང་བའོ། །ཞི་བའི་བློ་གྲོས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་གསུང་དབྱངས་\nཚད་མེད་པ་སྟེ། ཞི་བའི་བློ་གྲོས་གང་ཞིག་དེ་བཞིན་གཤེགས་པའི་དབྱངས་ཀྱི་ཚད་དམ་མཐའ་གཟུང་བར་ནུས་པ་དེ་ནི་ཁོ་བོས་ལྷ་དང་བཅས་པ་དང་། བདུད་དང་བཅས་པ་དང་། ཚངས་པ་དང་བཅས་པ་\nདང་། དགེ་སྦྱོང་དང་བྲམ་ཟེར་བཅས་པའི་སྐྱེ་དགུ་དང་། ལྷ་དང་མི་དང་། ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་ན་མ་མཐོང་ངོ་། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཞི་བའི་བློ་གྲོས་ཁོ་བོས་མངོན་པར་ཤེས་ཏེ། བཅོམ་\nལྡན་འདས་རྒྱལ་པོའི་ཁབ་བྱ་རྒོད་ཀྱི་ཕུང་བའི་རི་འདི་ཉིད་ལ་བྱང་ཆུབ་སེམས་དཔའ་ཚོགས་ཀྱིས་བསྐོར་ཅིང་བཞུགས་ཏེ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པ་ལ་བརྟེན་ནས་དབྱངས་\nཀྱི་དཀྱིལ་འཁོར་ཡོངས་སུ་དག་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་རྣམ་གྲངས་རྒྱ་ཆེར་རབ་ཏུ་སྟོན་པ་དེ་མཇུག་ཏུ་ཕྱིན་པའི་དུས་གྱི་ཚེ་ཚེ་དང་ལྡན་པ་<span class='add'>  མཽད་  </span>གལ་གྱི་བུ་ཆེན་པོ་འདི་སྙམ་དུ་སེམས་ཏེ། དེ་བཞིན་"
 ],
 [
  "78.151a",
  "དང་། མ་ཚད་པ་མེད་པ་དང་། མ་ཞུམ་པ་དང་། མི་ཞ་ན་པ་དང་། རབ་ཏུ་དགའ་བ་དང་། ཁྱབ་པ་དང་། ཆུབ་པ་དང་། རྒྱུན་ཆགས་པ་དང་། འབྲེལ་བ་དང་། སྒྲ་ཐམས་ཅད་རྫོགས་པར་བྱེད་པ་དང་། དབང་པོ་\nཐམས་ཅད་ཚིམ་པར་བྱེད་པ་དང་། མ་སྨད་པ་དང་། མི་འགྱུར་བ་དང་། མ་བརྟབས་པ་དང་། འཁོར་ཀུན་དུ་གྲག་པ་དང་། འདོད་ཆགས་ཞི་བར་བྱེད་པ་དང་། ཞེ་སྡང་འདུལ་བ་དང་གཏི་མུག་སེལ་བ་དང་། བདུད་\nཚར་གཅོད་པ་དང་། རྣམ་པ་ཐམས་ཅད་ཀྱི་མཆོག་དང་ལྡན་པར་འབྱུང་བ་སྟེ། ཞི་བའི་བློ་གྲོས་དེ་བཞིན་གཤེགས་པའི་གསུང་ནི་ཡན་ལག་དྲུག་བཅུ་རྩ་བཞི་པོ་དེ་དག་དང་ལྡན་པར་འབྱུང་ང་ོ། །ཞི་བའི་བློ་གྲོས་\nགཞན་ཡང་དེ་བཞིན་གཤེགས་པའི་གསུང་ནི་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་རྒྱས་པར་འགེངས་ཤིང་སེམས་ཅན་ཐམས་ཅད་ཀྱི་བསམ་པ་ཡང་དག་པར་ཚིམ་པར་མཛད་ཀྱང་། ཞི་བའི་བློ་གྲོས་\nདེ་བཞིན་གཤེགས་པ་ནི་འདི་སྙམ་དུ་ང་མདོའི་སྡེའམ། དབྱངས་ཀྱིས་བསྙད་པའི་སྡེའམ། ལུང་བསྟན་པའི་སྡེའམ། ཚིགས་སུ་བཅད་པའི་སྡེའམ། ཆེད་དུ་བརྗོད་པའི་སྡེའམ། གླེང་གཞིའི་སྡེའམ། \nདེ་ལྟ་བུ་བྱུང་བའི་སྡེ་འམ། སྐྱེས་པའི་རབས་ཀྱིས་སྡེའམ། ཤིན་ཏུ་རྒྱས་པའི་སྡེའམ། རྨད་དུ་བྱུང་བའི་ཆོས་ཀྱི་སྡེའམ། གཏན་ལ་དབབ་པར་བསྟན་པའི་སྡེའམ། <span class='add'>  དཔེ་  </span>འམ། རྒྱུན་གྱི་ཚུལ་ལམ། \nརྟོགས་པ་བརྗོད་པའི་སྡེ་འམ། ཀུན་དུ་བསྙད་པ་འདི་སྟོན་ཏོ་ཞེ་འམ། རབ་ཏུ་གསལ་བར་མཛད་དོ་ཞེའམ། རབ་ཏུ་ཤེས་པར་མཛད་དོ་ཞེའམ། རབ་ཏུ་འཇོག་གོ་ཞེ་འམ། རྣམ་པར་བྱེད་དོ་ཞེ་འམ། རྣམ་\nཔར་འགྲེལ་ལོ་ཞེའམ། རྗོད་དོ་ཞེའམ། ཡང་དག་པར་བསྒྲགས་པར་མཛད་དོ་སྙམ་དུ་མི་དགོང་སོ། །དེ་ལྟ་མོད་ཀྱི་དེ་བཞིན་གཤེགས་པའི་འཁོར་འདུ་བ་ཅི་འདྲ་བར་དགེ་སློང་གི་འཁོར་རམ། དགེ་སློང་"
 ],
 [
  "78.153b",
  "གཤེགས་པའི་གསུང་གི་དཀྱིལ་འཁོར་ཇི་སྲིད་ཅིག་ཏུ་རིང་དུ་འགྲོ་བ་ཞིག་བདག་གིས་དེ་བཞིན་གཤེགས་པའི་གསུང་གི་དཀྱིལ་འཁོར་དཔག་པར་བྱའོ་སྙམ་མོ། །དེ་ནས་གནས་བརྟན་\n<span class='add'>  མཽད་  </span>གལ་གྱི་བུ་ཆེན་པོ་རང་གི་སྟེང་ནས་མི་སྣང་བར་གྱུར་ཏེ་རི་རབ་ཀྱི་རྩེ་མོར་ཕྱིན་ནས་དེ་དེ་ན་འདུག་ན་ཡང་དེ་བཞིན་གཤེགས་པའི་གསུང་དེ་འདྲ་བ་ཁོ་ནར་ཐོས་སོ། །རང་གི་རྫུ་འཕྲུལ་གྱི་སྟོབས་\nཀྱིས་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་འདིའི་ནུབ་ཕྱོགས་ཀྱི་རི་རབ་ལས་འདས་ཤིང་གླིང་བཞི་པ་ལས་ཀྱང་འདས་ཁོར་ཡུག་ལས་ཀྱང་འདས་ཏེ།འཇིག་རྟེན་གྱི་བར་གྱི་ཡོག་གི་ཟོམ་ལ་འདུག་ན་ཡང་\nབཅོམ་ལྡན་འདས་ཀྱི་གསུང་ལྷག་ཆད་མེད་ཅིང་མཉམ་བར་དེ་འདྲ་བ་ཁོ་ནར་ཐོས་སོ། །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་འདི་སྙམ་དུ་གྲོངས་ཏེ། ཀྱེ་མ་<span class='add'>  མཽད་  </span>གལ་གྱི་བུ་འདི་ངའི་སྒྲ་སྐད་དཔོག་པར་འདོད་ཀྱིས་\nངས་འདི་ལ་རྫུ་འཕྲུལ་བསྟང་ངོ་སྙམ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེ་ལ་རྫུ་འཕྲུལ་གྱིས་བསྟངས་པ་དང་། དེ་སངས་རྒྱས་ཀྱི་མཐུ་དང་། རང་གི་རྫུ་འཕྲུལ་གྱི་སྟོབས་ཀྱིས་སངས་རྒྱས་ཀྱི་\nཞིང་འདི་ནས་ནུབ་ཕྱོགས་ལོགས་སུ་སངས་རྒྱས་ཀྱི་ཞིང་གང་གཱའི་ཀླུང་དགུ་བཅུ་རྩ་དགུའི་བྱེ་མ་སྙེད་འདས་བ་ན་འཇིག་རྟེན་གྱི་ཁམས་འོད་ཟེར་གྱི་རྒྱལ་མཚན་ཞེས་བྱ་བ་དེ་ན་དེ་བཞིན་\nགཤེགས་པ་འོད་ཟེར་གྱི་རྒྱལ་པོ་ཞེས་བྱ་བ་ད་ལྟ་ན་བཞུགས་ཤིང་<span class='add'>  འཚོ་ལ་  </span>གཞེས་ཏེ་ཆོས་ཀྱང་སྟོན་པ་དེར་གནས་བརྟན་<span class='add'>  མཽད་  </span>གལ་གྱི་བུ་ཆེན་པོས་ཕྱིན་ཏེ། དེ་ན་འདུག་ཀྱང་བཅོམ་ལྡན་འདས་ཀྱི་སྒྲ་སྐད་\nདེ་འདྲ་བ་ཁོ་ནར་ཐོས་ཏེ། འདི་ལྟ་སྟེ་དཔེར་ན་འདོམ་གང་ཙམ་གྱི་ཕྱོགས་ན་འདུག་པའི་མིས་མི་གཅིག་ཤོས་ཀྱི་སྒྲ་ཐོས་པ་དེ་བཞིན་དུ་གནས་བརྟན་<span class='add'>  མཽད་  </span>གལ་གྱི་བུ་ཆེན་པོ་འཇིག་རྟེན་གྱིས་ཁམས་དེ་ན་"
 ],
 [
  "78.154a",
  "གནས་ཀྱང་བཅོམ་ལྡན་འདས་ཀྱི་གསུང་སྒྲ་ཐོས་སོ། །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་འོད་ཟེར་གྱི་རྒྱལ་པོ་དེའི་སྐུའི་ཁྲུན་ནི་དཔག་ཚད་ཙམ་མོ། །བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་\nགི་ལུས་ཀྱི་ཁྲུན་ནི་དཔག་ཚད་ཕྱེད་དོ། །དེ་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་གི་སྤྱད་<span class='add'>  པར་  </span>བྱ་བའི་ལྷུང་བཟེད་ཀྱི་རྟེན་མ་གདུ་བུ་དེ་ལ་གནས་བརྟན་<span class='add'>  མཽད་  </span>གལ་གྱི་བུ་ཆེན་པོ་འཆག་ཅིང་འདུག་གོ །དེ་ནས་\nབྱང་ཆུབ་སེམས་དཔའ་དེ་དག་རབ་ཏུ་དགའ་ནས་བཅོམ་ལྡན་འདས་དེ་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་དགེ་སྦྱོང་གི་ཁ་དོག་འདྲ་བའི་སྲོག་ཆགས་ལྷུང་བཟེད་ཀྱི་རྟེན་མ་ག་དུ་བུ་ལ་འཆག་\nཅིང་མཆིས་པ་འདི་ག་<span class='add'>  ལས་  </span>མཆིས་<span class='add'>  པ་  </span>ཞིག་བཅོམ་ལྡན་འདས་དེས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་ཁྱེད་འདི་ལ་བརྙས་པའི་སེམས་མ་སྐྱེད་ཅིག །དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ནི་གནས་བརྟན་<span class='add'>  མཽད་  </span>གལ་གྱི་བུ་\nཆེན་པོ་ཞེས་བྱ་སྟེ། བཅོམ་ལྡན་འདས་ཤཱ་ཀྱ་ཐུབ་པའི་ཉན་ཐོས་ཀྱི་མཆོག་<span class='add'>  གོ། །  </span>ཉན་ཐོས་ཆེན་པོ་རྣམས་ཀྱི་ནང་ན་རྫུ་འཕྲུལ་དང་ལྡན་པའི་མཆོག་གོ །དེ་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་\nཔ་འོད་ཟེར་གྱི་རྒྱལ་པོས་<span class='add'>  མཽད་  </span>གལ་གྱི་བུ་ཆེན་པོ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །<span class='add'>  མཽད་  </span>གལ་གྱི་བུ་ཁྱོད་ལ་བྱང་ཆུབ་སེམས་དཔའ་འདི་དག་ཁྱད་དུ་གསོད་ཀྱིས་ཁྱོད་ཀྱིས་འདི་ལྟ་སྟེ། བཅོམ་ལྡན་འདས་\nདེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱ་ཀྱ་ཐུབ་པ་དེ་ཉིད་ཀྱི་བྱིན་གྱི་བརླབས་ཀྱིས་རང་གི་རྫུ་འཕྲུལ་སྟོན་ཅིག །དེ་ནས་གནས་བརྟན་<span class='add'>  མཽད་  </span>གལ་\nགྱི་བུ་ཆེན་པོ་བཅོམ་ལྡན་འདས་དེའི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། ལན་བདུན་བསྐོར་བ་བྱས་ནས་བཅོམ་ལྡན་འདས་དེ་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་རིན་པོ་ཆེའི་གླིང་འདི་སྐྱིལ་"
 ],
 [
  "78.155b",
  "<span class='add'>  མཽད་  </span>གལ་གྱི་བུས་གསོལ་པ། བཅོམ་ལྡན་འདས་བདག་ནི་རིང་པོ་ཞིག་ནས་མཆིས་པ་ལུས་དུབ་སྟེ། འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་དེར་འཆི་བའི་<span class='add'>  རྔོ་  </span>མི་ཐོག་གོ །བཅོམ་ལྡན་འདས་དེས་བཀའ་སྩལ་\nཔ། <span class='add'>  མཽད་  </span>གལ་གྱི་བུ་དེ་ཇི་སྙམ་དུ་སེམས། ཁྱོད་རང་གི་རྫུ་འཕྲུལ་གྱི་སྟོབས་ཀྱིས་འཇིག་རྟེན་གྱི་ཁམས་འདིར་ཕྱིན་སྙམ་དུ་སེམས་ན་ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟའོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཁྱོད་ནི་བཅོམ་ལྡན་\nའདས་ཤཱཀྱ་ཐུབ་པ་ཉིད་ཀྱི་བྱིན་གྱི་བརླབས་ཀྱིས་འཇིག་རྟེན་གྱི་ཁམས་དེར་ཕྱིན་གྱིས་ཁྱོད་བཅོམ་ལྡན་འདས་དེ་ཉིད་ལ་ཕྱག་<span class='add'>  འཚོལ་  </span>ཅིག་དང་། <span class='add'>  དེ་  </span>ཉིད་ཀྱིས་ཁྱོད་སླར་ཁྲིད་པར་འགྱུར་རོ། །<span class='add'>  མཽད་  </span>གལ་གྱི་\nབུ་གལ་ཏེ་ཁྱོད་དང་གི་རྫུ་འཕྲུལ་གྱི་སྟོབས་ཀྱིས་འཇིག་རྟེན་གྱི་ཁམས་དེར་འགྲོ་ན་ནི་བསྐལ་པ་སྲིད་ཀྱིས་ཀྱང་ཕྱིན་པར་མི་ནུས་ཏེ། འཇིག་རྟེན་གྱི་ཁམས་དེར་མ་ཕྱིན་པར་བར་དུ་ཡོངས་སུ་མྱ་ངན་ལས་\nའདའ་བར་གྱུར་རོ། །<span class='add'>  མཽད་  </span>གལ་གྱི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། ཤར་རམ། ལྷོ་འམ། ནུབ་བམ། བྱང་ངམ་ཕྱོགས་གང་ཞིག་ཏུ་ཕྱིན། གསོལ་པ། བཅོམ་ལྡན་འདས་བདག་ཕྱོགས་བསླད་དེ་གང་ནས་འདིར་\nམཆིས་པ་མ་འཚལ་ཏོ། །བཅོམ་ལྡན་འདས་དེས་བཀའ་སྩལ་པ། <span class='add'>  མཽད་  </span>གལ་གྱི་བུ་ཁྱོད་ཀྱིས་རྣམ་གྲངས་འདིས་ཀྱང་འདི་ལྟར་རིག་པར་བྱ་སྟེ། གལ་ཏེ་ཁྱོད་རང་གི་རྫུ་འཕྲུལ་གྱི་སྟོབས་ཀྱིས་འཇིག་རྟེན་གྱི་\nཁམས་དེར་འགྲོ་ན་ནི་བསྐལ་པས་ཀྱང་ཕྱིན་པར་མི་ནུས་སོ། །གསོལ་པ། བཅོམ་ལྡན་འདས་ཕྱོགས་གང་ན་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པ་དེ་བཞུགས། བཀའ་སྩལ་པ། <span class='add'>  མཽད་  </span>གལ་གྱི་བུ་བཅོམ་ལྡན་\nའདས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་དེ་ནི་ཤར་ཕྱོགས་ལོགས་ན་བཞུགས་སོ། །དེ་བས་གནས་བརྟན་<span class='add'>  མཽད་  </span>གལ་གྱི་བུ་ཆེན་པོས་དེའི་ཚེ་ཡན་ལག་ལྔ་ས་ལ་གཏུགས་ཏེ་ཤར་ཕྱོགས་སུ་ཕྱག་"
 ],
 [
  "78.156a",
  "འཚལ་ནས་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་སྨྲས་སོ། མཐུ་ཆེན་མངའ་བ་ལྷ་དང་མིས་མཆོད་པ་ཡེ་ཤེས་མཐའ་ཡས་མཐའ་ཡས་གསུང་ལྡན་པ། རྐང་གཉིས་རྣམས་ཀྱི་དམ་པ་\nདགོངས་སུ་གསོལ། སླར་ཡང་ཞིང་དེ་རབ་ཏུ་མཆི་བར་བགྱི། ཞི་བའི་བློ་གྲོས་དེ་ལྟར་སངས་རྒྱས་ཀྱི་མཐུས། བཅོམ་ལྡན་འདས་ཀྱི་ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་བྱ་རྒོད་ཀྱི་ཕུང་པོའི་རི་ལ་\nགནས་པ་དེས་གནས་བརྟན་<span class='add'>  མཽད་  </span>གལ་གྱི་བུས་གསོལ་བ་བཏབ་པའི་སྒྲ་དེ་ཐོས་སོ། །ཐོས་ནས་ཀྱང་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་\nལྡན་འདས་འདི་ལྟར་གསོལ་བ་འདེབས་པ་འདི་སུ་ཞིག་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་འདི་ནི་<span class='add'>  མཽད་  </span>གལ་གྱི་བུ་སྟེ། སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནས་ནུབ་ཕྱོགས་ལོགས་སུ་\nསངས་རྒྱས་ཀྱི་ཞིང་གང་<span class='add'>  གའི་  </span>ཀླུང་དགུ་བཅུ་རྩ་དགུའི་བྱེ་མ་སྙེད་འདས་པར་སོང་སྟེ། འཇིག་རྟེན་གྱི་ཁམས་འོད་ཟེར་གྱི་རྒྱལ་མཚན་ཞེས་བྱ་བར་བཅོམ་ལྡན་འདས་འོད་ཟེར་གྱི་རྒྱལ་པོའི་སངས་རྒྱས་ཀྱི་\nཞིང་ན་གནས་ཏེ་དེ་འཇིག་རྟེན་གྱི་ཁམས་འདིར་འོང་བར་འདོད་ནས་གསོལ་བ་འདེབས་པའི་སྒྲ་དེ་ལྟ་བུ་ཕྱུང་ངོ་། །ཀུན་དགའ་བོས་གསོལ་པ། བཅོམ་ལྡན་འདས་<span class='add'>  མཽད་  </span>གལ་གྱི་བུ་ཆེན་པོ་ཅིའི་སྨད་དུ་འཇིག་རྟེན་\nགྱི་ཁམས་དེར༤་མཆིས། བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་<span class='add'>  མཽད་  </span>གལ་གྱི་བུ་འདི་སླར་འོངས་པ་དང་འདི་ཉིད་དུ་ཐོས་པར་འགྱུར་རོ། །དེ་ནས་ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དེས་ཐལ་མོ་སྦྱར་ཏེ་བཅོམ་ལྡན་འདས་\nལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་འཇིག་རྟེན་ཀྱི་ཁམས་འོད་ཟེར་གྱི་རྒྱལ་མཚན་དེ་དང་། དེ་བཞིན་གཤེགས་པའི་འོད་ཟེར་གྱི་རྒྱལ་པོ་དེ་དང་། བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་དང་། གནས་བརྟན་"
 ],
 [
  "78.156b",
  "<span class='add'>  མཽད་  </span>གལ་གྱི་བུ་ཆེན་པོ་བལྟ་བར་འཚལ་ལོ། །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱི་འཁོར་དེས་གསོལ་བ་བཏབ་པ་མཁྱེན་ནས་མཛོད་སྤུ་ནས་ཐམས་ཅད་ཀྱི་རྗེས་སུ་སོང་བ་ཞེས་བྱ་བའི་འོད་ཟེར་ཕྱུང་སྟེ་འོད་ཟེར་དེས་སངས་\nརྒྱས་ཀྱི་ཞིང་གང་གའི་ཀླུང་དགུ་བཅུ་རྩ་དགུའི་བྱེ་མ་སྙེད་པོ་དེ་དག་ལས་ཐལ་ཏེ་འཇིག་རྟེན་གྱི་ཁམས་འོད་ཟེར་གྱི་རྒྱལ་མཚན་དེ་སྣང་བ་ཆེན་པོས་ཁྱབ་པར་འགྱུར་ཏོ། །དེ་ན་ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དེས་\nའཇིག་རྟེན་གྱི་ཁམས་འོད་ཟེར་གྱི་རྒྱལ་མཚན་དེ་དང་། དེ་བཞིན་གཤེགས་པ་འོད་ཟེར་གྱི་རྒྱལ་པོ་དེ་དང་། བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་དང་། གནས་བརྟན་<span class='add'>  མཽད་  </span>གལ་གྱི་བུ་ཆེན་པོ་ཡན་ལག་ལྔ་ས་ལ་གཏུགས་\nཏེ། བཅོམ་ལྡན་འདས་ལ་གསོལ་བ་འདེབས་པ་མཐོང་ང་ོ། །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་<span class='add'>  མཽད་  </span>གལ་གྱི་བུ་ཆེན་པོ་ལ་བཀའ་སྩལ་པ། <span class='add'>  མཽད་  </span>གལ་གྱི་བུ་འོད་ཀྱི་དཀྱིལ་འཁོར་འདིའི་རྗེས་སུ་\nའབྲོངས་ཏེ་ཤོག་ཤིག །དེ་ནས་གནས་བརྟན་<span class='add'>  མཽད་  </span>གལ་གྱི་བུ་ཆེན་པོས་བཅོམ་ལྡན་འདས་ཀྱི་འོད་ཀྱི་དཀྱིལ་འཁོར་ལ་བརྟེན་ཏེ་། སེམས་ཀྱི་རྣམ་པར་རྟོག་པ་ཙམ་གྱིས་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་འདིར་\nབཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པའི་སྤྱན་སྔར་ཕྱིན་ནས་དེ་ས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། ལན་བདུན་བསྐོར་བ་བྱས་ནས་སྤྱན་སྔར་ཡན་ལག་ལྔ་ས་ལ་གཏུགས་ཏེ། ཕྱག་འཚལ་\nནས་ཉེས་པ་བཤགས་ལ། བཅོམ་ལྡན་འདས་བདག་དེ་བཞིན་གཤེགས་པའི་གསུང་དབྱངས་ཀྱི་དཀྱིལ་འཁོར་རྟོགས་པར་འཚལ་ནས་དེ་སྲིད་དུ་རིང་དུ་མཆིས་<span class='add'>  པར་  </span>བདག་ནོངས་པ་ཅན་ཏེ་ནོངས་པ་\nའཆགས་སོ། །བཅོམ་ལྡན་འདས་དེ་སྲིད་དུ་རིང་དུ་མཆིས་ཀྱང་དེ་བཞིན་གཤེགས་པའི་གསུང་ནི་འདི་ན་ཇི་ཙམ་པ་དེ་ཙམ་ལགས་སོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། <span class='add'>  མཽད་  </span>གལ་གྱི་བུ་ཆེན་པོ་"
 ],
 [
  "78.154b",
  "མོ་དཀྲུང་གཅིག་གིས་ཁྱབ་པར་བགྱིའོ། །བཀའ་སྩལ་པ། <span class='add'>  མཽད་  </span>གལ་གྱི་བུ་ཁྱོད་ཀྱིས་དེའི་དུས་ལ་བབ་པར་ཤེས་ན་གྱིས་ཤིག །དེ་ནས་གནས་བརྟན་<span class='add'>  མཽད་  </span>གལ་གྱི་བུ་ཆེན་པོ་སྟེང་གི་ནམ་མཁའ་ལ་ཤིང་ཏ་ལ་\nབདུན་ཙམ་གྱི་གོང་དུ་མངོན་པར་འཕགས་ཏེ། རིན་པོ་ཆེའི་གླིང་དེ་སྐྱིལ་མོ་དཀྲུང་གཅིག་གིས་ཁྱབ་པར་བྱས་སོ། །སྐྱིལ་མོ་དཀྲུང་དེ་ལས་ཀྱང་མུ་ཏིག་གི་རྒྱན་ཕྲེང་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་མངོན་པར་\nའཕྱང་<span class='add'>  ངོ་། །  </span>མུ་ཏིག་གི་རྒྱན་ཕྲེང་གི་འབྲུ་ཐམས་ཅད་ལས་ཀྱང་འོད་ཟེར་བརྒྱ་སྟོང་བྱུང་<span class='add'>  ངོ་། །  </span>འོད་ཟེར་དེ་དག་ཐམས་ཅད་ཀྱི་རྩེ་མོ་དག་ལས་ཀྱང་པདྨ་རྣམ་བྱུང་ང་ོ། །པདྨ་ཐམས་ཅད་ཀྱི་སྙིང་པོ་རྣམས་ལ་\nཡང་བཅོམ་ལྡན་འདས་ཤཱ་ཀྱ་ཐུབ་པ་ཅི་འདྲ་བ་དེ་འདྲ་བའི་དེ་བཞིན་གཤེགས་པའི་གཟུགས་བཞུགས་པར་<span class='add'>  སྣང་ངོ་། །  </span><span class='add'>    </span><span class='add'>    </span>དེ་བཞིན་གཤེགས་པའི་གཟུགས་དེ་དག་ཐམས་ཅད་ཀྱང་བཅོམ་ལྡན་འདས་\nཤཱ་ཀྱ་ཐུབ་པའི་དབྱངས་ཀྱི་དཀྱིལ་འཁོར་ཡོངས་སུ་དག་པའི་ཆོས་ཀྱི་རྣམ་གྲངས་ལས་བརྩམས་<span class='add'>  ཏེ་  </span>བསྔགས་པ་གསུང་ངོ་། །དེ་ནས་གནས་བརྟན་<span class='add'>  མཽད་  </span>གལ་གྱི་བུ་ཆེན་པོས་བཅོམ་ལྡན་འདས་དེ་ལ་\nའདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་གླིང་བཞི་པའི་འཇིག་རྟེན་གྱི་ཁམས་<span class='add'>  འདི་  </span>སྐྱིལ་མོ་དཀྲུང་གཅིག་གིས་ཁྱབ་པར་བགྱིའོ། །དེ་བཞིན་དུ་སྦྱར་ཏེ། དེ་ལྟར་སྟོང་དང་སྟོང་གཉིས་ཁྱབ་པར་བགྱིའོ། །\nབཅོམ་ལྡན་འདས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་སྐྱིལ་མོ་དཀྲུང་གཅིག་གིས་ཁྱབ་པར་བགྱིའོ། །བཅོམ་ལྡན་འདས་དེས་བཀའ་སྩལ་པ། <span class='add'>  མཽད་  </span>གལ་གྱི་བུ་ཁྱོད་ཀྱིས་དེའི་\nདུས་ལ་བབ་པར་ཤེས་ན་གྱིས་ཤིག །དེ་ནས་གནས་བརྟན་<span class='add'>  མཽད་  </span>གལ་གྱི་བུ་ཆེན་པོས་རྫུ་<span class='add'>  འཕྲུལ་གྱི་ཆོ་འཕྲུལ་  </span>དེ་བསྡུས་ཏེ་བཅོམ་ལྡན་འདས་གྱི་སྤྱན་སྔར་འདུག་གོ །དེ་ནས་བྱང་ཆུབ་སེམས་"
 ],
 [
  "78.157a",
  "ཇི་སྐད་སྨྲས་པ་དེ་དེ་བཞིན་ནོ། །དེ་བཞིན་གཤེགས་པའི་གསུང་ལ་ནི་ཚད་གང་ཡང་མེད་དེ། <span class='add'>  མཽད་  </span>གལ་གྱི་བུ་གང་དེ་བཞིན་གཤེགས་པའི་གསུང་གི་ཚད་དམ་མཐའ་ཡོངས་སུ་ཚོལ་བར་\nསེམས་པ་དེ་ནི་ནམ་མཁའི་ཚད་དམ། མཐའ་ཡོངས་སུ་ཚོལ་བར་སེམས་པ་ཡིན་ནོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ནམ་མཁའ་ཇི་ཙམ་དུ་དེ་བཞིན་གཤེགས་པའི་གསུང་གིས་ཁྱབ་བོ། །\nགནས་བརྟན་<span class='add'>  མཽད་  </span>གལ་གྱི་བུ་ཆེན་པོ་འགྲོ་བ་དང་། འོང་བའི་ལེའུ་འདི་བཤད་བ་ན་སྲོག་ཆགས་ཁྲིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ། །ཞི་བའི་བློ་གྲོས་འདི་ཡང་\nདེ་བཞིན་གཤེགས་པའི་གསུང་གི་གསང་བའོ། །ཞི་བའི་བློ་གྲོས་འདི་ཇི་སྙམ་དུ་སེམས་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་དང་སེམས་ལས་བྱུང་བའི་འཇུག་པ་གང་དག་ཡིན་པ་དེ་དག་ཅི་མང་བ་\nཡིན་ནམ། ཞི་བའི་བློ་གྲོས་ཀྱིས་སྨྲས་པ། གསང་བ་པའི་བདག་པོ་སེམས་ཅན་གཅིག་གི་སེམས་དང་སེམས་ལས་བྱུང་བའི་འཇུག་པ་གང་དག་ཡིན་པ་དེ་དག་ཀྱང་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོར་\nགཏོགས་པའི་སེམས་ཅན་ཐམས་ཅད་རང་སངས་རྒྱས་སུ་གྱུར་པ་རྣམས་ཀྱིས་བསྐལ་བར་ཡང་བསམ་པའམ། གཞལ་བ་འམ། རྩི་བའམ། བརྟག་པར་མི་ནུས་ན་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ལྟ་སྨོས་\nཀྱང་མི་དགོས་། ལག་ན་རྡོ་རྗེས་སྨྲས་པ། ཞི་བའི་བློ་གྲོས་ཁྱོད་མོས་པར་བྱའོ། །སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་དང་སེམས་ལས་བྱུང་བའི་འཇུག་པ་ཇི་སྙེད་པར་འདི་ལྟ་སྟེ། སེམས་ཅན་\nཐམས་ཅད་ཚིམ་པར་བྱ་བའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་ཆོས་སྟོན་པའི་གསུང་གི་ཡན་ལག་གི་རྣམ་པ་ཡང་དེ་སྙེད་དུ་འབྱུང་སྟེ། དེ་ལ་ཡང་དེ་བཞིན་གཤེགས་པ་ནི་རྣམ་པར་མི་རྟོག་ཅིང་"
 ],
 [
  "78.157b",
  "བཏང་སྙོམས་པའོ། དེ་ལ་འདི་སྐད་ཅེས་བྱ་སྟེ། སྟོང་གསུམ་སེམས་ཅན་གང་ཡིན་པ། དེ་དག་རང་རྒྱལ་འདྲེན་གྱུར་པས། བསྐལ་པར་སེམས་ཅན་གཅིག་གཅིག་གི །སེམས་ཀྱི་ཁམས་ཀྱང་མི་ཤེས་\nསོ། །སེམས་ཅན་གཅིག་ཡིད་ཇི་སྙེད་པ། སངས་རྒྱས་ཀྱིས་ནི་རབ་མཁྱེན་ཀྱང་། ང་ཡིས་ཡིད་འདི་ཤེས་སོ་ཞེས། དེ་ནི་རྟོག་པར་མི་འགྱུར་རོ། །དུས་གསུམ་སེམས་ཅན་ཐམས་ཅད་ཀྱི། སེམས་\n<span class='add'>  པ་  </span>དག་ནི་ཇི་སྙེད་པ། འཇིག་རྟེན་མགོན་པོ་ཆོས་སྟོན་ཚེ། དབྱངས་ཀྱི་ཡན་ལག་དེ་སྙེད་དོ། །ཆོས་ཀྱི་བདག་པོ་གསུང་པ་ན། དབྱངས་ཀྱི་ཡན་ལག་ཇི་སྙེད་པ། ཆོས་ཀྱི་མིང་གིས་བཤད་པ་ཡི། ཆོས་\nབསྟན་པ་ཡང་དེ་ཙམ་མོ། །སེམས་ཅན་ཀུན་གྱི་གཟུགས་དང་ནི། མིང་དང་སེམས་པ་ཇི་སྙེད་པ། སེམས་ཅན་སྙིང་པོའི་སྤུ་གཅིག་ནས། འོད་ཟེར་འབྱུང་བ་དེ་སྙེད་དོ། །འཇིག་རྟེན་དགོན་པོའི་སྤུ་ཀུན་གྱིས་\nའོད་ཟེར་དག་ནི་ཇི་སྙེད་པ། མི་ཡི་དབང་པོ་ཆོས་སྟོན་ཚེ། གསུང་གི་ཡན་ལག་དེ་བས་མང་། དཔེ་བཀོད་ནས་ནི་སངས་རྒྱས་ཀྱིས་། བསྐལ་པར་རབ་ཏུ་བསྟན་མཛད་ཀྱང་སངས་རྒྱས་ཀྱི་ནི་གསུང་\nདབྱངས་ཀྱི། མཐའ་མ་རྙེད་པར་མི་འགྱུར་རོ། །ཉོན་མོངས་གཟུགས་ཅན་མ་ཡིན་རྣམས། གཟུགས་ཅན་མིན་པའི་ཚིག་གིས་བརྗོད། གཟུགས་ཅན་མིན་<span class='add'>  པའི་  </span>ཚིག་གིས་ནི། ཉོན་མོངས་གཟུགས་\nམེད་ཞི་བར་བྱེད། ཇི་ལྟར་ཚིག་ནི་གཟུགས་མེད་པ། ཐམས་ཅད་དུ་ནི་མི་དམིགས་ཏེ། དེ་ལྟར་ཉོན་མོངས་གཟུགས་མེད་པ་། ཤིན་དུ་དམིགས་པར་མི་འགྱུར་རོ། །ཇི་ལྟར་ཚིག་ནི་ཡོང་མིན་ཏེ་། \nནང་དང་ཕྱི་རོལ་མི་གནས་པ། དེ་ལྟར་ཉོན་མོངས་རྣམས་མེད་ཅིང་། ནང་དང་ཕྱི་རོལ་མི་གནས་སོ། །ཇི་ལྟར་ཕྱོགས་བཅུར་སངས་རྒྱས་གསུང་། གང་ཡང་རྙེད་པར་མི་འགྱུར་པ། དེ་ལྟར་"
 ],
 [
  "78.158a",
  "ཉོན་མོངས་མི་དམིགས་ཀྱང་། དེ་ནི་ཚིག་གིས་བརྗོད་པ་ཡིན་། སེམས་ཅན་དག་ནི་ཀུན་གྱི་ཚིག །རབ་འབྲིང་ཐ་མ་གང་ཡིན་པ། དེ་དག་ལུས་དང་སེམས་མི་གནས། གནས་པ་\nམེད་པ་འང་མ་ཡིན་ནོ། །ཇི་ལྟར་སིལ་སྙན་འཁྲུལ་འཁོར་བྱས། རླུང་གིས་བསྐྱོད་ནས་སྒྲ་འབྱུང་བ་། སྒྲ་འབྱིན་བྱེད་པ་གང་ཡང་མེད། འོན་ཀྱང་སྒྲ་རྣམས་དེ་དག་འབྱུང་། དེ་ལྟར་སྔོན་ཆད་རྣམས་\nདག་ཕྱིར། སེམས་ཅན་ཀུན་གྱི་བསམ་པས་བསྐྱོད། སངས་རྒྱས་ཀྱི་ནི་གསུང་འབྱུང་ཡང་། འདི་ལ་དེ་ནི་རྟོག་མི་མངའ་། ཇི་ལྟར་བྲག་ཆ་རྣམས་ཀྱི་སྒྲ། ནང་དང་ཕྱི་རོལ་མི་གནས་བ། དེ་ལྟར་མི་\nཡི་དབང་པོའི་གསུང་། ནང་དང་ཕྱི་རོལ་མི་གནས་སོ། །ཇི་ལྟར་རིན་ཆེན་མི་རྟོག་པར། སྣང་བས་སེམས་ཅན་ཚིམ་བྱེད་པ། དེ་ལྟར་རྒྱལ་བ་མི་རྟོག་གསུང་། སྒྲ་ཀུན་རབ་ཏུ་རྫོགས་པར་བྱེད། \nཞི་བའི་བློ་གྲོས་གཞན་ཡང་དེ་བཞིན་གཤེགས་པའི་གསུང་གི་གསང་བ་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྐད་ཀྱི་འཇུག་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཆོས་སྟོན་པར་ཁོང་དུ་ཆུད་པར་བྱའོ། །ཞི་བའི་བློ་\nགྲོས་སྟོང་སུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ན་སྐྱེ་བའི་གནས་ཐ་དད་པ་དག་ཡོད་པ་རྣམས་སུ་དེ་བཞིན་གཤེགས་པས་སེམས་ཅན་རྣམས་ཀྱི་སྐད་ཀྱི་འཇུག་པ་ཇི་ལྟ་\nབ་བཞིན་དུ་བདེན་པ་རྣམས་ཀྱི་མིང་ཐ་དད་པ་དག་གིས་རྣམ་པར་གཞག་གོ །ཞི་བའི་བློ་གྲོས་འདིར་སྡུག་བསྔལ་དང་། སྡུག་བསྔལ་ཀུན་འབྱུང་བ་དང་། སྡུག་བསྔལ་འགོག་པ་དང་། སྡུག་བསྔལ་\nའགོག་པར་འགྲོ་བའི་ལམ་ཞེས་བྱ་བ་གང་ཡིན་པ་དེ་ས་བླ་<span class='add'>  པའི་  </span>ལྷ་རྣམས་ཀྱི་འདི་སྐད་ཅེས་བྱ་སྟེ། ཟ་བ་དང་། ཟ་བའི་རྩ་བ་དང་། ཟ་བ་སེལ་དང་། ཟ་བ་འགོག་བྱེད་ཅེས་བྱའོ། །འདིར་སྡུག་"
 ],
 [
  "78.155a",
  "དཔའ་དེ་དག་ངོ་མཚར་དུ་གྱུར་ཏེ། བཅོམ་ལྡན་འདས་དེ་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་གནས་བརྟན་མཽང་གལ་གྱི་བུ་ཆེན་པོ་འདི་ཅི་ཞིག་གི་སླད་དུ་འཇིག་རྟེན་གྱི་ཁམས་\nའདིར་མཆིས། བཅོམ་ལྡན་འདས་དེས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་དག་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པ་དེའི་དབྱངས་ཀྱི་དཀྱིལ་འཁོར་ཤེས་པར་འདོད་ནས་འཇིག་རྟེན་གྱི་ཁམས་འདིར་འོངས་སོ། །\nདེ་ནས་བཅོམ་ལྡན་འདས་དེས་གནས་བརྟན་<span class='add'>  མཽད་  </span>གལ་གྱི་བུ་ཆེན་པོ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། མཽང་གལ་གྱི་བུ་ཁྱོད་དེ་བཞིན་གཤེགས་པ་གསུང་དབྱངས་ཚད་མེད་པའི་གསུང་གི་དཀྱིལ་འཁོར་\nཤེས་པར་འདོད་པས་འཇིག་རྟེན་གྱི་ཁམས་འདིར་ཕྱིན་གྱི་ཁྱོད་ཀྱི་ལན་གཉིས་སུ་དེ་ལྟ་བུའི་སེམས་མ་སྐྱེད་ཅིག །གལ་ཏེ་<span class='add'>  མཽད་  </span>གལ་གྱི་བུ་ཁྱོད་ཤུགས་འདི་ཉིད་དང་། རྫུ་འཕྲུལ་གྱི་སྟོབས་འདི་ཉིད་\nཀྱིས་ནུབ་ཕྱོགས་ལོགས་སུ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་གྱི་བསྐལ་པར་སོང་ཡང་ཁྱོད་ཀྱིས་འདི་ལྟར་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པ་དེའི་གསུང་གི་དཀྱིལ་འཁོར་ཀྱི་མཐའ་རྟོགས་པར་མི་ནུས་ཏེ། སངས་\nརྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་དེ་ལྟར་གསུང་དབྱངས་ཚད་མེད་པ་དང་ལྡན་ནོ། །དེ་ནས་གནས་བརྟན་<span class='add'>  མཽད་  </span>གལ་གྱི་བུ་ཆེན་པོས་བཅོམ་ལྡན་འདས་དེའི་ཞབས་གཉིས་ལ་ཕྱག་འཚལ་ཏེ། ཉེས་པ་བཤགས་\nཔ་། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པའི་གསུང་དབྱངས་ཚད་མ་མཆིས་པའི་གསུང་གི་དཀྱིལ་འཁོར་རྟོགས་པར་འཚལ་བས་བདག་ནི་ནོངས་པ་ཅན་ཏེ་ནོངས་པ་འཆགས་སོ། །བཅོམ་ལྡན་འདས་\nབདག་ཇི་སྲིད་ཅིག་གནས་མཆིས། བཅོམ་ལྡན་འདས་དེས་བཀའ་སྩལ་པ། འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་དགུ་བཅུ་རྩ་དགུའི་བྱེ་མ་སྙེད་འདས་པ་ནས་ཁྱོད་འཇིག་རྟེན་གྱི་ཁམས་འདིར་འོངས་<span class='add'>  སོ། །  </span>"
 ],
 [
  "78.160b",
  "འགོག་པ་དང་། སྡུག་བསྔལ་འགོག་པར་འགྲོ་བའི་ལམ་ཞེས་བྱ་བ་གང་ཡིན་པ་དེ་གནས་གཙང་མའི་རིས་འོག་མིན་གྱི་ལྷ་རྣམས་ཀྱི་འདི་སྐད་ཅེས་བྱ་སྟེ། མཐར་ཐུག་དང་། ཤིན་དུ་མཐར་ཐུག་\nདང་།མི་རྟོག་པ་དང་། ཉིད་མཚམས་སྦྱོར་བ་མེད་པ་ཞེས་བྱའོ། །ཞི་བའི་བློ་གྲོས་དེ་ལྟར་ཇི་ལྟར་ལྷ་རྣམས་ཀྱི་བདེན་པ་རྣམས་ཀྱི་བདེན་པ་རྣམ་པར་གཞག་པ་དེ་བཞིན་དུ་ཀླུ་རྣམས་ཀྱི་ཡང་\nགཞན་ནོ། །གནོད་སྦྱིན་རྣམས་ཀྱི་ཡང་གཞན་ནོ། །དྲི་ཟ་རྣམ་གྱི་ཡང་གཞན་ནོ། །ལྷ་མ་ཡིན་རྣམས་ཀྱི་ཡང་གཞན་ནོ། །ནམ་མཁའ་ལྡིང་རྣམས་ཀྱི་ཡང་གཞན་ནོ། །མི་འམ་ཅི་རྣམ་ཀྱི་ཡང་\nགཞན་ནོ། །ལྟོ་འཕྱེ་ཆེན་པོ་རྣམས་ཀྱི་ཡང་གཞན་ནོ། །གནོད་སྦྱིན་ལག་ན་གཞོང་ཐོགས་རྣམས་ཀྱི་ཡང་ཞན་ནོ། །ཕྲེང་ཐོགས་རྣམས་ཀྱི་བདེན་པ་རྣམ་པར་གཞག་པ་ཡང་ཞན་ཡིན་ནོ། །ཞི་\nབའི་བློ་གྲོས་གང་ཡུལ་ཆེན་པོ་བཅུ་དྲུག་ཏུ་བསྡུ་བས་བསྡུས་པའི་ཡུལ་སྟོང་གིས་འཛམ་བུའི་གླིང་འདི་ཡོངས་སུ་གང་སྟེ་། གང་ན་མི་རྣམས་ཀྱི་ཚིག་ཀྱང་གཞན། ངེས་པའི་ཚིག་ཀྱང་གཞན། བརྡ་\nཡང་ཐ་དད་པ་དེར་ཡང་དེ་བཞིན་གཤེགས་པས་སྐད་ཀྱི་འཇུག་པ་ཇི་ལྟ་བ་བཞིན་དུ་མིང་ཐ་དད་པ་རྣམས་ཀྱིས་བདེན་པ་དག་རྣམ་པར་བཀོད་དེ། འདི་ལྟ་སྟེ། ཡུལ་ཀ་ཤ་དང་། བ་ཧུ་པ་དང་། \nཐོ་གར་ཡུལ་དང་། ཡ་བ་ན་དང་། ཀམ་པོ་ཛ་དང་། ཁ་ཤ་དང་། ཧུ་ན་དང།་ རྒྱ་ཡུལ་དང་། ད་ར་ཏ་དང་། ཨུ་ར་ཤ་དང་། པི་ལིན་དང་། པོ་མ་ད་<span class='add'>    </span>བྲམ་ཟེ་དང་། རྒྱལ་རིགས་དང་། རྗེའུ་རིགས་\nདང་། དམངས་རིགས་དང་། ད་ཙི་བ་དང་། ཀི་ར་ཏ་དང་། པུ་ལིན་ཏ་དང་། བུན་དྲ་དང་། ཀུ་རུ་ན་དང་། ལྔ་ལེན་དང་། ཤར་ཕྱོགས་དང་། ཕུ་རུ་ར་བ་དང་། ལྷོ་ཕྱོགས་དང་། ཀ་ལིང་ཀ་དང་། གཅེར་"
 ],
 [
  "78.161a",
  "བུ་དང་། བ་ན་ས་ཀ་དང་། པ་ན་ཏ་དང་། སྦལ་ཀ་དང་། ཁྱི་གདོང་དང་། ལྦ་གདོང་དང་། ཀྲི་བ་ཤའི་གདོང་དང་། སྤྱིའུ་ཚུགས་པ་དང་། གནས་གདོང་པོ་དང་། ཕྱི་ཕྱོགས་གདོད་དང་། བྱང་\nམཚམས་གདོང་དང་། རྗེས་སུ་རྒྱུག་དང་། རྒྱ་མཚོ་ཁོལ་བ་དང་། ཡུལ་མཐུས་གཏུག་པ་དང་། ཨང་ཀུ་ར་དང་། མང་གུ་ར་དང་། སྣ་མེད་དང་། གློ་བཀྲ་དང་། ཕྱོགས་ཀྱི་གཅེར་བུ་དང་། གཤོག་\nཐོགས་གཅེར་བུ་དང་། དགུས་ཏེ་འགྲོ་དང་། རྫོགས་བྱེད་རྣམ་པ་དང་། འཇིག་རྟེན་གྱི་བར་ན་གནས་པའི་ཡུལ་ལ་སོགས་པ་ཡུལ་སྟོང་གིས་འཛམ་བུ་གླིང་ཡོངས་སུ་གང་སྟེ། ཞི་བའི་བློ་\nགྲོས་གང་ན་མི་རྣམས་ཀྱི་ཚིག་དང་། ངེས་པའི་ཚིག་དང་། བརྡ་ཐ་དད་པ་དེར་ཡང་དེ་བཞིན་གཤེགས་པས་སྐད་ཀྱི་འཇུག་པ་ཇི་ལྟ་བ་བཞིན་དུ་མིང་ཐ་དད་པ་རྣམས་ཀྱིས་བདེན་པ་དག་\nབསྟན་ཀྱང་དེ་བཞིན་གཤེགས་པའི་གསུང་སེམས་ཀྱི་རྗེས་སུ་འབྲང་བ་མ་ཡིན་ཤིང་། རྣམ་པར་ཤེས་པའི་རྗེས་སུ་འབྲང་བ་མ་ཡིན་བ་འབྱུང་ངོ་། །ཞི་བའི་བློ་གྲོས་སྟོང་གི་འཇིག་རྟེན་གྱི་\nཁམས་འདི་ན་བདེན་པ་མིང་ཐ་དད་པས་བསྟན་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དགུ་བཅུ་རྩ་བཞི་ཡོད་དེ་བདེན་པ་བསྟན་པ་དེ་དག་ཐམས་ཅད་ཀྱང་འདི་ལྟ་སྟེ། དོན་དམ་པའི་བདེན་པ་དང་། \nསྐྱེས་བ་མེད་པའི་བདེན་པ་དང་། ཇི་ལྟ་བ་བཞིན་གྱི་བདེན་པ་དང་། མི་འཁྲུགས་པའི་བདེན་<span class='add'>  པར་  </span>དོན་གཅིག་ཏུ་ཡང་དག་པར་འདུས་ཏེ། ཞི་བའི་བློ་གྲོས་འདི་ཡང་དེ་བཞིན་གཤེགས་པའི་གསུང་གི་གསང་\nབའོ། །བམ་པོ་ལྔ་བ། ཞི་བའི་བློ་གྲོས་གཞན་ཡང་དེ་བཞིན་གཤེགས་པའི་གསུང་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོགས་པ་གཅོད་པ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་སོམ་ཉི་སེལ་བའོ། །ཞི་བའི་"
 ],
 [
  "78.159a",
  "འགོག་པར་འགྲོ་བའི་ལམ་ཞེས་བྱ་བ་གང་ཡིན་པ་དེ་འཕྲུལ་དགའི་ལྷ་རྣམས་ཀྱི་འདི་སྐད་ཅེས་བྱ་སྟེ། རྐྱལ་པ་དང་། ཀུན་དུ་རྒྱལ་བྱེད་དང་། རྐྱལ་ཟད་དང་། རྐྱལ་ཟང་སྒོ་ཞེས་བྱའོ། \nའདིར་སྡུག་བསྔལ་དང་། སྡུག་བསྔལ་ཀུན་འབྱུང་བ་དང་། སྡུག་བསྔལ་འགོག་པ་དང་། སྡུག་བསྔལ་འགོག་པར་འགྲོ་བའི་ལམ་ཞེས་བྱ་བ་གང་ཡིན་པ་དེ་གཞན་འཕྲུལ་དབང་བྱེད་ཀྱི་ལྷ་རྣམས་ཀྱི་འདི་\nསྐད་བྱ་སྟེ། ཧ་ཧ་ཧོ་དང་། ཧ་ཧ་ཐོབ་བྱེད་དང་། ཧ་ཧ་བྲལ་དང་། ཧ་ཧ་བྲལ་བྱེད་ཅེས་བྱའོ། །འདིར་སྡུག་བསྔལ་དང་། སྡུག་བསྔལ་ཀུན་འབྱུང་བ་དང་།སྡུག་བསྔལ་འགོག་པ་དང་། སྡུག་བསྔལ་འགོག་པར་\nའགྲོ་བའི་ལམ་ཞེས་བྱ་བ་གང་ཡིན་པ་དེ་བདུད་ཀྱི་རིས་ཀྱི་ལྷ་རྣམས་ཀྱི་འདི་སྐད་ཅེས་བྱ་སྟེ། མེ་མུར་དང་། མེ་མུར་གནོད་དང་། མེ་མུར་འདོར་འདོད་དང་། མེ་མུར་སྒྲོལ་ཞེས་བྱའོ། །འདིར་སྡུག་བསྔལ་དང་། \nསྡུག་བསྔལ་ཀུན་འབྱུང་བ་དང་། སྡུག་བསྔལ་འགོག་པ་དང་། སྡུག་བསྔལ་འགོག་པར་འགྲོ་བའི་ལམ་ཞེས་བྱ་བ་གང་ཡིན་པ་དེ་ཚངས་པའི་ལྷ་རྣམས་ཀྱི་འདི་སྐད་ཅེས་བྱ་<span class='add'>  སྟེ།   </span>སྡུག་པ་དང་། སྡུག་བྱེད་དང་། \nསྡུག་པ་ཉལ་དང་། སྡུག་པར་འཁོར་ཞེས་བྱའོ། འདིར་སྡུག་བསྔལ་དང་། སྡུག་བསྔལ་ཀུན་འབྱུང་བ་དང་། སྡུག་བསྔལ་འགོག་པ་དང་། སྡུག་བསྔལ་འགོག་པར་འགྲོ་བའི་ལམ་ཞེ་བྱ་བ་གང་ཡིན་པ་དེ་\nཚངས་རིས་ཀྱི་ལྷ་རྣམས་ཀྱི་འདི་སྐད་ཅེས་བྱ་སྟེ། འཛག་པ་དང་། ཀུན་དུ་འཛག་བྱེད་དང་། རྒྱུན་གཅད་དང་། ཤིན་དུ་འབྱུང་ཞེས་བྱའོ། འདིར་སྡུག་བསྔལ་དང་། སྡུག་བསྔལ་ཀུན་འབྱུང་བ་དང་། \nསྡུག་བསྔལ་འགོག་པ་དང། སྡུག་བསྔལ་འགོག་པར་འགྲོ་བའི་ལམ་ཞེས་བྱ་བ་གང་ཡིན་པ་དེ་ཚངས་པའི་མདུན་ན་འདོན་གྱི་ལྷ་རྣམས་ཀྱི་འདི་སྐད་ཅེས་བྱ་སྟེ། རྨ་དང་། རྨའི་མཚམས་སྦྱོར་བ་དང་།"
 ],
 [
  "78.161b",
  "བློ་གྲོས་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ཚད་མེད་གྲངས་མེད་<span class='add'>  པ་  </span>དག་ན་སེམས་ཅན་དུ་བསྡུ་བར་བསྡུས་པའི་སེམས་ཅན་ཇི་སྙེད་ཡོད་པ། སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་ཀྱིས་མཁྱེན་པའི་སེམས་ཅན་གྱི་\nཁམས་ན་ཆེས་མང་གི་སའི་ཁམས་ནི་དེ་ལྟ་མ་ཡིན་ནོ་ཞེས་བྱ་སྟེ། ཞི་བའི་བློ་གྲོས་ཡོངས་སུ་བརྟག་པ་ཉེ་བར་བཟུང་ནས་སེམས་ཅན་དེ་དག་ཐམས་ཅད་ཕྱི་མེད་པར་མིའི་ལུས་ཐོབ་པར་གྱུར་ལ། ཞི་བའི་བློ་གྲོས་\nསེམས་ཅན་ཐམས་ཅད་འདི་ལྟ་སྟེ། གནས་བརྟན་ཤྭ་ར་དྭ་ཏི་འི་བུའི་ཤེས་རབ་དང་། ཡེ་ཤེས་དེ་ལྟ་བུ་དང་ལྡན་<span class='add'>  པར་  </span>གྱུར་ལ། ཤཱི་རིའི་བུ་ལྟ་བུའི་སེམས་ཅན་དེ་དག་ཐམས་ཅད་ཀྱི་ཤེས་རབ་དང་། ཡེ་\nཤེས་གང་ཡིན་<span class='add'>  པའི་  </span>ཤེས་རབ་དང་། ཡེ་ཤེས་དེ་སེམས་ཅན་གཅིག་དང་ལྡན་<span class='add'>  པར་  </span>གྱུར་ཅིང་རྣམ་གྲངས་འདིས་སེམས་ཅན་ཐམས་ཅད་ཤེས་རབ་དང་། ཡེ་ཤེས་དེ་ལྟ་བུ་དང་ལྡན་<span class='add'>  པར་  </span>གྱུར་ལ། ཞི་བའི་\nབློ་གྲོས་སེམས་ཅན་དེ་དག་ཐམས་ཅད་ཀྱིས་བསྐལ་པའམ། བསྐལ་པ་ལས་ལྷག་པར་ཐེ་ཙོམ་གྱི་དྲི་བ་བསམས་ཤིང་གཞལ་ཏེ། ཡོངས་སུ་བཅལ་ལ། སེམས་ཅན་གཅིག་གི་ཐེ་ཙོམ་དྲི་བ་གང་ཡིན་\nཔ་དེ་གཉིས་པའི་མ་ཡིན་ཞིང་། ཞི་བའི་བློ་གྲོས་རྣམ་གྲངས་འདིས་སེམས་ཅན་ཐམས་ཅད་ཀྱིས་ཐེ་ཙོམ་གྱི་དྲི་བ་ཐ་དད་<span class='add'>  པ་  </span>བསམས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱི་གན་དུ་དོང་ནས་སེ་གོལ་གཏོགས་པ་སྲིད་\nལ་ཐེ་ཚོམ་གྱི་དྲི་བ་དེ་དག་གསོལ་ཀྱང་དེས་སེམས་ཅན་གཅིག་གི་རྗེས་སུ་ཞུགས་པའི་དྲན་པས་ཐམས་ཅད་བཟུང་ནས་གསུང་བརྗོད་པ་གཅིག་གིས་དེ་དག་གི་ཐེ་ཙོམ་གྱི་དྲི་བ་ཐམས་ཅད་གཅད་དེ། \nདེ་དག་ཐམས་ཅད་ཀྱང་རང་རང་གི་ཐེ་ཙོམ་གྱི་དྲི་བ་ཆད་པར་ཤེས་ཤིང་བཅོམ་ལྡན་འདས་ཀྱིས་ཞུས་<span class='add'>  པ་  </span>ལུང་བསྟན་པས་ཐམས་ཅད་ཀྱང་སེམས་རངས་པར་འགྱུར་ཏེ། ཞི་བའི་བློ་གྲོས་དེ་ལྟར་ན་"
 ],
 [
  "78.162a",
  "དེ་བཞིན་གཤེགས་པའི་གསུང་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོགས་པ་གཅོད་ཅིང་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སོམ་ཉི་སེལ་ཀྱང་དེ་བཞིན་གཤེགས་པ་ནི་དེ་ལ་ཐུགས་ཀྱིས་མཛད་\nཔའམ། གསུང་དུ་བརྗོད་པ་ཡང་མི་མངའ་ལ་མཛད་པ་དེ་ཡང་མཛད་དེ། ཞི་བའི་བློ་གྲོས་འདི་ཡང་དེ་བཞིན་གཤེགས་པའི་གསུང་གི་གསང་བའོ། །འདི་ནི་གསུང་རྨད་དུ་བྱུང་བའོ། །འདི་ནི་ཡོངས་སུ་\nདག་པའོ། །དེ་བཞིན་གཤེགས་པའི་གསུང་ངོ་མཚར་ཅན་དང་གསུང་གི་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེས་བཤད་པའི་ཚེ་སྲོག་ཆགས་སུམ་ཁྲི་ཉིས་སྟོང་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་\nརྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ། །བསྐལ་པ་བཟང་པོ་པའི་བྱང་ཆུབ་སེམས་དཔའ་སངས་རྒྱས་ཀྱི་ཞིང་གང་དང་གང་ན་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་ཐང་ན་ཚངས་པར་སྤྱད་\nཔ་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་གིས་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེ་ལ་མཆོད་པའི་ལས་ཀྱི་ཕྱིར་མེ་ཏོག་རྣམས་ཀྱིས་ཀྱང་གཏོར། རིན་པོ་ཆེའི་གདུགས་རྣམས་ཀྱང་གཏོང་\nརོ། །དེ་ནས་མེ་ཏོག་དེ་དག་བཅོམ་ལྡན་འདས་ཀྱི་སྐུ་ལ་ཡང་ཕོག །གསང་བ་པའི་བདག་པོ་ལན་ན་རྡོ་རྗེའི་ལུས་ལ་ཡང་ཕོག་ཅིང་འཁོར་ཐམས་ཅད་ལ་ཡང་འཐོར་རོ། །རིན་པོ་ཆེའི་གདུགས་\nདེ་དག་ཀྱང་བར་སྣང་ལ་གནས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱི་དབུའི་གཙུག་གི་སྟེང་ན་འདུག་གོ །རིན་པོ་ཆེའི་གདུགས་དེ་དག་ལས་ཀྱང་བཅོམ་ལྡན་འདས་བདག་ཅག་ནི་བཅོམ་ལྡན་འདས་ལ་མཆོད་\nབ་བགྱི་པ་དང་། དེས་དེ་བཞིན་གཤེགས་པའི་ཆོས་ཉིད་རྨད་དུ་བྱུང་བ་འདི་བསྟན་པས་གསང་བ་པའི་བདག་པོ་ལག་ན་<span class='add'>  རྡོ་རྗེ་  </span>རྗེས་སུ་གཟུང་བའི་སླད་དུ་བསྐལ་པ་བཟང་པོའི་བྱང་ཆུབ་སེམས་"
 ],
 [
  "78.162b",
  "དཔའ་རྣམས་ཀྱིས་བཏང་བ་ལགས་སོ་ཞེས་སྒྲ་བྱུང་ངོ། །དེ་ནས་ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དེ་ངོ་མཚར་དུ་གྱུར་ནས་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེ་ལ་ཕྱག་འཚལ་ཞིང་གུས་པ་ཆེར་བསྐྱེད་\nདེ། །ཚིག་འདི་སྐད་ཅེས་བདག་ཅག་གིས་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེ་མཐོང་བ་དང་། དེ་བཞིན་གཤེགས་པའི་གསུང་བསམ་གྱིས་མི་ཁྱབ་པ་འདི་ཐོས་པ་ནི་བདག་ཅག་གིས་རྙེད་པ་ལེགས་པར་\nརྙེད་དོ། །གང་དག་བསྟན་པ་འདི་ཐོས་ནས་མོས་ཤིང་སོམ་ཉི་ཟ་བར་མི་འགྱུར་བའི་སེམས་ཅན་དེ་དག་ནི་དོན་ཡོད་པའི་མི་ཉིད་རྙེད་པར་འགྱུར་རོ། །དེ་དག་ནི་དེ་བཞིན་གཤེགས་པས་འདུལ་བར་འགྱུར་\nཞིང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་བར་ཡང་འགྱུར་རོ་ཞེས་སྨྲས་སོ། །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་འཁོར་ཐམས་ཅད་ལ་ལེགས་སོ་ཞེས་བྱ་བ་གནང་སྟེ། བྱང་\nཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཞི་བའི་བློ་གྲོས་ལ་བཀའ་སྩལ་པ། ཞི་བའི་བློ་གྲོས་དེ་བཞིན་གཤེགས་པའི་གསུང་དག་པ། དེ་བཞིན་གཤེགས་པའི་ཆོས་འཇིག་རྟེན་ཐམས་ཅད་དང་མི་\nམཐུན་<span class='add'>  པ།   </span>དེ་བཞིན་གཤེགས་པའི་གནས་པ་གང་ཡིན་བ་དེ་དག་ནི་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེས་ཆོས་ཀྱི་རྣམ་གྲངས་འདིའི་ནང་དུ་བསྟན་ཏོ། བསྙད་དོ། །ཡང་དག་པར་བཤད་དོ། །གང་དག་ཆོས་\nབསྟན་པ་འདི་ལ་མོས་པའི་སེམས་ཅན་དེ་དག་ནི་རིང་པོར་མི་ཐོགས་པར་ཆོས་འདི་ལྟ་བུ་དང་ལྡན་བར་འགྱུར་རོ། །གང་དག་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཐོས་ནས་མོས་པ་དང་། འཆང་བ་དང་། \nམི་དངང་མི་སྐྲག་སྐྲག་པར་མི་འགྱུར་བ་དང་། དོན་རྟོགས་པའི་རྗེས་སུ་རྟོག་པ་དང་། དེ་བཞིན་ཉིད་དུ་སྒྲུབ་པ་དེ་ཉིད་དེ་དག་གི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་པར་"
 ],
 [
  "78.163b",
  "བར་འཕགས་པ་དེ་བཞིན་དུ་གང་དག་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་འཆང་བ་དང་། དེ་བཞིན་ཉིད་དུ་སྒྲུབ་པར་བྱེད་པའི་སེམས་<span class='add'>  ཅན་  </span>དེ་དག་ཀྱང་མངོན་པར་འཕགས་པར་གྱུར་ཏེ། དེ་དག་ནི་མ་\nརིག་པ་དང་། ལྟ་བར་གྱུར་བའི་སྒོ་གླེགས་བཅག་ནས་ཆོས་ཀྱི་སྣང་བ་མི་ཟད་པ་དང་། ཤེས་རབ་དང་། སྤོབས་པ་འབྱུང་བར་འགྱུར་རོ། །དེས་སྐྱེས་བུ་དེ་དག་གིས་ལེགས་པར་བཤད་པས་\nསེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་རྣམས་ཚིམ་པར་བྱེད་པར་འགྱུར་ཏེ། འདི་ནི་ཆོས་ཀྱི་རྣམ་གྲངས་འདིའི་མ་འདྲེས་པའི་མཚན་ཉིད་དུ་རིག་པར་བྱའོ། །དེ་བཞིན་གཤེགས་པའི་གསུང་གི་\nགསང་བ་བསམ་གྱིས་མི་ཁྱབ་པ་བསྟན་པའི་ལེའུ་སྟེ་བརྒྱད་བའོ། །གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་ཆེན་པོ་ཞི་\nབའི་བློ་གྲོས་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཞི་བའི་བློ་གྲོས་དེ་ལ་དེ་བཞིན་གཤེགས་པའི་ཐུགས་ཀྱི་གསང་བ་དང་། ཐུགས་ཀྱི་ཕྲིན་ལས་ཀྱི་ཡོངས་སུ་དག་པ་གང་ཞེ་ན། ཞི་བའི་བློ་གྲོས་འདི་ལྟ་སྟེ། \nདཔེར་ན་གཟུགས་མེད་པ་ན་སྤྱོད་པའི་ལྷའི་རིས་སུ་སེམས་ཅན་གང་དག་སྐྱེས་པ་དེ་དག་རྣམ་པར་ཤེས་པའི་དམིགས་པ་གཅིག་གིས་བསྐལ་པ་བརྒྱད་ཁྲི་བཞི་སྟོང་དུ་གནས་ཀྱང་ཏིང་ངེ་འཛིན་\nགྱི་ཆེའི་མཐར་མ་ཐུག་གི་བར་དུ་དེ་དག་གི་རྣམ་པར་ཤེས་པ་དེ་རྣམ་པར་ཤེས་པ་གཞན་གྱི་རྗེས་སུ་མི་འབྲང་སྟེ། དེ་ནས་ཤི་འཕོས་ནས་ལས་ཇི་ལྟར་བསགས་པ་བཞིན་དུ་སྐྱེ་བ་ཡོངས་\nསུ་འཛིན་ཏོ། །ཞི་བའི་བློ་གྲོས་དེ་བཞིན་དུ་གཤེགས་པའི་རྣམ་པར་ཤེས་པ་ཡང་མི་གནས་པ་སྟེ་གང་གི་ནུབ་མོ་བྱང་ཆུབ་སེམས་དཔའ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་"
 ],
 [
  "78.163a",
  "འགྱུར་རོ། །གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེས་བསྟན་པ་འདི་བཤད་པ་ན་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་གྲངས་མེད་པ་དག་རྣམ་པ་དྲུག་ཏུ་རབ་ཏུ་གཡོས་\nཏེ་སྣང་བ་ཆེན་པོས་ཁྱབ་པར་གྱུར་ཏོ། །མེ་ཏོག་གི་ཆར་ཆེན་པོ་ཡང་བབ་པ། སིལ་སྙན་དང་རོལ་མོའི་སྒྲ་ཡང་བྱུང་ངོ་། སེམས་ཅན་གྲངས་མེད་པ་དག་གིས་ནི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ། །\nབྱང་ཆུབ་སེམས་དཔའ་གྲངས་མེད་པ་དག་གིས་ནི་རྗེས་སུ་འཐུན་པའི་ཆོས་ལ་བཟོད་པ་ཐོབ་པར་གྱུར་ཏོ། །བྱང་ཆུབ་སེམས་དཔའ་གྲངས་མེད་པ་དག་གིས་ནི་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་པར་\nགྱུར་<span class='add'>  ཏོ། །  </span>བྱང་ཆུབ་སེམས་དཔའ་གྲངས་མེད་པ་དག་གིས་ནི་སྐྱེ་བ་གཅིག་གིས་ཐོགས་པར་འགྱུར་པའི་དགེ་བའི་རྩ་བ་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱས་སོ། །དེ་ནས་འཁོར་གྱི་ཁྱམས་དེའི་དབུས་\nནས་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་ཆུའི་རྒྱུན་ཤིང་རྟའི་སྲོག་ཤིང་ཙམ་གྱིས་ས་ཆེན་པོ་དཔག་ཚད་སྟོང་ཕྲག་དྲུག་བཅུ་རྩ་བརྒྱད་པ་བརྟོལ་ཏོ་མངོན་དུ་བྱུང་བར་སྣང་ངོ་། །དེ་དག་སྟེང་གི་བར་སྣང་\nནས་ཚངས་པའི་འཇིག་རྟེན་གྱི་བར་དུ་མངོན་པར་འཕགས་ཏེ། སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ཐམས་ཅད་སྤོས་ཆུས་ཆག་ཆག་བཏབ་པར་གྱུར་ཏོ། །དེ་ནས་བཅོམ་\nལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་ཞི་བའི་བློ་གྲོས་ལ་བཀའ་སྩལ་པ། ཞི་བའི་བློ་གྲོས་ཁྱོད་ཀྱིས་ཆུའི་རྒྱུན་མངོན་<span class='add'>  པར་  </span>འཕགས་པ་འདི་དག་མཐོང་ངམ། གསོལ་པ། བཅོམ་ལྡན་\nའདས་མཐོང་ལགས་ཏེ་འདི་སུའི་སྔ་ལྟས་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཞི་བའི་བློ་གྲོས་ཆུའི་རྒྱུན་འདི་དག་སེམས་མེད་ཀྱང་ཇི་ལྟར་འདི་དག་གིས་ས་ཆེན་པོ་བརྟོལ་ཏེ་མངོན་"
 ],
 [
  "78.166a",
  "ཞིང་ཐོགས་པ་མི་མངའ་བ་འཇུག་སྟེ། དེ་ཡང་ལྷུན་གྱིས་གྲུབ་ཅིང་བསྒྲིམ་པ་མི་མངའ་ལ་མངོན་པར་འདུ་བྱ་བ་མི་མངའ་བས་འཇུག་གོ །ཞི་བའི་བློ་གྲོས་འདི་ཡང་དེ་བཞིན་\nགཤེགས་པའི་ཐུགས་ཀྱི་གསང་བ་སྟེ་མཉམ་པར་བཞག་པའི་གནས་ཀྱང་མི་འདོར་ལ་སེམས་ཅན་ཐམས་ཅད་ལ་སེམས་རྣམ་པར་རིག་པར་ཡང་མཛད་པས་ཐུགས་བསམ་གྱིས་མི་ཁྱབ་\nཔ་ཉིད་དོ། །དེ་བཞིན་གཤེགས་པའི་ཐུགས་ཀྱི་གསང་<span class='add'>  བའི་  </span>ལེའུ་ཞེས་བྱ་བ་སྟེ་དགུ་པའོ། །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་འདི་སྐད་ཅེས་གསོལ་\nཏོ། །བཅོམ་ལྡན་འདས་ཕྱོགས་བཅུ་དག་ན་བསྐལ་པ་བཟང་པོ་པའི་བྱང་ཆུབ་སེམས་དཔའ་གང་དག་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་ཐད་ན་ད་ལྟར་ཚངས་པར་སྤྱད་པ་སྤྱོད་པའི་\nབྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ཐམས་ཅད་ཀྱི་སླད་ན་ཡང་གསང་བ་པའི་བདག་པོ་མཆིས་ལགས་སམ། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤཱ་རི་འི་བུ་བྱ་བ་འདི་བསམ་གྱི་མི་\nཁྱབ་ཀྱིས་ཞོག་ཤིག །ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་འདི་ལ་མགོ་རྨོངས་བར་འགྱུར་རོ། །དེ་ལྟ་མོད་ཀྱི་ཤཱ་རིའི་བུ་གང་དག་ད་ཅིང་དགེ་བའི་བཤེས་\nགཉེན་གྱིས་ཡོངས་སུ་ཟིན་པ་དེ་དག་གནས་འདི་ལ་སྐྲག་པར་མི་འགྱུར་རོ། །གསོལ་པ། བཅོམ་ལྡན་འདས་ཀྱིས་བཤད་དུ་གསོལ་། བདག་དེ་བཞིན་གཤེགས་པ་ལ་ཡིད་ཆེས་པར་\nམཆིའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤཱ་རིའི་བུ་ཁྱོད་ཀྱིས་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེ་རྟག་ཏུ་ངའི་ཕྱི་བཞིན་འབྲང་བ་མཐོང་ངམ། གསོལ་པ་། བཅོམ་ལྡན་"
 ],
 [
  "78.164a",
  "པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་དང་། གང་གི་ནུབ་མོ་དེ་བཞིན་གཤེགས་པ་ཕུང་པོའི་ལྷག་མ་མེད་པའི་མྱ་ངན་ལས་འདས་པའི་དབྱིངས་སུ་ཡོངས་\nསུ་མྱ་ངན་ལས་འདའ་བར་འགྱུར་པའི་བར་དུ་དེ་བཞིན་གཤེགས་པའི་ཐུགས་ལ་ལྡོག་པ་མི་མངའ་། ཐུགས་ལ་རྟོག་པ་མི་མངའ། ཐུགས་ལ་རྣམ་པར་གཅོད་པ་མི་མངའ་། ཐུགས་ལ་\nའགྱུར་བ་མི་མངའ་། ཐུགས་ཀྱི་ཚད་མི་མངའ་། ཐུགས་ལ་འཁྲུག་པ་མི་མངའ་། ཐུགས་ལ་སེལ་བ་མི་མངའ་། ཐུགས་ལ་གཡེང་བ་མི་མངའ་། ཐུགས་ལ་ཁེངས་པ་མི་མངའ། ཐུགས་ལ་\nདམའ་བ་མི་མངའ་། ཐུགས་ལ་ཀུན་དུ་སྲུང་བ་མི་མངའ་། ཐུགས་ལ་རྒྱུ་བ་མི་མངའ་། ཐུགས་ལ་ཤིན་དུ་རངས་པ་མི་<span class='add'>  མངའ།   </span>ཐུགས་ལ་རྣམ་པར་འཁྲུག་པ་མི་མངའ། ཐུགས་ལ་འཁོན་དུ་\nའཛིན་པ་མི་མངའ། ཐུགས་ལ་གཡོ་བ་མི་མངའ། ཐུགས་ལ་ངེས་པར་སེམས་པ་མི་མངའ་། ཐུགས་ལ་དགྱེས་པ་མི་མངའ། ཐུགས་ལ་གནོད་པ་མི་མངའ། ཐུགས་ལ་འཇུག་པ་མི་མངའ། \nཐུགས་རབ་ཏུ་རྒྱུ་བ་མི་མངའ། ཐུགས་ལ་རྟོག་པ་མི་མངའ། ཐུགས་ལ་རྣམ་པར་རྟོག་པ་མི་མངའ། ཐུགས་ལ་ཡོངས་སུ་རྟོག་པ་མི་མངའ། ཐུགས་ལ་ཞི་གནས་མི་མངའ། ཐུགས་ལ་ལྷག་\nམཐོང་མི་མངའ་། ཐུགས་རྣམ་པར་ཤེས་པའི་རྗེས་སུ་འབྲང་བ་མི་མངའ། རང་གི་ཐུགས་ལ་གནས་པ་མི་མངའ། གཞན་གྱི་སེམས་ལ་ལྟ་བ་མི་མངའ། ཐུགས་མིག་ལ་གནས་པ་མི་<span class='add'>  མངའ།  </span>\nཐུགས་རྣ་བ་དང་། སྣ་དང་། ལྕེ་དང་། ལུས་དང་། ཡིད་ལ་གནས་པ་མི་མངའ། ཐུགས་གཟུགས་ལ་གནས་པ་མི་མངའ། ཐུགས་སྒྲ་དང་། དྲི་དང་། རོ་དང་རེག་ལ་གནས་པ་མི་མངའ། ཐུགས་"
 ],
 [
  "78.165b",
  "ཅད་ཀྱང་མཛད་དེ། དེ་ཡང་ལྷུན་གྱིས་གྲུབ་ཅིང་བསྒྲིམ་པ་མི་མངའ་ལ་མངོན་པར་འདུ་མཛད་པ་མི་མངའ་བས་མཛད་དོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཞི་བའི་བློ་གྲོས་དེ་བཞིན་གཤེགས་པས་སྤྲུལ་པའི་\nརང་བཞིན་གྱི་མཚན་ཉིད་དུ་ཆོས་ཐམས་ཅད་མངོན་<span class='add'>  པར་  </span>རྫོགས་པར་སངས་རྒྱས་ཏེ། མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་ཀྱང་སེམས་ཅན་ལ་ཐུགས་བརྩེ་བས་དེ་བཞིན་དུ་བསྟན་\nཏོ། །ཞི་བའི་བློ་གྲོས་དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་ནི་འདུས་བྱས་ལ་གནས་པ་མ་ཡིན། འདུས་མ་བྱས་ལ་གནས་པ་མ་ཡིན། ཕུང་པོ་ལ་གནས་པ་མ་ཡིན། ཁམས་ལ་གནས་པ་\nམ་ཡིན། སྐྱེ་མཆེད་ལ་གནས་པ་མ་ཡིན། <span class='add'>  ནང་  </span>ལ་གནས་པ་མ་ཡིན། ཕྱི་རོལ་ལ་གནས་པ་མ་ཡིན། དགེ་བ་ལ་གནས་པ་མ་ཡིན། མི་དགེ་བ་ལ་གནས་པ་མ་ཡིན། འཇིག་རྟེན་པ་ལ་\nགནས་པ་མ་ཡིན། འཇིག་རྟེན་ལས་འདས་པ་ལ་གནས་པ་མ་ཡིན། ཁ་ན་མ་ཐོ་བ་དང་བཅས་པ་ལ་གནས་པ་མ་ཡིན། ཁ་ན་མ་ཐོ་བ་མེད་པ་ལ་གནས་པ་མ་ཡིན། ཟག་པ་དང་བཅས་\nཔ་ལ་གནས་པ་མ་ཡིན། ཟག་པ་མེད་པ་ལ་གནས་པ་མ་ཡིན། འདས་པ་ལ་གནས་པ་མ་ཡིན། མ་འོངས་པ་ལ་གནས་པ་མ་ཡིན། ད་ལྟར་བྱུང་བ་ལ་གནས་པ་མ་ཡིན། སོ་སོར་\nབརྟགས་པ་ལ་གནས་པ་མ་ཡིན། སོ་སོར་བརྟགས་པ་མ་ཡིན་པ་ལ་གནས་པ་མ་ཡིན་ཏེ། ཞི་བའི་བློ་གྲོས་དེ་ལྟར་དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་གནས་པ་མི་མངའོ། །དེ་ཆོས་\nགང་ཡང་མངོན་པར་མི་སྒྲུབ་ལ་སེམས་ཅན་ལ་ཐུགས་བརྩེ་བས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་དང་། སྤྱོད་པ་དང་། བསམ་པ་རྣམས་ལ་ཡང་དེའི་ཡེ་ཤེས་མཐོང་བ་ཆགས་པ་མི་མངའ་"
 ],
 [
  "78.166b",
  "འདས་དེ་ལྟར་སངས་རྒྱས་ཀྱི་མཐུས་མཐོང་ལགས་ཏེ། འདི་བདག་གིས་སྔོན་ནི་ནམ་ཡང་མ་མཐོང་ངོ་། བཀའ་སྩལ་པ། ཤཱ་རིའི་བུ་དེ་བཞིན་དུ་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེ་འདི་ནི་\nབསྐལ་པ་བཟང་པོ་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་རྒྱབ་རྒྱབ་ན་ཡང་གནས་ཏེ་སྔོན་གྱི་སྨོན་ལམ་གྱི་སྟོབས་དང་། མངོན་པར་ཤེས་པའི་སྟོབས་ཀྱིས་ཐམས་ཅད་དུ་ཡང་ལག་\nན་རྡོ་རྗེའི་གཟུགས་སུ་ཀུན་དུ་སྟོན་ཏོ། །ཤཱ་རིའི་བུ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ན་སེམས་ཅན་ཇི་སྙེད་འཁོད་པའི་སེམས་ཅན་དེ་དག་ཐམས་ཅད་ཀྱི་རྒྱབ་རྒྱབ་ཏུ་། \nགསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེ་ལག་ན་རྡོ་རྗེའི་གཟུགས་ཀུན་དུ་བསྟན་ཀྱང་དེས་ཡེ་ཤེས་ཀྱི་བྱིན་གྱིས་བརླབས་ཡོངས་སུ་རྫོགས་པར་བསྟན་པར་མི་འགྱུར་རོ། །ཤཱ་རི་འི་བུ་ཁྱོད་ཀྱིས་བྱང་ཆུབ་\nསེམས་དཔའ་བྱམས་པའི་རྒྱབ་ན་ལག་ན་རྡོ་རྗེ་འདུག་པ་མཐོང་ངམ། གསོལ་པ། བཅོམ་ལྡན་འདས་བདག་གིས་ད་<span class='add'>  གདོང་  </span>མཐོང་ལགས་ཏེ། སྔོན་ནི་མ་མཐོང་ངོ། །བཀའ་སྩལ་པ། འདི་\nནི་དེའི་རྒྱབ་ན་རྟག་ཏུ་གནས་ན་ཁྱོད་ཀྱིས་དེ་མ་མཐོང་བ་མ་གཏོགས་པར་བྱང་ཆུབ་སེམས་དཔའ་འམ། བརྒྱ་བྱིན་ནམ། ཚངས་པ་འམ། འཇིག་རྟེན་སྐྱོང་བ་གང་དག་འཇིག་རྟེན་གྱི་ཁམས་\nགཞན་ནས་ལྷགས་པ་དེ་དག་གིས་ནི་བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པའི་རྒྱབ་ན་ལག་ན་རྡོ་རྗེ་རྡོ་རྗེ་ཐོགས་ཤིང་རྟག་ཏུ་འདུག་པར་མཐོང་ང་<span class='add'>    </span>ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་\nབྱམས་པ་དང་། བསྐལ་པ་བཟང་པོ་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱིས་སྤྲུལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དག་སྤྲུལ་ཀྱང་དེ་དག་ཐམས་ཅད་ཀྱི་རྒྱབ་ན་ཡང་གསང་བ་པའི་"
 ],
 [
  "78.167a",
  "བདག་པོ་ལག་ན་རྡོ་རྗེ་གནས་པར་སྣང་སྟེ་བྱིན་གྱི་བརླབས་དེ་དག་ཐམས་ཅད་ནི་གསང་བ་པའི་བདག་པོའི་ཡིན་ནོ། །ཤཱ་རིའི་བུ་ད་བཞིན་གཤེགས་པས་སྤྲུལ་པ་གང་ཡིན་པ་དེ་\nདག་གི་རྒྱབ་ན་ཡང་འདིའི་བྱིན་གྱིས་བརླབས་ཀྱིས་གསང་བ་པའི་བདག་པོ་ལན་རྡོ་རྗེ་གནས་ཏེ། ཤཱ་རིའི་བུ་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེ་ནི་དེ་ལྟར་ཡེ་ཤེས་དང་མངོན་<span class='add'>  པར་  </span>ཤེས་པའི་བྱིན་གྱིས་བརླབས་ཀྱི་\nསྟོབས་དང་ལྡན་ནོ། །གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེའི་ཡོན་ཏན་ཡོངས་སུ་བརྗོད་པའི་ལེའུ་ཞེས་བྱ་བ་སྟེ་བཅུ་པའོ། །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཞི་བའི་བློ་གྲོས་\nཀྱིས་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །གསང་བ་པའི་བདག་པོ་བྱང་ཆུབ་སེམས་དཔའི་དཀའ་བ་སྤྱོད་པ་དང་། བྱང་ཆུབ་ཀྱི་སྙིང་པོར་འགྲོ་བ་དང་། བདུད་\nའདུལ་བ་དང་། ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བ་དང་། བཀོད་པ་བསྟན་པ་ལ་བརྩམས་ཏེ། དེ་ན་རྨད་དུ་བྱུང་བའི་རྒྱུ་གང་དག་བྱུང་བ་གང་དུ་ཁྱོད་ལ་མངོན་སུམ་དུ་གྱུར་པ་ལ་ཁྱོད་སྤོབས་\nཔར་གྱིས་ཤིག །གསང་བ་པའི་བདག་པོས་སྨྲས་པ། ཞི་བའི་བློ་གྲོས་བྱང་ཆུབ་སེམས་དཔའི་ཡོན་ཏན་བཀོད་པ་བྱུང་བ་ནི་ཚད་མེད་དེ་དེ་དག་ནི་ཚེའི་ཚད་བསྐལ་པར་གནས་པས་ཀྱང་\nརྒྱས་པར་རྣམ་པར་ཕྱེ་སྟེ་བསྟན་པར་སླ་བ་མ་ཡིན་མོད་ཀྱི། འོན་ཀྱང་ཅུང་ཟད་ཙམ་ཞིག་བརྗོད་པར་བྱའོ། །ཞི་བའི་བློ་གྲོས་བྱང་ཆུབ་སེམས་དཔའི་དཀའ་བ་སྤྱོད་པ་ནི་རྣམ་པ་གཅིག་\nམ་ཡིན་ཏེ། མུ་སྟེགས་ཅན་གཞོམ་པའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་སྤྱད་དོ། །དཀའ་ཐུབ་དང་། ལུས་ལ་ཡོངས་སུ་གདུང་བ་ཇི་སྙེད་དང་། ལུས་ལ་ཡོངས་སུ་གདུང་བ་ཇི་སྙེད་ཀྱིས་ཕ་རོལ་"
 ],
 [
  "78.167b",
  "མུ་སྟེགས་ཅན་དག་མངོན་པར་སྙེམས་པ་དེ་བས་ཆེས་ཁྱད་པར་དུ་འཕགས་པའམ། ཆེས་མཆོག་ཏུ་གྱུར་པའི་བྱ་བ་དང་། བརཏལ་ཞུགས་དང་། དཀའ་ཐུབ་གང་དག་དེ་དག་གིས་བྱ་བས་\nཀུན་དུ་བསྟན་པར་མི་ནུས་པ་དེ་དག་ཐམས་ཅད་བྱང་ཆུབ་སེམས་དཔས་ཀུན་དུ་བསྟན་ཏེ། །ཞི་བའི་བློ་གྲོས་དེ་ལ་ཁ་ཅིག་གིས་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྐང་པ་ཡ་ཅིག་བརྩུགས་ཏེ་\nའདུག་པར་མཐོང་། ཁ་ཅིག་གིས་ནི་ལག་པ་བཏེག་སྟེ་འདུག་པར་མཐོང་། ཁ་ཅིག་གིས་ནི་ཉི་མ་ལ་ལྟ་ཞིང་འདུག་པར་མཐོང་། ཁ་ཆིག་གིས་ནི་གདུང་བ་ལྔས་གདུང་བར་མཐོང་། །ཁ་ཅིག་\nགིས་ནི་ཙོག་ཙོག་པོར་འདུག་ཅིང་སྤོང་བ་ལ་བརྩོན་པར་མཐོང་། ཁ་ཅིག་གིས་ནི་རྐང་པ་བཙུགས་ཏེ་མི་འགུལ་བར་མཐོང་། ཁ་ཅིག་གིས་ནི་རྐང་པ་གྱེན་དུ་བསྒྲེང་སྟེ་འདུག་\nཔར་མཐོང་། ཁ་ཅིག་གིས་ནི་ཁས་བུབ་ཏུ་འདུག་པར་མཐོང་། ཁ་ཅིག་གིས་ནི་ཚེར་མའི་སྟེང་ན་ཉལ་བར་མཐོང་། ཁ་ཅིག་གིས་ནི་<span class='add'>  བ་  </span>ལང་གི་ལྕི་བའི་ནང་ན་ཉལ་བར་མཐོང་། ཁ་<span class='add'>  ཅིག་  </span>གིས་\nནི་རྡོ་ལེབ་ལ་སྐྱིལ་མོ་དཀྲུང་བཅས་ཏེ་འདུག་པར་མཐོང་། ཁ་ཅིག་གིས་ནི་བརྩིག་པ་ལ་སྙེས་པ་དང་། ཁ་ཅིག་གིས་ནི་ཤིང་ལེབ་ལ་སྙེས་པ་དང་། ཁ་ཅིག་གིས་ནི་གཏུན་ཤིང་ལ་སྙེས་པ་དང་། \nཁ་ཅིག་གིས་ནི་ཕྱག་དར་ཁྲོད་ན་ཉལ་བ་དང་། ཁ་ཅིག་གིས་ནི་ཉི་མ་ཡོངས་སུ་སྒྱུར་བ་དང་། ཁ་ཅིག་གིས་ནི་ཤིང་ལེབ་གྱོན་པ་དང་། ཁ་ཅིག་གིས་ནི་རྩྭ་ཙིར་གྱོན་པ་དང་། ཁ་ཅིག་གིས་\nནི་རྩྭ་བལ་བཇའི་གོས་གྱོན་པ་དང་། ཁ་ཅིག་གིས་ནི་རྩྭ་ཀུ་ཤའི་གོས་གྱོན་པ་དང་། ཁ་ཅིག་གིས་ནི་རི་དགས་ཀྱི་ལྤགས་པ་གྱོན་པ་དང། ཁ་ཅིག་གིས་ནི་རྩྭ་ཙིར་གྱོན་པ་དང་། ཁ་ཅིག་གིས་ནི་སྒྲེན་མོར"
 ],
 [
  "78.170a",
  "པོ་རབ་ཏུ་འཕྲུལ་གྱི་བར་། རབ་ཏུ་དགའ་ནས་འཛམ་བུའི་ཆུ་གསེར་གྱི། དྲིལ་བུའི་དྲ་བ་གསེར་གྱི་དྲར་བཅས་དང། སྒྲ་སྙན་བཅས་པས་སྟོང་གསུམ་ཐམས་ཅད་བཀབ། ཐམས་\nཅད་དོན་ལ་མི་འཇིགས་མཆོད་པའི་ཕྱིར་། དབང་སྒྱུར་དག་གིས་ལྷ་ཡི་རིན་པོ་ཆེ། རྣམ་པར་དག་ཅིང་གཟི་བརྗིད་མཐའ་ཡས་པ། འོད་གསལ་དྲི་མེད་དྲ་བ་གཅིག་ཀྱང་སྤྲུལ། ཀླུ་དང་དྲི་ཟ་\nལྟོ་འཕྱེ་ཆེན་པོ་དང།་ ལྷ་མིན་མཁའ་ལྡིང་མི་འམ་ཅི་ཀུན་གྱིས། རང་རང་གནས་དང་བཀོད་པ་རྣམས་ཀྱིས་ནི། འདོད་ཁམས་ལེགས་པར་བརྒྱན་ནས་མཛེས་པར་བྱས། ཞི་བའི་བློ་གྲོས་\nདེ་ནས་སྟོང་གསུམ་གྱི་དབང་པོ་ཚངས་པ་ཆེན་པོ་དབང་སྒྱུར་ཞེས་བྱ་བས་བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་མངོན་དུ་ཕྱོགས་པར་མཐོང་ནས་ཚངས་རིས་ཀྱི་ལྷ་རྣམས་ལ་\nསྨྲས་པ། གྲོགས་པོ་དག་ཤེས་པར་གྱིས་<span class='add'>  ཤིག །  </span>བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གོ་ཆ་ཆེན་པོ་བསྣབས་པ། དམ་བཅས་པ་ཆེན་པོ་མ་བོར་བ། གོ་ཆ་སྲ་བ་མནབས་\nཔ། ཐུགས་ཡོངས་སུ་མ་སྐྱོ་བ། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཐམས་ཅད་ལས་ངེས་པར་བྱུང་བ། ཕ་རོལ་དུ་ཕྱིན་པ་ཐམས་ཅད་ཀྱི་ཕ་རོལ་དུ་བྱོན་པ། བྱང་ཆུབ་སེམས་དཔའི་ས་ཐམས་ཅད་\nལ་མངའ་དབང་བརྙེས་པ། བྱང་ཆུབ་སེམས་དཔའི་བསམ་པ་ཐམས་ཅད་ཤིན་དུ་རྣམ་པར་དག་པ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་དབང་པོའི་རྗེས་སུ་ཞུགས་པ། དེ་བཞིན་གཤེགས་\nཔའི་གསང་བ་ཐམས་ཅད་ལ་ཤིན་དུ་ཞུགས་པ། བདུད་ཀྱི་ལས་ཀྱི་ལམ་ཐམས་ཅད་ལས་ཡང་དག་པར་འདས་པ། དགེ་བའི་རྩ་བ་ཐམས་ཅད་ལ་གཞན་གྱི་དྲིང་མི་འཇོག་པ། དེ་བཞིན་གཤེགས"
 ],
 [
  "78.171b",
  "འདྲེན་པ་བྱང་ཆུབ་སྙིང་པོར་ཉེ་བར་གཤེགས། ལེགས་པར་ཐམས་ཅད་ལྷན་ཅིག་འདུས་ནས་ནི། ས་ཡི་གཞི་ནི་ལེགས་པར་བརྒྱན་པར་བྱ། སྟོང་གསུམ་བརྒྱན་པར་གྱུར་ལ་ལྟོས་ཤིག་ཀྱེ། \nའདོད་པའི་ཁམས་ཀྱང་བརྒྱན་པར་གྱུར་པ་ལྟོས། འདོད་པའི་ཁམས་ནི་ཇི་ལྟར་བརྒྱན་པ་བཞིན། དེ་ལྟར་གཟུགས་ཀྱི་ཁམས་ཀྱང་བརྒྱན་པར་བྱ། ཚངས་པ་རྣམས་ནི་སེམས་དང་ལེགས་\nསོ་ཞེས། རབ་ཏུ་དགའ་ནས་སྟོང་གསུམ་བརྒྱན་པར་གྱུར་། ཇི་ལྟར་འདོད་པའི་ཁམས་ན་བཀོད་སྣག་བ། དེ་བས་ལྷག་པའི་མཆོད་པ་དེ་དག་བསྟན་། མེ་ཏོག་རྣམས་ཀྱིས་བཀང་ཞིང་སྨོས་ཀྱིས་\nབཀང། རིན་ཆེན་རྣམས་ཀྱིས་མཆོད་ཅིང་སིལ་སྙན་བསྒྲགས་། ཚངས་པ་ལ་སོགས་འོག་མིན་ལྷ་ཡི་རྣམས་། རབ་ཏུ་དགའ་ནས་སྟོང་གསུམ་ཐམས་ཅད་ཀྱང། དགའ་བར་འགྱུར་དང་ཕྱག་\nབྱའི་འོས་སུ་བྱས། རང་རང་གནས་ཀྱི་གཞི་ཡང་བཀོད་པ་བྱས། ལྷ་རྣམས་ཀྱིས་ནི་གོང་ནས་གོང་དུ་ཡང། ལྷག་པ་ལྷག་པའི་རྒྱན་རྣམས་རབ་ཏུ་བསྟན་། ལྷ་ཡི་བུ་མོ་བྱེ་བ་དྲུག་བཅུ་བརྒྱས་། \nབྱང་ཆུབ་རྡོ་རྗེ་གདན་ནི་<span class='add'>  བརྒྱན་  </span>པར་བྱེད། སྤོས་ཆུ་ཡིས་ནི་ཀུན་དུ་ཆག་ཆག་འདེབས། མེ་ཏོག་སྣ་ཚོགས་དག་ཀྱང་འཐོར་བར་བྱེད། ས་གཞི་དག་ལ་རིན་ཆེན་རྣམས་ཀྱང་བཀྲམ། བྱང་<span class='add'>  ཆུབ་  </span>\nསྙིང་པོར་རྒྱན་རྣམས་རབ་ཏུ་བསྟན། ཐམས་ཅད་ཚིག་གིས་བརྗོད་པར་མི་ནུས་པ། དེ་སྙེད་ཚད་ཀྱི་བཀོད་པ་འདིར་བྱས་གྱུར། ཞི་བའི་བློ་གྲོས་བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་ཀྱི་སྙིག་པོར་\nའགྲོ་བ་ན་སྟོང་གི་དབང་པོ་ཚངས་པ་ཆེན་པོ་མི་མཇེད་ཀྱི་བདག་པོས་ཚངས་རིས་ཀྱི་ལྷ་ཐམས་ཅད་ལ་སྨྲས་པ། གྲོགས་པོ་དག་བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་མང་པོར་བརཏལ་ཞུགས་དང།"
 ],
 [
  "78.169a",
  "ནས་ཀླུང་ནེ་རན་ཛ་ན་ནས་བྱུང་སྟེ་འདུག་པར་གྱུར་ཏོ། །དེ་ན་གྲོང་མིའི་བུ་མོ་ལེགས་སྐྱེས་མ་ཞེས་བྱ་བ་དེས་བ་སྟོང་གི་འོ་མ་བསྐོལ་བ་སྦྲང་རྩི་དང་བསྲེས་པའི་འོ་ཐུག་ཁྱེར་ཏེ་\nབྱང་ཆུབ་སེམས་དཔའ་<span class='add'>  ག་ལ་  </span>བ་དེར་སོང་ངོ། །གཞན་ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྷིང་དང་མི་འམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་བྱེ་བ་ཕྲག་དྲུག་\nབཅུ་ཡང་རང་རང་གི་ཟས་ཐོགས་ཏེ་འཁོད་ནས་སོ་སོ་ནས་ཚིག་འདི་སྐད་ཏུ། ཀྱ་སྐྱེས་བུ་དམ་པ་བདག་གི་བཤོས་གསོལ་<span class='add'>  ཅིག   </span>ཀྱེ་བུ་དམ་པ་བདག་གི་བཤོས་གསོལ་ཅིག་ཅེས་\nཟེར་རོ། །ཞི་བའི་བློ་གྲོས་དེ་ན་བྱང་ཆུབ་སེམས་དཔའ་གྲོང་མིའི་བུ་མོ་ལེགས་སྐྱེས་མ་ལ་སོགས་པ་ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་བྱེ་བ་ཕྲག་དྲུག་བཅུ་པོ་དེ་དག་ཐམས་ཅད་ཀྱི་ཁ་\nཟས་དེ་དག་བླངས་ནས་ཐམས་ཅད་ཟོས་ཀྱང་ཕན་ཚུན་མ་མཐོང་ངོ། །ལྷའི་བུ་རེ་རེས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་བདག་གི་བཤོས་གསོལ་ཏེ། བྱང་ཆུབ་སེམས་དཔའ་བདག་གི་བཤོས་\nགསོལ་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་བར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་བར་ཤེས་སོ། །དེ་དག་ཐམས་ཅད་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་བླ་ན་མེད་པ་ཡང་དག་པར་\nརྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྨིན་པར་བྱས་པར་གྱུར་ཏེ། ཞི་བའི་བློ་གྲོས་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་ཟས་ལེན་པར་སྦྱོར་བ་དཀའ་བ་སྤྱོད་པ་ཡང་དག་འཕགས་ཞེས་བྱ་བའོ། །ཟས་ལེན་པ་སེམས་\nཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་དཀའ་བ་སྤྱོད་པ་ཡང་དག་འཕགས་ཀྱི་ལེའུ་ཞེས་བྱ་བ་སྟེ་བཅུ་གཅིག་པའོ། །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ལུས་བཀྲུས་ཏེ་ལུས་སྟོབས་དང་"
 ],
 [
  "78.172a",
  "དཀའ་ཐུབ་རྣམས་ཀྱི་སྤྱོད་པ་སྤྱད་པ་སེམས་ཅན་གྱི་མཆོག་སྐྱེས་བུ་ཆེན་པོ་འདི་བྱང་ཆུབ་ཀྱི་སྙིང་པོར་བཞུད་ཀྱིས། དེ་ལ་ཁྱེད་ཀྱིས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་\nཁམས་ཐམས་ཅད་བཀོད་པ་ཆེན་པོ་རྣམས་ཀྱིས་བརྒྱན་པར་གྱིས་<span class='add'>  ཤིག །  </span>དེ་ནས་མི་མཇེད་ཀྱི་བདག་པོ་ཚངས་པས་ཚངས་རིས་ཀྱི་ལྷའི་བུ་རྣམས་ལ་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ། །སེམས་\nཅན་རྣམ་དག་བརཏལ་ཞུགས་ཆོས་དེས་པ། ཕན་བཞེད་འཇིག་རྟེན་དོན་མཛད་བདག་ཉིད་ཆེ། དེ་ནི་བློ་ངན་སྡེ་བཅས་བདུད་འདུལ་དུ། ཤིང་གི་དབང་པོ་བྱང་ཆུབ་དྲུང་དུ་བཞུད། ཐམས་ཅད་\nའདུས་ཏེ་ལྷན་ཅིག་<span class='add'>  འདོང་  </span>བར་བྱ། སྟོང་གསུམ་མི་མཇེད་འདི་ནི་བརྒྱན་པར་བྱ། འདི་ནི་ལྷར་བཅས་འཇིག་རྟེན་ཆོས་ཀྱི་དབང། ཡང་དག་མཆོད་ན་བསོད་ནམས་མཐའ་ཡས་འགྱུར། ཚངས་\nཔ་དེ་དག་ཚིག་མཆོག་དེ་ཐོས་ནས། སྟོང་གསུམ་ཐམས་ཅད་མ་ལུས་བརྒྱན་པར་བྱེད་ཅིང། ལེགས་པར་ཕྱགས་ཏེ་མེ་ཏོག་རྒྱལ་མཚན་བརྒྱན་། འཇིག་རྟེན་ཁམས་ནི་རིན་ཆེན་རང་བཞིན་\nསྤྲུལ། ཉི་མ་ཟླ་བའི་འོད་ཀྱི་བཀོད་པ་དང། བྱ་བའི་གདུགས་རྣམས་ནམ་མཁར་དེ་དག་སྤྲུལ། ས་ལའི་ཤིང་རྣམས་མེ་ཏོག་མཆོག་སྤྲུལ་པ། དགའ་ཚལ་ལྟ་བུ་དེ་དག་རྣམས་ཀྱིས་\nསྤྲུལ། ལམ་གང་ནས་ནི་དྲང་སྲོང་ཆེ་གཤེགས་པ། དེ་ནི་ཤིང་རྟ་བདུན་བསྣམས་ཚད་དུ་སྤྲུལ། རིན་ཆེན་གཞི་ལ་གསེར་གྱི་པདྨ་བཀྲམ། ཁ་ཁྱེར་རིམ་པ་བདུན་གྱིས་ཡོངས་སུ་\nབསྐོར། བརྒྱ་བྱིན་གྱིས་དེར་བཀོད་པ་གང་བྱས་པ། དེ་དག་ལྷ་མི་རྣམས་ཀྱིས་སྔོན་མ་མཐོང། སུམ་བཅུ་གསུམ་དབང་རྣམ་རྒྱལ་ཁང་འདྲ་བར། དེ་ལྟར་གླིང་བཞི་དག་"
 ],
 [
  "78.171a",
  "བསྟན་པར་བཞེད་པ་དང། ཆོས་ཐམས་ཅད་ལ་དབང་ཕྱུག་གི་མངའ་དབང་བརྙེས་པར་མཛད་པའི་ཕྱིར་བྱང་ཆུབ་ཀྱི་སྙིང་པོར་བཞུད་ཀྱིས། དེ་ལ་གྲོགས་པོ་དག་ཁྱེད་\nབྱང་ཆུབ་སེམས་དཔའ་ལ་མཆོད་པ་དང་རིམ་གྲོ་བྱ་བ་ལ་སྤྲོ་བར་གྱིས་ཤིག། དེ་ནས་སྟོང་གསུམ་གྱི་བདག་པོ་ཚངས་པ་ཆེན་པོ་མི་མཇེད་གྱི་བདག་པོ་དེ་ཡིད་རབ་ཏུ་དགའ་ནས་ཚངས་\nརིས་ཀྱི་ལྷ་ཐམས་ཅད་ལ་སྨྲས་པ། གྲོགས་པོ་དག་བསྐལ་པ་བརྒྱ་སྟོང་མང་པོར་བརཏལ་ཞུགས་དང་དཀའ་ཐུབ་བསགས་པ་། སྐྱེས་བུ་ཆེན་པོ་དམ་པ་དེ་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ག་<span class='add'>  ལ་བ་  </span>དེར་\nབཞུད་ཀྱིས་དེ་ལ་ཁྱོད་ཀྱིས་བཀོད་པ་ཆེན་པོ་རྣམས་ཀྱི་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོ་ཐམས་ཅད་བརྒྱན་པར་གྱིས་ཤིག། དེ་ནས་ཚངས་པ་ཆེན་པོ་མི་མཇེད་ཀྱི་བདག་པོ་དེའི་ཚེ་\nཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ། སེམས་ཅན་རྣམ་དག་བརཏལ་ཞུགས་ཆོས་དེས་<span class='add'>  པ།   </span>ལྷར་བཅས་འཇིག་རྟེན་དག་ལ་ཕན་བཞེད་པ། ལྷ་དང་མི་ཡིས་མཆོད་པ་ལྷ་ཡི་ལྷ། ཐུབ་\nཔ་ཆེན་པོ་བྱང་ཆུབ་སྙིང་པོར་གཤེགས། སྡེ་དང་བཅས་པའི་བདུད་ནི་གདུལ་བ་དང། ཐམས་ཅད་མཁྱེན་ཀྱི་ཡེ་ཤེས་འཚང་རྒྱ་དང། རྫོགས་པའི་སངས་རྒྱས་ཆོས་རྣམས་ཡོངས་བཀང་\nདང། དམ་པའི་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བ་དང། མཁས་པ་སེང་གེའི་སྒྲ་ཆེན་བསྒྲག་པ་དང། སེམས་ཅན་ཐམས་ཅད་ཚིམ་པར་བྱ་བ་དང། དམ་པའི་ཆོས་མིག་ཡོངས་སུ་སྦྱང་བའི་ཕྱིར། \nའདྲེན་པ་བྱང་ཆུབ་སྙིག་པོར་ཉེ་བར་གཤེགས། ཕས་ཀྱི་རྒོལ་བ་རྣམས་ནི་ཚར་གཅད་པ་དང། སྔོན་གྱི་དམ་བཅས་ཡོངས་སུ་བཀང་བ་དང། རྫོགས་སངས་རྒྱས་ཀྱི་མཛད་པ་བསྟན་པའི་<span class='add'>  ཕྱིར། །  </span>"
 ],
 [
  "78.173a",
  "གྱུར་། ཁོ་བོས་སྔོན་གྱི་སངས་རྒྱས་ཀྱི། ལྟས་བཟང་མཐོང་བ་ལྟར་ན་ནི། གདོན་མི་ཟ་བར་དཔའ་ཆེན་པོ། སངས་རྒྱས་འཇིག་རྟེན་འབྱུང་བར་འགྱུར་། ལེགས་པར་ཕྱེ་མ་ཕྲེང་བ་དང། \nསྤོས་དང་མེ་ཏོག་བྱུག་པ་དང། གསེར་དང་ནོར་བུ་མུ་ཏིག་དང། །དུང་དང་རྒྱབ་ཕྲེང་མཆོག་རྣམས་དང། རོལ་མོ་སིལ་སྙན་རྣམ་ཐོགས་ལ། གདུགས་དང་རྒྱལ་མཚན་ཐོགས་ནས་ནི། བ་དན་དག་\nཀྱང་བསྒྲེང་བྱོས་ཏེ། སྟོན་པ་ལ་ནི་མཆོད་པ་བྱ། ཀླུ་ཡི་རྒྱལ་པོའི་གནས་འདི་ན། བཟང་པོའི་རྒྱན་རྣམས་ཇི་སྙེད་པ། དེ་དག་རབ་ཏུ་དགའ་བ་ཡིས། སངས་རྒྱས་ལ་ནི་རིམ་གྲོ་བྱ་། དེ་ནས་ཀླུའི་རྒྱལ་\nཔོ་ནག་པོ་ཆུང་མའི་འཁོར་དང་བཅས་། གཉེན་གྱི་འཁོར་དང་བཅས་ཏེ། མེ་ཏོག་དང་།སྤོས་དང་ཕྲེང་བ་དང། བྱུག་པ་དང། ཕྱེ་མ་དང། གོས་དང། གདུགས་དང། རྒྱལ་མཚན་དང་། བ་དན་\nཐོགས་པ་དང། སིལ་སྙན་དང། ཕེག་རྡོབ་པ་དང། རོལ་མོའི་སྒྲ་འབྱིན་པ་རྣམས་དང་ལྷན་ཅིག་ཏུ་རང་གི་གནས་ནས་བྱུང་སྟེ་སྤོས་ཆུས་གང་བའི་སྤྲིན་མངོན་པར་སྤྲུལ་ནས་སྤོས་ཆུའི་ཆར་པ་ནི་<span class='add'>  འབེབས།   </span>\nཀླུའི་མུ་ཏིག་དང། ཀླུའི་མེ་ཏོག་གི་ཆར་ནི་འབེབས་ཤིག་ཀླུའི་མཐུ་ཆེན་པོ་དང། ཀླུའི་རྫུ་འཕྲུལ་ཆེན་པོས་བྱང་ཆུབ་སེམས་དཔའ་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས་འཁོར་དང་བཅས་པས་བྱང་ཆུབ་\nསེམས་དཔའ་ལ་མཆོད་པ་བྱས་ཏེ་ཞབས་ལ་ཕྱག་འཚལ་ནས་རོལ་མོ་དང། སིལ་སྙན་ལེན་པ་དང། བཅས་པས་བྱང་ཆུབ་སེམས་དཔའ་ལ་བསྐོར་བ་བྱས་ཏེ་ཕྱོགས་གཅིག་ཏུ་འདུག་ནས་མངོན་\nཔར་བསྟོད་དོ། དེ་ལ་འདི་སྐད་ཅེས་བྱ་སྟེ། སྐྱེས་བུ་མཆོག་གི་འོད་ནི་རབ་བཀྱེ་བས། །སངས་རྒྱས་ཞིང་འདི་ཐམས་ཅད་སྣང་བར་གྱུར། སྐད་ཅིག་དེ་ལ་ངན་སོང་གསུམ་ཡང་ཞི། ནག་པོའི་"
 ],
 [
  "78.173b",
  "གནས་ཀྱང་འོད་ཀྱིས་ཁྱབ་པར་གྱུར། ཀླུ་ཡི་རྒྱལ་པོ་དེ་ཡིས་འོད་མཐོང་ནས་། རབ་ཏུ་དགའ་སྟེ་དེ་ཚེ་ཚིག་སྨྲས་པ། གསེར་གྱི་མདོག་གི་འོད་འདི་བྱུང་ལགས་ན། དེ་རིང་སངས་རྒྱས་འབྱུང་\nདུ་གདོན་མི་ཟ་། ཀླུ་མོ་ཁྲག་<span class='add'>  ཁྲིག་དག་  </span>གིས་མདུན་བདར་ཏེ། གདུགས་དང་མེ་ཏོག་གོས་མཆོག་ཐོགས་ནས་སུ། བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ག་ལར་སོང། ཕྱག་བྱས་མཆོད་པ་བྱས་ནས་\nགུས་བཅས་འདུག། ས་ཀུན་རིན་ཆེན་མེ་ཏོག་རྣམས་ཀྱིས་གང་ཤིང་དེ་ཚེ་མཛེས་པར་བརྒྱན། ཤིང་མཆོག་ཀུན་དང་སྨན་དང་རྩྭ་རྣམས་དེ་དག་བྱང་<span class='add'>  ཆུབ་  </span>ཤིང་ལ་འདུད་། འདི་ན་ཡོད་པའི་ཆུ་\nཀླུང་ཐམས་ཅད་མི་འབབ་མཁའ་ལ་རླུང་མི་ལྡང་། དེ་རིང་བདུད་བཏུལ་ནས་ནི་འཇིག་རྟེན་ཐམས་ཅད་ཟིལ་གྱིས་གནོན་པར་འགྱུར་སྲིད་པ་གསུམ་ན་བརྒྱ་བྱིན་ཚངས་པ་ཉི་མ་ཟླ་བའི་འོད་མི་སྣང། \nམཚུངས་མེད་ཁྱོད་ཀྱི་འོད་རེག་ནས་དེ་རིང་ངན་སོང་<span class='add'>  གསུམ་  </span>པོ་ཞི། བདག་གི་གནས་སུ་འོད་བྱུང་ནས་ནི་སངས་རྒྱས་འབྱུང་བར་སྟོན་པར་བགྱིད། །དེ་རིང་རྒྱལ་བ་བྱོན་པར་འགྱུར་གྱིས་\nདགྱེས་མཛོད་རང་ཤིང་ཚིམ་པ་སྐྱེད། བུམ་པ་གང་བ་འདི་དག་ནམ་མཁར་སོང་སྟེ་ཁྱོད་ལ་སྐོར་བ་དང། ཙ་ཤའི་ཚོགས་རྣམས་འདི་དག་ནམ་མཁར་སོང་སྟེ་ཁྱོད་ལ་སྐོར་བ་དང། ལྷར་\nབཅས་མིར་བཅས་འཇིག་རྟེན་དག་ཀྱང་མཆོད་པར་བརྩོན་པར་གནས་པ་ལས། དེ་རིང་འགྲོ་བའི་སྦྱིན་གནས་འགྱུར་ཞིང་ཤེས་རབ་འདོད་པའི་ལམ་དུ་འགྱུར། བདེ་བར་གཤེགས་པ་བདག་\nགིས་རྙེད་པ་ལེགས་རྙེད་གཟི་བརྗིད་ཆེ་ལྡན་པ། མི་མཆོག་འཁོར་བ་འཇིག་དང་དེ་བཞིན་གསེར་ཐུབ་ཅེས་ནི་བྱ་བ་མཆོད། མི་མཆོག་འོད་སྲུང་དང་ནི་ཤཱཀྱ་མཆོག་ཁྱོད་དེ་རིང་བདག་གིས་<span class='add'>  མཆོད། །  </span>"
 ],
 [
  "78.172b",
  "ནི་མཛེས་པར་བརྒྱན། འཐབ་བྲལ་ལྷ་དང་དགའ་ལྡན་འཕྲུལ་བ་དང། གཞན་འཕྲུལ་པ་དང། འོག་མིན་ལྷ་ཡི་རྣམས་། སྟོབས་དང་ཤུགས་འཆང་ཐམས་ཅད་བརྩོན་པར་ནི། བྱང་ཆུབ་སྙིང་པོ་\nདམ་པ་རྒྱན་པར་བྱེད། བྱང་ཆུབ་སྙིང་པོར་གཤེགས་པའི་བར་དེར་ནི། འདོད་པའི་ཁམས་འདིར་དཀོན་མཆོག་གང་ཡོད་པ། ལྷ་འམ་ཀླུ་འམ་མི་འམ་ཅི་རྣམས་ཀྱི། དེ་དག་ཐམས་ཅ་སྐད་\nཅིག་དེ་ལ་བསྟན། ཕྱོགས་བཞི་དག་ནས་ལྷ་མོ་བྱེ་བ་ལྷགས། མེ་ཏོག་རྣམས་དང་སྤོས་དང་བྱུག་པ་ཡིས། བྱང་ཆུབ་ཤིང་ནི་མངོན་དུ་རྒྱན་པར་བྱེད། སྤོས་ཆུས་ཡིས་ནི་ཀུན་དུ་ཆག་ཆག་<span class='add'>  འདེབས། །  </span>\nབྱང་ཆུབ་ཤིང་ནི་ལེགས་པར་བརྒྱན་བྱས་ཏེ། སུམ་བཅུ་རྩ་གསུམ་ལྷ་ཡི་ཡོངས་འདུ་འདྲ། ལྷ་རྣམས་བྱེ་བ་དག་གིས་མཛེས་སྤྲུལ་པ། བཀོད་པ་དེ་དག་ཚིག་གིས་བརྗོད་མི་ནུས། ཞི་བའི་བློ་\nགྲོས་དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་ཀྱི་སྙིང་པོར་འགྲོ་བ་ན་རྐང་པའི་མཐིལ་འཁོར་ལོ་རྩིབས་སྟོང་པ་གཉིས་ལས་འདི་འདྲ་བའི་འོད་ཕྱུང་སྟེ་འོད་དེས་སེམས་ཅན་དམྱལ་བ་དང། \nདུད་འགྲོའི་སྐྱེ་གནས་དང། གཤིན་རྗེའི་འཇིག་རྟེན་པའི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྡུག་བསྔལ་གྱི་ཚོར་བ་རྣམས་རྒྱུན་བཅད་དོ། །ཀླུའི་རྒྱལ་པོ་ནག་པོའི་གནས་ཀྱང་སྣང་བ་ཆེན་པོས་\nཁྱབ་པར་གྱུར་ཏོ། །དེ་ནས་ཀླུའི་བདག་པོ་ནག་པོས་བྱང་ཆུབ་སེམས་དཔའི་འོད་མཐོང་ནས་། ཚིམ་ཞིང་མགུ་ལ་ཡིད་རངས་ཏེ། རབ་ཏུ་དགའ་ནས་། དགའ་བ་དང་ཡིད་བདེ་བ་སྐྱེས་ཏེ་ཐམས་ཅད་དང་\nལྡན་པའི་རང་གི་འཁོར་ལ་ཚིགས་སུ་བཅད་པས་སྨྲས་པ། གསེར་གྱི་ཁ་དོག་འདྲ་བའི་འོད། གནས་འདིར་ལྷང་དེར་གྱུར་པས་ན། ཁོ་བོའི་ལུས་ནི་རབ་ཏུ་ཚིམ། སེམས་ཀྱང་རབ་ཏུ་དགའ་བར་"
 ],
 [
  "78.174a",
  "བདག་ནི་སངས་རྒྱས་དཔའ་མཐོང་མ་བྲལ་བྱང་ཆུབ་དམ་པ་དོན་དུ་གཉེར་། ས་ནི་གྲུམ་ཞིང་རི་རྣམས་གཡོས་ལ་འགྲོ་བ་ཐམས་ཅད་མེད་འགྱུར་སྲིད། སུ་ཞིག་བྱང་ཆུབ་ཏུ་\nནི་སེམས་དེས་ལྷག་པའི་བསམ་<span class='add'>  པས་  </span>འཕགས་གྱུར་པ། དེ་ནི་དེ་རིང་སྟོབས་བཅུ་ལྡན་པར་མི་འགྱུར་གནས་ནི་མཆིས་མ་ལགས། སེང་གེའི་སྒྲ་བསྒྲགས་ཚངས་པའི་དབྱངས་ཅན་བཅོམ་\nལྡན་འདྲེན་པ་གསུང་ཕྱུང་ཤིག །ཞི་བའི་བློ་གྲོས་དེ་ནས་ཀླུའི་རྒྱལ་པོ་ནག་པོའི་ཆུང་མ་དམ་པ་གསེར་འོད་ཅེས་བྱ་བ་དེ་ཀླུའི་བུ་མོ་རབ་ཏུ་མང་པོས་བསྐོར་ཅིང་མདུན་དུ་བདར་ནས་གདུགས་\nསྣ་ཚོགས་ཐོགས་པ་དང་། རས་བཅོས་བུ་སྣ་ཚོགས་ཐོགས་པ་དང་། མུ་ཏིག་གི་རྒྱན་ཕྲེང་སྣ་ཚོགས་ཐོགས་པ་དང་། ནོར་བུ་རིན་པོ་ཆེ་སྣ་ཚོགས་ཐོགས་པ་དང་། ལྷའི་དང་མིའི་ཕྲེང་བ་བརྒྱུས་\nཔ་ཐོགས་པ་དང་། པོག་པོར་སྣ་ཚོགས་ཐོགས་པ་དང་། སིལ་སྙན་དང་། རོམ་མོའི་སྒྲ་སྣ་ཚོགས་ལེན་པ་རྣམས་དང་ལྷན་ཅིག་ཏུ་རིན་པོ་ཆེའི་མེ་ཏོག་སྣ་ཚོགས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་འོད་\nབ་ལ་འཐོར་ཞིང་ཚིགས་སུ་བཅད་པ་འདི་དག་གིས་མངོན་པར་བསྟོད་དོ། །འཁྲུལ་པ་མི་མངའ་མི་དངང་མི་བསྙེངས་བག་མི་ཚ། མ་ཞུམ་མི་དམན་རབ་དགྱེས་མི་ཐུབ་ཆགས་མི་<span class='add'>  མངའ། །  </span>\nསྡང་དང་མོངས་དང་བརྐམ་པ་མི་མངའ་ཆགས་བྲལ་པ། རྣམ་གྲོལ་དྲང་སྲོང་ཆེན་པོ་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །དོགས་བྲལ་ཟུག་རྔུ་བྲལ་ཞིག་དུལ་ལ་མ་རིག་སེལ། འགྲོ་བ་ཐམས་ཅད་\nསྡུག་བསྔལ་རྣམས་ལས་རབ་ཏུ་འགྲེལ། གནས་དང་སྐྱབས་དང་གླིང་མ་མཆིས་པ་མཁྱེན་ནས་ནི། གནས་ཁྱོད་སྐྱབས་ཁྱོད་འཇིག་རྟེན་གསུམ་པོ་དག་ཏུ་བྱུང། ཇི་ལྟར་ལྷ་ཡི་ཚོགས་"
 ],
 [
  "78.174b",
  "རྣམས་དད་ཅིང་རབ་དགའ་སྟེ། མཁའ་ལས་མེ་ཏོག་ཆར་ཆེན་རབ་ཏུ་འབེབས་པ་དང། ཇི་ལྟར་གོས་ཆེན་དག་ཀྱང་འདོར་བར་བགྱིད་ལགས་ན། དྲང་སྲོང་ཆེན་པོ་མགོན་པོ་རྒྱལ་བར་དེར་\nའགྱུར་སྙམ་། དགྱེས་སྐྱེད་ཤིང་དབང་དྲུང་གཤེགས་མི་བསྙེངས་བཞུགས་མཛོད་ལ། བདུད་སྡེ་ཕམ་པར་མཛོད་དེ་ཉོན་མོངས་དྲ་བ་དྲོལ། ཇི་ལྟར་སྔོན་གྱི་རྒྱལ་དབང་དེ་དག་སངས་རྒྱས་\nཔ། དེ་ལྟར་བྱང་ཆུབ་རབ་མཆོག་ཞི་བ་འཚང་རྒྱར་མཛོད། གང་གི་དོན་དུ་ཁྱོད་ཀྱིས་བསྐལ་པ་བྱེ་མང་དུ། འགྲོ་བ་དག་ནི་དགྲོལ་ཕྱིར་དཀའ་བ་རྣམས་ཀྱང་སྤྱད། ཁྱོད་ཀྱི་དགོངས་པ་\nདེ་རྫོགས་ཤིག་དབང་དྲུང་གཤེགས་ཏེ། བྱང་ཆུབ་མཆོག་ལ་རེག་པར་མཛད་པའི་དུས་འདི་ལགས། བམ་པོ་དྲུག་པ། ཞི་བའི་བློ་གྲོས་དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཀླུའི་རྒྱལ་\nཔོ་ནག་པོའི་གནས་ན་བྱུང་ནས་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ག་ལ་དེར་སོང་སྟེ་འགྲོ་བ་ན་ལམ་གྱིས་གཡས་རོལ་ན་རྩྭ་<span class='add'>  འཚོང་  </span>བཀྲ་ཤིས་པ་ཞེས་བྱ་བ་བརྩྭ་<span class='add'>  བརྔ་ཞིང་  </span>འདུག་པ་དེས་བྱང་ཆུབ་སེམས་དཔའ་\nབྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་མངོན་དུ་ཕྱོགས་པ་མཐོང་སྟེ། ལྷ་རྣམས་ཀྱིས་བསྐུལ་ནས་རྩཱ་འཇམ་པ། ཤིན་དུ་གཞོན་པ། ཉམས་དགའ་བ། ཡིད་དགའ་བར་བྱེད་པ། རྨ་བྱའི་མགྲིན་པ་ལྟ་བུ་\nདགའ་བ་འཁྱིལ་པ། གཡས་སུ་འཁྱིལ་པ། ཁ་དོག་དང་ལྡན་པ། དྲི་དང་ལྡན་པ། ཀ་ཙ་ལིན་དི་ཀ་ལྟར་རེག་ན་བདེ་བ་སྤྲ་གང་བླངས་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་ག་ལ་དེར་སོང་ནས་ཕྱིན་པ་<span class='add'>  དང་།   </span>\nརྩྭ་སྤར་གང་བྱང་ཆུབ་སེམས་དཔའ་ལ་བྱིན་ཏེ། བསམ་པ་ཐག་པ་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ། ཞི་བའི་བློ་གྲོས་ཁྱོད་རྩྭ་<span class='add'>  འཚོང་  </span>བ་བཀྲ་ཤིས་པ་མི་"
 ],
 [
  "78.175b",
  "རྩྭ་<span class='add'>  འཚོང་  </span>བཀྲ་ཤིས་པ་འདི་དེའི་ཚེ་དེའི་དུས་ན་ཁྱིམ་བདག་བློ་གྲོས་ལྡན་ཞེས་བྱ་བར་གྱུར་ཏོ། །ཞི་བའི་བློ་གྲོས་ཁྱོད་ཀྱིས་རྣམ་གྲངས་འདིས་ཀྱང་རྩྭ་འཆོང་བཀྲ་ཤིས་པའི་སྔོན་གྱི་སྨོན་ལམ་འདི་ལྟར་རིག་པར་\nབྱ་སྟེ། སེམས་ཅན་རྣམས་ཀྱི་མོས་པ་ཇི་ལྟ་བ་<span class='add'>  དང་།   </span>དབང་པོ་ཡོངས་སུ་སྨིན་པ་ཇི་ལྟ་བུ་བཞིན་དུ་དེ་ཁ་ཅིག་ལ་ནི་རྩྭ་སྤར་གང་འབུལ་བར་འགྱུར། ཁ་ཅིག་ལ་ནི་རིན་པོ་ཆེ་བཀོད་པའི་སེང་གེའི་ཁྲི་འབུལ་བར་\nའགྱུར་རོ། །ཞི་བའི་བློ་གྲོས་དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་ཀྱི་སྙིག་པོའི་ཤིང་དྲུང་དུ་སོང་བ་དང་། བྱང་ཆུབ་ཀྱི་སྙིང་པོའི་ལྷ་རྣམས་ལྷའི་བུ་མོ་མེ་ཏོག་གི་སྐོན་བུ་ཐོགས་པ་དང། སྤོས་དང་། ཕྱེ་མའི་\nཕུར་མ་ཐོགས་པ་ཁྲི་དང་ལྷན་ཅིག་ཏུ་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་རྐང་པ་ལ་མགོ་བོས་ཕྱག་འཚལ་ནས་ཇི་ལྟར་ཐོགས་པའི་མེ་ཏོག་དང་། ཕྱེ་མ་དང་། \nསྤོས་དང་། ཕྲེང་བ་དང་། བྱུག་པ་རྣམས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་ལ་གཏོར་ཏེ་ཚིགས་སུ་བཅད་<span class='add'>  པ་  </span>འདི་དག་གིས་མངོན་པར་བསྟོད་དོ། །བདག་ཉིད་ཆེན་པོ་མ་བསྙེངས་དཔའ་ཞིང་དུལ་ཞི་བ། དགྱེས་\nཤིང་ཚིམ་པ་བརྟན་པ་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །འབར་བ་ཉམས་དགྱེས་ཁ་ན་མ་ཐོ་<span class='add'>  མི་  </span>མངའ་བ། སྐྱོན་ལས་གྲོལ་བའི་སྟོན་པ་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །སྡུག་བསྔལ་ཆེན་པོར་བྱིང་བ་མགོན་མེད་འགྲོ་\nའདི་ལ། ཁྱོད་ནི་བདེ་བ་རབ་ཏུ་སྩོལ་བའི་མགོན་པོ་གཅིག །འགྲོ་བའི་ཉོན་མོངས་ནད་རྣམས་སྤང་པའི་ཕྱིར་བྱུང་བ། སྨན་པའི་རྒྱལ་ཆེན་གྲགས་ལྡན་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །ཇི་ལྟར་ལྷ་ཚོགས་དད་ཅིག་\nརབ་ཏུ་དགའ་བ་ཡིས། ལྷ་ཡི་མེ་ཏོག་ཆར་པ་རབ་ཏུ་འབེབས་པ་ལས། བདུད་དག་སྡེ་དང་བཅས་པ་བྱམས་པས་བཅོམ་ནས་ནི། ཁྱོད་ཀྱིས་བྱང་ཆུབ་དམ་པ་དེ་རིང་བརྙེས་སུ་དེས། ཤིང་དབང་དྲུང་དུ་"
 ],
 [
  "78.175a",
  "སྔ་མི་འཕྱི་བར་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ཅིང་རྩྭ་ཡང་བྱིན་ནོ་སྙམ་དུ་སེམས་ན་དེ་ལྟར་མི་བལྟའོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་རྩྭ་<span class='add'>  འཚོང་  </span>བཀྲ་ཤིས་པའི་སྔོན་གྱི་སྨོན་ལམ་ཡིན་ཏེ། ཇི་ལྟར་\nཁོ་བོ་བསྐལ་པ་བཟང་པོ་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བྱང་ཆུབ་ཀྱི་སྙིང་པོར་ཁྲི་ཤོམ་<span class='add'>  པ་  </span>བཞིན་ནོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཞི་བའི་བློ་གྲོས་ཁོ་བོས་མངོན་<span class='add'>  པར་  </span>ཤེས་ཏེ་འདས་པའི་དུས་ན་བསྐལ་པ་བཟང་པོ་འདིའི་སྔ་\nརོལ་བསྐལ་པ་དགུ་བཅུ་རྩ་གཅིག་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ་སྐྱེས་བུ་\nའདུལ་བའི་ཁ་ལོ་སྒྱུར་<span class='add'>  བ།   </span>བླ་ན་མེད་པ་ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམ་པར་གཟིགས་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱང་སྟེ། དེའི་གསུང་རབ་ལ་དགེ་སློང་སྟོང་ཐམས་\n<span class='add'>  པ་  </span>ཚངས་པར་སྤྱོད་པ་<span class='add'>  སྤྱད་  </span>ནས་བཅོམ་ལྡན་འདས་དེས་ཁྱོད་ཅག་བསྐལ་པ་བཟང་པོ་ལ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་འཚང་རྒྱ་བར་འགྱུར་རོ་ཞེས་དེ་དག་ལུང་\nབསྟན་ཏོ། དེའི་ཚེ་ན་ཁྱ་མི་བདག་བློ་གྲོས་ལྡན་ཞེས་བྱ་བ་ཞིག་འཁོར་དེ་ཉིད་དུ་འདུས་པར་གྱུར་ཏེ་འདུས་པ་དེས། བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ལུང་བསྟན་པ་དེ་ཐོས་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་\nཔའི་བྱང་ཆུབ་དུ་སེམས་བསྐྱེད་དེ། འདི་སྐད་དུ་བསྐལ་པ་བཟང་པོ་པའི་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་བྱང་ཆུབ་ཀྱི་སྙིང་པོར་འགྲོ་བ་ན་སེང་གེའི་ཁྲི་བྱི་དོར་བྱའོ་ཞེས་སྨོན་ལམ་བཏབ་བོ། །ཞི་བའི་བློ་གྲོས་\nདེའི་ཚེ་དེའི་དུས་ན་ཁྱིམ་བདག་བློ་གྲོས་ལྡན་ཞེས་བྱ་བར་འགྱུར་པ་དེ་གཞན་ཞིག་ཡིན་པ་སྙམ་དུ་ཁྱོད་དོགས་ཤིང་ཐེ་ཚོམ་ཟ་བ་འམ། ཡིད་གཉིས་སུ་གྱུར་ན་ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟའོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།"
 ],
 [
  "78.178b",
  "རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཀྱི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་མངོན་དུ་བྱས་ཏེ་དྲན་པ་དང་ལྡན་ཞིང་ཤེས་བཞིན་དུ་ས་ཆེན་པོ་ལ་བརྡབས་སོ། །ཞི་བའི་བློ་གྲོས་བྱང་ཆུབ་སེམས་དཔས་\nས་ཆེན་པོ་ལ་བརྡབས་མ་ཐག་ཏུ་དེ་ནས་དེའི་ཚེ་ཆེན་པོ་རྣམ་པ་དྲུག་ཏུ་གཡོས་སོ། །རབ་ཏུ་གཡོས་སོ། །ཀུན་དུ་རབ་ཏུ་གཡོས་སོ། །འགུལ་ཏོ། རབ་ཏུ་འགུལ་ཏོ། །ཀུན་དུ་རབ་ཏུ་འགུལ་ཏོ། །ལྡེག་\nགོ །རབ་ཏུ་ལྡེག་གོ །ཀུན་དུ་རབ་ཏུ་ལྡེག་གོ །འཁྲུགས་སོ། །རབ་ཏུ་འཁྲུགས་སོ། །ཀུན་དུ་རབ་ཏུ་འཁྲུགས་སོ། །འུར་འུར་རོ། །རབ་ཏུ་འུར་འུར་རོ། །ཀུན་དུ་རབ་ཏུ་འུར་འུར་རོ། །ཆེམ་ཆེམ་མོ། །རབ་ཏུ་\nཆེམ་ཆེམ་མོ། །ཀུན་དུ་རབ་ཏུ་ཆེམ་ཆེམ་མོ། །ཤར་ཕྱོགས་དམའ་ན་ནུབ་ཕྱོགས་མཐོའོ། །ནུབ་ཕྱོགས་དམའ་ན་ཤར་ཕྱོགས་མཐོའོ། །ལྷོ་ཕྱོགས་དམའ་ན་བྱང་ཕྱོགས་མཐོའོ། །བྱང་ཕྱོགས་དམའ་\nན་ལྷོ་ཕྱོགས་མཐོའོ། །མཐའ་མཐོ་ན་དབུས་དམའོ། །དབུས་མཐོ་ན་མཐའ་དམའོ། །ཞི་བའི་བློ་གྲོས་དེ་ལྟར་རྣམ་པ་དྲག་དང་། ལྟས་ཆེན་པོ་བཅྭ་བརྒྱད་<span class='add'>  དུ་ས་  </span>གཡོས་པ་ཆེན་པོ་འཇིག་རྟེན་དུ་བྱུང་བར་\nགྱུར་ཏོ། །བདུད་སྡིག་ཅན་རྣམས་ཀྱིས་ཀྱང་འུར་སྒྲ་དང་། ཏུག་ཆེམ་གྱིས་སྒྲ་ཆེན་པོ་དང་། ཟུང་ཤིག་དང་། རྒྱོབ་ཅིག་པ་དང། ཆིངས་ཤིག་པ་<span class='add'>  དང་།   </span>སོད་ཅིག་པའི་སྒྲ་ཐོས་སོ། །བདུད་ཀྱི་འཁོར་གྱིས་ནི་བྱང་\nཆུབ་སེམས་དཔའི་མཐུས་སྟེང་གི་བར་སྣང་ལ་འདི་ལྟ་བུའི་སྒྲ་འདི་ཐོས་སོ། །དྲང་སྲོང་ནང་ན་དྲང་སྲོང་མཆོག །འདི་ནི་མི་འཇིགས་སྦྱིན་པ་སྟེ། སྲོག་ཆགས་ཀུན་གྱི་སྐྱབས་ཡིན་གྱིས། འདི་ལ་སྐྱབས་\nསུ་འགྲོ་བར་གྱིས། ཞི་བའི་བློ་གྲོས་བདུད་ཀྱི་འཁོར་གྱིས་སྒྲ་དེ་ཐོས་པ་དང་། གནོད་སྦྱིན་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་བརྒྱད་བཅུ་ཁས་བུབ་ཏུ་ས་ལ་སྒྱེལ་ནས་སྐྱེས་བུ་ཆེན་པོ་ཡོངས་སུ་བསྐྱབ་ཏུ་"
 ],
 [
  "78.177b",
  "ཐུང་ཤིག དེ་ཅིའི་ཕྱིར་ཞེ་ན། སྡིག་ཅན་ཁྱེད་ནི་གྱད་སྟོབས་ཆུང་ངུ་ལ་གྱད་སྟོབས་ཆེན་པོ་བབ་པ་ལྟར་དོ་མོད་བྱང་ཆུབ་སེམས་དཔས་<span class='add'>  བརྡ  </span>བས་པར་འགྱུར་རོ། །སྡིག་ཅན་ཁྱེད་ནི་དཔའ་བོ་ཆེན་པོས་\nཕ་རོལ་གྱི་སྡེ་བཅོམ་པ་ལྟར་དོ་མོད་བྱང་ཆུབ་སེམས་དཔས་ཕམ་པར་བྱས་པར་འགྱུར་རོ། །སྡིག་ཅན་ཁྱེད་ནི་སྲིན་བུ་མེ་ཁྱེར་ལ་ཟླ་བའི་དཀྱིལ་འཁོར་བབ་པ་ལྟར་དོ་མོད་བྱང་ཆུབ་སེམས་\nདཔས་ཟིལ་གྱིས་ནོན་པར་འགྱུར་རོ། །སྡིག་ཅན་ཁྱེད་ནི་ཕུབ་མ་སྤར་གང་ལ་རླུང་མར་བབ་པ་ལྟར་དོ་མོད་བྱང་ཆུབ་སེམས་དཔས་གཏོར་བར་འགྱུར་རོ། །སྡིག་ཅན་ཁྱེད་ནི་ཤིང་ས་ལ་ཆེན་པོ་རྩ་\nབ་ནས་ཆད་པ་ལྟར་དོ་མོད་བྱང་ཆུབ་སེམས་དཔས་སྒྱེལ་པར་འགྱུར་རོ། །སྡིག་ཅན་ཁྱེར་ནི་རི་དགས་ཀྱི་ཚོགས་ལ་སེང་གེ་བབ་པ་ལྟར་<span class='add'>  དོ་  </span>མོད་བྱང་ཆུབ་སེམས་དཔས་དངངས་པར་བྱས་\nཔར་འགྱུར་རོ། །སྡིག་ཅན་ཁྱེད་ནི་བརྗེས་ཀྱི་ཆུ་ལ་ཉི་ཚན་བབ་པ་ལྟར་དོ་མོད་བྱང་ཆུབ་སེམས་དཔས་ཡོངས་སུ་ཟད་པར་བྱས་པར་འགྱུར་རོ། །སྡིག་ཅན་ཁྱེད་ནི་མི་མཛའ་བའི་གྲོང་ཁྱེར་ལ་རྒྱལ་\nཔོ་ཆེན་པོ་བབ་པ་ལྟར་དོ་མོད་བྱང་ཆུབ་སེམས་དཔས་རླག་པར་འགྱུར་རོ། །སྡིག་ཅན་ཁྱེད་ནི་མི་གཡོ་ཅན་གསད་པར་བྱ་བ་ཤོར་པ་ལྟར་དོ་མོད་བྱང་ཆུབ་སེམས་དཔས་འབྲོས་པར་བྱེད་པར་འགྱུར་\nརོ། །སྡིག་ཅན་ཁྱེད་ནི་ཚོང་པ་ལམ་རྒྱགས་མང་པོ་མེས་ཚིག་པ་ལྟར་དོ་མོད་བྱང་ཆུབ་སེམས་དཔས་མགོ་འཁོར་བར་བྱེད་པར་འགྱུར་རོ། །སྡིག་ཅན་ཁྱེད་ནི་ཆོས་ཀྱི་རྒྱལ་པོ་རྒྱལ་སྲིད་ཉམས་པ་\nལྟར་དོ་མོད་བྱང་ཆུབ་སེམས་དཔས་མྱ་ངན་བྱེད་དུ་བཅུག་པར་འགྱུར་རོ། །སྡིག་ཅན་ཁྱེད་ནི་ཁྲུང་ཁྲུང་རྒན་པོ་འདབ་མ་བྲེགས་པ་ལྟར་དོ་མོད་བྱང་ཆུབ་སེམས་དཔས་སེམས་ཁོངས་སུ་བཅུག་པར་"
 ],
 [
  "78.179b",
  "ཨ་<span class='add'>  ཤྭད་  </span>ཐར་མཐོང་ངོ་། །ཁ་ཅིག་གིས་ནི་བྱང་ཆུབ་ཀྱི་ཤིང་ཡོངས་འདུས་བརྟོལ་དུ་མཐོང་ངོ་། །ཁ་ཅིག་གིས་ནི་བྱང་ཆུབ་ཀྱི་ཤིང་རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་རང་བཞིན་ཅན་དུ་མཐོང་ངོ་། །ལྷ་དང་མི་ཁ་\nཅིག་གིས་ནི་བྱང་ཆུབ་ཀྱི་ཤིང་ཤིང་ཏ་ལ་སྲིད་ཙམ་དུ་མཐོང་ཞིང་སེང་གེའི་ཁྲི་ཤིང་ཏ་ལ་ཕྱེད་ཙམ་དུ་མཐོང་ངོ་། །ཁ་ཅིག་གིས་ནི་བྱང་ཆུབ་ཀྱི་ཤིང་ཤིང་ཏ་ལ་བདུན་སྲིད་ཙམ་དུ་མཐོང་\nཞིང་སེང་གེའི་ཁྲི་ཤིང་ཏ་ལ་ཕྱེད་དང་གཉིས་ཀྱི་སྲིད་ཙམ་དུ་མཐོང་ངོ་། །ཁ་ཅིག་གིས་ནི་བྱང་ཆུབ་ཀྱི་ཤིང་དཔག་ཚད་བརྒྱད་ཁྲི་བཞི་སྟོང་པའི་བར་དུ་མཐོང་ཞིང་སེང་གེའི་ཁྲི་དཔག་ཚད་བཞི་ཁྲི་ཉིས་\nསྟོང་པར་མཐོང་ངོ་། །ལྷ་དང་མི་ཁ་ཅིག་གིས་ནི་བྱང་ཆུབ་སེམས་དཔའ་བདུད་འདུལ་བར་མཐོང་ངོ་། །ཁ་ཅིག་གིས་ནི་བདུད་གཅིག་མཐོང་ངོ་། །ཁ་ཅིག་གིས་ནི་བདུད་རྒྱ་ཆེན་པོར་མཐོང་ངོ་། ཁ་\nཅིག་གིས་ནི་བྱང་ཆུབ་སེམས་དཔའ་བདུད་འཇོམས་པ་ལ་རྩེ་བར་མཐོང་ངོ་། །ཁ་ཅིག་གིས་ནི་བྱང་ཆུབ་སེམས་དཔའ་ནམ་མཁའི་དཀྱིལ་ན་གནས་ཤིང་ནམ་མཁའ་ལ་འདུག་པའི་བྱང་ཆུབ་ཀྱི་ཤིང་\nདྲུང་ན་སེང་གེའི་ཁྲི་ལ་འདུག་ཅིང་བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་མཐོང་སྟེ། ཞི་བའི་བློ་གྲོས་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་ཡུལ་མཐའ་མེད་\nཔ་ཡིན་ཏེ་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་མཆོག་དམ་པ་ན་འཁོད་པ་དེ་དག་གི་ཡོན་ཏན་གྱི་རྒྱའི་ཁྱད་པར་ནི་ཚད་མེད་པར་སྣང་ངོ་། །ཞི་བའི་བློ་གྲོས་བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་མཆོག་དམ་པར་\nའདུག་པ་དང་། སྔོན་འཐུན་པར་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་གྲངས་མེད་དཔག་ཏུ་མེད་པ་དག་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ཆད་མེད་གྲངས་མེད་པ་དག་ནས་ལྷགས་ཏེ། མི་འཇིགས་པའི་སྒྲ་"
 ],
 [
  "78.180a",
  "རྗོད་ཅིང་ཤིས་པའི་སྒྲ་དང་། བདེ་བའི་སྒྲ་དང། ཀུན་དགའ་བའི་སྒྲ་དང། མགྱོགས་པའི་སྒྲ་དང། མྱུར་བའི་སྒྲ་དང་། ལེགས་པའི་སྒྲ་དང་། དོན་ཡོད་པའི་སྒྲ་དང་། དཔའ་བའི་སྒྲ་དང་། \nསྐྱེས་བུ་དམ་བའི་སྒྲ་དང་། ཕྱིར་མི་ལྡོག་པའི་སྒྲ་དང་། རྒྱས་པའི་སྒྲ་དང་། བཀྲ་ཤིས་པའི་སྒྲ་དང་། མི་གདུང་བའི་སྒྲ་དང་། མ་ཞུམ་པའི་སྒྲ་དང་། སྔོན་གྱི་བསམ་པའི་སྒྲ་དང་། སྤོང་བ་དོན་\nཡོད་པའི་སྒྲ་དང་། ཡིད་བདེ་བའི་སྒྲ་དང་། རྡོ་རྗེ་ལྟར་མཁྲེགས་པའི་སྒྲ་དང་། སྐྱེས་བུ་དམ་པ་རྩེན་པའི་སྒྲ་དང་། ཕན་པའི་སྒྲ་དང། སྐད་ཅིག་གཅིག་དང་ལྡན་པའི་སྒྲ་དང་། ཐམས་ཅད་མཁྱེན་\nཔའི་ཡེ་ཤེས་ཀྱི་སྒྲ་དང་། མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པའི་སྒྲ་རྗོད་དེ། །ཞི་བའི་བློ་གྲོས་དེ་ལྟར་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་མཆོག་དམ་པ་ལ་འདུག་པའི་བྱང་ཆུབ་སེམས་དཔའ་ལ་ཕྱོགས་བཅུའི་\nའཇིག་རྟེན་གྱི་ཁམས་ནས་འདུས་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་དབུགས་འབྱིན་པ་རྣམ་པ་སྣ་ཚོགས་བརྒྱ་སྟོང་དག་གིས་དབུགས་འབྱིན་ཏོ། །མཆོད་པ་རྣམ་པ་སྣ་ཚོགས་བྱེད་དོ། །\nབསྟོད་པ་རྣམ་པ་སྣ་ཚོགས་བྱེད་དོ། །འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྔོན་ལེགས་པར་སྤྱད་པ་སྟེ་དེས་ན་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ནས་འདུས་<span class='add'>  པའི་  </span>བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་བྱང་\nཆུབ་སེམས་དཔའ་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་མཆོག་དམ་པ་ལ་འདུག་པ་ལ་དབུགས་འབྱིན་ཅིང་མཆོད་པ་བྱེད་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་དེ་ལ་ཡང་རྗེས་སུ་ཆགས་པ་མེད་ལ་བདུད་ཀྱི་སྡེ་ལ་ཡང་\nཁོང་ཁྲོ་བ་མེད་དོ། ཞི་བའི་བློ་གྲོས་བྱང་ཆུབ་སེམས་དཔའ་རྗེས་སུ་ཆགས་པ་དང་། ཁོང་ཁྲོ་བ་དང་བྲལ་བས་སྐད་ཅིག་གཅིག་དང་ལྡན་པའི་ཤེས་རབ་ཀྱིས་ཤེས་པར་བྱ་བ་དང། བལྟ་བར་བྱ་བ་<span class='add'>  དང་།   </span>"
 ],
 [
  "78.181a",
  "པས་བྱང་ཆུབ་བརྙེས་པ་དང་། རྒྱལ་པོ་ཆེན་པོ་བཞི་ལྷུང་བཟེད་རྣམས་ཐོགས་ཏེ་དེ་བཞིན་གཤེགས་པའི་གན་དུ་དོང་བར་གྱུར་ཏོ། །བཞི་གང་ཞེ་ན། ཡུལ་འཁོར་སྲུང་དང་། \nའཕགས་སྐྱེས་པོ་དང་། མིག་མི་བཟང་དང་། རྒྱལ་པོ་ཆེན་པོ་རྣམ་ཐོས་ཀྱི་བུ་སྟེ་རྒྱལ་པོ་ཆེན་པོ་བཞི་པོ་དེ་དག་གོ །གླིང་བཞི་པ་འདི་ནས་ཇི་ལྟར་དོང་བ་དེ་བཞིན་དུ་གླིང་\nབཞི་པ་བྱེ་བ་ཕྲག་བརྒྱ་ནས་རྒྱལ་པོ་ཆེན་པོ་བྱེ་བ་བྲག་ཕྲག་བཞི་བརྒྱ་ལྷུང་བཟེད་རྣམས་ཐོགས་ཏེ་དེ་བཞིན་གཤེགས་པའི་གན་དུ་དོང་ངོ་། །ཞི་བའི་བློ་གྲོས་དེ་ལ་དེ་བཞིན་གཤེགས་པས་ལྷུང་བཟེད་བྱེ་བ་\nཕྲག་བཞི་བརྒྱ་རྣམས་བཞེས་ཏེ། བཞེས་ནས་ཀྱང་ལྷུང་བཟེད་གཅིག་ཏུ་བྱིན་གྱིས་བརླབས་ནས་རྒྱལ་པོ་ཆན་པོ་རེ་རེ་ཡང་འདི་སྙམ་དུ་དེ་བཞིན་གཤེགས་པས་བདག་གི་ལྷུང་བཟེད་བཞེས་<span class='add'>  སོ། །  </span>\nདེ་བཞིན་གཤེགས་པས་བདག་གི་ལྷུང་བཟེད་དུ་གསོལ་ལོ་སྙམ་དུ་སེམས་ཏེ་། དེ་དག་དགའ་བ་དང་། མཆོག་ཏུ་དགའ་བ་དེ་ཉིད་ཀྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་\nལྡོག་པར་གྱུར་ཏོ། །ཞི་བའི་བློ་གྲོས་དེ་བཞིན་གཤེགས་པས་བྱང་ཆུབ་བརྙེས་ནས་ཚོང་པ་ག་གོན་དང་བཟང་པོ་དང་། གཞན་ཡང་ལྷའི་བུ་དྲུག་ཁྲི་དེ་བཞིན་གཤེགས་པའི་ཐོག་མའི་ཞལ་ཟས་ཐོགས་\nནས་དོང་བར་གྱུར་ཏེ། དེ་དག་ནི་སྔོན་འདི་སྐད་དུ་བདག་ཅག་གིས་དེ་བཞིན་གཤེགས་པ་ལ་ཐོག་མར་ཞལ་ཟས་དབུལ་ལོ་ཞེས་སྨོན་ལམ་བཏབ་པར་གྱུར་པ་དག་གོ །དེ་དག་གིས་དེ་བཞིན་གཤེགས་\nཔ་ལ་ཐོག་མར་ཞལ་ཟས་ཕུལ་ནས་དགའ་བ་དང་། མཆོག་ཏུ་དགའ་བ་དེ་ཉིད་ཀྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་གྱུར་ཏོ། །ཞི་བའི་བློ་གྲོས་དེ་ལྟར་བྱང་ཆུབ་སེམས་"
 ],
 [
  "78.181b",
  "དཔའ་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་མཆོག་དམ་པར་འདུག་སྟེ་ཐམས་ཅད་མཁྱེན་པ་མ་ཐོག་པ་ལས་བྱང་ཆུབ་བརྙེས་པ་<span class='add'>  དང་།   </span>དེ་བཞིན་གཤེགས་པས་ཆོས་ཀྱི་འཁོར་ལོ་མ་བསྐོར་བའི་བར་དུ་སེམས་\nཅན་གྱི་དོན་མཛད་པ་དེ་ནི་རབ་ཏུ་མང་གི །སེམས་དང་པོ་བསྐྱེད་པ་ནས་བཟུང་སྟེ་བྱང་ཆུབ་ཀྱི་སྙིང་པོར་སོང་བའི་བར་དུ་ནི་དེ་ལྟ་མ་ཡིན་ནོ། །ཞི་བའི་བློ་གྲོས་ཁྱོད་ཀྱིས་རྣམ་གྲངས་འདིས་ཀྱང་ཇི་ལྟ་\nཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་ལ་ཉེ་བར་གྱུར་པ་དེ་ལྟར་སེམས་ཅན་ཚད་མེད་པའི་དོན་བྱེད་པ་དེ་ལྟར་ཤེས་པར་བྱའོ། །ཞི་བློ་གྲོས་དེ་བཞིན་གཤེགས་པས་བྱང་ཆུབ་སེམས་བརྙེས་ནས་\nཚངས་པ་གཙུག་པུད་ཅན་ཞེས་བྱ་བ་ཚངས་རིས་ཀྱི་ལྷའི་བུ་འབུམ་ཕྲག་དྲུག་བཅུ་རྩ་བརྒྱད་ཀྱིས་བསྐོར་ཅིང་མདུན་དུ་བདར་ཏེ་ཚངས་པའི་འཇིག་རྟེན་ནས་མི་སྣང་བར་གྱུར་ནས་བཅོམ་ལྡན་འདས་ཀྱི་\nསྤྱན་སྔར་ཕྱིན་ཏེ་། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ནས་ལན་བདུན་བསྐོར་བ་བྱས་ཏེ། བཅོམ་ལྡན་འདས་ལ་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བའི་ཕྱིར་སེམས་ཅན་ཆོས་ཀྱི་སྣོད་དུ་གྱུར་པ་\nདག་མཆིས་ཏེ་དེ་དག་དེ་བཞིན་གཤེགས་པའི་ཆོས་བསྟན་པ་འཚལ་བར་འགྱུར་གྱིས་བཅོམ་ལྡན་འདས་ཀྱིས་ཆོས་བསྟན་དུ་གསོལ། བདེ་བར་གཤེགས་པས་ཆོས་བསྟན་དུ་གསོལ་ཞེས་གསོལ་\nབ་བཏབ་བོ། །དེ་ནི་སྔོན་གྱི་སྨོན་ལམ་གྱིས་གྱུར་པ་སྟེ་གང་གིས་རྒྱལ་པོ་ཡུལ་འཁོར་སྲུང་གི་བུར་ཁས་བླངས་ནས་བདག་གིས་བསྐལ་པ་བཟང་པོ་<span class='add'>  པའི་  </span>དེ་བཞིན་གཤེགས་པ་བྱང་ཆུབ་བརྙེས་པ་\nཐམས་ཅད་ལ་ཆོས་ཀྱི་བསྐོར་བར་བསྐུལ་ལོ་ཞེས་སྨོན་ལམ་བཏབ་པ་ཡིན་ནོ། །ཞི་བའི་བློ་གྲོས་ཚངས་པ་གཙུག་བུད་ཅན་ཉིད་ཀྱིས་དེ་བཞིན་གཤེགས་པ་ལ་ཆོས་ཀྱི་འཁོར་ལོ་སྐོར་བར་"
 ],
 [
  "78.176a",
  "གཤེགས་ཏེ་ཁྲི་དེར་བཞུགས་ནས་སུ། བདུད་བཏུལ་ནས་ནི་མུན་པ་ཐམས་ཅད་གཞོམ་པར་མཛོད་། ཇི་ལྟར་སྔོན་གྱི་ཐུབ་དབང་དེ་དག་སངས་རྒྱས་པ། དེ་ལྟར་བྱང་ཆུབ་ཞི་བ་\nམཆོག་རབ་འཚང་རྒྱར་མཛོད། ཇི་ལྟར་ཁྱོད་ཀྱིས་འགྲོ་བ་དགྲོལ་བའི་དོན་དུ་ནི། བསྐལ་པ་བྱེ་བར་དཀའ་མཛད་རྣམ་པར་དག་འགྱུར་བ། དྲང་སྲོང་ཆེན་པོ་ཁྱོད་ཀྱི་དགོངས་མཆོག་དེང་རྫོགས་\nཀྱིས། ཤིང་དབང་དྲུང་དུ་བཞུགས་ཏེ་བྱང་ཆུབ་འཚང་རྒྱར་མཛོད་། ཞི་བའི་བློ་གྲོས་དེ་ནས་བྱང་ཆུབ་སེམས་དཔས་རྩྭ་སྤར་གང་ཁྱེར་ནས་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་པ་དང། \nབྱང་ཆུབ་ཀྱི་ཤིང་དྲུང་དུ་བདག་ཉིད་ཀྱིས་རྩྭའི་གདིང་བ་བཏིང་ནས་བྱང་ཆུབ་ཀྱིས་ཤིང་ལ་ཕྱག་འཚལ་ཏེ་ལན་བདུན་བསྐོར་བ་བྱས་སོ། །ཞི་བའི་བློ་གྲོས་བྱང་ཆུབ་སེམས་དཔའ་རྩྭའི་གདིང་བ་བཏིང་\nམ་ཐག་ཏུ་དེ་ནས་ལྷའི་བུ་བརྒྱད་ཁྲི་བཞི་སྟོང་གིས་སེང་གེའི་ཁྲི་སྣ་ཚོགས་བལྟ་ན་སྡུག་པ། མཐོ་བ་། ཡངས་པ། རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱིས་སྤྲས་པ། རིན་པོ་ཆེའི་ཁ་ཁྱེར་<span class='add'>  ཅན།   </span>རིན་པོ་ཆེའི་\nདྲ་བ་གཡོགས་པ། རིན་པོ་ཆེའི་དྲིལ་བུ་གཡེར་ཀའི་དྲ་བ་བྲེས་པ། མུ་ཏིག་གི་རྒྱན་ཕྲེང་རབ་ཏུ་སྦྱངས་པ། རས་བཅོས་བུ་བརྒྱ་སྟོང་དུ་མ་བཏིང་བ་བརྒྱད་ཁྲི་བཞི་སྟོང་བྱང་ཆུབ་སེམས་དཔའི་\nཆེད་ཏུ་བཤམས་སོ། ཞི་བའི་བློ་གྲོས་དེ་ན་བྱང་ཆུབ་སེམས་དཔའ་སེང་གེའི་ཁྲི་བརྒྱད་ཁྲི་བཞི་སྟོང་པོ་དེ་དག་ཐམས་ཅད་ལ་བདག་ཉིད་འདུག་པར་ཀུན་དུ་བསྟན་པར་གྱུར་ཏོ། །ལྷའི་བུ་དེ་དག་\nགིས་ཀྱང་གཞན་དང་གཞན་དུ་མི་མཐོང་མི་ཤེས་ཏེ། ལྷའི་བུ་རེ་རེས་ཀྱང་འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་ནི་བདག་གི་སེང་གེའི་ཁྲི་ལ་བཞུགས་སོ། །བདག་གི་སེང་གེའི་ཁྲི་ལ་བཞུགས་ནས་བླ་ན་"
 ],
 [
  "78.182a",
  "གསོལ་བ་བཏབ་ཀྱིས་གཞན་དག་གིས་ནི་མ་ཡིན་ནོ་སྙམ་དུ་ཁྱོད་སེམས་ན་དེ་ལྟར་མི་བལྟའོ། དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཇི་ལྟར་ཚངས་པ་གཙུག་པུད་ཅན་གྱིས་གསོལ་པ་བཏབ་པ་\nདེ་བཞིན་དུ་ཚངས་པ་བྱེ་བ་ཕྲག་བཅུས་ཀྱང་དེ་བཞིན་གཤེགས་པ་ལ་གསོལ་བ་བཏབ་པར་གྱུར་ཏོ། བརྒྱ་བྱིན་བྱེ་བ་ཕྲག་བཅུ་དང་། བྱང་ཆུབ་སེམས་དཔའ་བྱེ་བ་ཕྲག་བཅུས་ཀྱང་བཅོམ་\nལྡན་འདས་ལ་ཆོས་ཀྱི་འཁོར་ལོ་སྐོར་བར་གསོལ་བ་བཏབ་པར་གྱུར་ཏོ། །གང་གི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱིས་ཆོས་ཀྱི་འཁོར་སྐོར་བར་གནང་བ་དེའི་ཚེ་ཚངས་པ་གཙུག་པུད་ཅན་གྱིས་\nགྲོང་ཁྱེར་བཱ་ར་ཎ་སཱི་དྲང་སྲོང་ལྷུང་བ་རི་དགས་ཀྱི་ནགས་སུ་བཅོམ་ལྡན་འདས་ཀྱི་སེང་གེའི་ཁྲི་འཕང་དུ་དཔག་ཚད་བཞི་ཁྲི་ཉིས་སྟོང་ཡོད་པ། རྣམ་པ་ཐམས་ཅད་ཀྱི་མཆོག་དང་ལྡན་པ། \nབཀྲ་བ། བལྟ་ན་སྡུག་པ། སེའི་སྟེང་ན་འདུག་པ་བཤམས་པར་གྱུར་ཏོ། །ཇི་ལྟར་ཚངས་པ་གཙུག་པུད་ཅན་གྱིས་དེ་བཞིན་གཤེགས་པའི་སེང་གེའི་ཁྲི་བཤམས་པར་གྱུར་པ་དེ་བཞིན་\nདུ་ཚངས་པ་བྱེ་བ་ཕྲག་བཅུ་དང་། བརྒྱ་བྱིན་བྱ་བ་ཕྲག་བཅུ་དང་། བྱང་ཆུབ་སེམས་དཔའ་འཁོར་དང་བཅས་པ་བྱེ་བ་ཕྲག་བཅུས་ཀྱང་བཅོམ་ལྡན་འདས་ཀྱི་སེང་གེའི་ཁྲི་བཀྲ་བ། བལྟ་\nན་སྡུག་པ། རྣམ་པ་ཐམས་ཅད་ཀྱི་མཆོག་དང་ལྡན་པ། བཤམས་པར་གྱུར་ཏོ། །ཞི་བའི་བློ་གྲོས་དེ་ནས་བཅོམ་ལྡན་འདས་གྲོང་ཁྱེར་ཆེན་པོ་བཱ་ར་ཎ་སཱི་ག་ལ་<span class='add'>  བ་  </span>དང་། དྲང་སྲོང་ལྷུང་\nབ་རི་དགས་ཀྱི་ནགས་ག་ལ་བ་དེར་གཤེགས་ཏེ་བྱོན་ནས་། སེང་གེའི་ཁྲི་དེ་དག་ཐམས་ཅད་ལ་བདག་ཉིད་བཞུགས་པར་ཀུན་དུ་བསྟེན་ཏོ། །་དེ་ན་རེ་རེས་ཀྱང་དེ་བཞིན་གཤེགས་པ་བདག་"
 ],
 [
  "78.183b",
  "པ་དང་། གཟུགས་ན་སྤྱོད་པའི་ལྷའི་བུ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དག་ཀྱང་འདུས་པར་གྱུར་ཏོ། །ཞི་བའི་བློ་གྲོས་དེ་ལ་གང་གི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱིས་གསུང་འདི་སྐད་དུ་ཀཽ་དི་ནྱ་མིག་མི་རྟག་\nགོ་ཞེས་བཀའ་སྩལ་པ་དེ་ལ་སྡུག་བསྔལ་གི་སྒྲས་འདུལ་བ་རྣམས་ཀྱིས་ནི་མིག་སྡུག་བསྔལ་ལོ་ཞེས་ཐོས་སོ། །བདག་མེད་པས་འདུལ་བ་རྣམས་ཀྱིས་ནི་མིག་བདག་མེད་པའོ་ཞེས་ཐོས་\nསོ། །སྟོང་པ་ཉིད་ཀྱིས་འདུལ་བ་རྣམས་ཀྱིས་ནི་མིག་སྟོང་ངོ་ཞེས་ཐོས་སོ། །ཞི་བས་འདུལ་བ་རྣམས་ཀྱིས་ནི་མིག་ཞི་བའོ་ཞེས་ཐོས་སོ། །དབེན་པས་འདུལ་བ་རྣམས་ཀྱིས་ནི་མིག་དབེན་པའོ་ཞེས་ཐོས་\nསོ། །མི་རྟག་པས་འདུལ་བ་རྣམས་ཀྱིས་ནི་མིག་མི་རྟག་པའོ་ཞེས་ཐོས་སོ། །གནས་མེད་པས་འདུལ་བ་རྣམས་ཀྱིས་ནི་མིག་གནས་མེད་པའོ་ཞེས་ཐོས་སོ། །སྒྱུ་མ་ལྟ་བུས་འདུལ་བ་རྣམས་ཀྱིས་ནི་མིག་སྒྱུ་\nམ་ལྟ་བུའོ་ཞེས་ཐོས་སོ། །མི་ལམ་ལྟ་བུས་འདུལ་བ་རྣམས་ཀྱིས་ནི་མིག་རྨི་ལམ་ལྟ་བུ་ཞེས་ཐོས་སོ། །ཆུ་ཟླ་ལྟ་བུས་འདུལ་བ་རྣམས་ཀྱིས་ནི་མིག་ཆུ་ཟླ་ལྟ་བུའོ་ཞེས་ཐོས་སོ། །མིག་ཡོར་ལྟ་བུས་འདུལ་\nབ་རྣམས་ཀྱིས་ནི་མིག་མིག་ཡོར་ལྟ་བུའོ་ཞེས་ཐོས་སོ། །བྲག་ཆ་ལྟ་བུས་འདུལ་བ་རྣམས་ཀྱིས་ནི་མིག་བྲག་ཅ་ལྟ་བུའོ་ཞེས་ཐོས་སོ། །དེ་བཞིན་དུ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་\nདང་། མངོན་པར་འདུ་བྱེད་པ་མེད་པ་དང་། མ་སྐྱེས་པ་དང་། སྐྱེ་བ་མེད་པས་འདུལ་བ་རྣམས་ཀྱིས་ནི་མིག་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་<span class='add'>  དང་།   </span>སྨོན་པ་མེད་པ་དང་། མངོན་པར་འདུ་བྱེད་པ་མེད་པ་དང་། \nམ་སྐྱེས་པ་དང་། མ་བྱུང་བར་ཐོས་སོ། །རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བས་འདུལ་བ་རྣམས་ཀྱིས་ནི་མིག་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བའོ་ཞེས་ཐོས་སོ། །མིག་ལ་ཇི་ལྟ་བ་དེ་བཞིན་དུ་ཡིད་ཀྱི་བར་དུ་ཡང་རྟེན་"
 ],
 [
  "78.182b",
  "གི་སེང་གེའི་ཁྲི་ལ་བཞུགས་སོ། །བདག་གི་སེང་གེའི་ཁྲི་ལ་བཞུགས་ནས་ཆོས་ཀྱི་འཁོར་སྐོར་བར་འགྱུར་བར་ཤེས་ཏེ། དེ་དགའ་བ་དང་མཆོག་ཏུ་དགའ་བ་དེ་ཉིད་ཀྱིས་བླ་ན་མེད་པ་ཡང་\nདག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་གྱུར་ཏོ། །བཅོམ་ལྡན་འདས་སེང་གེའི་ཁྲི་དེ་ལ་བཞུགས་མ་ཐག་ཏུ་དེ་ནས་དེའི་ཚེ་ཕྱོགས་བཅུ་མཐའ་ཡས་མུ་མེད་པའི་འཇིག་རྟེན་གྱི་\nཁམས་རབ་ཏུ་གཡོས་ཏེ་སྣང་བ་ཆེན་པོས་ཁྱབ་པར་གྱུར་ཏོ། །དེ་ནས་དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱིས་ཡུལ་མཐའ་ཡས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ལ་མཉམ་པར་བཞག་གོ །བཅོམ་ལྡན་\nའདས་ཀྱིས་ཡུལ་མཐའ་ཡས་པའི་ཏིང་ངེ་འཛིན་དེ་ལ་མཉམ་པར་བཞག་མ་ཐག་ཏུ་དེ་ནས་དེའི་ཚེ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་མཉམ་པར་གྱུར་པར་གནས་ཏེ་ལག་\nམཐིལ་ལྟར་གྱུར་ཏོ། །སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ན་སེམས་ཅན་དམྱལ་བ་པ་འམ། དུད་འགྲོའི་སྐྱེ་གནས་པ་འམ། གཤིན་རྗེའི་འཇིག་རྟེན་པ་འམ། མི་འམ། \nལྷ་འམ། སེམས་ཅན་ཇི་སྙེད་ཡོད་པ་དེ་དག་ཐམས་ཅད་དེའི་ཚེ་བདེ་བ་དང་ལྡན་པར་གྱུར་ཏེ། སེམས་ཅན་གང་ལ་ཡང་འདོད་ཆགས་ཀྱིས་གནོད་པ་མེད་ཅིང་ཞེ་སྡང་གིས་མ་ཡིན་། གཏི་མུག་\nགིས་མ་ཡིན་ཏེ། ཉོན་མོངས་པ་ཐམས་ཅད་ཀྱིས་གནོད་པ་མེད་ཅིང་གཅིག་ལ་གཅིག་ཕ་མ་ཙམ་དུ་འདུ་ཤེས་ཏེ་བྱམས་པའི་སེམས་དང་ལྡན་པར་གྱུར་ཏོ། བཅོམ་ལྡན་འདས་ཀྱིས་ཡུལ་\nབསམ་གྱིས་མི་ཁྱབ་གྱིས་<span class='add'>    </span>ཁྱབ་པའི་ཏིང་ངེ་འཛིན་དེ་ལ་མཉམ་པར་བཞག་མ་ཐག་ཏུ་དེ་ནས་དེའི་ཚེ་བཅོམ་ལྡན་འདས་ལ་ཆོས་མཉན་པའི་ཕྱིར་ཕྱོགས་བཅུ་ནས་བྱང་ཆུབ་སེམས་དཔའ་གྲངས་མེད་དཔག་"
 ],
 [
  "78.184a",
  "ཅིང་འབྲེལ་བར་འབྱུང་བའོ་ཞེས་ཐོས་སོ། །དེ་བཞིན་དུ་གཟུགས་རྣམས་དང་། སྒྲ་རྣམས་དང་། དྲི་རྣམས་དང་། རོ་རྣམས་དང་། རེག་བྱ་རྣམས་དང་། ཆོས་རྣམས་སྟོད་དོ་ཞེས་ཐོས་སོ། །ཁ་ཅིག་གིས་ནི་ཕུང་པོ་\nམི་རྟག་པ་དང་། ཁ་ཅི་གིས་ནི་ཁམས་མི་རྟག་པར་ཐོས་སོ། །ཁ་ཅིག་གིས་ནི་སྐྱེ་མཆེད་བདག་མེད་པའོ་ཞེས་ཐོས་སོ། །ཁ་ཅིག་གིས་ནི་ཕུང་པོ་མི་རྟག་པ་ཉིད་དུ་ཐོས་ལ་ཁམས་ལ་མི་རྟག་པ་ཉིད་དུ་མ་ཡིན་ནོ། །\nཁ་ཅིག་གིས་ནི་ཁམས་ལ་མི་རྟག་པ་ཉིད་དུ་ཐོས་ལ་ཕུང་པོ་མི་རྟག་པ་ཉིད་དུ་མ་ཡིན་ནོ། །ཁ་ཅིག་གིས་ནི་སྡུག་བསྔལ་གྱི་སྒྲས་རྣམ་པར་གྲོལ་ལོ། །ཁ་ཅིག་གིས་ནི་ཀུན་འབྱུང་བའི་སྒྲས་རྣམ་པར་གྲོལ་ལོ། །ཁ་ཅིག་\nནི་འགོག་པའི་སྒྲས་རྣམ་པར་གྲོལ་ལོ། །ཁ་ཅིག་ནི་ལམ་གྱི་སྒྲས་རྣམ་པར་གྲོལ་ལོ། །ཁ་ཅིག་གིས་ནི་དྲན་པ་ཉེ་བར་གཞག་པའི་གཏམ་དུ་ཐོས་སོ། །ཁ་ཅིག་གིས་ནི་ཡང་དག་པར་སྤོང་པའི་གཏམ་དུ་ཐོས་སོ། །\nཁ་ཅིག་གིས་ནི་རྫུ་འཕྲུལ་གྱི་རྐང་པའི་གཏམ་དུ་ཐོས་སོ། །ཁ་ཅིག་གིས་ནི་དབང་པོའི་གཏམ་དུ་ཐོས་སོ། །ཁ་ཅིག་གིས་ནི་སྟོབས་ཀྱི་གཏམ་དུ་ཐོས་སོ། །ཁ་ཅིག་གིས་ནི་བྱང་ཆུབ་ཀྱི་ཡན་ལག་གི་གཏམ་\n<span class='add'>  དུ་ཐོས་  </span>སོ། །ཁ་ཅིག་གིས་ནི་ལམ་གྱི་གཏམ་དུ་ཐོས་སོ། །ཁ་ཅིག་གིས་ནི་ཞི་གནས་ཀྱི་གཏམ་དུ་ཐོས་སོ། །ཁ་ཅིག་གིས་ལྷག་མཐོང་གི་གཏམ་དུ་ཐོས་སོ། །ཁ་ཅིག་གིས་ནི་བརྟེན་པའི་གཏམ་དུ་ཐོས་སོ། །ཁ་\nཅིག་གིས་ནི་ཉན་ཐོས་དང་རབ་ཏུ་ལྡན་པའི་གཏམ་དུ་ཐོས་སོ། །ཁ་ཅིག་གིས་ནི་རང་སངས་རྒྱས་དང་རབ་ཏུ་ལྡན་པའི་གཏམ་དུ་ཐོས་སོ། །ཁ་ཅིག་གིས་ནི་ཐེག་པ་ཆེན་པོ་དང་རབ་ཏུ་ལྡན་པའི་གཏམ་\nདུ་ཐོས་ཏེ། །ཞི་བའི་བློ་གྲོས་དེ་ལྟར་དེ་བཞིན་གཤེགས་པས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་ཀྱི་བསམ་པ་<span class='add'>  ཚིམ་  </span>པར་བྱ་བའི་ཕྱིར་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་ཏོ། །ཞི་བའི་བློ་གྲོས་དེ་ལྟར་དེ་བཞིན་"
 ],
 [
  "78.184b",
  "གཤེགས་པས། ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བ་ལ་སེམས་ཅན་གྱི་དོན་མཛད་པ་གང་ཡིན་པ་དེ་ནི། དགེ་སློང་ཤཱ་རིའི་བུས་ཀྱང་སེམས་ཅན་དེ་དག་བགྲང་པའི་རྟོགས་པས། ལོ་བརྒྱ་ཡང་རྟོགས་པར་མི་\nནུས་ན་སེམས་ཅན་གཞན་དག་གིས་ལྟ་སྨོས་ཀྱང་ཅི་དགོས། བཅོམ་ལྡན་འདས་ཀྱིས་དཀའ་བ་སྤྱད་པ་དང་། བྱང་ཆུབ་ཀྱི་སྙིང་པོར་འགྲོ་བ་དང་། བདུད་འདུལ་བ་དང་། བཀོད་པ་དང་། སེང་གེའི་སྒྲ་\nདང། རྣམ་པར་རོལ་བ་དང་། ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བ་བསྟན་པ་འདི་བཤད་པ་ན། སྲོག་ཆགས་བརྒྱད་ཁྲི་བཞི་སྟོང་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་\nདོ། །སེམས་ཅན་ཚད་མེད་པ་དག་ནི་ཐེག་པ་གསུམ་ལ་ཡོངས་སུ་སྨིན་པར་བྱས་སོ། །ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བའི་ལེའུ་ཞེས་བྱ་བ་སྟེ་བཅུ་བཞི་པའོ། །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་\nགསང་བའི་བདག་པོ་ལག་ན་རྡོ་རྗེས། འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བདག་གིས་དེ་སྐད་བསྟན་པས་དེ་བཞིན་གཤེགས་པ་ལ་སྐུར་བ་འམ། གཅིག་ཏུ་མ་གྱུར་ལགས་སམ། འོན་ཏེ་\nདེ་བཞིན་གཤེགས་པ་བསྟན་པ་རྗེས་སུ་འཐུན་པ་འམ། ཅིག་<span class='add'>  ལྟ་  </span>འམ་ལགས་སམ། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པའི་བསྟན་པ་ནི་ཟབ་པ་ལགས། བཅོམ་ལྡན་འདས་དེ་བཞིན་\nགཤེགས་པའི་གསང་བ་ནི་ཟབ་སྟེ། འཇིག་རྟེན་ཐམས་དང་མི་མཐུན་པ་ལགས། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པའི་ཐུགས་། ངེས་པར་དགོངས་པ་ནི་ཐབ་པ་ལགས་ཏེ། བཅོམ་\nལྡན་འདས་བདག་གིས་གང་བསྟན་པ་དེ་ནི་འདི་ལྟར་དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་བདག་གི་ལུས་ལ་གནས་པས་ལགས་ཀྱི། འདི་བདག་གི་རྩལ་གྱིས་ནི་མ་ལགས་པར་འཚལ་ཏོ། །བཅོམ་ལྡན་"
 ],
 [
  "78.185a",
  "འདས་ཀྱིས་བཀའ་སྩལ་པ། གསང་བ་པའི་བདག་པོ་དེ་དེ་བཞིན་ནོ། །ཇི་སྐད་སྨྲས་པ་དེ་བཞིན་ཏེ། གསང་བ་པའི་བདག་པོ་གང་སུ་དག་དེ་བཞིན་གཤེགས་པའི་རྗེས་སུ་འགྲོ་བའི་ཕྱིར་\nཆོས་སྨྲ་བ་དེ་དག་ཐམས་ཅད་ཀྱི་ལུས་ལ་དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་གནས་སོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། གསང་བ་པའི་བདག་པོ་གནས་མ་ཡིན་ཞིང་གོ་སྐབས་མེད་དེ། གང་དེ་བཞིན་གཤེགས་\nཔས་བྱིན་གྱིས་མ་བརླབས་པར་སེམས་ཅན་དེ་དག་དེ་བཞིན་གཤེགས་པའི་གསང་བ་སྨྲ་བ་འམ། །དེ་བཞིན་གཤེགས་པའི་ཆོས་ཉིད་དང་འཐུན་པ་དེ་ནི་གནས་མ་ཡིན་ནོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། \nདེ་བཞིན་གཤེགས་པས་བྱིན་གྱིས་མ་བརླབས་<span class='add'>  པ་  </span>རྣམས་ཀྱིས་དེ་བཞིན་གཤེགས་པའི་གསང་བ་ཤེས་<span class='add'>  པར་  </span>རམ། མཉན་པར་རམ། བཤད་པར་ནུས་པ་སུ་ཞིག་ཡོད། གསང་བ་པའི་བདག་\nཔོ་དེ་བཞིན་གཤེགས་པའི་ཆོས་ཉིད་ནི་མཆོག་ཏུ་ཡང་དག་པའོ། །དེ་བཞིན་གཤེགས་པའི་ཆོས་ཉིད་ནི་དེ་ཁོ་ནའོ། །དེ་བཞིན་གཤེགས་པའི་བཞུགས་པ་ནི་ཡང་དག་པའོ་ཞེས་ཡང་དག་པར་སྨྲ་བས་\nསྨྲ་བ་ནི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཉིད་ཡང་དག་པར་སྨྲ་བས་སྨྲ་བའོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། གསང་བ་པའི་བདག་པོ་འདས་པ་དང་། མ་བྱོན་པ་དང་། ད་ལྟར་བྱུང་བའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་\nཀྱི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་འཇིག་རྟེན་ཐམས་ཅད་དང་མི་མཐུན་པ་གང་ཡིན་<span class='add'>  པ་  </span>དེ་ནི་ཆོས་ཀྱི་རྣམ་གྲངས་འདིར་བསྟན་ཏོ། །བསྙད་དོ། །རབ་ཏུ་བཤད་དོ། །གསང་བ་པའི་བདག་པོ་གང་\nདག་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཐོས་ནས་མོས་པ་དང་ཡིད་ཆེས་པར་འགྱུར་བའི་སེམས་ཅན་དེ་དག་ཀྱང་འཇིག་རྟེན་ཐམས་ཅད་དང་མི་འཐུན་པར་འགྱུར་རོ། །གསང་བ་པའི་བདག་པོ་རིའི་རྒྱལ་པོ་རི་རབ་ནི་"
 ],
 [
  "78.186a",
  "མོངས་པ་ཉེ་བར་ཞི་བའི་ཚིག་བླ་དགས་སོ། །ཉོན་མོངས་པ་ཉེ་བར་ཞི་བ་ཞེས་བྱ་བ་འདི་ནི་ཀུན་དུ་རྟོག་པ་དང་། རྣམ་པར་རྟོག་པ་དང་། ཡོངས་སུ་རྟོག་པ་ཉེ་བར་ཞི་བའི་ཚིག་བླ་དགས་\nསོ། །ཀུན་དུ་རྟོག་པ་དང་། རྣམ་པར་རྟོག་པ་དང་། ཡོངས་སུ་རྟོག་པ་ཉེ་བར་ཞི་བ་ཞེས་བྱ་བ་འདི་ནི་འདུ་ཤེས་ཡིད་ལ་བྱེད་པ་ཉེ་བར་ཞི་བའི་ཚིག་བླ་དགས་སོ། །འདུ་ཤེས་ཡིད་ལ་བྱེད་པ་\nཉེ་བར་ཞི་བ་ཞེས་བྱ་བ་འདི་ནི་ཕྱིན་ཅི་ལོག་ཉེ་བར་ཞི་བའི་ཚིག་བླ་དགས་སོ། །ཕྱིན་ཅི་ལོག་ཉེ་བར་ཞི་བ་ཞེས་བྱ་བ་འདི་ནི་རྒྱུ་དང་དམིགས་པ་ཉེ་བར་ཞི་བའི་ཚིག་བླ་དགས་སོ། །རྒྱུ་དང་\nདམིགས་པ་ཉེ་བར་ཞི་བ་ཞེས་བྱ་བ་འདི་ནི་མ་རིག་པ་དང་སྲིད་པའི་སྲེད་པ་ཉེ་བར་ཞི་བའི་ཚིག་བླ་དགས་སོ། །མ་རིག་པ་དང་། སྲིད་པའི་སྲེད་པ་ཉེ་བར་ཞི་བ་ཞེས་བྱ་བ་འདི་ནི་ངར་འཛིན་\nཔ་དང་། ང་ཡིར་འཛིན་པ་ཉེ་བར་ཞི་བའི་ཚིག་བླ་དགས་སོ། །ངར་འཛིན་པ་དང་། ང་ཡིར་འཛིན་པ་ཉེ་བར་ཞི་བ་ཞེས་བྱ་བ་འདི་ནི་མིང་དང་གཟུགས་ཉེ་བར་ཞི་བའི་ཚིག་བླ་དགས་སོ། །མིང་\nདང་གཟུགས་ཉེ་བར་ཞི་བ་ཞེས་བྱ་བ་འདི་ནི་ཆད་པ་དང་། །རྟག་པར་ལྟ་བ་ཉེ་བར་ཞི་བའི་ཚིག་བླ་དགས་སོ། །ཆད་པ་དང་རྟག་པར་ལྟ་བ་ཉེ་བར་ཞི་བ་ཞེས་བྱ་བ་འདི་ནི་འཇིག་ཚོགས་\nལ་ལྟ་བ་ཉེ་བར་ཞི་བའི་ཚིག་བླ་དགས་སོ། །ཞི་བའི་བློ་གྲོས་དེ་ལྟར་ན་དམིགས་པ་དང་། རྒྱུ་དང་ལྟ་བ་དང་ལྡན་པའི་ཀུན་ནས་ཉོན་མོངས་པ་འབྱུང་བ་གང་ཡིན་པ་དེ་དག་ཐམས་ཅད་ནི་\nའཇིག་ཚོགས་ལ་ལྟ་བ་ལས་འབྱུང་ངོ་། །འཇིག་ཚོགས་ལ་ལྟ་བ་ཉེ་བར་ཞི་ན། ལྟ་བ་ཐམས་ཅད་ཉེ་བར་ཞིའོ། །འཇིག་ཚོགས་ལ་ལྟ་བ་ཉེ་བར་ཞི་ན་སྨོན་པ་ཐམས་ཅད་ཉེ་བར་<span class='add'>  ཞིའོ། །  </span>"
 ],
 [
  "78.186b",
  "འཇིག་ཚོགས་ལ་ལྟ་བ་ཉེ་བར་ཞི་ན། ཉོན་མོངས་པ་ཐམས་ཅད་ཉ་ེ་བར་ཞིའོ། །ཞི་བའི་བློ་གྲོས་འདི་ལྟ་སྟེ་དཔེར་ན། ཤིང་གི་རྩ་བ་བཅད་ན། ཡལ་ག་དང་ལོ་མ་དང་། ཡལ་ག་ཕྲའུ་ཐམས་ཅད་སྐམ་པར་\nའགྱུར་རོ། །ཞི་བའི་བློ་གྲོས་དེ་བཞིན་དུ་འཇིག་ཚོགས་ལ་ལྟ་བ་ཉེ་བར་ཞི་ན་ཉོན་མོངས་པ་ཐམས་ཅད་ཉེ་བར་ཞི་བར་འགྱུར་རོ། །ཞི་བའི་བློ་གྲོས་འཇིག་ཚོགས་ལ་ལྟ་བ་ཡོངས་སུ་མི་ཤེས་ན་ཉེ་བར་\nལེན་པ་དང་། ཉེ་བའི་ཉོན་མོངས་པ་ཐམས་ཅད་འབྱུང་ངོ་། །འཇིག་ཚོགས་ལ་ལྟ་བ་ཡོངས་སུ་ཤེས་པར་གྱུར་ན་ཉེ་བར་ལེན་པ་དང་ཉེ་བའི་ཉོན་མོངས་པ་ཐམས་ཅད་མི་འབྱུང་སྟེ། གནོད་པར་མི་\nའགྱུར་རོ། །ཞི་བའི་བློ་གྲོས་ཀྱིས་གསོལ་པ། །བཅོམ་ལྡན་འདས་འཇིག་ཚོགས་ལ་ལྟ་བ་ཡོངས་སུ་འཚལ་བ་ཇི་ལྟ་བུ་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཞི་བའི་བློ་གྲོས་བདག་\nཀུན་ནས་མི་སློང་བ་ནི་འཇིག་ཚོགས་ལ་ལྟ་བ་ཡོངས་སུ་ཤེས་པའོ། །སེམས་ཅན་ཀུན་ནས་མི་སློང་བ་དང་། སྲོག་དང་གང་ཟག་དུ་ལྟ་བ་ཀུན་ནས་མི་སློང་བ་ནི་འཇིག་ཚོགས་ལ་ལྟ་བ་\nཡོངས་སུ་ཤེས་པའོ། ཞི་བའི་བློ་གྲོས་ལྟ་བ་དེ་ནི་ནང་ན་ཡང་མི་གནས་། ཕྱི་རོལ་ན་ཡང་མི་གནས་སོ། །ལྟ་བ་གནས་པ་མེད་པ་དེ་ལ་མི་གནས་པར་ཤེས་པ་གང་ཡིན་པ་འདི་ནི། ཞི་བའི་བློ་\nགྲོས་འཇིག་ཚོགས་ལ་ལྟ་བ་ཡོངས་སུ་ཤེས་པའོ། །ཞི་བའི་བློ་གྲོས་འཇིག་ཚོགས་ལ་ལྟ་བ་ཡོངས་སུ་ཤེས་པ་ཞེས་བྱ་བ་འདི་ནི་སྟོང་<span class='add'>  པ་  </span>ཉིད་ཀྱི་ཚིག་བླ་དགས་ཏེ། སྟོང་པ་ཉིད་ཀྱི་རྗེས་སུ་\nའཐུན་པའི་བཟོད་པའི་ལྟ་བ་དེ་མི་འཛིན་པ་གང་ཡིན་པ་འདི་ཡང་ཞི་བའི་བློ་གྲོས་འཇིག་ཚོགས་ལ་ལྟ་བ་ཡོངས་སུ་ཤེས་པའོ། །ཞི་བའི་བློ་གྲོས་མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་།"
 ],
 [
  "78.187b",
  "པ་ཡང་ཞི་བར་མི་བྱེད་དོ། །ཉོན་མོངས་པ་ལ་དམིགས་པར་ཡང་མི་སྐྱེད་ལ་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་དམིགས་པར་ཡང་སྐྱེད་དོ། །བདུད་དང་ཉེ་བའི་ཉོན་མོངས་པའི་དམིགས་པ་ཡང་སྤོང་ལ་བྱང་ཆུབ་\nཀྱི་ཕྱོགས་དང་འཐུན་<span class='add'>  པའི་  </span>ཆོས་ལ་དམིགས་པ་ཡང་མི་སྤོང་<span class='add'>  ངོ་། །  </span>ཉན་ཐོས་དང། རང་སངས་རྒྱས་ཀྱི་ཆོས་འདོད་པ་ལ་དམིགས་པར་ཡང་མི་ལེན་ལ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་སེམས་ལ་དམིགས་\nབར་ཡང་མི་འདོར་རོ། །སྟོང་པ་ཉིད་དུ་དམིགས་པ་ལ་ཡང་རབ་ཏུ་རྟོག་ལ་སེམས་ཅན་ཐམས་ཅད་སྙིང་རྗེ་ཆེན་པོའི་དམིགས་པར་ཡང་བལྟའོ། །ཞི་བའི་བློ་གྲོས་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་\nཐབས་ལ་མཁས་པ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་དག་པ་ནི་དམིགས་པ་ལ་དབང་འཐོབ་སྟེ། མ་སྐྱེས་པའི་དམིགས་པ་ལ་ཡང་དེས་པར་སེམས་ལ་བསམས་བཞིན་དུ་སྐྱེ་བའི་དམིགས་པ་ཡང་མི་\nསྤོང་<span class='add'>  ངོ་། །  </span>མངོན་པར་འདུ་བྱེད་<span class='add'>  པ་  </span>མེད་པའི་དམིགས་པ་ལ་ཡང་འཇུག་ལ་དགེ་བའི་རྩ་བ་མངོན་<span class='add'>  པར་  </span>འདུ་བྱ་བའི་དམིགས་པ་ཡང་ཉམས་འོག་ཏུ་ཆུད་པར་བྱེད་དོ། །མཚན་མ་མེད་པའི་དམིགས་པ་\nལ་ཡང་དཔྱོད་ལ་བྱང་ཆུབ་ཀྱི་སེམས་ཀྱི་དམིགས་པ་ཡང་ཆུད་མི་གཟོན་ཏོ། །སྨོན་པ་མེད་པའི་དམིགས་པ་ཡང་རྣམ་པར་མཐོང་ལ་ཁམས་གསུམ་པའི་དམིགས་པ་ལ་ཡང་མི་སྨོད་དོ། །\nཤེས་རབ་དང་ཐབས་ལས་ངེས་པར་བྱུང་བ་དེ་ནི་དམིགས་པ་ཐམས་ཅད་ལ་ཡང་དབང་བྱེད་པར་གྱུར་ཏེ་དེ་མི་སྡུག་པ་ལ་དམིགས་ནས་དེ་བཞིན་གཤེགས་པའི་སྐུ་སྡུག་པ་ལ་སེམས་\nགནས་སོ། །མི་རྟག་པ་ལ་དམིགས་ནས་འཁོར་བ་ལ་སེམས་ཡོངས་སུ་མི་སྐྱོ་བ་ཉིད་དུ་གནས་སོ། །སྡུག་བསྔལ་ལ་དམིགས་ནས་སེམས་ཅན་ཐམས་ཅད་མྱ་ངན་ལས་འདས་བ་བདེ་བ་ལ་དགོད་པར་སེམས་"
 ],
 [
  "78.188a",
  "གནས་སོ། །བདག་མེད་པ་ལ་དམིགས་ནས། སེམས་ཅན་ཐམས་ཅད་སྙིང་རྗེ་ཆེན་པོའི་སེམས་གནས་སོ། །འདོད་ཆགས་ལ་དམིགས་ནས་སེམས་ཅན་འདོད་ཆགས་ལ་སྤྱོད་པ་རྣམས་ལ་མི་སྡུག་པའི་སྨན་ཆེན་པོ་ཡང་\nདག་པར་བསྟན་པར་སེམས་གནས་སོ། །ཞེ་སྡང་ལ་དམིགས་ནས་སེམས་ཅན་ཞེ་སྡང་ལ་སྤྱོད་པ་རྣམས་ལ་བྱམས་པ་ཆེན་པོའི་སྨན་ཆེན་པོ་ཡང་དག་པར་བསྟན་པར་སེམས་གནས་སོ། །གཏི་མུག་ལ་དམིགས་\nནས་སེམས་ཅན་གཏི་མུག་ལ་སྤྱོད་པ་རྣམས་ལ་རྟེན་ཅིང་འབྲེལ་བར་<span class='add'>  འབྱུང་  </span>བའི་སྨན་ཆེན་པོ་ཡང་དག་པར་བསྟན་པར་སེམས་གནས་སོ། །ཆ་མཉམ་པ་ལ་དམིགས་ནས་སེམས་ཅན་ཆ་མཉམ་བ་ལ་སྤྱོད་པ་རྣམས་ལ་\nམི་རྟག་པའི་འདུ་ཤེས་ཀྱི་སྨན་ཆེན་པོ་ཡང་དག་པར་བསྟན་པར་སེམས་གནས་སོ། །འདོད་ཆགས་དང་བྲལ་བ་ལ་དམིགས་ནས་ཉན་ཐོས་སུ་འདུལ་བར་སེམས་གནས་སོ། །ཞེ་སྡང་དང་བྲལ་པ་ལ་དམིགས་ནས་རང་\nསངས་རྒྱས་སུ་འདུལ་བར་སེམས་གནས་སོ། །གཏི་མུག་དང་བྲལ་བ་ལ་དམིགས་ནས་བྱང་ཆུབ་སེམས་དཔར་འདུལ་བར་སེམས་གནས་སོ། །གཟུགས་ལ་དམིགས་ནས་དེ་བཞིན་གཤེགས་པའི་གཟུགས་ཐོབ་པར་\nབྱ་བར་སེམས་གནས་སོ། །སྒྲ་ལ་དམིགས་ནས་དེ་བཞིན་གཤེགས་པའི་སྒྲ་དབྱངས་ཐོབ་པར་བྱ་བར་སེམས་གནས་སོ། །དྲི་ལ་དམིགས་ནས་དེ་བཞིན་གཤེགས་པའི་ཚུལ་ཁྲིམས་ཀྱི་དྲི་བསུང་ཐོབ་པར་བྱ་བར་\nསེམས་གནས་སོ། །རོ་ལ་དམིགས་ནས་དེ་བཞིན་གཤེགས་པའི་སྐྱེས་བུ་ཆེན་པོའི་མཚན་རོ་བྲོ་བའི་མཆོག་ཐོབ་པར་བྱ་བར་སེམས་གནས་སོ། །རེག་བྱ་ལ་དམིགས་ནས་དེ་བཞིན་གཤེགས་པའི་ཕྱག་དང་\nཞབས་འཇམ་ཞིང་གཞོན་པ་ཐོབ་པར་བྱ་བར་སེམས་གནས་སོ། །ཆོས་ལ་དམིགས་ནས་དེ་བཞིན་གཤེགས་པའི་སེམས་ངེས་པར་སེམས་པ་ཐོབ་པར་བྱ་བར་སེམས་གནས་སོ། །སྦྱིན་པ་ལ་དམིགས་ནས་མཚན་"
 ],
 [
  "78.180b",
  "ཐོབ་པར་བྱ་བ་དང་། མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པར་བྱ་བ་གང་ཅི་ཡང་རུང་སྟེ་དེ་ཐམས་ཅད་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ། །ཞི་བའི་བློ་གྲོས་བྱང་ཆུབ་བརྙེས་པའི་དེ་བཞིན་གཤེགས་པ་\nལ་ཕྱོགས་བཅུ་ནས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་གྲངས་མེད་དཔག་ཏུ་མེད་པ་དག་གིས་ཕྱག་གཡས་པ་བརྐྱང་སྟེ། སྐུ་མ་མཉེལ་ཏམ་ཞེས་སྙུན་གསོལ་ལོ། །མཉེས་པ་མི་མངའ་བར་\nབྱང་ཆུབ་བམ། རང་བྱུང་དུ་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་བམ། སྒྲིབ་པ་མི་མངའ་བར་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་བམ། མཉམ་པ་ཉིད་ཀྱི་ཡེ་ཤེས་ཀྱིས་མངོན་པར་རྫོགས་\nཔར་བྱང་ཆུབ་བམ། ཀུན་དུ་ཡེ་ཤེས་ཀྱིས་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་བམ། སྤྱོད་ཡུལ་མ་འདྲེས་པ་དང་ལྡན་ནམ། སྙིང་རྗེ་ཆེན་པོའི་བགོས་སམ། དཀོན་མཆོག་གསུམ་གྱི་རིགས་\n<span class='add'>  བསབས་  </span><span class='add'>    </span>སམ། ཆོས་ཐམས་ཅད་ལ་དབང་སྒྱུར་རམ་ཞེས་ཡོངས་སུ་འདྲིའོ། །དེ་ལ་སེམས་ཅན་གང་དག་དབང་པོ་ཡོངས་སུ་སྨིན་པ་དེ་དག་གིས་ནི་བྱང་བ་དེ་ཤེས་སོ། །སེམས་ཅན་གང་དག་\nདཔང་པོ་ཡོངས་སུ་མ་སྨིན་པ་དེ་དག་གིས་ནི་བྱ་བ་དེ་མི་ཤེས་སོ། །ཞི་བའི་བློ་གྲོས་བྱང་ཆུབ་བརྙེས་པའི་དེ་བཞིན་གཤེགས་པ་ཞིག་བདུན་གྱི་བར་དུ་སྤྱན་མི་འཛུམས་པར་ཆོས་གྱི་དགའ་བའི་\nབདེ་བ་ཉམས་སུ་བསྟར་རོ། །སྤྱན་མི་འཛུམས་པར་བྱང་ཆུབ་ཀྱི་ཤིང་ལ་ཡང་གཟིགས་སོ། །ལྷའི་བུ་སྟོང་ཡང་དེ་ལ་མཆོད་དོ། །བསྟོད་དོ། །ཕྱག་འཚལ་ལོ། །ལྷའི་བུ་མོ་བརྒྱ་སྟོང་དག་ཀྱང་དེ་ལ་\nམཆོད་པ་བྱེད་དོ། བསྟོད་དོ། །ཕྱག་འཚལ་ལོ། །དེ་བཞིན་གཤེགས་པའི་སྤྱོད་ལམ་མཐོང་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་ཀྱང་བསྐྱེད་དོ། །ཞི་བའི་བློ་གྲོས་དེ་བཞིན་གཤེགས་"
 ],
 [
  "78.189a",
  "ཉོན་ཐོས་དང། རང་སངས་རྒྱས་ཡིད་ལ་བྱས་ནས་ཐེག་པ་ཆེན་པོ་ཡང་དག་པར་བསྒྲུབ་པར་སེམས་གནས་སོ། །ཡིད་འབྱུང་བ་ཡིད་ལ་བྱས་ནས་སྡིག་པ་ཐམས་ཅད་མི་བྱ་བར་སེམས་གནས་སོ། །\nངན་འགྲོ་ངན་སོང་ཡིད་ལ་བྱས་ནས་ངན་འགྲོ་ངན་སོང་དང། མི་ཁོམ་པར་སྐྱེས་པའི་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་བསྐྱབ་པར་སེམས་གནས་སོ། །ལྷ་ཡིད་ལ་བྱས་ནས་འབྱོར་བ་ཐམས་ཅད་མཐར་རྒུད་པར་འགྱུར་པར་\nསེམས་གནས་སོ། །མི་ཡིད་ལ་བྱས་ནས་སྙིང་པོ་བླང་བར་སེམས་གནས་སོ། །སངས་རྒྱས་རྗེས་སུ་དྲན་པར་ཡིད་ལ་བྱེད་ནས་སངས་རྒྱས་དང་ཕྲད་པར་བྱ་བར་སེམས་གནས་སོ། །ཆོས་རྗེས་སུ་དྲན་པ་ཡིད་ལ་བྱས་ནས་\nསློབ་དཔོན་ཆོས་ལ་དཔེ་མཁྱུད་མེད་པར་བྱ་བར་སེམས་གནས་སོ། །དགེ་འདུན་རྗེས་སུ་དྲན་པ་ཡིད་ལ་བྱས་ནས་ཕྱིར་མི་ལྡོག་པའི་ཆོས་ཐོབ་པར་བྱ་བར་སེམས་གནས་སོ། །གཏོད་པ་རྗེས་སུ་དྲན་པ་ཡིད་ལ་བྱས་ནས་\nགཏང་བ་ཐམས་ཅད་ཡོངས་སུ་གཏང་བར་སེམས་གནས་སོ། །ཚུལ་ཁྲིམས་རྗེས་སུ་དྲན་པ་ཡིད་ལ་བྱས་ནས་སྨོན་པ་དང། བསམ་གཏན་དང། བྱང་ཆུབ་ཀྱི་ཡན་ལག་ཡོངས་སུ་རྫོགས་པར་བྱ་བར་སེམས་གནས་སོ། །\nལྷ་རྗེས་སུ་དྲན་པ་ཡིད་ལ་བྱས་ནས། ལྷ་ཐམས་ཅད་ཀྱིས་བསྟོད་ཅིང་བསྔགས་པའི་སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་གནས་<span class='add'>  པར་  </span>བྱ་བར་སེམས་གནས་སོ། །ལུས་ཡིད་ལ་བྱས་ནས། སངས་རྒྱས་ཀྱི་སྐུ་ཐོབ་པར་བྱ་\nབར་སེམས་གནས་སོ། །དག་ཡིད་ལ་བྱས་ནས་སངས་རྒྱས་ཀྱི་གསུང་ཐོབ་པར་བྱ་བར་སེམས་གནས་སོ། །སེམས་ཡིད་ལ་བྱས་ནས་སངས་རྒྱས་དང་མཉམ་པའི་སེམས་ཐོབ་པར་བྱ་བར་སེམས་གནས་སོ། །\nའདུས་བྱས་ལ་དམིགས་ནས་དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་ཡོངས་སུ་རྫོགས་པར་བྱ་བར་སེམས་གནས་སོ། །འདུས་མ་བྱས་ལ་དམིགས་ནས་སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་ཡོངས་སུ་རྫོགས་པར་བྱ་བར་"
 ],
 [
  "78.178a",
  "འགྱུར་རོ། །སྡིག་ཅན་ཁྱེད་ནི་འབྲོག་དགོན་པར་ལམ་བརྒྱགས་ཆད་པ་ལྟར་དོ་མོད་བྱང་ཆུབ་སེམས་དཔས་ཕོངས་པར་བྱས་པར་འགྱུར་རོ། སྡིག་ཅན་ཁྱེད་ནི་རྒྱ་མཚོ་ཆེན་པོའི་དབུས་སུ་\nགྲུ་ཞིག་པ་ལྟར་དོ་མོད་བྱང་ཆུབ་སེམས་དཔས་སྨྲེ་སྔགས་འདོན་དུ་བཅུག་པར་འགྱུར་རོ། །སྡིག་ཅན་ཁྱེད་ནི་བསྲེག་པའི་བསྐལ་པས་རྩྭ་དང་ནགས་ཚལ་ལྟར་དོ་མོད་བྱང་ཆུབ་སེམས་དཔས་རྙིས་\nཔར་བྱས་པར་འགྱུར་རོ། །<span class='add'>  སྡིག་ཅན་  </span>ཅི་ཁྱེད་ནི་རྡོ་བ་ལ་རྡོ་རྗེ་ཆེན་པོ་བབ་པ་ལྟར་དོ་མོད་བྱང་ཆུབ་སེམས་དཔས་རྣམ་པར་གཏོང་བར་འགྱུར་རོ། །ཞི་བའི་བློ་གྲོས་དེ་ལྟར་བྱང་ཆུབ་ཀྱི་བསྙེན་བཀུར་\nབའི་ལྷ་རྣམས་ཀྱིས་བཟློག་པ་རྣམ་པ་བཅུ་དྲུག་གིས་བདུད་སྡིག་ཅན་རྣམས་ཟློག་པར་བྱེད་ཀྱང་བདུད་སྡིག་ཅན་དེ་དག་ཕྱིར་མ་ལོག་གོ །དེ་ནས་བྱང་ཆུབ་སེམས་དཔས་བསྐལ་པ་གྲངས་མེད་\nཔ་བྱེ་བ་ཁྲག་<span class='add'>  ཁྲིག་  </span>བརྒྱ་སྟོང་དུ་སྦྱིན་པ་དང། དུལ་བ་དང། ལེགས་པར་སྡོམ་པ་དང། ཚུལ་ཁྲིམས་དང། བཟོད་པ་དང། བརྩོན་འགྲུས་དང། བསམ་གཏན་དང། ཤེས་རབ་དང། །བྱམས་\nཔ་དང། སྙིང་རྗེ་དང། དགའ་བ་དང། བཏང་སྙོམས་དང། དྲན་པ་ཉེ་བར་གཞག་པ་དང། ཡང་དག་པར་སྤོང་བ་དང། རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང། དབང་པོ་དང། སྟོབས་དང། བྱང་ཆུབ་ཀྱི་ཡན་\nལག་དང། ལམ་དང། ཞི་གནས་དང། ལྷག་མཐོང་དང། རིག་པ་དང། རྣམ་པར་གྲོལ་བ་ཡོངས་སུ་སྦྱང་བ་བྱས་པས་ལག་པ་གཡས་པ་འཇམ་ཞིང་གཞོན་ལ་ཤིན་དུ་གཞོན་པ་གསེར་གྱི་ཁ་\nདོག་ལྟར་འདུག་པ་བརྐྱང་སྟེ། སྙིང་རྗེ་ཆེན་པོས་བསྐྱོད་པ་དང་སེམས་ཅན་ཐམས་ཅད་རབ་ཏུ་ཐར་པར་བྱ་བའི་ལྷག་པའི་བསམ་<span class='add'>  པས་  </span>སྤྱི་བོ་ནས་བཟུང་སྟེ། ལུས་ཐམས་ཅད་ལ་བྱུགས་ནས་འཇིག་"
 ],
 [
  "78.192a",
  "ལེགས་པར་བཤད་པས་སེམས་ཅན་ཐབས་ཅད་ཚིམ་པར་བྱེད་པ་ཡིན་ནོ། །བསྟན་པ་འདི་བཤད་པ་ན་སྲོག་ཆགས་ཁྲིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ། །བྱང་ཆུབ་\nསེམས་དཔའ་ལྔ་བརྒྱ་ནི་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་སྐྱེས་སོ། །དམིགས་པའི་ལེའུ་ཞེས་བྱ་བ་སྟེ་བཅྭ་ལྔ་པའོ། །དེ་ནས་འཁོར་དེའི་ནང་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཁ་ཅིག་འདི་སྙམ་\nདུ་སེམས་ཏེ། ཀྱེ་མ་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེ་འདི་ཇི་སྲེད་ཅིག་ན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར། དེའི་སངས་རྒྱས་ཀྱི་ཞིང་ནི་མིང་ཅི་ཞེས་བྱ་བར་འགྱུར། དེ་\nབྱང་ཆུབ་ཐོབ་པའི་མིང་ནི་ཅི་ཞེས་བྱ་བར་འགྱུར། དེའི་བྱང་ཆུབ་སེམས་དཔའི་འཁོར་ནི་ཅི་འདྲ་བ་ཞིག་ཏུ་འགྱུར་སྙམ་མོ། །དེ་ནས་བཅོམ་ལྡན་ཀྱི་དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་གིས་སེམས་ཀྱི་ཡོངས་སུ་རྟོག་\nཔ་ཐུགས་ཀྱིས་མཁྱེན་ནས་དེའི་ཚེ་འཛུམ་པ་མཛད་དོ། །འདི་ནི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་ཆོས་ཉིད་དེ་གང་གི་ཚེ་འཛུམ་པ་མཛད་པ་དེའི་ཚེ། འོད་ཟེར་ཁ་དོག་སྣ་ཚོགས་འབྱུང་བས།། དེ་ནས་བཅོམ་ལྡན་འདས་\nཀྱི་ཞལ་གྱི་སྐོ་ནས་འོད་ཟེར་ཁ་དོག་དུ་མ་དང་<span class='add'>    </span>ལྡན་པ་ཁ་དོག་ཐ་དད་པ་འདི་ལྟ་སྟེ། སྔོན་པོ་དང། སེར་པོ་དང་དམར་པོ་དང། དཀར་པོ་དང། ལེབ་རྒན་དང། ཤེལ་དང། དངུལ་གྱི་ཁ་དོག་ལྟ་བུ་བྱུང་ནས་འོད་དེས་འཇིག་རྟེན་གྱི་\nཁམས་མཐའ་ཡས་མུ་མེད་པ་ཁྱབ་པར་བྱས་ཏེ། ཚངས་པའི་འཇིག་རྟེན་གྱི་བར་དུ་མངོན་པར་འཕགས་ནས་སླར་ལོག་སྟེ། བཅོམ་ལྡན་འདས་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་ནས་བཅོམ་ལྡན་ལྡན་འདས་ཀྱི་དབུའི་གཙུག་ཏུ་\nནུབ་བར་གྱུར་ཏོ། །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཞི་བའི་བློ་གྲོས་ཀྱིས་ཚིགས་སུ་བཅད་པའི་དབྱངས་ཀྱིས་བཅོམ་ལྡན་འདས་ལ་འཛུམ་པ་མཛད་པའི་དོན་ཞུས་པ། འོད་བཟང་དྲི་མ་མི་མངའ་"
 ],
 [
  "78.192b",
  "གསེར་དང་འདྲ། ཟླ་བའི་ཞལ་འདྲ་ཞི་གནས་ལེགས་པར་བཞུགས། ཉི་མ་ལྟ་བུ་མུན་པ་འཛོམ་མཛད་པ། མི་མཆོག་ཅི་ཡི་སླད་དུ་འཛུམ་པ་བསྟན་། མོས་པས་ཞི་གནས་རྫིང་དུ་རབ་ཏུ་བཞུགས། ཐུགས་\nརྗེ་ཆུ་བོ་བརྩོན་འགྲུས་སྟོབས་ཀྱིས་འཐུངས་། དྲན་བས་ཁ་བྱེ་ཡོན་ཏན་དྲི་<span class='add'>  ཞིམ་  </span>ལྡན་། བདེ་གཤེགས་པད་མ་ཇི་སླད་འཛུམ་པ་མཛད། དྲན་པ་སྣོད་བཟང་ཞི་གནས་མར་ལགས་ཏེ། སྙིང་པོ་ཐུགས་རྗེ་དྲི་མ་གསུམ་\nསེལ་མཛད། ཤེས་རབ་མར་མེ་མུན་པ་སེལ་མཛད་པ། བདེ་གཤེགས་མར་མེ་ཅི་སླད་འཛུམ་པ་མཛད། དཀྱིལ་འཁོར་ཐུགས་རྗེ་ལྷག་མཐོང་འོད་ལྡན་པ། རབ་རིབ་སེལ་<span class='add'>  བ་སྲིད་པ་  </span>བསྐམ་མཛད་པ། འགྲོ་\nབ་རྒྱས་མཛད་མིག་ནི་སྤྱོད་མཛད་པ། །བདེ་གཤེགས་ཉི་མ་ཅི་སླད་འཛུམ་པ་མཛད།ཁྱོད་ནི་འགྲོ་བའི་བསམ་པ་རབ་ཏུ་མཁྱེན། ཁྱོད་ནི་ལྷར་བཅས་འགྲོ་ནའང་<span class='add'>  ལྷང་ངེ་  </span><span class='add'>    </span>བ། དྲང་སྲོང་ཆེན་པོའི་ཞལ་དུ་འཁོར་\nརྣམས་ལྟ། མི་མཆོག་ཅི་སླད་འདིར་ནི་འཛུམ་པ་མཛད། དེ་སྐད་ཅེས་གསོལ་པ་དང། བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཞི་བའི་བློ་གྲོས་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །\nཞི་བའི་བློ་གྲོས་གསང་བ་བའི་བདག་པོ་ལག་ན་རྡོ་རྗེ་འདི་ནི་རྡོ་རྗེ་ཐོགས་ནས་བསྐལ་པ་བཟང་པོ་པའི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཐམས་ཅད་ལ་མཆོད་པ་བྱེ་དཔར་འགྱུར་། \nདམ་པའི་ཆོས་ཀྱང་ཡོངས་སུ་འཛིན་པར་འགྱུར། དེ་བཞིན་གཤེགས་པའི་གསང་བ་བའི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཡང་རྒྱས་པར་བྱེད་པར་འགྱུར། སེམས་ཅན་ཚད་མེད་པ་དག་ཀྱང་བྱང་ཆུབ་ཀྱི་ཕྱིར་ཡོངས་སུ་སྨིན་པར་\nབྱེད་པར་འགྱུར་རོ། །དེ་བསྐ་ལ་པ་བཟང་པོ་དེ་འདས་ནས་དེ་བཞིན་གཤེགས་པ་མོས་པའི་བར་གྱི་དམ་པའི་ཆོས་ནུབ་པ་ན་དེ་བཞིན་གཤེགས་པ་མི་འཁྲུགས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་དུ་སྐྱེ་བར་འགྱུར་ཏེ། དེ་འཇིག་རྟེན་"
 ],
 [
  "78.193a",
  "གྱི་ཁམས་མངོན་པར་དགའ་བ་དེར་སྐྱེས་ནས་དེ་བཞིན་གཤེགས་པ་མི་འཁྲུགས་པ་དེས་ཕྱག་རྒྱ་བརྒྱ་རྩ་བརྒྱད་བྱང་ཆུབ་སེམས་དཔའ་དེ་དགལ་བསྟན་པས་འཛིན་པར་འགྱུར། དོན་གྱི་ཚུལ་ལ་ཡང་འཇུག་\nཔར་འགྱུར། དེ་བཞིན་ཉིད་དུ་ཡང་དག་པར་སྒྲུབ་པར་འགྱུར་རོ། །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་གྲངས་མེད་དཔག་ཏུ་མེད་པ་མཉེས་པར་བྱེད་པར་འགྱུར། སྟི་སྟང་དུ་བྱེད་པར་འགྱུར། བླ་མར་བྱེད་པར་འགྱུར། །རིམ་\nགྲོ་བྱེད་པར་འགྱུར། མཆོད་པ་བྱེད་པར་འགྱུར། དེ་དག་གི་གནན་ཚངས་པར་སྤྱོད་པར་འགྱུར། དམ་པའི་ཆོས་ཀྱང་སྲུང་བར་འགྱུར། སེམས་ཅན་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཚད་མེད་པ་དག་ཀྱང་ཡང་དག་པར་རྫོགས་པའི་\nབྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྨིན་པར་བྱེད་པར་འགྱུར་རོ། །དེ་དེའི་འོག་ཏུ་བསྐལ་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་འདས་པ་ན་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་ཡོངས་སུ་རྫོགས་པར་བྱས་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་\nཆུབ་རྒྱ་བར་འགྱུར་ཏེ། བསྐལ་པ་རྣམ་པར་སྦྱོང་བ་ཞེས་བྱ་བ་ལ་འཇིག་རྟེན་གྱི་ཁམས་ཀུན་ཡོངས་སུ་དག་པ་ཞེས་བྱ་བར་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་\nརྒྱས་རིག་པ་དང་ཞུགས་སུ་ལྡན་<span class='add'>  པ།   </span>བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ། བླ་ན་མེད་པ་། ལྷ་དང་མི་རྣམས་ཀྱིས་སྟོན་པ། །སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྡོ་རྗེས་རྣམ་པར་གནོན་\nཔ་ཞེས་བྱ་བར་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར་རོ། །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་རྡ་ོ་རྗེས་རྣམ་པར་གནོན་པ་དེའི་སངས་རྒྱས་ཀྱི་ཞིང་འཇིག་རྟེན་ཀྱི་ཁམས་ཀུན་ནས་ཡོངས་སུ་དག་པ་དེ་ནི་འབྱོར་པ་དང་། རྒྱས་པ་དང་། \nལོ་ལེགས་པ་དང་། ཉམས་དགའ་བ་དང་། ལྷ་དང་མི་མང་པོ་དང་། བྱང་ཆུབ་སེམས་དཔས་གང་བར་འགྱུར་རོ། །སངས་རྒྱས་ཀྱི་ཞིང་དེ་རིན་པོ་ཆེ་སྣ་བདུན་འདི་ལྟ་སྟེ། གསེར་དང་། དངུལ་དང་། བཻ་དཱུ་རྻ་དང་། ཤེལ་"
 ],
 [
  "78.194a",
  "ཐམས་ཅད་ཀྱང་<span class='add'>  མཚན་  </span>ཉི་ཤུ་རྩ་བརྒྱད་ཀྱི་བརྒྱན་པར་འགྱུར་རོ། །དེ་བཞིན་གཤེགས་པ་དེའི་ཚེའི་ཚད་ནི་བར་གྱི་བསྐལ་བ་བརྒྱད་ཐུབ་པར་འགྱུར་རོ། །ལྷ་དང་མི་རྣམས་ཀྱང་གློ་བུར་དུ་འཆི་བར་\nམི་འགྱུར་རོ། །ཞི་བའི་བློ་གྲོས་དེ་ལྟར་དེ་བཞིན་གཤེགས་པ་རྡོ་རྗེས་རྣམ་པར་གནོན་པ་དེའི་ཡོན་ཏན་ཚད་མེད་པའི་རྒྱུའི་ཁྱད་པར་ནི་འདི་དག་དང་གཞན་ཡང་མང་དུ་ཡོད་དོ། །དེ་བཞིན་གཤེགས་པ་དེ་ནམ་ཆོས་སྟོན་པར་\nའགྱུར་བ་དེའི་ཆེ་སྐུ་ལ་འོད་ཕྱུང་བ་དང་། དེ་ནས་སེམས་ཅན་དེ་དག་གིས་འོད་དེ་མཐོང་ནས་འདི་སྙམ་དུ་སེམས་པར་འགྱུར་ཏེ་དེ་བཞིན་གཤེགས་པ་ཆོས་སྟོན་པར་འགྱུར་གྱིས། བདག་ཅག་བཅོམ་ལྡན་འདས་ལ་ཆོས་ཉན་དུ་\nའདོད་དོ་སྙམ་མོ། །དེ་ནས་ཁ་ཅིག་ནི་མངོན་པར་ཤེས་པའི་རྫུ་འཕྲུལ་གྱི་སྟོབས་ཀྱི་འོང་བར་འགྱུར། ཁ་ཅིག་ནི་དེ་བཞིན་གཤེགས་པའི་བྱིན་གྱིས་རླབས་ཀྱིས་འོང་བར་འགྱུར་རོ། །དེར་ལྷ་དང་མི་དེ་དག་འདུས་པ་དང་། དེ་བཞིན་\nགཤེགས་པ་དེ་སྟེང་གི་བར་སྣང་ལ་ཤིང་ཏ་ལ་འབུམ་སྲིད་དུ་མངོན་པར་འཕགས་ཏེ་གླིང་བཞི་པ་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་སུ་སྐྱིལ་མོ་དཀྲུང་དུ་བཞུགས་ནས་སྐུས་ཁྱབ་པར་མཛད་དེ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་\nཀྱི་བསམ་པ་ཚིམ་པར་བྱ་བའི་ཕྱིར་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ཚད་མེད་པས་སངས་རྒྱས་ཀྱི་གསུང་དབྱངས་ཀྱིས་གོ་བར་མཛད་དེ། དེ་བཞིན་གཤེགས་པའི་གསུང་གིས་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ལ་ཆོས་སྟོན་པར་\nའགྱུར་རོ། །དེའི་ནང་ན་གང་དེ་བཞིན་གཤེགས་པའི་ཆོས་སྟོན་པ་དང་འགལ་བར་བྱེད་པ་འམ། ཟློག་པར་བྱེད་པའི་སེམས་ཅན་ནི་གཅིག་ཀྱང་མེད་དོ། །སེམས་ཅན་དེ་དག་ཐམས་ཅད་ནི་དབང་པོ་རྣོ་བ། མགོ་སྨོས་\nཔས་གོ་བར་འགྱུར་བ་ཤ་སྟག་གོ། །འཇིག་རྟེན་གྱི་ཁམས་དེ་ན་ཆོས་ཀྱི་རྒྱལ་པོ་དེ་བཞིན་གཤེགས་པ་རྡོ་རྗེས་རྣམ་པར་གནོན་པ་དེ་མ་གཏོགས་པར་རྒྱལ་པོ་གཞན་གང་ཡང་མེད་པར་འགྱུར་རོ། །འཇིག་རྟེན་གྱི་ཁམས་"
 ],
 [
  "78.194b",
  "དེ་ན་ང་ཡི་བ་མེད་ཅིང་ཡོངས་སུ་འཛིན་པ་མེད་པར་འགྱུར་རོ། །སེམས་ཅན་དེ་དག་ཐམས་ཅད་ནི་ང་ཡི་བ་མེད་ཅིང་ཡོངས་སུ་འཛིན་པ་མེད་པར་འགྱུར་རོ། །ཞི་བའི་བློ་གྲོས་དེ་བཞིན་གཤེགས་པ་རྡོ་རྗེས་རྣམ་པར་\nགནོན་པ་དེ་ལྷའི་བུའམ། མིར་གྱུར་པ་གང་ལ་བསོད་སྙོམས་བླང་བར་བཞེད་པར་གྱུར་པའི་ལྷའི་བུའམ། མིར་གྱུར་པ་དེའི་མདུན་དུ་དེ་བཞིན་གཤེགས་པའི་གཟུགས་ལྷུང་བཟེད་ཐོགས་པ་ཉེ་བར་གནས་པ་དང་། \nདེར་ལྷའི་བུ་འམ། མིར་གྱུར་པ་དེས་དེ་བཞིན་གཤེགས་པའི་གཟུགས་མཐོང་ནས་འདི་སྙམ་དུ་སེམས་པར་གྱུར་ཏེ། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་རྡོ་རྗེས་རྣམ་པར་གནོན་པ་བདག་ལས་གཤོས་གསོལ་\nབར་བཞེད་དོ་སྙམས་ནས་ཡིད་ཀྱིས་བསམས་པས་འཁོར་གྱི་ཁྱམས་སུ་སྟན་དང་། །ཟས་དང་། སྐོམ་དང་། རོ་བརྒྱ་བའི་ཟས་སྦྱར་ནས་བཅོམ་ལྡན་འདས་དེ་ལ་གདུགས་ཚོད་བབ་ཅེས་གསོལ་པ་དང་། དེར་དེ་བཞིན་གཤེགས་\nཔ་དེ་བཤོས་གསོལ་ལོ། །བཤོས་གསོལ་ནས་སླར་བཞུད་པར་འགྱུར་རོ། །དེ་བཞིན་གཤེགས་པ་དེ་གང་གི་ཚེ། ནང་དུ་ཡང་དག་འཇོག་ལ། འཇུག་པར་<span class='add'>  འགྱུར་  </span>པ་དེ་ན། བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་\nཏིང་ངེ་འཛིན་གྱི་བཀོད་པས་གནས་པར་འགྱུར་རོ། །འཇིག་རྟེན་གྱི་ཁམས་དེ་ནི་ཡོན་ཏན་གྱི་རྒྱུའི་ཁྱབ་པར་འདི་དག་དང་། གཞན་ཡང་ཚད་མེད་པ་དག་དང་ལྡན་པར་འགྱུར་ཏེ། དེའི་ཕྱིར་འཇིག་རྟེན་གྱི་ཁམས་\nདེ་ཀུན་ནས་ཡོངས་སུ་དག་པ་ཞེས་བྱའོ། །གསང་བ་བའི་བདག་པོ་ལག་ན་རྡོ་རྗེའི་ལུང་བསྟན་པ་བཤད་པ་འདི་བསྟན་པ་ན་སྲོག་ཆགས་ཉི་ཁྲིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དེ། །སངས་\nརྒྱས་ཀྱི་ཞིང་དེར་སྐྱེ་བར་ཤོག་ཤིག་ཅེས་སྨོན་ལམ་ཡང་བཏབ་བོ། །དེ་དག་ཐམས་ཅད་ཀྱང་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་རྡོ་རྗེས་རྣམ་པར་གནོན་པའི་སངས་རྒྱས་ཀྱི་ཞིང་འཇིག་རྟེན་གྱི་ཁམས་ཀུན་"
 ],
 [
  "78.188b",
  "དང་དཔེ་བྱད་བཟང་པོ་ཐོབ་པར་བྱ་བར་སེམས་གནས་སོ། །ཚུལ་ཁྲིམས་ལ་དམིགས་ནས་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བྱ་བར་སེམས་གནས་སོ། །བཟོད་པ་ལ་དམིགས་ནས་ཚངས་པའི་སྒྲ་དབྱངས་དང་གསེར་\nགྱི་མདོག་ཏུ་འདུག་པའི་ལྤགས་པ་ཐོབ་པར་བྱ་བར་སེམས་གནས་སོ། །བརྩོན་འགྲུས་ལ་དམིགས་ནས་སེམས་ཅན་ཐམས་ཅད་བསྒྲལ་བར་སེམས་གནས་སོ། །བསམ་གཏན་ལ་དམིགས་ནས་མངོན་པར་ཤེས་པ་\nབསྐྱེད་པར་སེམས་གནས་སོ། །ཤེས་རབ་ལ་དམིགས་ནས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ལྟ་བ་དང། ཉོན་མོངས་པའི་ཀུན་ནས་ཉོན་མོངས་བ་རྒྱུན་བཅད་པར་སེམས་གནས་སོ། །བྱམས་པ་ལ་དམིགས་ནས་སེམས་\nཅན་ཐམས་ཅད་ལ་ཁོང་ཁྲོ་བའི་སེམས་མེད་པར་བྱ་བར་སེམས་གནས་སོ། །སྙིང་རྗེ་ལ་དམིགས་ནས་དམ་པའི་ཆོས་ཡོངས་སུ་གཟུང་བར་སེམས་གནས་སོ། །དགའ་བ་ལ་དམིགས་ནས་ཆོས་བསྟན་པ་ལ་མཆོག་ཏུ་དགའ་བར་\nབྱ་བར་སེམས་གནས་སོ། །བཏང་སྙོམས་ལ་དམིགས་ནས་སེམས་ཅན་རྗེས་སུ་ཆགས་པ་དང། ཁོང་ཁྲོ་བ་སྤང་བ་ལ་སྦྱར་བར་སེམས་གནས་སོ། །བསྡུ་བའི་དངོས་པོ་ལ་དམིགས་ནས་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བར་སེམས་\nགནས་སོ། །སེར་སྣའི་སྐྱོན་ལ་དམིགས་ནས་བདོོག་པ་ཐམས་ཅད་ཡོངས་སུ་གཏང་བར་སེམས་གནས་སོ། །འཆལ་པའི་ཚུལ་ཁྲིམས་ཀྱི་སྐྱོན་ལ་དམིགས་ནས་ཚུལ་ཁྲིམས་རྣམ་པར་དག་པར་བྱ་བའི་ཕྱིར་སེམས་གནས་སོ། \nགནོད་སེམས་ཀྱི་སྐྱོན་ལ་དམིགས་ནས་བཟོད་པའི་སྟོབས་<span class='add'>  དང་།   </span>དེས་པ་ལ་སེམས་གནས་སོ། ལེ་ལོའི་སྐྱོན་ལ་དམིགས་ནས་དེ་བཞིན་གཤེགས་པའི་སྟོབས་ཡོངས་སུ་བསྒྲུབ་<span class='add'>  པར་  </span>སེམས་གནས་སོ། །གཡེང་བའི་སྐྱོན་ལ་\nདམིགས་ནས་དེ་བཞིན་གཤེགས་པའི་བསམ་གཏན་ཐོབ་པར་བྱ་བར་སེམས་གནས་སོ། །འཆལ་པའི་ཤེས་རབ་ཀྱི་སྐྱོན་ལ་དམིགས་ནས་ཆགས་པ་མེད་པའི་ཡེ་ཤེས་རབ་ཏུ་རྫོགས་པར་བྱ་བར་སེམས་གནས་<span class='add'>  སོ། །  </span>"
 ],
 [
  "78.195a",
  "ནས་ཡོངས་སུ་དག་པ་དེར་སྐྱེ་བར་བཅོམ་ལྡན་འདས་ཀྱིས་ལུང་བསྟན་ཏོ། །དེ་ནས་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེས་རང་གི་ལུང་བསྟན་པ་འདི་ཐོས་ནས་ཚིམ་ཞིང་མགུ་ལ་ཡི་རངས་ཏེ་རབ་ཏུ་\nདགའ་ནས་དགའ་བ་དང་ཡིད་བདེ་བ་སྐྱེས་ཏེ། རྡོ་རྗེས་ནམ་མཁའི་དཀྱིལ་དུ་འཕངས་སོ། །རྡོ་རྗེ་དེ་འཕངས་མ་ཐག་ཏུ་དེ་ནས་དེའི་ཚེ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་རྣམ་པ་དྲུག་ཏུ་གཡོས་\nསོ། །མེ་ཏོག་གི་ཆར་ཡང་བབ་བོ། །རོལ་མོ་སིལ་སྙན་བརྒྱའི་སྒྲ་ཡང་བྱུང་ངོ་། །འཁོར་ཐམས་ཅད་ཀྱི་ལག་པ་གཡས་པར་ཡང་མེ་ཏོག་ཁ་དོག་སྣ་ཚོགས་ཀྱི་ཕྲེང་བ་དག་བྱུང་ངོ་། །དེ་ནས་གསང་བ་པའི་བདག་པོ་ལག་\nན་རྡོ་རྗེས་བཅོམ་ལྡན་འདས་ལ་ཚིགས་སུ་བཅད་པ་འདི་དག་གིས་མངོན་པར་བསྟོད་དོ། །ཆོས་ཀྱི་དབང་ཕྱུག་རྒྱ་ཆེན་མི་ཟད་ཆོས་ཀྱི་མཛོད། ཆོས་རྣམས་རབ་ཏུ་འབྱེད་ལ་མཁས་པ་འགྲོ་དོན་བཞེད། ཆོས་ལ་ཐུགས་\n<span class='add'>  མ་ཞུམ་  </span>ཞིང་རྟག་ཏུ་ལྷུག་པར་བཏང་། ཆོས་ཀྱི་རྗེས་འཐུན་ཆོས་སྒྲུབ་གནས་ལ་ཕྱག་འཚལ་ལོ། །སེམས་ཅན་དག་པ་ཁྱོད་ཀྱི་ཡེ་ཤེས་<span class='add'>  སྤྱོད་  </span>རྣམ་དག །ཡོན་ཏན་རྒྱལ་གྲགས་སྙན་པ་འཇིག་རྟེན་གསུམ་དུ་<span class='add'>  གྲགས། །  </span>\nཡེ་ཤེས་རྒྱུན་ནི་དུས་གསུམ་རྟག་ཏུ་<span class='add'>  བ་སམ་  </span>འཚལ། ཆགས་འདས་ཞབས་མཉམ་ལེགས་པ་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །ཟླ་བ་ལས་ལྷག་ཡོངས་དག་ཚུལ་ཁྲིམས་རྣམ་པར་དག །ཉི་མ་ལས་ལྷག་འོད་མཛེས་\nའོད་མངའ་གཟི་བརྗིད་མཆོག །ཚངས་པ་ལས་ལྷག་གསུང་སྙན་ཚངས་པའི་གསུང་མངའ་བ། དཀོན་མཆོག་གསུམ་ལྡན་གསེར་འདྲ་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །ཁྱོད་ནི་སྐུ་ཡང་སྟོན་ལ་སྐུ་དང་ལྡན་མ་ལགས། །\nཁྱོད་ནི་གསུང་ཡང་རྗོད་ལ་སྒྲ་སྐད་རྟོག་མི་མངའ། ཁྱོད་ནི་ཆོས་ཀྱང་གསུང་ལ་ཆོས་ཀྱི་འདུ་ཤེས་བྲལ། སེམས་ཅན་ཐར་པར་མཛད་ལ་སེམས་ཅན་འདུ་ཤེས་བྲལ། གང་དག་ཁྱོད་བསྟན་ཐོས་ནས་ཇི་ལྟར་"
 ],
 [
  "78.196b",
  "མཐའ་ནི་གནས་སོ། །སྨྲས་པ། རྣམ་པར་རིག་པས་ཅི་ཞིག་རིག་པར་བྱེད། སྨྲས་པ། གལ་ཏེ་རྣམ་པར་རིག་པར་བྱེད་ན། རྣམ་པར་རིག་པ་མ་ཡིན་པར་མི་འགྱུར་རོ། །སྨྲས་པ། ཅི་ཞིག་རྣམ་པར་རིག་པར་མི་<span class='add'>  བྱེད།   </span>\nསྨྲས་པ། རྣམ་པར་རིག་པ་ཐམས་ཅད་རྣམ་པར་རིག་པར་མི་བྱེད་དོ། །སྨྲས་པ། གལ་ཏེ་རྣམ་པར་རིག་པར་མི་བྱེད་ན་ཇི་ལྟར་ཀུན་ཤེས་པར་བྱེད་སྨྲས་པ། གལ་ཏེ་ཀུན་ཤེས་པར་བྱེད་ན་རྣམ་པར་རིག་པར་བྱེད་པ་མ་\nཡིན་ཏེ། གང་གི་ཕྱིར་རྣམ་པར་རིག་པར་མི་བྱེད་པ་དེའི་ཕྱིར་ཀུན་ཤེས་པར་བྱེད་དོ། །སྨྲས་པ། ཀུན་ཤེས་པར་བྱེད་པ་ཇི་ལྟ་བུ་ཡིན། སྨྲས་པ། གང་གི་ཚེ་རྣམ་པར་རིག་པ་ཁས་མི་ལེན་པའོ། །སྨྲས་པ། ཇི་ལྟར་ན་\nརྣམ་པར་རིག་པ་ཁས་མི་ལེན། སྨྲས་པ། གང་གི་ཚེ་ཚིག་འབྲུའི་རྗེས་སུ་མི་རྒྱུག་པའོ། །སྨྲས་པ། ཇི་ལྟར་ན་ཚིག་འབྲུའི་རྗེས་སུ་མི་རྒྱུག །སྨྲས་པ། གང་གི་ཚེ་དོན་ལ་རྟོན་པའོ། སྨྲས་པ། དོན་ལ་རྟོན་པ་ཇི་ལྟ་བུ་ཡིན། \nསྨྲས་པ། གང་གི་ཚེ་དོན་མི་མཐོང་བའོ། །སྨྲས་པ། དོན་མི་མཐོང་བ་ཇི་ལྟ་བུ་ཡིན། སྨྲས་པ། གང་གི་ཚེ་དོན་དང་དོན་མ་ཡིན་པ་དོན་དུ་མི་གཉེར་བའོ། །སྨྲས་པ། གང་གི་ཚེ་དོན་དང་དོན་མ་ཡིན་པ་དོན་དུ་མི་གཉེར་བར་\nགྱུར་པ་དེའི་ཚེ་ཅི་ཞིག་དོན་དུ་གཉེར་བར་འགྱུར། སྨྲས་པ། གང་གི་ཚེ་དོན་དང་དོན་མ་ཡིན་པ་དོན་དུ་གཉེར་བར་གྱུར་པ་དེའི་ཚེ་ཆོས་དོན་དུ་གཉེར་བར་འགྱུར་བའོ། །སྨྲས་པ། གལ་ཏེ་ཆོས་དོན་དུ་གཉེར་བར་གྱུར་ན་\nདེ་དོན་དུ་གཉེར་བ་ཉིད་མ་ཡིན་ནམ། སྨྲས་པ། རིགས་ཀྱི་བུ་ཆོས་དོན་དུ་གཉེར་བ་ནི་ཅི་ཡང་དོན་དུ་གཉེར་བ་མ་ཡིན་ནོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། གང་གིས་གང་དོན་དུ་གཉེར་བ་དེ་ནི་ཆོས་མ་ཡིན་ཏེ་ཆོས་སུ་མི་རུང་<span class='add'>  ངོ་། །  </span>\nསྨྲས་པ། ཆོས་གང་ཡིན། སྨྲས་པ། གང་ལ་ཆོས་ཀྱི་སྒྲ་ཡང་མི་དམིགས་པའོ། །སྨྲས་པ། གང་ལ་ཆོས་ཀྱི་སྒྲ་ཡང་མི་དམིགས་པ་དེ་ལ་ཆོས་གང་ཡིན། སྨྲས་པ། རིགས་ཀྱི་བུ་གང་ལ་ཡི་གེ་རྣམས་"
 ],
 [
  "78.195b",
  "བསྟན་པ་ལྟར། བསྒྲུབ་པ་སྙིང་པོར་གནས་པ་དག་ནི་མི་གཏོགས་པར། འགྲོ་བ་ཐམས་ཅད་རྟག་ཏུ་བྱུང་ཡང་ནི། ཁྱོད་ཀྱི་བཀའ་དྲིན་ལན་ལོན་ནམ་ཡང་<span class='add'>  རྔོ་  </span>མི་ཐོག །དེ་ནས་གསང་བ་པའི་བདག་པོ་ལག་ན་\nརྡོ་རྗེ་དང་ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དེས་ཇི་ལྟར་ཐོགས་ཐོགས་པའི་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་མེ་ཏོག་གི་ཕྲེང་བ་རྣམས་བཅོམ་ལྡན་འདས་ལ་མངོན་པར་གཏོར་ཏོ། །མེ་ཏོག་གི་ཕྲེང་བ་དེ་དག་གཏོར་མ་ཐག་ཏུ་དེ་ནས་དེའི་ཚེ་འདི་ལྟ་\nསྟེ། སངས་རྒྱས་ཀྱི་མཐུས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་མེ་ཏོག་སྣ་ཚོགས་ཀྱི་ཕྲེང་བས་ལེགས་པར་བརྒྱན་པར་གྱུར་ཅིང་མིག་མངས་རིས་སུ་གནས་པར་ཀུན་དུ་སྣང་ང་ོ། །གསང་བ་པའི་བདག་པོ་ལག་\nན་རྡོ་རྗེ་ལུང་བསྟན་པའི་ལེའུ་ཞེས་བྱ་བ་སྟེ་བཅུ་དྲུག་པའོ། །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཞི་བའི་བློ་གྲོས་ཀྱིས། གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །གསང་\nབ་པའི་བདག་པོ་ཁྱོད་དེ་བཞིན་གཤེགས་པས་ལུང་བསྟན་མོད། སྨྲས་པ། རིགས་ཀྱི་བུ་རྨི་ལམ་གྱི་རང་བཞིན་ལྟ་བུའི་བསྟན་པས་བདག་ལུང་བསྟན་ཏོ། སྨྲས་པ། ཅི་ཞིག་ཐོབ་པར་བྱ་བའི་ཕྱིར་ཁྱོད་ལུང་བསྟན། སྨྲས་པ། \nརིགས་ཀྱི་བུ་ཐོབ་པར་བྱ་བ་མེད་པར་ལུང་བསྟན་པ་ཐོབ་བོ། །སྨྲས་པ་ཅི་ཞིག་ཐོབ་པ་མེད། སྨྲས་པ། སེམས་ཅན་དང་། སྲོག་དང་། གང་ཟག་དང་། གས་ོ་བ་དང་། སྐྱེས་བུ་ཐོབ་པ་མེད་དོ། །ཕུང་པོ་རྣམས་དང་། ཁམས་\nརྣམས་དང་། སྐྱེད་མཆེད་རྣམས་ཐོབ་པ་མེད་དོ། །དགེ་བ་དང་། མི་དགེ་བ་དང་། ཁ་ན་མ་ཐོ་བ་དང་བཅས་པ་དང་། ཁ་ན་མ་ཐོ་བ་མེད་པ་དང་། ཟག་པ་དང་བཅས་པ་དང་། ཟག་པ་མེད་པ་དང་། འཇིག་རྟེན་པ་དང་། འཇིག་རྟེན་ལས་འདས་པ་དང་། <span class='add'>  འདུས་  </span>བྱས་དང་། \nའདུས་མ་བྱས་དང་། ཀུན་ནས་ཉོན་མོངས་པ་དང་། རྣམ་པར་བྱང་པ་དང་། འཁོར་བ་དང་། མྱ་ངན་ལས་འདས་པའི་བར་དུ་ཐོབ་པ་མེད་དོ། །སྨྲས་པ། གལ་ཏེ་ཐོབ་པ་མེད་ན་འདིར་ཅི་ཞིག་ལུང་སྟོན། སྨྲས་པ། མི་"
 ],
 [
  "78.197a",
  "ཀུན་དུ་མི་འབྱུང་བ་དེ་ཉིད་ཆོས་ཡིན་ནོ། དེ་བས་ན་ཆོས་ཐམས་ཅད་ནི་བརྗོད་དུ་མེད་པ། སྒྲ་མེད་པ། བརྗོད་པ་མེད་པའོ། རིགས་ཀྱི་བུ་སུ་ཞིག་བདག་སྨྲའོ་ཞེས་སྨྲ་བ་དེ་འཆལ་བར་སྨྲ་བའོ། །\nགང་འཆལ་པར་སྨྲ་བ་དེ་ལ་ཆོས་མེད་དོ། །འདུལ་བ་མེད་དོ། །སྨྲས་པ། གསང་བ་པའི་བདག་པོ་གང་ཆོས་གསུང་བའི་དེ་བཞིན་གཤེགས་པ་འཆལ་པར་གསུང་བར་མི་འགྱུར་རམ། སྨྲས་པ་། ཞི་བའི་བློ་\nགྲོས་དེ་བཞིན་གཤེགས་པས་ཡི་གེ་གཅིག་ཀྱང་མ་གསུངས་སོ། །མ་བརྗོད་དོ་ཞེས་ཁོ་བོས་སྔར་མ་བཤད་དམ། དེ་ལྟ་མོད་ཀྱི་སྨོན་ལམ་གྱི་དབང་གིས་དེ་བཞིན་གཤེགས་པའི་གསུང་སེམས་ཅན་རྣམས་\nཀྱིས་དམིགས་སོ། །སྨྲས་པ། སྨྲས་ན་ཉེས་པ་ཅི་ཡོད། སྨྲས་པ། ངག་གི་ལས་ཀྱི་ཉེས་པར་འགྱུར་རོ། །སྨྲས་པ། ངག་གི་ལས་ལས་ཉེས་པ་ཅི་ཞིག་འབྱུང། སྨྲས་པ། ཡི་གེ་ལ་སེམས་པས་བཀླགས་\nཔའི་ཉེས་པར་འགྱུར་རོ། །སྨྲས་པ། ཉེས་པ་མེད་པ་གང་<span class='add'>  ཡིན།   </span>སྨྲས་། <span class='add'>    </span>པ། གང་མི་སྨྲ་མི་རྗོད་པ་དེ་ལ་རྣམ་པར་རིག་པ་གང་ཡང་མེད་དོ། །རྣམ་པར་རིག་པ་མེད་པ་ནི་ཉེས་པ་མེད་པའོ། །གང་བདག་\nལ་རྣམ་པར་རིག་པར་མི་བྱེད་པ་དང་། གཞན་ལ་རྣམ་པར་རིག་པར་མི་བྱེད་པ་དེ་ཉེས་པ་མེད་པའོ། །སྨྲས་པ། ཉེས་པའི་རྩ་བ་གང་ཡིན། སྨྲས་པ་། ཉེས་པའི་རྩ་བ་ནི་འཛིན་པའོ། །སྨྲས་པ། འཛིན་དྷ\nཔའི་རྩ་བ་ཅི་ཡིན། སྨྲས་པ། མངོན་པར་ཞེན་པ་ནི་རྩ་བའོ། །སྨྲས་པ། མངོན་པར་ཞེན་པའི་རྩ་བ་ཅི་ཡིན། སྨྲས་པ། ཡང་དག་པ་མ་ཡིན་པ་ཀུན་བརྟགས་པ་ནི་རྩ་བའོ། །སྨྲས་པ། ཡང་དག་པ་\nམ་ཡིན་པ་ཀུན་བཏགས་པའི་རྩ་བ་ཅི་ཡིན། སྨྲས་པ། ལྷག་པར་དམིགས་པའི་ལྟ་བ་ནི་རྩ་བའོ། །སྨྲས་པ། ཅི་ཞིག་ལ་ལྷག་པར་དམིགས། སྨྲས་པ། གཟུགས་རྣམས་དང་། སྒྲ་རྣམས་དང་། དྲི་རྣམས་"
 ],
 [
  "78.189b",
  "སེམས་གནས་ཏེ། ཞི་བའི་བློ་གྲོས་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཀྱི་ཕྱིར་ཡིད་ལ་མི་བྱེད་པའི་དམིགས་པ་དེ་གང་ཡང་མེད་དོ། །བྱང་ཆུབ་སེམས་དཔའ་དེའི་དམིགས་པ་ཐམས་\nཅད་ནི་བྱང་ཆུབ་<span class='add'>  ་ཡོངས་  </span>སུ་བསྔོ་པའོ། །ཆོས་ཐམས་ཅད་བྱང་ཆུབ་ཀྱི་རྗེས་སུ་སོང་བར་མཐོང་བར་མཐོང་བ་འདི་ཡང་བྱང་ཆུབ་སེམས་དཔའི་ཐབས་ལ་མཁས་པ་སྟེ། ཞི་བའི་བློ་གྲོས་འདི་ལྟ་སྟེ། དཔེར་སྟོང་གསུམ་\nགྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ན་ས་ལས་སྐྱེ་བ་ནི་ཇི་ལྟ་བར་སྐྱེས་པའི་སེམས་ཅན་རྣམས་ཀྱི་ཡོངས་སུ་སྤྱད་པར་མི་འགྱུར་པ་གང་ཡང་མེད་དོ། །ཞི་བའི་བློ་གྲོས་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་\nདཔའ་ཐབས་ལ་མཁས་པའི་བྱང་ཆུབ་ཀྱི་ཕྱིར་ཡོངས་སུ་སྤྱད་པ་དང། བྱང་ཆུབ་ཀྱི་ཕྱིར་ཕན་འདོག་པར་མི་མཐོང་བའི་དམིགས་པ་གང་ཡང་མེད་དོ། །ཞི་བའི་བློ་གྲོས་འདི་ལྟ་སྟེ། དཔེར་ན་གཟུགས་གང་ཅི་\nཡང་རུང་སྟེ་དེ་ཐམས་ཅད་ནི་འབྱུང་བ་ཆེན་པོ་བཞི་ལས་གྱུར་པའོ། །ཞི་བའི་བློ་གྲོས་དེ་བཞིན་དུ་ཐབས་ལ་མཁས་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་དམིགས་པ་གང་ཅི་ཡང་རུང་སྟེ། དེ་ཐམས་ཅད་ནི་བྱང་\nཆུབ་ཀྱི་རྣམ་པ་དང་ཡང་དག་པར་ལྡན་པའོ། །ཞི་བའི་བློ་གྲོས་སེམས་ཅན་གང་དག་འཇུངས་པ་དང། བྱས་པ་མི་གཟོ་བ་དེ་དག་ལས་བྱང་ཆུབ་སེམས་དཔའི་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་\nཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ། །སེམས་ཅན་གང་དག་ཁྲོ་བ་ལ་སྤྱོད་པ་དང། ལེ་ལོ་ཅན་དེ་དག་ལས་བྱང་ཆུབ་སེམས་དཔའི་བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་\nཔ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ། །སེམས་ཅན་གང་དག་གླེན་པ་དང། རྨོངས་པ་དེ་དག་ལས་བྱང་ཆུབ་སེམས་དཔའི་བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་"
 ],
 [
  "78.199a",
  "གྱི་ལྡ་ལྡི་དུ་མས་མཛེས་པར་བྱས་པ། མེ་ཏོག་གི་ཕྲེང་བ་དུ་མས་བཀབ་པ། པོག་པོར་དུ་མ་ནས་བདུགས་པ། ལྷའི་མེ་ཏོག་ཁ་དོག་དུ་མ་དང་། ཁ་དོག་སྣ་ཚོགས་བཀྲམ་པ། བཀྲ་བ། བལྟ་ན་སྡུག་\nཔ། ཡིད་དུ་འོང་བ། ལུས་སིམ་པར་བྱེད་པ། སེམས་ལ་དགའ་བ་བསྐྱེད་པ། ཡོན་ཏན་གྱི་ཚོགས་མཐའ་ཡས་པ་དང་ལྡན་པ། བསྔགས་པའི་བསྟན་པ་ཚད་མེད་པ་སྟེ། འཁོར་གྱི་ཁྱམས་དེར་སེང་གེའི་ཁྲི་རིན་\nཔོ་ཆེའི་རྩ་བས་བརྒྱན་པ། རིན་པོ་ཆེའི་ཁ་ཁྱེར་གྱིས་བསྐོར་པ། རིན་པོ་ཆེའི་པད་མ་བཀོད་པ་དང་ལྡན་པ། མུ་ཏིག་གི་དྲ་བས་གཡོགས་པ། མིག་མངས་རིས་སུ་བྲེས་པ། ལྷའི་རས་བཅོས་བུ་དུ་མ་བཏིང་བ། སྟེང་\nདུ་རིན་པོ་ཆེའི་དྲ་བ་བྲེས་པ། བཀོད་པ་སྔོན་མ་མཐོང་མ་ཐོས་པ། འཇིག་རྟེན་གྱི་ཁམས་མང་པོ་དག་ན་མེད་པ་བརྒྱ་སྟོང་མང་པོ་བྱུང་ངོ་། །ཞལ་ཟས་རོ་བྲོ་བ་བརྒྱས་བསྒོས་པ་འང་བཤམས་སོ། །སེང་གེའི་\nཁྲི་ལ་མི་རྟེན་པ་བརྒྱ་སྟོང་ཡང་བཞག་སྟེ། <span class='add'>  སེང་  </span>གེའི་ཁྲི་རེ་རེའི་བར་སྣང་ལ་ཡང་རིན་པོ་ཆེའི་གདུགས་རྣམ་པ་ཐམས་ཅད་ཀྱི་མཆོག་དང་ལྡན་པ་དག་བྲེས་སོ། །དེ་ནས་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེས་འཁོར་གྱི་\nཁྱམས་བཀོད་པ་དང་། སེང་གེའི་ཁྲི་བཀོད་པ་རྣམ་པ་དེ་ལྟ་བུ་བྱས་ནས་དྲན་པ་དང་ལྡན་ཞིང་ཤེས་བཞིན་དུ་ཏིང་ངེ་འཛིན་དེ་ལས་ལངས་ཏེ། དེའི་ནུབ་མོ་ཉིད་དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པར་འོས་པའི་ཞལ་ཟས། \nབྱང་ཆུབ་སེམས་དཔའི་བསམ་པས་ཡོངས་སུ་དག་པ། རོ་བྲོ་བ་མང་པོ་སྣ་ཚོགས་དང་ལྡན་པ། བསོད་པ་མང་ཡང་བཤམས་ནས་ནམ་ནངས་པ་དང་། རྒྱལ་པོ་ཆེན་པོ་བཞི་ལ་སྨྲས་པ། གྲོགས་པོ་དག་ཤེས་པར་\nགྱིས་ཤིག །ཁོ་བོས་བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་དང་། ཉན་ཐོས་ཆེན་པོ་རྣམས་དང་ཐབས་གཅིག་ཏུ། གསང་བ་པ་རང་གི་གནས་སུ་སྤྱན་དྲངས་ན། བཅོམ་ལྡན་འདས་ཀྱིས་ཁོ་བོ་ལ་ཐུགས་"
 ],
 [
  "78.198b",
  "རྒྱས་ཀྱི་ཞིང་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཁྲི་ལུང་བསྟན་པའི་ཕྱིར་བཅོམ་ལྡན་མཚན་མོ་མི་ཉལ་ཙམ་ན་སྤྱོད་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་ལྡན་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་ཏེ། འཇིག་རྟེན་\nགྱི་ཁམས་འདི་ནས་ཤར་ཕྱོགས་ལོགས་སུ་སངས་རྒྱས་ཀྱི་ཞིང་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་འདས་ཏེ། འཇིག་རྟེན་གྱི་ཁམས་ཡོན་ཏན་རིན་པོ་ཆེ་མཐའ་ཡས་པ་བཀོད་པ་ཞེས་བྱ་བར་གཤེགས་པའི་ཚེ་སངས་རྒྱས་ཀྱི་ཞིང་\nདེར་བདག་གིས་ལྷའི་དང་། མིའི་བཀོད་པ་བསམ་གྱིས་མི་ཁྱབ་པ་ལས་ཡང་དག་པར་འདས་པའི་བཀོད་པ་མཐོང་གིས། བཅོམ་ལྡན་འདས་ལ་མཆོད་པའི་ལས་ཀྱི་ཕྱིར། བདག་གིས་འཇིག་རྟེན་གྱི་ཁམས་ཡོན་\nཏན་རིན་པོ་ཆེ་མཐའ་ཡས་པ་བཀོད་པ་དེའི་བཀོད་པ་ཅི་འདྲ་བ་དེ་འདྲ་བའི་འཁོར་གྱི་ཁྱམས་བཀོད་པར་བྱའོ་སྙམ་མོ། །དེ་ནས་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེས་དེའི་ཚེ་བཀོད་པ་ཆེན་པོའི་རྒྱལ་པོ་ཞེས་བྱ་བའི་\nཏིང་ངེ་འཛིན་ལ་སྙོམ་པར་ཞུགས་སོ། །གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེ་བཀོད་པ་ཆེན་པོའི་རྒྱལ་པོའི་ཏིང་ངེ་འཛིན་ལ་སྙོམ་པར་ཞུགས་མ་ཐག་ཏུ་དེ་ནས་དེའི་ཚེ་འཇིག་རྟེན་གྱི་ཁམས་ཡོན་ཏན་རིན་པོ་ཆེ་\nམཐའ་ཡས་པ་བཀོད་པ་དེའི་བཀོད་པ་ཅི་འདྲ་པ་དེ་འདྲ་བའི་འཁོར་གྱི་ཁྱམས་བཀོད་པ་ཞིག་ལྕང་ལོ་ཅན་གྱི་ཕོ་བྲང་འཁོར་གྱི་དབུས་ན་གནས་པར་སྣང་ངོ་། །འཁོར་གྱི་ཁྱམས་དེ་ཡང་ཡངས་ཤིང་རྒྱ་ཆེ་སྟེ། ཤར་\nནུབ་ཏུ་ཆུར་ནི་<span class='add'>  དཔག་  </span>ཚད་དྲུག་བཅུ་རྩ་བཞི་ཡོད་པ། ལྷོ་བྱང་དུ་རྒྱར་ནི་དཔག་ཚད་བཞི་བཅུ་རྩ་གཉིས་ཡོད་པ། ས་གཞི་ནི་བ་ཻདཱུ་རྻ་སྔོན་པོའི་རང་བཞིན་དུ་གནས་པ། ཕྱིར་ནི་ཨན་ད་རྙིལ་ལས་བྱས་པ། ཐུང་གི་\nཕྲུགས་རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱིས་སྤྲས་པ། འཛམ་བུའི་ཆུ་བོའི་གསེར་གྱི་པད་མས་བརྒྱན་པ། རྒྱན་ཕྲེང་སྣ་ཚོགས་དུ་མས་སྤྲས་པ། རས་བཅོས་བུ་དུ་མ་བཏིང་བ། མུ་ཏིག་གི་རྒྱན་ཕྲེང་དུ་མ་སྦྱངས་པ། དར་"
 ],
 [
  "78.198a",
  "གཡོག་འཁོར་གང་ལགས་པ་དེ་དག་གི་ཡུན་རིང་པོའི་དོན་དང་། སྨན་པ་དང་། བདེ་བ་དང་། གྲུབ་པ་དང་། བདེ་བར་འགྱུར་ལགས་སོ། །བཅོམ་ལྡན་འདས་ཀྱིས་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེ་ལ་\nཐུགས་བརྩེ་བ་དང་། སེམས་ཅན་ཚང་མེད་པ་གང་དག་གི་དགེ་བའི་རྩ་བ་རྣམ་པར་སྤེལ་བ་དང་། གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེའི་བསམ་པ་ཡོངས་སུ་བཀང་བའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་\nཆེན་པོ་རྣམས་དང་། ཉན་ཐོས་ཆེན་པོ་རྣམས་དང་ཐབས་གཅིག་ཏུ་གསང་བ་པའི་གནས་ལྕང་ལོ་ཅན་གྱི་ཕོ་བྲང་འཁོར་དུ་གཤེགས་ཏེ་ཞག་བདུན་བཞུགས་པར་གནང་ངོ་། །དེ་ནས་གསང་བ་པའི་བདག་པོ་ལག་\nན་རྡོ་རྗེས། བཅོམ་ལྡན་འདས་ཀྱིས་ཅང་མི་གསུང་བས་གནང་བར་མི་མཛད་པ་རིག་ནས་ཚིམ་ཞིང་མགུ་ལ་ཡིད་རངས་ཏེ། རབ་ཏུ་དགའ་ནས་དགའ་བ་དང་ཡིད་བདེ་བ་སྐྱེས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་\nམགོ་བོས་ཕྱག་འཚལ་ནས་བཅོམ་ལྡན་འདས་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱི་<span class='add'>  ཐད་  </span>ནས་སོང་ནས་ལྕང་ལོ་ཅན་གྱི་ཕོ་བྲང་འཁོར་ག་ལ་བ་དེར་སོང་སྟེ་རང་གི་གནས་སུ་ཕྱིན་ཏོ། དེ་ནས་གསང་\nབ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེས་འདི་སྙམ་དུ་བསམས་ཏེ། བདག་གིས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པའི་ལས་ཀྱི་ཕྱིར་ཅི་ནས་<span class='add'>  འདོད་  </span>པ་ན་སྤྱོད་པ་དང་། གཟུགས་ན་སྤྱོད་པའི་ལྷའི་བུ་ཐམས་\nཅད་ངོ་མཚར་དུ་སེམས་པར་འགྱུར་བ་དང་། ཕྱོགས་བཅུ་ནས་འདུས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱང་དགའ་བ་སྐྱེ་བར་འགྱུར་བ་དང་། བདག་གིས་ཀྱང་དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པ་རྒྱ་ཆེན་པོ་བྱས་\nཔར་འགྱུར་བ་དེ་ལྟ་བུའི་འཁོར་གྱི་ཁྱམས་བཀོད་པ་བྱའོ་སྙམ་མོ། །དེས་ཡང་འདི་སྙམ་དུ་བསམས་ཏེ་བདག་གིས་མངོན་པར་ཤེས་ཏེ། དུས་གཅིག་ཅིག་ན་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་བཀོད་པའི་རྒྱལ་པོའི་སངས་"
 ],
 [
  "78.199b",
  "བརྩེ་བའི་ཕྱིར་<span class='add'>  གནང་  </span>གིས། དེ་ལ་ཁྱེད་དཔུང་དང་བཅས། གཡོག་འཁོར་དང་བཅས་པར་མི་གཡེང་བའི་སེམས་ཀྱིས་ཞག་བདུན་གྱི་བར་དུ་ལས་གཞན་མི་བྱེད་པར་དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པ་དང་། རིམ་\nགྲོ་བྱ་བར་སྤྲོ་བར་གྱིས་ཤིག །ལྕང་ལོ་ཅན་གྱི་ཕོ་བྲང་འཁོར་ན་གནོད་སྦྱིན་དང་། སྲིན་པོ་དང་། ཡི་དགས་དང་། ཤ་ཟ་དང་། དྲི་ཟ་དང་། གྲུལ་བུམ་དང་། གསང་བ་པ་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་ཇི་སྙེད་འཁོད་པ་དང་། \nདེ་མ་ཡིན་པའི་སེམས་ཅན་གཞན་དག་འཁོད་པ་དེ་དག་ལ་ཡང་གྲོགས་པོ་དག་ཤེས་པར་གྱིས་ཤིག །ཁོ་བོས་བཅོམ་ལྡན་འདས་ལྕང་ལོ་ཅན་གྱི་ཕོ་བྲང་འཁོར་འདིར་སྤྱན་དྲངས་ན་གཤེགས་པར་གནང་གིས། དེ་ལ་ཁྱེད་ཀྱིས་\nངན་སེམས་མེད་པ་དང་། སྡང་བ་མེད་པ་དང་དགའ་བ་དང་། དང་བ་དང་མཆོག་ཏུ་དགའ་བ་མང་པོས་བཅོམ་ལྡན་འདས་དེ་ལ་བསྙེན་བཀུར་གྱིས་ཤིག །ཆོས་ཀྱང་ཉོན་ཅིག་ཅེས་བསྒོའོ།།      །།       །།\nབམ་པོ་བརྒྱད་པ། དེ་ནས་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེས་བུ་ཐུ་བོ་རྡོ་རྗེའི་སྡེ་ཞེས་བྱ་བ་ལ་སྨྲས་པ། བཞིན་བཟངས་ཁྱོད་རང་གི་རྫུ་འཕྲུལ་གྱི་སྟོབས་ཀྱིས་<span class='add'>  སོང་  </span>ལ་ཚངས་རིས་ནས་གཟུང་སྟེ། འོག་མིན་གྱི་བར་\nགྱིས་ལྷ་རྣམས་ལ་བཅོམ་ལྡན་འདས་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེའི་གནས་ལྕང་ལོ་ཅན་གྱི་ཕོ་བྲང་འཁོར་དུ་གདུགས་ཚོད་གསོལ་གྱིས། ཁྱེད་ཀྱི་<span class='add'>  ནང་  </span>ནས་སུ་ལྟ་འདོད་པ་དེ་མྱུར་དུ་ཤོག་ཤིག་ཅེས་སྦྲོན་ཅིག །\nཡབ་དེ་ལྟར་བགྱིའོ་ཞེས་ཏེ་ཇི་སྐད་བསྒོ་བ་བཞིན་དུ་གསང་བ་པའི་བདག་པོའི་བུ་<span class='add'>  དེས་བྱས་  </span>སོ། །དེ་ནས་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེས་བུ་གཉིས་པ་ལག་བཟངས་ཞེས་བྱ་བ་ལ་སྨྲས་པ། ཁྱོད་རང་གི་\nརྫུ་འཕྲུལ་གྱི་སྟོབས་ཀྱིས་སོད་ལས་བླ་པའི་ལྷ་རྣམས་ནས་བཟུང་སྟེ། བར་སྣང་དང་། རྒྱལ་ཆེན་བཞིའི་རིས་དང་། སུམ་ཅུ་རྩ་གསུམ་པ་དང་། འཐབ་བྲལ་དང། དགའ་ལྡན་དང་། འཕྲུལ་དགའ་དང་། གཞན་"
 ],
 [
  "78.200b",
  "གཏམ། ཡོན་ཏན་རྒྱ་མཚོ་གཤེགས་སུ་གསོལ། ཐུགས་རྗེའི་དཀྱིལ་འཁོར་<span class='add'>  དཔལ་  </span>ལྡན་པ། ཤེས་རབ་འོད་ཟེར་ལེགས་པར་བརྒྱན། སློབ་མ་པད་མ་ཁ་འབྱེད་པ། ཐུབ་པ་ཉིད་མ་གཤེགས་སུ་\nགསོལ། ཕས་ཀྱི་རྒོལ་བས་མི་བསྐྱོད་ཅིང་། རྣམ་ཐར་ལ་སོགས་སྨན་ཚོགས་ཅན། སློབ་དང་མི་སློབ་རི་དགས་གཏམ། ཐུབ་པ་རི་བོ་གཤེགས་སུ་གསོལ། དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་\nགསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེས་གདུགས་ཚོད་ཕབ་པར་མཁྱེན་ནས་དགེ་སློང་རྣམས་ལ་བཀལ་སྩལ་པ། དགེ་སློང་དག་གསང་བ་པའི་བདག་པོས་གདུགས་ཚོད་ཕབ་ཀྱིས་ཆོས་གོས་གྱོན་ལ་ལྷུང་བཟེད་\nཐོགས་ཤིག །ཞག་བདུན་བྱིན་གྱིས་བརླབ་པ་བྱིན་གྱིས་རློབས་ལ་གཙུག་ལག་ཁང་སྐྱོང་བསྐོས་ཤིག །དེ་ནས་ཉན་ཐོས་དང་། བྱང་ཆུབ་སེམས་དཔའ་གང་དག་རྫུ་འཕྲུལ་དང་ལྡན་པ་དེ་དག་ནི་རང་གི་རྫུ་\nའཕྲུལ་གྱི་སྟོབས་ཀྱིས་བར་སྣང་ལས་དོང་ངོ་། །གང་དག་རྫུ་འཕྲུལ་དང་ལྡན་<span class='add'>  པ་  </span>མ་ཡིན་<span class='add'>  པ་  </span>དེ་དག་ནི་དེ་བཞིན་གཤེགས་པའི་འོད་ཀྱི་དཀྱིལ་འཁོར་གྱི་ཁྲོད་དུ་ཞུགས་ནས་བཅོམ་ལྡན་འདས་དང་ལྷན་ཅིག་ཏུ་\nནམ་མཁའི་དཀྱིལ་གྱི་ལམ་ནས་དོང་ངོ་། །དེ་ནས་བཅོམ་ལྡན་འདས་བྱ་རྒོད་ཀྱི་ཕུང་པོའི་རི་ལས་མི་སྣང་བར་གྱུར་ནས་བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་ཀྱིས་ནི་བསྐོར། ཉན་ཐོས་ཀྱི་ཚོགས་ཀྱིས་ནི་མདུན་\nདུ་བདར། ལྷའི་ཚོགས་ཀྱིས་ནི་མངོན་<span class='add'>  པར་  </span><span class='add'>  བསྟོད།   </span>ལྷའི་བུ་མོ་རྣམས་ནི་གླུ་དབྱངས་ལེན། འོད་ཟེར་ནི་འགྱེད། མེ་ཏོག་གི་ཆར་ནི་འབེབས། རོལ་མོ་སིལ་སྙན་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ནི་ལེན། ཞིང་རྣམས་\nནི་གཡོ་བར་མཛད་ཅིང་། སངས་རྒྱས་ཀྱི་མཐུ་ཆེན་པོ་དང་རྫུ་འཕྲུལ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་རྣམ་པར་འཕྲུལ་བ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོ་འཕྲུལ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་དཔལ་ཆེན་པོ་དང་།"
 ],
 [
  "78.200a",
  "འཕྲུལ་དབང་བྱེད་ཀྱི་ལྷའི་བུ་རྣམས་ལ་བཅོམ་ལྡན་འདས་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེའི་གནས་ལྕང་ལོ་ཅན་གྱི་ཕོ་བྲང་འཁོར་དུ་གདུགས་ཚོད་གསོལ་གྱིས་ཁྱེར་ཀྱི་<span class='add'>  ནང་  </span>ནས་སུ་ལྟ་འདོད་པ་དེ་མྱུར་\nདུ་ཤོག་ཤིག་ཅེས་སྤྲོན་ཅིག ཡབ་དེ་ལྟར་བགྱིའོ་ཞེས་ཏེ་ཇི་སྐད་བསྒོ་བ་བཞིན་དུ་གཞོན་ནུ་ལག་བཟངས་ཀྱིས་བྱས་སོ། །དེ་ནས་སྐད་ཅིག་ཐང་ཅིག་ཡུད་ཙམ་དེ་ལ་འདོད་པ་ན་སྤྱོད་པ་དང་། གཟུགས་ན་སྤྱོད་པའི་ལྷའི་\nབུ་བརྒྱ་སྟོང་དག་གིས། དཔག་ཚད་ཁྲི་ཁོར་ཡུག་གི་བར་སྣང་ཁྱབ་པར་གྱུར་ཏོ། །དེ་ནས་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེས་བཅོམ་ལྡན་འདས་ཀྱི་མཆོད་པ་བཤམས་ཏེ་ནམ་ནངས་པ་དང་། བུས་མོ་གཡས་པའི་\nལྷ་ང་ས་ལ་བཙུགས་ཏེ། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས་ཚིགས་སུ་བཅད་པའི་དབྱངས་ཀྱིས་བཅོམ་ལྡན་འདས་ལ་གདུག་ཚོད་བབ་པ་གསོལ་པ། །ཐུབ་པ་ཆེན་པོ་དུས་འདི་ལགས། \nསྐྱེས་བུ་གཙོ་བོ་གཤེགས་སུ་གསོལ། སྐྱེས་བུ་དམ་པ་གཤེགས་སུ་གསོལ། སྐྱེས་བུ་ཅང་མཁྱེན་གཤེགས་སུ་གསོལ། ཐུབ་པ་ཆེན་པོ་གདུགས་ཚོད་བབ། རྐང་གཉིས་གཙོ་བོ་གཤེགས་སུ་གསོལ། རྐང་གཉིས་དམ་པ་གཤེགས་སུ་\nགསོལ། རྐང་གཉིས་ཅང་མཁྱེན་གཤེགས་སུ་གསོལ། ཚུལ་ཁྲིམས་པད་མའི་རྫིང་ནས་འཁྲུངས། བརྩོན་འགྲུས་ཆབ་ཀྱིས་རྣམ་པར་འཕེལ། སློབ་མ་<span class='add'>  བུང་  </span>བ་སྒྲ་འབྱིན་པ། ཐུབ་པ་པད་མ་གཤེགས་སུ་གསོལ། \nའཕགས་པའི་བདེན་པར་གནས་བཅས་ཏེ། བྱམས་དང་ཐུགས་རྗེའི་སྤྱན་མངའ་ཞིང་། བདག་མེད་པ་ཡི་སྒྲ་སྒྲོགས་པ། རྒྱལ་བ་སེང་གེ་གཤེགས་སུ་གསོལ། ཁྲིམས་ནི་རྩ་བ་ཆུ་བ་དྲན། བྱང་ཆུབ་ཡན་\nལག་མེ་ཏོག་བརྒྱན། རྣམ་གྲོལ་འབྲས་བུ་ཕུན་སུམ་ཚོགས། རྒྱལ་བ་སྡོང་པོ་གཤེགས་སུ་གསོལ། ཤེས་རབ་རྒྱ་ཆེན་ཟབ་པ་པོ། ཏིང་འཛིན་ཆབ་ནི་གྲང་ལྡན་ཞིང་། རྣལ་འབྱོར་པ་ཡི་ཚོང་པས་"
 ],
 [
  "78.201a",
  "སངས་རྒྱས་ཀྱི་གཟི་བརྗིད་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་སྤྱོད་ལམ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་རྣམ་པར་རོལ་པ་ཆེན་པོས་ལྕང་ལོ་ཅན་གྱི་ཕོ་བྲང་འཁོར་ག་ལ་བ་དེར་ནམ་མཁའི་དཀྱིལ་གྱི་ལམ་ནས་<span class='add'>  ངང་  </span>\nཔའི་རྒྱལ་པོ་བཞིན་དུ་ཐོགས་པ་མེད་པར་གཤེགས་པ་དང་། འདོད་པ་ན་སྤྱོད་པ་དང་། གཟུགས་ན་<span class='add'>  སྤྱོ  </span><span class='add'>  ད་པའི་  </span>ལྷའི་བུ་དེ་དག་གིས་བཅོམ་ལྡན་འདས་ནམ་མཁའི་དཀྱིལ་གྱི་ལམ་ནས་<span class='add'>  ངང་  </span>པའི་རྒྱལ་པོ་ལྟར་ཐོགས་པ་ནི་མི་\nམངའ། ཉི་མའི་དཀྱིལ་འཁོར་འཆར་བ་ནི་འདྲ། ཟླ་བ་ཉ་བའི་དཀྱིལ་འཁོར་སྐར་མའི་ཚོགས་ཀྱིས་བསྐོར་བ་དང་ནི་མཚུངས། ལྷའི་རྒྱལ་པོ་བརྒྱ་བྱིན་ལྟར་ལྷའི་ཚོགས་ཀྱིས་ནི་བསྐོར། ཚངས་པ་ཆེན་པོ་ལྟར་ཚངས་\nཔའི་འཁོར་གྱིས་ནི་བསྐོར་ཅིང་གཤེགས་པར་རྒྱང་རིང་པོ་ནས་མཐོང་ངོ་། །མཐོང་ནས་ཀྱང་ཚིམ་ཞིང་མགུ་ལ་ཡི་རངས་ཏེ། རབ་ཏུ་དགའ་ནས་དགའ་བ་དང་ཡིད་བདེ་བ་སྐྱེས་ཏེ། བཅོམ་ལྡན་འདས་ལ་མཆོད་པའི་\nལས་ཀྱི་ཕྱིར་ལྷའི་མེ་ཏོག་ཨུད་པ་ལ་དང་། ཀུ་མུ་ད་དང་། པད་མ་དཀར་པོ་དང་། མན་དཱ་ར་བ་དང་། མན་དཱ་ར་བ་ཆེན་པོ་དང་། ཡོངས་འདུ་དང་ཡོངས་འདུ་ཆེན་པོ་དང་། མན་འཛུ་ཤ་ཀ་དང་། མན་འཛུ་ཤ་ཀ་ཆེན་པོ་དང་། ཧྶྭ་ལ་དང་། \nཧྶྭ་ལ་ཆེན་པོ་དང་། མདོག་མཛེས་དང་། མདོག་མཛེས་ཆེན་པོ་དང་། འཁོར་ལོ་དང་། འཁོར་ལོ་ཆེན་པོ་<span class='add'>  དང་།   </span>དྲི་ཞིམ་དང་། པད་མ་མདབ་བརྒྱ་དང། འདབ་སྟོང་དང་། སྐྲ་འོད་དང་། སྐར་མ་དགའ་དང་། ཀུན་ཏུ་\nབསྲུང་དང་། བསྲུང་རྟག་དང་། རྟག་ཏུ་མེ་ཏོག་ཆགས་མིག་ཏུ་སྡུག་པ་དེ་དག་དང་། མེ་ཏོག་གཞན་དག་གིས་ཀྱང་བཅོམ་ལྡན་འདས་ལ་མངོན་པར་གཏོར་ཏོ། །གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དག་ཀྱང་\nབསྒྲེང་ངོ་། །རོལ་མོ་སིལ་སྙན་བརྒྱ་སྟོང་ཡང་ལེན་ཏོ། །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བཀོད་པ་རྣམ་པ་དེ་ལྟ་བུ་མེ་ཏོག་གི་ཆར་འབེབ་པ་དང་། སྤོས་དང་། ཕྲེང་བ་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། གོས་དང་།"
 ],
 [
  "78.202a",
  "བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ། །དེ་ནས་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེ་བཙུན་མོའི་འཁོར་དང་བཅས་། གཉེན་གྱི་གཡོག་དང་བཅས་ཤིང་འཁོར་\nདང་། ཡོན་ཏན་མཐའ་ཡས་བཀོད་པའི་གཡོག་འཁོར་དང་བཅས་ཏེ། མེ་ཏོག་དང་། བདུག་པ་དང་། སྤོས་དང་། ཕྲེང་བ་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། གོས་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་ཐམས་\nཅད་ཐོགས་ཤིང་། སིལ་སྙན་དང་། ཕེག་རྡོབ་པ་དང་། རོལ་མོའི་སྒྲ་འབྱིན་པ་རྣམས་དང་ལྷན་ཅིག་ཏུ་རྒྱལ་པོ་རྣམ་ཐོས་ཀྱི་བུའི་འདུན་<span class='add'>  ཁང་  </span><span class='add'>  ག་  </span>ལ་བ་དང་། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས་བཅོམ་ལྡན་\nའདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། ལན་བདུན་བསྐོར་བ་བྱས་ནས། ཇི་ལྟར་ཐོགས་ཐོགས་པའི་མེ་ཏོག་དང་། བདུག་པ་དང་། སྤོས་དང། ཕྲེང་བ་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། གོས་དང་། གདུགས་\nདང་། རྒྱལ་མཚན་དང་། བ་དན་རྣམས་ཀྱིས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་བྱས་ཏེ། སིལ་སྙན་དང་། རོལ་མོ་བྱས་ནས། བཅོམ་ལྡན་འདས་ལ་ཕྱག་འཚལ་ཏེ། དགེ་སློང་གི་དགེ་འདུན་དང་། བྱང་ཆུབ་སེམས་\nདཔའི་ཚོགས་དང་བཅས་པར་ལྷན་ཅིག་ཏུ་རང་གི་འཁོར་གྱི་<span class='add'>    </span>ཁྱམས་སུ་སྤྱན་དྲངས་སོ། །དེ་ནས་བཅོམ་ལྡན་འདས་འཁོར་གྱི་ཁྱམས་དེར་ས་ལ་མི་རྟེན་པ་རྣམ་པ་ཐམས་ཅད་ཀྱི་མཆོག་དང་ལྡན་པ་ཉིད་ཀྱི་སེང་གེའི་གདན་\nཇི་ལྟར་བཤམས་པ་ལ་བཞུགས་སོ། །བྱང་ཆུབ་སེམས་དཔའ་དང་ཉན་ཐོས་ཆེན་པོ་དེ་དག་དང་། ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་ཡང་སྟན་ཅི་རིགས་<span class='add'>  པ་  </span>དག་ལ་འཁོད་དོ། །དེ་ནས་གསང་བ་པའི་བདག་པོ་ལག་ན་\nརྡོ་རྗེས་བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། འཇིག་རྟེན་སྐྱོང་བ་དེ་དག་དང་། ལྷའི་འཁོར་ཆེན་པོ་དེ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཁྱེད་དེ་བཞིན་གཤེགས་པ་ལ་བསུ་བ་གྱིས་ཤིག །མཆོད་པ་དང་། རིམ་གྲོ་གྱིས་ཤིག །དེ་ནི"
 ],
 [
  "78.204a",
  "ཀྱི་ལམ་ལ་མི་དམིགས་པ་ཡིན་ནོ། །དེ་<span class='add'>  དད་  </span>པར་གྱུར་ནས་། དགེ་སྦྱོང་ངམ་བྲམ་ཟེ་གང་དག་ཡང་དག་པར་སོང་བ་དང་། ཡང་དག་པར་ཞུགས་པ་དང་། ཚུལ་ཁྲིམས་དང་ལྡན་པ་དང་། ཡོན་ཏན་དང་ལྡན་པ་དང་། \n<span class='add'>  ངེས་  </span>པ་དང་། དགེ་བའི་ཆོས་ཅན་དང་། མང་དུ་ཐོས་པ་དང་། ཐོས་པ་ལ་མངོན་པར་བརྩོན་པ་དང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱེད་པ་ལ་རབ་ཏུ་བརྩོན་པ་དང་། ཞི་བ་དང་། དུལ་བ་དང་། ཉེ་བར་ཞི་བ་དང་། <span class='add'>  དོ་  </span>ཟློག་ཕོད་པར་སྨྲ་ཞིང་\nགཅམ་བུར་མི་སྨྲ་བ་དང་། དགེ་བའི་བསམ་པ་ཅན་དང་། མི་དགེ་བའི་ཆོས་ཡོངས་སུ་སྤོང་བ་དང་། མི་རྒོད་པ་དང་། མ་ཁེངས་པ་དང་། མུ་ཅོར་སྨྲ་བ་མ་ཡིན་པ་དང་། ཚིག་མ་འཆལ་པ་དང་། དྲན་པ་ཉེ་བར་གནས་པ་དང་། \nཤིན་ཏུ་མཉམ་པར་བཞག་པའི་སེམས་དང་ལྡན་པ་དང་། སྲིད་པའི་ཚུལ་བཅད་པ་དང་། ཟུག་རྔུ་ཕྱུང་བ་དང་། ཁུར་བོར་བ་དང་། སོམ་ཉི་ལས་ངེས་པར་རྒལ་བ་དང་། ཐེ་ཙོམ་ལས་རྒལ་བ་དང་། ཡང་སྲིད་པ་ལས་རྒལ་བ་\nའདི་ལྟ་སྟེ། དེ་བཞིན་གཤེགས་པ་དང་། དེ་བཞིན་གཤེགས་པའི་ཉན་ཐོས་དགེ་སྦྱོང་དང་། བྲམ་ཟེ་རྣམ་པ་དེ་ལྟ་བུ་ལ་དགེ་བའི་བཤེས་གཉེན་དུ་རིག་ནས་སྟེན་ཏོ། །བསྙེན་ཏོ། །བསྙེན་བཀུར་བྱེད་དོ། །མཉེས་པར་བྱེད་\nཅིང་མི་མཉེས་པར་མི་བྱེད་ལ་དགྱེས་པར་བྱེད་དེ། དེས་དགེ་བའི་བཤེས་གཉེན་དེ་དག་མཉེས་པར་བྱས་པས་ཆོས་ཀྱི་གཏམ་གྱིས་ཡང་དག་པར་སྟོན་ཡང་དག་པར་འཛིན་དུ་འཇུག །ཡང་དག་པར་གཟེང་སྟོད། ཡང་དག་\nཔར་དགའ་བར་མཛད་དེ་སྦྱིན་པས་ནི་ལོངས་སྤྱོད་ཆོན་པོར་འགྱུར་བར་ཡང་དག་པར་སྟོན། ཚུལ་ཁྲིམས་ཀྱིས་ནི་མཐོ་རིས་སུ་སྐྱེ་བ་དང་། ཐོས་པས་ནི་ཤེས་རབ་ཆེན་པོར་འགྱུར་བ་དང་། བསྒོམས་པས་ནི་འབྲལ་བར་འགྱུར་\nབར་ཡང་དག་པར་སྟོན་ཏོ། །འདི་ནི་སྦྱིན་པའོ། །འདི་ནི་སྦྱིན་པའི་རྣམ་པར་སྨིན་པའོ། །འདི་ནི་སེར་སྣ་འོ། །འདི་ནི་སེར་སྣའི་རྣམ་པར་སྨིན་པའོ། །འདི་ནི་ཚུལ་ཁྲིམས་སོ། །འདི་ནི་ཚུལ་ཁྲིམས་ཀྱི་རྣམ་པར་སྨིན་པའོ། །"
 ],
 [
  "78.203a",
  "ཇི་ལྟར་བཤམས་པའི་ཞལ་ཟས་བཅོམ་ལྡན་འདས་ལ་གསོལ་ཅིག །དེ་ནས་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེ་བཙུན་མོའི་འཁོར་དང་བཅས། གཉེན་གྱི་འཁོར་དང་བཅས། བུ་དང་བཅས། དཔུང་དང་\nབཅས། གཡོག་འཁོར་དང་བཅས་ཏེ། རང་གི་ལག་ནས་གུས་པར་སྟི་སྟང་དུ་བྱས་ཏེ། བཟའ་བ་དང་། བཅའ་བ་བསོད་པ་མང་པོ་རོ་བྲོ་བ་མང་པོ་དུ་མ་དང་ལྡན་པ་བྱང་ཆུབ་སེམས་དཔའི་ལྷག་པའི་བསམ་པས་ཡོངས་སུ་དག་པ། དེ་བཞིན་\nགཤེགས་པ་ལ་མཆོད་པར་འོས་པའི་ཞལ་ཟས་ཀྱིས་དེ་བཞིན་གཤེགས་པ་བྱང་ཆུབ་སེམས་དཔའི་དགེ་འདུན་དང་དགེ་སློང་གི་དགེ་འདུན་དང་བཅས་པ་ལ་བསྟབས་ཏེ་ཚིམ་པར་བྱས་སོ། །བསྟབས་ཏེ་ཚིམ་པར་བྱས་ནས་ལྷུང་\nབཟེད་<span class='add'>  གྱུ་  </span>ཏེ། བཅོམ་ལྡན་འདས་ཕྱག་བཅབས་པར་རིག་ནས་ཆོས་མཉན་པའི་ཕྱིར་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འདུག་གོ །ལྕང་ལོ་ཅན་གྱི་ཕོ་བྲང་འཁོར་ན་འཁོད་པའི་གནོད་སྦྱིན་དང་། <span class='add'>  སྲིན་  </span>པོ་གང་ཡིན་པ་དེ་དག་\nཀྱང་འདུས་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞལ་དུ་བལྟས་ཏེ་ཐལ་མོ་སྦྱར་ནས་ཕྱག་འཚལ་ཏེ་འཁོད་པར་གྱུར་ཏོ། །ལྕང་ལོ་ཅན་དུ་གཤེགས་ནས་བཤོས་གསོལ་བའི་ལེའུ་ཞེས་བྱ་བ་སྟེ་བཅྭ་བརྒྱད་པའོ། །\nདེ་ནས་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེས་ཆོས་མཉན་པའི་ཕྱིར་བཅོམ་ལྡན་འདས་ལ་གསོལ་བ་བཏབ་པ། ཅི་ནས་བྱང་ཆུབ་ཏུ་སེམས་མ་བསྐྱེད་པའི་སེམས་ཅན་རྣམས་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པར་འགྱུར་པ་\nདང་། ཕྱིར་མི་ལྡོག་པ་ལ་གནས་པར་འགྱུར་པ་དང་། གནོད་སྦྱིན་དང་། <span class='add'>  སྲིན་  </span>པོ་དང་། ཤ་ཟ་དང་། དྲི་ཟ་དང་། གསང་བ་པ་དང་། ལྟོ་འཕྱེ་ཆེན་པོའི་འཁོར་འདིའི་<span class='add'>  ཡུན་  </span>རིང་པོའི་དོན་དང་། སྨན་པ་དང་། བདེ་བ་དང་། གྲུབ་\nཔ་དང་། བདེ་བར་འགྱུར་པ་དང་། ཁྱད་<span class='add'>  པར་  </span>གྱིས་ཁྱད་པར་དུ་མངོན་པར་འཕགས་པར་འགྱུར་བ་དང། ཉམས་པའི་ཆོས་ཅན་དུ་མི་འགྱུར་བར་དེ་ལྟར་ཆོས་ཀྱི་ཚུལ་ལ་འཇུག་པ་བཅོམ་ལྡན་འདས་ཀྱིས་བཤད་དུ་གསོལ།"
 ],
 [
  "78.204b",
  "འདི་ནི་བཟོད་པའོ། །འདི་ནི་བཟོད་པའི་རྣམ་པར་སྨིན་པའོ། །འདི་ནི་བརྩོན་འགྲུས་སོ། །འདི་ནི་བརྩོན་འགྲུས་ཀྱི་རྣམ་པར་སྨིན་པའོ། །འདི་ནི་བསམ་གཏན་ནོ། །འདི་ནི་བསམ་གཏན་གྱི་རྣམ་པར་སྨིན་པའོ། །འདི་\nནི་ཤེས་རབ་བོ། །འདི་ནི་ཤེས་རབ་ཀྱི་རྣམ་པར་སྨིན་པའོ། །འདི་ནི་འཆལ་པའི་ཤེས་རབ་བོ། །འདི་ནི་འཆལ་པའི་ཤེས་རབ་ཀྱི་རྣམ་པར་སྨིན་པའོ། །འདི་ནི་ལུས་ཀྱི་ལེགས་པར་སྤྱང་པའོ། །འདི་ནི་ལུས་ཀྱི་ལེགས་\nཔར་སྤྱོད་པའི་རྣམ་པར་སྨིན་པའོ། །འདི་ནི་ལུས་ཀྱི་ཉེས་པར་སྤྱོད་པའོ། །འདི་ནི་ལུས་ཀྱི་ཉེས་པར་སྤྱད་པའི་རྣམ་པར་སྨིན་པའོ། །འདི་ནི་ངག་གི་ལེགས་པར་སྤྱད་པའོ། །འདི་ནི་ངག་གི་ལེགས་པར་སྤྱད་པའི་\nརྣམ་པར་སྨིན་པའོ། །འདི་ནི་ངག་གི་ཉེས་པར་སྤྱད་པའོ། །འདི་ནི་ངག་གི་ཉེས་པར་སྤྱད་པའི་རྣམ་པར་སྨིན་པའོ། །འདི་ནི་ཡིད་ཀྱི་ལེགས་པར་སྤྱད་པའོ། །འདི་ནི་ཡིད་ཀྱི་ལེགས་པར་སྤྱད་པའི་རྣམ་པར་སྨིན་པའོ། །\nའདི་ནི་ཡིད་ཀྱི་ཉེས་པར་སྤྱད་པའོ། །འདི་ནི་ཡིད་ཀྱི་ཉེས་པར་སྤྱད་པའི་རྣམ་པར་སྨིན་པའོ། །འདི་ནི་དགེ་བའོ། །འདི་ནི་མི་དགེ་བའོ། །འདི་ནི་བྱ་བའོ། །འདི་ནི་བྱ་བ་མ་ཡིན་པའོ། །འདི་ནི་བྱས་ན་ཡུན་རིང་པོའི་\nདོན་དང་། ཕན་པ་དང་། བདེ་བ་དང་། གྲུབ་པ་དང་། བདེ་<span class='add'>  བར་  </span>འགྱུར་རོ་ཞེས་དེ་ལྟར་དགེ་བའི་བཤེས་གཉེན་དེ་དག་ཆོས་ཀྱི་གཏམ་གྱིས་ཡང་དག་པར་སྟོན། ཡང་དག་པར་འཛིན་དུ་འཇུག །ཡང་དག་\nཔར་གཟེངས་སྟོད། ཡང་དག་པར་དགའ་བར་མཛད་དོ། །དེ་ནས་དེ་དག་སྣོད་དུ་རུང་བར་མཁྱེན་ནས་ཟབ་མོའི་གཏམ་འདི་ལྟ་སྟེ། སྟོང་པ་ཉིད་ཀྱི་གཏམ་དང་། མཚན་མ་མེད་པའི་གཏམ་དང་། \nསྨོན་པ་མེད་པའི་གཏམ་དང། མངོན་པར་འདུ་བྱེད་པ་མེད་པའི་གཏམ་དང་། མ་སྐྱེས་པའི་གཏམ་དང་། མ་བྱུང་བའི་གཏམ་དང་། བདག་མེད་པ་དང་། སེམས་ཅན་མེད་པ་དང་། སྲོག་མེད་པ་<span class='add'>  དང་།   </span>གང་ཟག་"
 ],
 [
  "78.206a",
  "བར་འགྱུར་རོ། །དེར་སྐྱེས་ནས་ཀྱང་བརྩོན་འགྲུས་བརྩམས་པར་འགྱུར་། དགེ་བའི་ཆོས་ཡོངས་སུ་བཙལ་བ་ལ་མངོན་པར་བརྩོན་པར་འགྱུར་རོ། །དེ་བརྩོན་འགྲུས་བརྩམས་པས་ཁྱིམ་གྱི་གནས་\nདོན་དུ་གཉེར་བར་མི་འགྱུར་རོ། །ཆུང་མ་དང་། བུ་དང་། བུ་མོ་དང་། བྲན་ཕོ་དང་། བྲན་མོ་དང་། ལས་བྱེད་པ་དང་། ཞོ་ཤས་འཚོ་བ་ཡོངས་སུ་འཛིན་པས་ཡོངས་སུ་སྤྱོད་པ་དོན་དུ་གཉེར་བར་མི་འགྱུར་ཏེ། དེ་ན་ཚོད་གཞོན་\nནུར་རྣམ་པར་རྩེ་བ་ལ་མི་དགའ་བས་ན་ཚོད་མཛེས་པ་ལ་བབ་པའི་ཚེ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་བསྟན་པ་ལ་དད་པས་ཁྱིམ་<span class='add'>  ནས་ཁྱིམ་  </span>མེད་པར་མྱུར་དུ་རབ་ཏུ་འབྱུང་ངོ་། །དེ་དད་པས་རབ་ཏུ་བྱུང་ནས་དགེ་བའི་\nབཤེས་གཉེན་རྣམས་དང་། དགེ་བའི་གྲོགས་པོ་དགེ་བ་ཐོབ་པར་བྱེད་པ་རྣམས་དང་དགེ་བའི་བསམ་པ་འཐོབ་བོ། །དེ་དགེ་བའི་བསམ་པ་དག་ལྡན་པས་དགེ་བའི་ཆོས་རྣམས་ཉན་ཏོ། །སྒྲུབ་པ་སྙིང་པོར་བྱེད་ཀྱི་ཚིག་\nལྷུར་ལེན་པའི་བློ་དང་ལྡན་པ་མ་ཡིན་ནོ། །མང་དུ་ཐོས་པ་ཡོངས་སུ་བཙལ་བའི་ཕྱིར་བརྩོན་འགྲུས་བརྩམས་པ་ཡང་ཡིན་ཏེ། ཇི་ལྟར་ཐོས་པའི་ཆོས་རྣམས་ཀྱང་ཟང་ཟིང་མེད་པའི་སེམས་ཀྱིས་འཐོབ་པ་དང་། བཀུར་\nསྟི་དང་། ཚིགས་སུ་བཅད་པ་ལ་མི་རེ་བར་གཞན་དག་ལ་རྒྱ་ཆེར་ཡང་དག་པར་སྟོན་ཏོ། །བདག་གི་ཚིག་གི་རྗེས་སུ་འབྲང་<span class='add'>  བར་  </span>གཞན་དག་ལ་ཆོས་མི་སྟོན་ཏོ། །དེ་ཇི་ལྟར་ཐོས་པ་དང་། ཇི་ལྟར་གནས་པ་དེ་བཞིན་\nདུ་གཞན་དག་ལ་ཆོས་སྟོན་ཏོ། །ཆོས་ཉན་པ་རྣམས་ལ་ནི་བྱམས་པ་ཆེན་པོ་འཐོབ་བོ། །སེམས་ཅན་ཐམས་ཅད་ལ་སྙིང་རྗེ་ཆེན་པོ་སྐྱེད་དོ། །དེ་མང་དུ་ཐོས་པར་གྱུར་པས་ལུས་དང་སྲོག་ལ་མི་ལྟ་བ་ཡིན། འདོད་\nཔ་ཆུང་བ་དང་། ཆོག་ཤེས་པ་དང་། རབ་ཏུ་དབེན་པ་དང་། མགུ་སླ་བ་དང་གསོ་སླ་བ་དང་། དགོན་པ་དང་། བས་མཐར་མངོན་པར་དགའ་བ་ཡིན་། ཇི་ལྟར་ཐོས་པའི་ཆོས་རྣམས་ཀྱི་དོན་ལ་ཡོངས་སུ་རྟོག་པ་ཡིན་ནོ། །"
 ],
 [
  "78.208b",
  "རེག་པ་མེད་ན་ཚོར་བ་ཞེས་བྱ་བ་དེ་མེད་དོ། །ཚོར་བའི་རྐྱེན་གྱིས་སྲེད་པ་ཞེས་བྱ་བ་དེ་ནི་ཡོད་དོ། ཚོར་བ་མེད་ན་སྲེད་པ་ཞེས་བྱ་བ་དེ་མེད་དོ། །སྲིད་པའི་རྐྱེན་གྱིས་ལེན་པ་ཞེས་བྱ་བ་དེ་ནི་ཡོད་དོ། །སྲེད་པ་མེད་ན་ལེན་\nཔ་ཞེས་བྱ་བ་དེ་མེད་དོ། །ལེན་པའི་རྐྱེན་གྱིས་སྲིད་པ་ཞེས་བྱ་བ་དེ་ནི་ཡོད་དོ། །ལེན་པ་མེད་ན་སྲིད་པ་ཞེས་བྱ་བ་དེ་མེད་དོ། །སྲིད་པའི་རྐྱེན་གྱིས་སྐྱེ་བ་ཞེས་བྱ་བ་དེ་ནི་ཡོད་དོ། །སྲིད་པ་མེད་ན་སྐྱེ་བ་ཞེས་བྱ་བ་དེ་\nམེད་དོ། །སྐྱེ་བའི་རྐྱེན་གྱིས་རྒ་ཤི་དང་། མྱ་ངན་དང་སྨྲེ་སྔགས་འདོན་པ་དང་། སྡུག་བསྔལ་བ་དང་། ཡིད་མི་བདེ་བ་དང་། འཁྲུག་པ་རྣམས་ནི་ཡོད་དོ། །སྐྱེ་བ་མེད་ན་རྒ་ཤི་དང་། མྱ་ངན་དང་། སྨྲེ་སྔགས་འདོན་པ་\nདང་། སྡུག་བསྔལ་བ་དང་། ཡིད་མི་བདེ་བ་དང་། འཁྲུག་པ་རྣམས་མེད་དོ། །གཞན་ཡང་སྦྱིན་<span class='add'>  པས་  </span>ལོངས་སྤྱོད་ཆེན་པོར་འགྱུར་བ་ནི་ཡོད་དོ། །སྦྱིན་བས་དབུལ་པོར་འགྱུར་བ་ནི་མེད་དོ། །ཚུལ་ཁྲིམས་ཀྱིས་མཐོ་རིས་\nསུ་སྐྱེ་བ་ནི་ཡོད་དོ། །ཚུལ་ཁྲིམས་ཀྱིས་ངན་སོང་དུ་སྐྱེ་བ་ནི་མེད་དོ། །ཐོས་པས་ཤེས་རབ་ཆེན་པོར་འགྱུར་བ་ནི་ཡོད་དོ། །ཐོས་པས་ཤེས་རབ་འཆལ་བར་འགྱུར་བ་ནི་མེད་དོ། །བསྒོམ་པས་འབྲལ་བར་འགྱུར་\nབ་ནི་ཡོད་དོ། །བསྒོམ་པས་འབྲལ་བར་མི་འགྱུར་བ་ནི་མེད་དོ། །ཚུལ་བཞིན་མ་ཡིན་པ་ཡིད་ལ་བྱེད་པ་དང་ལྡན་ན་ཉོན་མོངས་པ་འབྱུང་བ་ནི་ཡོད་དོ། །ཚུལ་བཞིན་མ་ཡིན་པ་ཡིད་ལ་བྱེད་པ་དང་བྲལ་ན་ཉོན་མོངས་པ་\nའབྱུང་བ་ནི་མེད་དོ། །མངོན་པའི་ང་རྒྱལ་ཅན་ལ་ནི་ཀུན་ཤེས་པ་བརྡ་སྤྲོད་པ་མེད་དོ། །མངོན་པའི་ང་རྒྱལ་མེད་པ་ལ་ནི་མྱ་ངན་ལས་འདས་པ་ཡོད་དོ། །གཞན་ཡང་ཐམས་ཅད་ཀྱི་རྗེས་སུ་སོང་བའི་སྟོང་པ་ཉིད་ཡོད་དོ། །ནང་\nགི་རྗེས་སུ་སོང་བའི་བདག་ནི་མེད་དོ། །ཡེ་ཤེས་དང་ལྡན་པ་ལ་ནི་ཐར་པ་ཡོད་དོ། །ང་རྒྱལ་དང་ལྡན་པ་ལ་ནི་འབྱུང་བ་མེད་དོ། །བདག་གམ། སེམས་ཅན་ནམ། སྲོག་གམ། གང་ཟག་ཅེས་བྱ་བ་གང་ཡིན་པ་དེ་ནི་མེད་དོ།"
 ],
 [
  "78.209b",
  "རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཀྱང་མྱུར་དུ་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ། །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་འཇིག་རྟེན་<span class='add'>  སྐྱོང་  </span>བ་རྒྱལ་པོ་ཆེན་པོ་བཞིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་རྒྱལ་པོ་བཞི་པོ་བདག་ཅག་འཇིག་རྟེན་\n<span class='add'>  སྐྱོང་  </span>བ་ཞེས་བགྱི་ན། བཅོམ་ལྡན་འདས་བདག་ཅག་གིས་ཇི་ལྟར་འཇིག་རྟེན་<span class='add'>  བསྐྱང་  </span>པར་བགྱི། དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་འཇིག་རྟེན་<span class='add'>  སྐྱོང་  </span>བ་རྒྱལ་པོ་ཆེན་པོ་བཞི་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །གྲོགས་པོ་དག་ཁྱེད་\nཀྱིས་ཆོས་ཀྱི་བྱ་བས་འཇིག་སྐྱོངས་ཤིག །དེ་ལ་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་འདི་དག་ནི་འཇིག་རྟེན་སྐྱོང་བར་བྱེད་པའོ། །བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། སྲོག་གཅོད་སྤང་བ་དང་། རང་གི་ལོངས་སྤྱོད་ཀྱི་ཆོག་པར་འཛིན་པ་དང་། \nགཞན་གྱི་ཆུང་མ་དག་ལ་མི་འཕྱོ་བ་དང་། ཆོས་སྤྱོད་པ་རྣམས་ལ་བདེན་པ་ཉིད་དང་། གཞན་གྱི་འཁོར་མི་འབྱེད་པ་དང་། ཐ་བའི་ཚིག་མེད་དེ་ཞེར་མི་འདེབས་པ་དང་། ཚིག་ཙམ་ཇི་ལྟ་བ་བཞིན་ཏེ། གཞན་ལ་མི་སླུ་བ་དང་། \nགཞན་གྱི་ལོངས་སྤྱོད་ལ་འདོད་པ་མེད་པ་དང་། གནོད་སེམས་ཉེ་བར་ཞི་བ་དང་། ལྟ་བ་ཡོངས་སུ་དག་ཅིང་ཡང་དག་པར་སོང་བ་སྟེ། གྲོགས་པོ་དག་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་དེ་དག་ནི་འཇིག་རྟེན་སྐྱོང་བར་བྱེད་པའོ། །གྲོགས་\nཔོ་དག་གཞན་ཡང་འཇིག་རྟེན་<span class='add'>  སྐྱོང་  </span>པར་བྱེད་པའི་ཆོས་བརྒྱད་དེ་། བརྒྱད་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ཇི་སྐད་སྨྲས་པ་དེ་བཞིན་དུ་བྱེད་པ་དང་། བླ་མ་ལ་གུས་པ་དང་། ཐམས་ཅད་དུ་འཐུན་པར་འཛིན་པ་དང་། དྲང་བ་དང་། མཉེན་\n<span class='add'>  པ་  </span>དང་། སེམས་ཅན་ཐམས་ཅད་ལ་བྱམས་པའི་སེམས་དང་ལྡན་པ་དང་། སྡིག་པ་ཐམས་ཅད་མི་བྱེད་པ་དང་། དགེ་བའི་རྩ་བ་ཐམས་ཅད་ཡང་དག་པར་སྡུད་པ་སྟེ། གྲོགས་པོ་དག་ཆོས་བརྒྱད་པོ་དེ་དག་ནི་འཇིག་རྟེན་སྐྱོང་བར་\nབྱེད་པའོ། །གྲོགས་པོ་དག་གཞན་ཡང་ཡང་དག་པར་མགུ་བར་བྱ་བའི་ཆོས་འཇིག་རྟེན་སྐྱོང་པར་བྱེད་པ་དྲུག་སྟེ། དྲུག་གང་ཞེ་ན། འདི་ལྟ་སྟེ། སྟོན་པ་དང་། ཚངས་པ་མཚུངས་པར་སྤྱོད་པ་མཁས་པ་རྣམས་དང་། སེམས་"
 ],
 [
  "78.209a",
  "གསང་བ་པའི་བདག་པོ་དེ་ལྟར་ན་བག་ཡོད་པ་དང་། ཚུལ་བཞིན་ཡིད་ལ་བྱེད་བ་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔས་འཇིག་རྟེན་ན་མཁས་པ་རྣམས་ལ་ཡོད་པར་གྲགས་པ་གང་ཡིན་བ་དེ་ནི་ཡོད་པར་རབ་\nཏུ་ཤེས་སོ། །འཇིག་རྟེན་ན་མཁས་པ་རྣམས་ལ་མེད་པར་གྲགས་པ་གང་ཡིན་བ་དེ་ནི་མེད་པར་རབ་ཏུ་ཤེས་སོ། །དེ་ཡོད་དོ་ཞེས་ཐ་སྙད་འདོགས་པ་ལ་ཡང་མི་ཆགས་སོ། །མེད་དོ་ཞེས་ཐ་སྙད་འདོགས་པ་ལ་ཡང་མི་ཆགས་\nཏེ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས་གསུངས་པ་ཡང་དག་པའི་དོན་རྗེས་སུ་རྟོགས་སོ། །གསང་བ་པའི་བདག་པོ་དེ་ལ་དེ་བཞིན་གཤེགས་པས་ཆོས་ཐམས་ཅད་མདོར་བསྡུས་ཏེ། ཆོས་ཀྱི་མདོ་བཞིན་རྣམ་པར་བཞག་\nགོ །བཞི་གང་ཞེ་ན། དགེ་སྦྱོང་དང་། བྲམ་ཟེ་རྟག་པར་སྨྲ་བ་རྣམས་དང་། ལྷ་ཚེ་རིངས་པོ་རྟག་པར་འདུ་ཤེས་པ་རྣམས་ཀྱི་གཞོམ་པའི་ཕྱིར་འདུ་བྱེད་ཐམས་ཅད་མི་རྟག་གོ་ཞེས་བྱ་བ་དང་། ལྷ་དང་མི་བདེ་བར་འདུ་ཤེས་པ་\nརྣམས་ཀྱི་གཞོམ་པའི་ཕྱིར་འདུ་བྱེད་ཐམས་ཅད་སྡུག་བསྔལ་ལོ་ཞེས་བྱ་བ་དང་། མུ་སྟེགས་ཅན་བདག་ཏུ་སྨྲ་བ་རྣམས་ཀྱི་གཞོམ་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ལ་བདག་མེད་དོ་ཞེས་བྱ་བ་དང་། རྣམ་པར་རྟོག་པ་ལ་སྤྱོད་པ་མངོན་\nཔའི་ང་རྒྱལ་ཅན་རྣམས་ཀྱི་གཞོམ་པའི་ཕྱིར་མྱ་ངན་ལས་འདས་པ་ནི་ཞི་བ་ཞེས་བྱ་བའོ། །གསང་བ་པའི་བདག་པོ་མི་རྟག་ཅེས་བྱ་བ་དེ་ནི་ཤིན་དུ་མི་རྟག་པའི་དོན་གྱི་ཚིག་བླ་དགས་སོ། །སྡུག་བསྔལ་ཞེས་བྱ་བ་དེ་ནི་སྨོན་པ་དང་\nབྲལ་བའི་ཚིགས་བླ་དགས་སོ། །བདག་མེད་ཅེས་བྱ་བ་དེ་ནི་སྟོང་པ་ཉིད་ཀྱི་མཚན་ཉིད་ཀྱི་ཚིག་བླ་དགས་སོ། །མྱ་ངན་ལས་འདས་པ་ནི་ཞི་<span class='add'>  བའོ་  </span>ཞེས་བྱ་བ་དེ་ནི་མཚན་མ་མེད་པ་མངོན་དུ་བྱ་བའི་ཚིག་བླ་དགས་སོ། །གསང་བ་པའི་\nབདག་པོ་དེ་ལྟར་ན་ཆོས་ཐམས་ཅད་ལ་དེ་ལྟར་མོས་ཤིང་ཚུལ་བཞིན་ཡིད་ལ་བྱེད་པ་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་དགེ་བ་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་ལས་མི་ཉམ་ཞིང་ཡོངས་སུ་ཉམས་པར་མི་འགྱུར་ཏེ། སངས་"
 ],
 [
  "78.206b",
  "དོན་ལ་རྟོན་པ་ཡིན་ཏེ་ཚིག་འབྲུ་ལ་རྟོན་པ་མ་ཡིན་ནོ། །ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་གྱི་སྟོན་པར་གྱུར་པ་ཡིན་ནོ། །བདག་འབའ་ཤིག་གི་ཕྱིར་བརྩོན་པ་མ་ཡིན་གྱི། སེམས་ཅན་ཐམས་\nཅད་ཀྱི་དོན་གྱི་ཕྱིར་བླ་ན་མེད་པའི་ཐེག་པ་ཆེན་པོ་འདི་ལྟ་སྟེ། སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་ཡོངས་སུ་ཚོལ་ལོ། །བག་ཡོད་པ་ལྷུར་ལེན་པ་ཡང་ཡིན་ཏེ། དེ་ལ་བག་ཡོད་པ་གང་ཞེན་འདི་ལྟ་སྟེ། དབང་པོ་སྡོམ་བའོ། །\nདེ་མིག་གིས་གཟུགས་རྣམས་མཐོང་ནས། མཚན་མར་མི་འཛིན་ཅིང་མངོན་རྟགས་སུ་མི་འཛིན་པ་ཡིན་ནོ། །དེ་གཟུགས་རྣམས་ཀྱི་རོ་མྱང་པ་དང་། ཉེས་དམིགས་དང། འབྱུང་བ་ཡང་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་\nཏུ་ཤེས་སོ། །དེ་བཞིན་དུ་རྣ་བས་སྒྲ་རྣམས་དང་། སྣས་དྲི་རྣམས་དང་། ལྕེས་རོ་རྣམས་དང་། ལུས་ཀྱིས་རེག་བྱ་རྣམས་དང་། ཡིད་ཀྱིས་ཆོས་རྣམས་ཤེས་ནས་མཚན་མར་མི་འཛིན་ཅིང་མངོན་རྟགས་སུ་མི་འཛིན་པ་\nཡིན་ཏེ། ཆོས་རྣམས་ཀྱི་རོ་མྱང་བ་དང་། ཉེས་དམིགས་དང་འབྱུང་བ་ཡང་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་ཏེ་འདི་ནི་བག་ཡོད་པ་ཞེས་བྱའོ། །གཞན་ཡང་བག་ཡོད་པ་ནི་གང་དག་རང་གི་སེམས་འདུལ་བ་དང་། \nགཞན་གྱི་སེམས་རྗེས་སུ་སྲུང་བ་དང་། ཉོན་མོངས་པ་ལ་དགའ་བ་སེལ་བ་དང་། ཆོས་ལ་དགའ་བའི་རྗེས་སུ་འཇུག་པ་དང་། འདོད་པ་ལ་རྣམ་པར་རྟོག་པ་དང་། གནོད་སེམས་ཀྱི་<span class='add'>  རྣམ་པར་  </span><span class='add'>    </span>རྟོག་པ་དང་། རྣམ་པར་\nའཚེ་བའི་རྣམ་པར་རྟོག་པ་རྣམས་ཀྱི་རྒྱུ་བ་མེད་པ་དང་། མི་དགེ་བའི་རྩ་བ་ཆགས་པ་དང་། ཞེ་སྡང་དང་། གཏི་མུག་གི་རྒྱུ་བ་མེད་པ་དང་། ལུས་ཀྱི་ཉེས་པར་སྤྱོད་པའི་རྒྱུ་བ་མེད་པ་དང་། དག་གི་ཉེས་པར་སྤྱོད་པའི་\nརྒྱུ་བ་མེད་པ་དང་། ཡིད་ཀྱི་ཉེས་པར་སྤྱོད་པའི་རྒྱུ་བ་མེད་པ་དང་། ཚུལ་བཞིན་མ་ཡིན་<span class='add'>  པ་  </span>ཡིད་ལ་བྱེད་པའི་རྒྱུ་བ་མེད་པ་དང་། སྡིག་པ་མི་དགེ་བའི་ཆོས་ཐམས་ཅད་ཀྱི་རྒྱུ་བ་མེད་པ་སྟེ། འདི་ནི་བག་ཡོད་པ་ཞེས་"
 ],
 [
  "78.210a",
  "ཅན་ཐམས་ཅད་ལ་བྱམས་པའི་ལུས་ཀྱི་ལས་འདི་ནི་ཡང་དག་པར་མགུ་བར་འགྱུར་བའི་ཆོས་དགའ་བར་བྱེད་པ་དང་། བླ་མར་བྱེད་པ་དང་། ཡིད་དུ་འོང་བར་བྱེད་པ་དང་། དགའ་བར་བྱ་བ་དང་། བླ་མར་བྱ་\nབ་དང་། གུས་པར་བྱ་བ་དང་། བསྒོམ་པ་དང་། བསྡུ་བ་དང་། ཏིང་ངེ་འཛིན་དུ་བྱ་བར་འགྱུར་བ་དང་པོའོ། དེ་བཞིན་དུ་སྟོན་པ་དང་། ཚངས་པ་མཚུངས་པར་སྤྱོད་པ་མཁས་པ་རྣམས་དང་། སེམས་ཅན་ཐམས་ཅད་ལ་བྱམས་\nཔའི་ངག་དང་། ཡིད་ཀྱི་ལས་འདི་ནི་ཡང་དག་པར་མགུ་བར་འགྱུར་བའི་ཆོས་དགའ་བར་བྱེད་པ་དང་། བླ་མར་བྱེད་པ་དང་། ཡིད་དུ་འོང་བར་བྱེད་པ་དང་། དགའ་བར་བྱ་བ་དང་། བླ་མར་བྱ་བ་དང་། གུས་པར་བྱ་བ་དང་། བསྒོམ་\nཔ་དང་། བསྡུ་བ་དང་། ཏིང་ངེ་འཛིན་དུ་བྱ་བ་འགྱུར་བ་གཉིས་པ་དང་གསུམ་པའོ། །རྙེད་པ་གང་དག་ཆོས་དང་འཐུན་པ། ཆོས་ཀྱི་རྙེད་པ་ཐ་ན་ལྷུང་བཟེད་ཀྱི་ནང་དུ་ཆུད་པའམ། ལྷུང་བཟེད་པར་གཏོགས་པ་དེ་ལྟ་བུའི་རྙེད་པ་\nདག་གིས་ཚངས་པ་མཚུངས་པར་སྤྱོད་པ་མཁས་པ་རྣམས་དང་ལྷན་ཅིག་ཏུ་རྙེད་པ་འཐུན་པར་བྱའོ་སྙམ་པ་འདི་ནི་ཡང་དག་པར་མགུ་བར་འགྱུར་བའི་ཆོས་དགའ་བར་བྱེད་པ་དང་། བླ་མར་བྱེད་པ་དང་། ཡིད་དུ་འོང་བར་བྱེད་\nཔ་དང་། དགའ་བར་བྱ་བ་དང་། བླ་མར་བྱ་བ་དང་། གུས་པར་བྱ་བ་དང་། བསྒོམ་པ་དང་། བསྡུ་བ་དང་། ཏིང་ངེ་འཛིན་དུ་བྱ་བར་འགྱུར་བ་བཞི་པའོ། །ཚུལ་ཁྲིམས་མ་ཉམས་པ། སྐྱོན་མེད་པ་འདྲེན་མ་མ་ཡིན་པ། \nསྲ་སྲེ་མ་ཡིན་པ། རང་དབང་ཅན། མ་འབགས་པ། མཁས་པས་བསྔགས་པ། ཚངས་པ་མཚུངས་པར་སྤྱོད་པ་མཁས་པ་རྣམས་ཀྱིས་མ་སྨད་པ་གང་དག་ཡིན་<span class='add'>  པ་  </span>དེ་ལྟ་བུའི་ཚུལ་ཁྲིམས་རྣམས་ཀྱིས་ཚངས་པ་མཚུངས་པར་སྤྱོད་པ་\nམཁས་པ་རྣམས་དང་ལྷན་ཅིག་ཏུ་ཚུལ་ཁྲིམས་འཐུན་པར་བྱའོ་སྙམ་<span class='add'>  པ་  </span>འདི་ནི་ཡང་དག་པར་འགུ་བར་འགྱུར་བའི་ཆོས་དགའ་བར་བྱེད་པ་དང་། མགུ་བར་བྱེད་པ་དང་། བླ་མར་བྱེད་པ་དང་། ཡིད་དུ་འོང་བར་བྱེད་པ་དང་། དགའ་བར་"
 ],
 [
  "78.211b",
  "སཏྭ་ནཱྃ། བྀ་ཀི་རན་ཏུ་<span class='add'>  མ་ཧཱ་  </span>པ་ར་པ་ཏ། སྃ་བྱ་ཐ་ཏཱྃ་དྷ་ར་ཎི། གརྫ་ཏུ་ས་མུ་དྲ་བེ་ག་ཨི་ཏི། གསང་སྔགས་ཀྱི་ཚིག་བསྟན་པ་འདི་བཤད་པ་ན་ལྷའི་གནས་ཐམས་ཅད་རབ་ཏུ་གཡོས་སོ། །ས་ཐམས་ཅད་ཀྱང་རབ་ཏུ་གཡོས་\nསོ། །རྒྱ་མཚོ་ཆེན་པོ་ཡང་རབ་ཏུ་འཁྲུགས་སོ། །དེ་ན་ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དེ་ཡང་འདར་པད་པད་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་ཕྱག་འཚལ་བར་འགྱུར་ཏོ། །བཅོམ་ལྡན་འདས་ཀྱིས་སྟོང་གི་འཇིག་\nརྟེན་གྱི་ཁམས་དེ་ལ་ཞབས་གཅིག་གིས་རེག་པར་མཛད་དོ། །དེ་ན་ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དེ་དེ་བཞིན་གཤེགས་པའི་ཞབས་ལ་མ་རེག་ཙམ་དུ་ཉེ་བར་འདུག་སྟེ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བདག་\nཅག་བསྲུང་དུ་གསོལ། བདེ་བར་གཤེགས་པ་བདག་ཅག་བསྐྱབ་ཏུ་གསོལ། བདག་ཅག་ལ་གནོད་ལགས་སོ། །བདག་ཅག་ལ་རབ་ཏུ་གནོད་ལགས་སོ། །བདག་ཅག་འདར་པད་པད་ལགས་སོ། །བཅོམ་ལྡན་འདས་\nབདག་ཀྱིས་བཀའ་སྩལ་པ། གྲོགས་པོ་<span class='add'>  དག་མ་  </span>འཇིགས་ཤིག །མ་འཇིགས་ཤིག །དེ་བཞིན་གཤེགས་པས་བྱིན་གྱིས་བརླབས་པའི་གསང་སྔགས་ཀྱི་ཚིག་འདི་དག་གི་ཡུལ་ནི་འདི་ལྟ་སྟེ། ས་ཆེན་པོ་འདི་རབ་ཏུ་གཡོས་\n<span class='add'>  པ་  </span>དང་། རྒྱ་མཚོ་ཆེན་པོ་འཁྲུགས་པ་དང་། ཁྱེད་ཀྱང་ནམ་མཁའ་ལ་གནས་ནས་རབ་ཏུ་ཡོས་པ་ཡིན་ནོ། །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེའི་འཁོར་གྱི་ཁྱམས་སུ་ཅི་ནས་སྲོག་\nཆགས་བརྒྱད་ཁྲིས་བྱང་ཆུབ་སེམས་བསྐྱེད་པ་དང་། སེམས་ཅན་ཚད་མེད་པ་དེ་དག་གིས་བསླབ་པའི་གནས་རྣམས་བླངས་པར་གྱུར་པ་དེ་ལྟར་ཆོས་རྒྱ་ཆེར་བསྟན་ནོ།།      །།བམ་པོ་དགུ་པ།།    །།\nདེ་ནས་གསང་བ་པའི་བདག་པོའི་བུ་རྡོ་རྗེའི་སྡེས་བཅོམ་ལྡན་འདས་ལ་རིན་པོ་ཆེའི་དྲ་བས་མངོན་པར་བཀབ་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་ཇི་ལྟར་ན་"
 ],
 [
  "78.212a",
  "བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་མི་འཁྲུགས་པའི་ཆོས་ཅན་དུ་འགྱུར་བ་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་\nཆེན་པོ་ཆོས་བཅུ་དང་ལྡན་ན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་མི་འཁྲུགས་པའི་ཆོས་ཅན་དུ་འགྱུར་རོ། །བཅུ་གང་ཞེ་ན། ཁོང་ཁྲོ་བ་མེད་པའི་བྱམས་པ་ཆེན་པོ་དང་། ཡོངས་སུ་མི་སྐྱོ་བའི་སྙིང་རྗེ་\nཆེན་པོ་དང་། བརྩམས་པ་ཐམས་ཅད་ཉམས་འོག་ཏུ་<span class='add'>  ཆུད་  </span>པར་བྱེད་པའི་བརྩོན་འགྲུས་དང་། སྟོང་པ་ཉིད་ཀྱི་རྣམ་པར་སྦྱོར་བའི་ཏིང་ངེ་འཛིན་དང་། མངོན་སུམ་དུ་རྟོགས་པའི་ཤེས་རབ་དང་། ཐམས་ཅད་ཀྱི་རྗེས་སུ་\nསོང་བའི་མཁས་པ་དང་། དུས་གསུམ་ཡོངས་སུ་སྦྱོང་བའི་ཡེ་ཤེས་དང་། བདེན་པ་མཐོང་བ་སྦྱང་བར་བྱ་བ་སྒྲིབ་པ་མེད་པ་དང་། རྣམ་པ་ཐམས་ཅད་ཀྱི་མཆོག་དང་ལྡན་པའི་སྟོང་པ་ཉིད་དང་། ཇི་ལྟ་བ་བཞིན་གྱིས་\nཡོངས་སུ་དག་པའི་ལམ་ལ་འཇུག་པ་སྟེ། གཞོན་ནུ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཅུ་པོ་དེ་དག་དང་ལྡན་ན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་མི་འཁྲུགས་པའི་ཆོས་ཅན་དུ་འགྱུར་རོ། །གསང་བ་\nཔའི་བདག་པོའི་བུ་རྡོ་རྗེའི་སྡེས་བཅོམ་ལྡན་འདས་ལ་ཡང་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སངས་རྒྱས་ཀྱི་ཆོས་བསམ་གྱིས་མི་ཁྱབ་པ་ཉིད་ཐོས་ན་མི་དངང་མི་སྐྲག་ཅིང་\nསྐྲག་པར་མི་འགྱུར་བ་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། གཞོན་ནུ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བརྒྱད་དང་ལྡན་ན་སངས་རྒྱས་ཀྱི་ཆོས་བསམ་གྱིས་མི་ཁྱབ་པ་ཉིད་ཐོས་ན་མིང་དངང་མི་སྐྲག་ཅིང་སྐྲག་\nཔར་མི་འགྱུར་ཏེ། བརྒྱད་གང་ཞེ་ན། ཤེས་རབ་ཀྱིས་བརྟན་པ་ཡིན། ཡེ་ཤེས་ཀྱིས་བརྟན་པ་ཡིན། དགེ་བའི་བཤེས་གཉེན་གྱིས་ཡོངས་སུ་ཟིན་པ་ཡིན། རྒྱ་ཆེན་པོ་ལ་མོས་པ་ཡིན། སྒྱུ་མ་དང་མཚུངས་པའི་ཆོས་ལས་ངེས་"
 ],
 [
  "78.210b",
  "བྱ་བ་དང་། བླ་མར་བྱ་བ་དང་། གུས་པར་བྱ་བ་དང་། བསྒོམ་པ་དང་། བསྡུ་བ་དང་། ཏིང་ངེ་འཛིན་དུ་བྱ་བར་འགྱུར་བ་ལྔ་པའོ། །ལྟ་བ་<span class='add'>  གང་  </span>འཕགས་པ་<span class='add'>  ངེས་  </span>པར་འབྱུང་བ་ངེས་པར་འབྱེད་པའི་ཆ་དང་འཐུན་པ་དེ་བྱེད་པའི་སྡུག་བསྔལ་ཡང་\nདག་པར་ཟད་པར་འགྱུར་བ་དང་། སྡུག་བསྔལ་མཐར་འབྱིན་པ་ངེས་པར་འབྱུང་བའི་ལྟ་བ་དེ་ལྟ་བུས་ཚངས་<span class='add'>  པ་  </span>མཚུངས་པར་སྤྱོད་པ་རྣམས་དང་ལྷན་ཅིག་ཏུ་ལྟ་བ་འཐུན་པར་བྱའོ་སྙམ་<span class='add'>  པ་  </span>འདི་ནི་ཡང་དག་པར་མགུ་བར་འགྱུར་\nབའི་ཆོས་དགའ་བར་བྱེད་པ་དང་། བླ་མར་བྱེད་པ་དང་། བླ་མར་བྱེད་པ་དང།་ ཡིད་དུ་འོང་བར་བྱེད་པ་དང་། དགའ་བར་བྱ་བ་དང་། བླ་མར་བྱ་བ་དང་། གུས་པར་བྱ་བ་དང་། བསྒོམ་པ་དང་། བསྡུ་བ་དང་། ཏིང་ངེ་འཛིན་དུ་བྱ་བར་འགྱུར་\nབ་དྲུག་པ་སྟེ། གྲོགས་པོ་དག་ཡང་དག་པར་མགུ་བར་བྱ་བའི་ཆོས་དྲུག་པོ་དེ་དག་ནི་འཇིག་རྟེན་སྐྱོང་བར་བྱེད་པའོ། །གྲོགས་པོ་དག་གཞན་ཡང་འཇིག་རྟེན་སྐྱོང་བར་བྱེད་པའི་ཆོས་བཞི་སྟེ། བཞི་གང་ཞེ་ན། འདི་ལྟ་སྟེ་\nའདོད་པ་དང་། ཞེ་སྡང་དང་། གཏི་མུག་དང་། འཇིགས་པ་སྤངས་པས་འདོད་པས་འགྲོ་བ་མ་ཡིན་<span class='add'>  པར་  </span>མི་འགྲོ་བ་དང་། ཞེ་སྡང་གིས་འགྲོ་བ་མ་ཡིན་པར་མི་འགྲོ་བ་དང་། གཏི་མུག་གིས་འགྲོ་བ་མ་ཡིན་པར་མི་འགྲོ་བ་<span class='add'>  དང་།   </span>\nའཇིགས་པས་འགྲོ་བ་མ་ཡིན་པར་མི་འགྲོ་བ་སྟེ། གྲོགས་པོ་དག་འགྲོ་བ་མ་ཡིན་པར་འགྲོ་བ་སྤངས་པའི་ཆོས་བཞི་པོ་དེ་དག་ནི་འཇིག་རྟེན་སྐྱོང་བར་བྱེད་པའོ། །གྲོགས་པོ་དག་གཞན་ཡང་འཇིག་རྟེན་སྐྱོང་བར་བྱེད་པའི་\nཆོས་གཉིས་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ངོ་ཚ་ཤེས་པ་དང་། ཁྲེལ་ཡོད་པ་སྟེ། ཆོས་གཉིས་པོ་དེ་དག་ནི་འཇིག་རྟེན་སྐྱོང་བར་བྱེད་པའོ། །གྲོགས་པོ་དག་གཞན་ཡང་འཇིག་རྟེན་སྐྱོང་བར་བྱེད་པའི་ཆོས་ནི་གཅིག་ཁོ་ན་སྟེ། འདི་ལྟ་\nསྟེ། བདེན་པ་ནི་འཇིག་རྟེན་སྐྱོང་བར་བྱེད་པ། བཀའ་བློ་བདེ་བ་ནི་འཇིག་སྐྱོང་བར་བྱེད་པ། གྱ་གྱུ་མེད་པ་ནི་འཇིག་རྟེན་སྐྱོང་བར་བྱེད་པ་སྟེ། གྲོགས་པོ་དག་ཆོས་གཅིག་པོ་དེ་ནི་འཇིག་རྟེན་སྐྱོང་བར་བྱེད་པའོ། །གྲོགས་"
 ],
 [
  "78.214a",
  "གནས་པར་འགྱུར། དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེའི་གནས་སུ་ཞག་བདུན་འདས་འདས་སུ་སེམས་ཅན་ཚད་མེད་པ་དག་གི་དོན་མཛད་ནད་ཞག་བདུན་འདས་\nཏེ། ལྕང་ལོ་ཅན་གྱི་ཕོ་བྲང་འཁོར་དུ་སེམས་ཅན་གྱི་དོན་མཛད་པ་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་རྒྱས་པར་མཛད་ནས་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེའི་གནས་ནས་གཤེགས་ཏེ། ནམ་མཁའི་དཀྱིལ་གྱི་ལམ་དེ་\nཉིད་ནས་བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་ཀྱིས་ནི་བསྐོར། ཉན་ཐོས་ཀྱི་ཚོགས་ཀྱིས་ནི་མདུན་དུ་བདར། ལྷའི་ཚོགས་ཀྱིས་ནི་ཕྱག་བྱས། ལྷའི་བུ་མོའི་ཚོགས་ཀྱིས་ནི་མངོན་པར་བསྟོད། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། \nལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དུ་མས་ནི་བསྐོར། བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། འཇིག་རྟེན་<span class='add'>  སྐྱོང་བ་  </span><span class='add'>    </span>རྣམས་ཀྱིས་ནི་མངོན་པར་བསྟོད། འོད་ཟེར་གྱི་དྲ་བ་ནི་རབ་ཏུ་འགྱེད། རོལ་མོ་སིལ་སྙན་ནི་ལེན། མེ་ཏོག་\nགི་ཆར་ནི་འབེབས། ཞིང་རྣམས་ནི་རབ་ཏུ་གཡོ་བར་མཛད་ཅིང་སངས་རྒྱས་ཀྱི་མཐུ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་རྫུ་འཕྲུལ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་རྣམ་པར་འཕྲུལ་བ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་\n<span class='add'>  ཆོ་  </span>འཕྲུལ་ཆེན་པོ་དང་སངས་རྒྱས་ཀྱི་དཔལ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་གཟི་བརྗིད་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་སྤྱོད་ལམ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱིས་རྣམ་པར་རོལ་པ་ཆེན་པོས་ངང་པའི་རྒྱལ་པོ་ལྟར་\nཐོགས་པ་མེད་པར་གཤེགས་ཏེ། སླར་བྱ་རྒོད་ཀྱི་ཕུང་པོའི་རི་ལ་བྱོན་ཏོ། །གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེ་ཡང་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་འབྲིང་དུ་འབྲང་པར་འགྱུར་ཏོ། །བཞུད་པ་དང་བྱོན་པའི་ལེའུ་\nཞེས་བྱ་སྟེ་ཉི་ཤུ་པའོ། །། །དེ་ནས་བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་དང་། ཉན་ཐོས་ཆེན་པོ་རྣམས་དང་ཐབས་གཅིག་ཏུ་བྱ་རྒོད་ཀྱི་ཕུང་པོའི་རི་ལ་བཞུགས་སོ། །དེ་ནས་བཅོམ་"
 ],
 [
  "78.213b",
  "བྱང་ཆུབ་ཀྱི་སྙིང་པོ་མཆོག་དམ་པ་ལ་འདུག་པ་བསྲུང་པ་དང་། བདུད་ཀྱི་སྡེ་འོངས་པ་ན་བདུད་ཚར་གཅད་པའི་ཕྱིར་ཁྱོད་ཀྱིས་གསང་སྔགས་ཀྱི་ཚིག་གང་དག་བསམས་ཤིང་བརྗོད་པ་དང་། ཁ་ཏོན་བྱས་པ་དེ་དག་ལ་ཁྱོད་སྤོབས་\nཔར་གྱིས་ཤིག །དེ་ནས་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེས་བཅོམ་ལྡན་འདས་ཀྱིས་<span class='add'>  བསྐུལ་  </span>བར་རིག་ནས་སྟན་ལས་ལངས་ཏེ། བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་གཙུགསཏེ། \nབཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས་དེའི་ཚེ་གསང་སྔགས་ཀྱི་ཚིག་འདི་དག་སྨྲས་སོ། །ཏདྱ་ཐཱ། ཧུ་ལུ་ཧུ་ལུ། ཧུ་ལེ་དྷི་རེ།ཧ་རི་ཏི། ཨ་ཀུ་ཤ་ལ་ཀྵ་ཡེ།ཙ་ལེ་ཙ་ལ་བ་ཏི། ས་རེ། ཀྵུ་རེ་\nཀྵཱན་ཏི་བ་ལེ། ཀྵེ་མེ། ཤན་ཏི་ཀ་རེ། ཀྵ་མེ། ཤ་མེ། ཧུ་ལུ། ཨི་ལི་ཁི། ཁི་རེ། ཁ་རེ། ཨ་བེ་<span class='add'>  ཤ་ནི།   </span>ས་ར་ཎེ། ཛ་ཡེ། ཛ་ཡ་བ་ཏི། ཧྶྭི་རེ། ཨ་བརྟེ། བི་བརྟེ། ཨ་བརྟ་ནི། མཻ་ཏྲེ། བྷུ་ཊ་ཌ་ནན། སང་གྲ་ཧེ། ད་མེ། ད་མ་སམ་བན་\nནེ། ཏཱ་ར་ཎེ། ཏཱ་ར་ཡ་སེ་སྭ་ཡན། སྭ་ཏི་དེ་བེ་བྷྱོ། ནཱ་གེ་བྷྱོ། ཡཀྵེ་བྷྱོ། གན་དྷ་རྦེ་བྷྱོ། རཱཀྵ་སེ་བྷྱོ། མ་ནུ་ཥེ་བྷྱོ། ཨ་མ་ནུ་ཥེ་བྷྱོ། སྭ་སྟིར་བྷ་བ་ཏུ་ས་<span class='add'>  ཏྭ་སུ་  </span>ཁུམ། གསང་སྔགས་འདི་དག་རབ་བརྗོད་<span class='add'>  པས། །  </span>ས་ཡང་རབ་ཏུ་གཡོས་\nཔར་གྱུར། ཆུ་ཡི་རྒྱལ་པོ་རྣམས་ཀྱང་འཁྲུངས། གསང་སྔགས་འདི་དག་རབ་བརྗོད་པས། ཕས་ཀྱིས་རྒོལ་རྣམས་ཚར་ཡང་གཅོད། ཆོས་སྨྲ་བ་ནི་ཡང་དག་བསྡུས། ཆོས་ཀྱི་མཛོད་ནི་ཀུན་དུ་བསྲུངས་། \nགསང་སྔགས་གཞི་འདི་ཐོས་ནས་ནི། ལྷ་ཚོགས་ཀུན་དུ་དགའ་གྱུར་ནས། དམ་ཆོས་རིང་དུ་གནས་འགྱུར་ཞེས། ཕན་ཚུན་དུ་ནི་སྨྲ་བར་བྱེད། སྟོང་གསུམ་པོ་ཡང་རབ་ཏུ་གཡོས། འཁོར་ཡང་རབ་ཏུ་འདར་འགྱུར་\nནས། མི་ཡི་དབང་པོའི་ཞབས་གཉིས་ལ། གཏུག་པ་བྱས་ཏེ་སྐྱབས་སུ་དོང་། དེ་དག་མི་འཇིགས་དེར་བྱིན་ནས། སྟོན་པས་འདི་སྐད་བཀའ་སྩལ་ཏེ། མདོ་འདི་བྱིན་གྱིས་བརླབས་པས་ན། དམ་ཆོས་རིང་དུ་"
 ],
 [
  "78.212b",
  "པར་འབྱུང་བ་ཡིན། ཆོས་ལ་མི་རྟག་པར་མོས་པ་ཡིན། སེམས་ཅན་མཁའ་དང་མཚུངས་པ་ཡིན། ཆོས་ཐམས་ཅད་རྣམ་པར་བསྒྲུབས་པར་གནས་པའི་མཚན་ཉིད་དུ་ཤེས་པ་ཡིན་ཏེ། གཞོན་ནུ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་\nབརྒྱད་པོ་དེ་དག་དང་ལྡན་ན་སངས་རྒྱས་ཀྱིས་ཆོས་བསམ་གྱིས་མི་ཁྱབ་པ་ཉིད་ཐོས་ན་མི་དངང་མི་སྐྲག་ཅིང་སྐྲག་པར་མི་འགྱུར་རོ། །གསོལ་པ། བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་དུ་དང་ལྡན་ན་བགྱི་བ་ཐམས་ཅད་ལ་དབང་\nདང་ལྡན་པར་འགྱུར་བ་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། གཞོན་ནུ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་དང་ལྡན་ན་བྱ་བ་ཐམས་ཅད་ལ་དབང་དང་ལྡན་བར་འགྱུར་ཏེ། བཞི་གང་ཞེ་ན། ལེགས་པར་བསྒོམས་\nཤིང་ཉམས་པར་མ་གྱུར་པའི་མངོན་པར་ཤེས་པ་ལྔ་དང་ལྡན་པ་ཡིན། རྣམ་པར་ཐར་པའི་སྒྲོས་ཡོངས་སུ་བསྒོས་པའི་བསམ་གཏན་བཞི་དང་ལྡན་པ་ཡིན། ཚངས་པའི་བླ་མ་འཇིག་རྟེན་ལས་འདས་པའི་ཚངས་པའི་གནས་\nཔ་<span class='add'>  བཞི་  </span>དང་ལྡན་པ་ཡིན། ཐམས་ཅད་ཀྱི་རྗེས་སུ་རྣམ་པར་རྒྱུ་བའི་ཐབས་དང་ཤེས་རབ་ལས་ངེས་པར་བྱུང་བ་ཡིན་ཏེ། གཞོན་ནུ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་པོ་དེ་དག་དང་ལྡན་ན་ཐམས་ཅད་ལ་དབང་དང་ལྡན་པར་འགྱུར་རོ། །\nགསོལ་པ། བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྒོ་དུ་མཆིས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། གཞོན་ནུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྒོ་བཞི་སྟེ། བཞི་གང་ཞེ་ན། འདི་ལྟ་སྟེ། སེམས་\nཅན་གྱི་དབང་པོ་ལ་འཇུག་པ་ཡེ་ཤེས་ཀྱི་སྒོ་དང་། ཚིག་རབ་ཏུ་དབྱེ་བ་བསྟན་པ་ཤེས་རབ་ཀྱི་སྒོ་དང་། སྐད་ཐམས་ཅད་ཀུན་དུ་འཛིན་པ་ལ་འདུག་པ་གཟུངས་ཀྱི་སྒོ་དང་། ཆོས་མི་ཟད་པ་བསྟན་པ་སོ་སོ་ཡང་དག་པར་རིག་\nཔའི་སྒོ་སྟེ། གཞོན་ནུ་བཞི་པོ་དེ་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྒོ་འོ། །གསོལ་པ། བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྟོབས་དུ་མཆིས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།"
 ],
 [
  "78.215a",
  "ཆེན་པོ་ནི་ངོ་མཚར་ཏོ་སྙམ་བགྱིད་དོ། །བཅོམ་ལྡན་འདས་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཇི་སྙེད་ཅིག་ལ་དགེ་\nབའི་རྩ་བ་བསྐྱེད་ན་དེས་འདི་འདྲ་<span class='add'>  བ  </span>འི་སྤོབས་པ་དང་ལྡན་པར་གྱུར། དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་རྒྱལ་པོ་མ་སྐྱེས་དགྲ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །རྒྱ་ལ་པོ་ཆེན་པོ་སེམས་ཅན་དགེ་བའི་རྩ་\nབ་མ་སྐྱེད་པ་རྣམས་ཀྱིས་ནི་གནས་འདི་ལ་མོས་པར་དཀའ་སྟེ། འོན་གྱིས་ཀྱང་དགེ་བའི་རྩ་བ་བསྐྱེད་པར་གྱུར་པ་དེ་དག་ནི་མོས་པར་གྱུར་རོ། །རྒྱལ་པོ་ཆེན་པོ་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་\nཔོ་དེ་དག་ནི་བགྲང་པའི་ཚུལ་གྱིས་མཐའ་རྟོགས་པར་ནུས་ཀྱི། གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཇི་སྙེད་ཅིག་ལ་མཆོད་པ་དང་བསྙེན་བཀུར་བྱས་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་\nནི་བགྲང་བའི་ཚུལ་གྱིས་མཐའ་རྟོགས་པར་མི་ནུས་ཏེ། དེ་དག་གི་གན་ནས་ཚངས་པར་སྤྱད་པ་སྤྱོད་པས་དེས་ན་སྤོབས་པ་འདི་ལྟ་བུ་དང་ལྡན་པར་གྱུར་ཏོ། །རྒྱལ་པོ་ཆེན་པོ་ཁྱོད་ཀྱིས་རྣམ་གྲངས་འདིས་ཀྱང་འདི་ལྟར་\nརིག་པར་བྱ་སྟེ། རྒྱལ་པོ་ཆེན་པོ་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན་བསྐལ་པ་གྲངས་མེད་པའི་ཆོས་གྲངས་མེད་པ། རྒྱ་ཆེ་བའི་ཡང་ཆེས་རྒྱ་ཆེ་བ། ཚད་མེད་པ། བསམ་གྱིས་མི་ཁྱབ་པར་གྱུར་པ་དེའི་ཚེ་དེའི་དུས་ན་མ་སྨད་པ་\nཞེས་བྱ་བའི་བསྐལ་པ་ལ། འཇིག་རྟེན་གྱི་ཁམས་རྣམ་པར་རྒྱལ་བ་ཅན་ཞེས་བྱ་བར་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་ལྡན་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་\nམཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ་བླ་ན་མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམ་པར་ཞི་སྤྱོད་ཅེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་སྟེ། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་རྣམ་པར་ཞི་"
 ],
 [
  "78.216b",
  "དཔའ་སྟོབས་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། སྐྱེས་བུ་དམ་པ་ཁྱོད་ཀྱིས་ཚིག་འདི་ལེགས་<span class='add'>  པར་  </span>སྨྲས་པ་ལེགས་སོ་ལེགས་སོ། བྱང་ཆུབ་སེམས་དཔས་རང་གི་སྤྱོད་ཡུལ་གྱི་བྱ་བ་དག་ལ་གུས་པར་བྱ་སྟེ། རང་གི་སྤྱོད་ཡུལ་ལ་\nསྤྱོད་པར་བྱའི། གཞན་གྱི་སྤྱོད་ཡུལ་ལ་སྤྱད་པར་མི་བྱའོ། །གསོལ་པ། བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་རང་གི་སྤྱོད་ཡུལ་གང་ལགས། བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའི་རང་གི་སྤྱོད་\nཡུལ་ནི་འདི་ལྟ་སྟེ། འཁོར་བ་དཔག་ཏུ་མེད་པ་ཡོངས་སུ་འཛིན་པས་མི་སྐྲག་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའི་ཕན་ཡོན་དང་། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་ས་ལ་འདོད་པ་མེད་པ་དང་། ཉིད་མཚམས་སྦྱོར་\nབ་མེད་པར་ཡང་ཤེས་ལ་ཁམས་གསུམ་དུ་ཡང་མཚམས་སྦྱོར་བ་དང་། སེལ་བ་དང་། སྡུད་པ་དང་། དགེ་བ་འི་རྩ་བ་རྣམས་སྤེལ་བ་དང་། ཚུལ་ལ་མཁས་པ་དང་། བསྡུ་བ་ཤེས་པ་དང་། དགེ་བ་ཐམས་ཅད་སོགས་པ་ལ་\nམཁས་པ་དང་། ཟད་པ་ཡང་ཤེས་ལ་བསོད་ནམས་ཀྱི་ཚོགས་མི་ཟད་པ་ལ་ཡང་མཁས་པ་དང་། སྐྱེ་བ་མེད་པ་ཡང་རབ་ཏུ་རྟོགས་ལ་བསམས་བཞིན་དུ་སྐྱེ་བ་ལ་ཡང་མཁས་པ་དང་། སེམས་ཅན་ཡང་མེད་ལ་སེམས་ཅན་\nཡོངས་སུ་སྨིན་པར་བྱེད་པ་ལ་ཡང་མཁས་པ་དང་། ཆོས་ཐམས་ཅད་དབེན་<span class='add'>  པར་  </span>ཡང་ཤེས་ལ་དམ་པའི་ཆོས་ཡོངས་སུ་གཟུང་བ་ལ་ཡ་མཁས་པ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ནམ་མཁའི་རང་བཞིན་དུ་ཡང་ཤེས་ལ་སངས་\nརྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་སྦྱོང་བ་ལ་ཡང་མཁས་པ་དང་། སངས་རྒྱས་ཐམས་ཅད་ཆོས་ཀྱི་སྐུ་ཡིན་པར་ཡང་ཤེས་ལ་མཚན་དང་དཔེ་བྱད་བཟང་པོའི་རྒྱན་རྣམ་པར་བསྒྲུབ་པ་ཡོངས་སུ་ཚོལ་བ་ལ་ཡང་མཁས་པ་དང་། \nམངོན་པར་འདུ་བྱེད་བ་མེད་པར་ཡང་ཤེས་ལ་དགེ་བའི་རྩ་བ་ཐམས་ཅད་མངོན་བར་འདུ་བྱ་བའི་རྒྱུན་མི་གཅོད་པ་ལ་ཡང་མཁས་པ་དང་། འདུས་བྱས་ཀྱི་ཆོས་ཀྱང་ཡོངས་སུ་སྦྱོང་ལ་དོན་ཉུང་ཞིང་བྱ་བ་ཉུང་བ་དང། སེམས་"
 ],
 [
  "78.216a",
  "བའི་བདེ་བའི་རོ་མི་མྱོང་བར་འཁོར་བ་སྦྱོང་ཡུལ་དུ་བགྱི་སྟེ། མྱ་ངན་ལས་འདས་པར་སྤྱོད་ཡུལ་དུ་མི་བགྱིའོ། །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་འཁོར་བའི་བདེ་བའི་རོ་མི་མྱང་བར་འཁོར་བ་སྤྱོད་\nཡུལ་དུ་བགྱིད་ཅིང་སེམས་ཅན་གྱི་དོན་ལ་བརྩོན་བ་ནི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཚད་མ་མཆིས་པ་མཐོང་བར་འགྱུར། ཆོས་ཚད་མ་མཆིས་པ་ཉན་པར་འགྱུར་ཞིང་སེམས་ཅན་ཚད་མ་མཆིས་པ་ཡོངས་སུ་སྨིན་པར་\nབགྱིད་དོ། །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་འཁོར་བ་སྤྱོད་ཡུལ་དུ་བགྱིད་པ་ནི་སེམས་ཅན་གྱི་སྤྱོད་ཡུལ་གྱི་རྗེས་སུ་འཇུག་གོ །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་མྱ་ངན་ལས་འདས་པ་སྤྱོད་ཡུལ་དུ་\nབགྱིད་པ་ནི་བཏང་སྙོམས་དུ་ལྷུང་ལགས་སོ། །བཅོམ་ལྡན་འདས་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་འཁོར་བའི་སྤྱོད་ཡུལ་གྱིས་སྐྲག་ན་སྤྱོད་ཡུལ་མ་ལགས་པར་ལྷུང་སྟེ། སླད་ཀྱིས་སེམས་ཅན་གྱི་དོན་མི་བགྱིད། དེ་བཞིན་\nགཤེགས་པའི་སྤྱོད་ཡུལ་ལ་གནས་བར་མི་འགྱུར་ཞིང་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཉེ་བར་འཚོ་བར་མི་འགྱུར་ལགས་སོ། །དེའི་སྤྱོད་ཡུལ་མ་ལགས་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱིས་འཚལ་\nཞིང་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བགྱིད་པ་ལ་གཡེལ་བ་ལགས་སོ། །དེ་ཅིའི་སླད་དུ་ཞེ་ན། བཅོམ་ལྡན་འདས་ཉན་ཐོས་རྣམས་ཀྱི་སྤྱོད་ཡུལ་<span class='add'>  གང་  </span><span class='add'>    </span>ལགས་པ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་ཡུལ་མ་ལགས་སོ། །དེ་ཅིའི་\nསླད་དུ་ཞེ་ན། བཅོམ་ལྡན་འདས་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་རྣམས་ནི་འཁོར་བས་སྐྲག་པའི་སྤྱོད་ཡུལ་པ་ལགས་སོ། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་འཁོར་བ་དཔག་ཏུ་མ་མཆིས་པ་ཡོངས་སུ་འཛིན་པ་\nལགས་ཏེ། བཅོམ་ལྡན་འདས་དེ་ལ་བྱང་ཆུབ་སེམས་དཔས་རང་གི་སྤྱོད་ཡུལ་ལ་གནས་པར་བགྱིའོ།  རྒྱལ་པོ་ཆེན་པོས་དེ་སྐད་ཅེས་གསོལ་པ་དང་། དེ་བཞིན་གཤེགས་པ་རྣམ་པར་ཞི་སྤྱོད་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་"
 ],
 [
  "78.218a",
  "འདས་འདི་ལྟ་སྟེ། དཔེར་བགྱིད་ན་ཚན་པོ་ཆེའི་ལུས་ནི་ཞུགས་ཀྱིས་མི་ཚིག །མཚོན་གྱིས་མི་ཁུམས་། དུག་གིས་མི་ཁུམས་ཏེ། དེ་ཕ་རོལ་གྱི་གནོད་པས་མི་ཚུགས་སོ། །བཅོམ་ལྡན་འདས་དེ་བཞིན་དུ་བྱང་ཆུབ་\nསེམས་དཔའི་ཤེས་རབ་དང་། ཡེ་ཤེས་ཀྱང་ཉན་ཐོས་དང་འདྲིས་པར་བགྱིད་པ་དང་། རང་སངས་དང་འདྲིས་པར་བགྱིད་པ་དང་། ཉོན་མོངས་པ་དང་འདྲིས་པར་བགྱིད་པས་ཞི་བར་བགྱིད་མི་ནུས་ཏེ། དེ་ཇི་ལྟ་ཇི་ལྟར་འདྲིས་\nཔར་བགྱིད་པ་དེ་ལྟ་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་ལྷག་མཐོང་ལ་བརྩོན་བ་ཤེས་རབ་གསལ་བར་འགྱུར་རོ། །བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ། དཔེར་བགྱི་ན་ནོར་བུ་རིན་པོ་ཆེ་ཆབ་དང་བར་བགྱིད་པ་ནི་རྙོག་པ་ཐམས་\nཅད་དང་བར་བགྱིད་དོ། །བཅོམ་ལྡན་འདས་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའི་ཤེས་<span class='add'>  རབ་  </span>ཀྱི་རིན་པོ་ཆེ་ཡང་སེམས་ཅན་རྣམས་ཀྱི་ཉོན་མོངས་པའི་དྲི་མ་ཐམས་དང་བར་བགྱིད་དོ། །བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ། \nདཔེར་བགྱི་ན་སྨན་གྱི་རིགས་འབྲལ་བྱེད་ཅེས་བགྱི་བ་དེ་ནི་དུག་དང་ལྷན་ཅིག་ཏུ་ཡང་མི་གནས་ལ་དུག་ཐམས་ཅད་ཀྱང་ཞི་བར་བགྱིད་དོ། །བཅོམ་ལྡན་འདས་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་པའི་ཐབས་དང་ཤེས་རབ་བསྒོམ་\nཔ་ཡང་སེམས་ཅན་གྱི་ཉོན་མོངས་པའམ། རང་གི་ཉོན་མོངས་པ་རྣམས་དང་ལྷན་ཅིག་མི་གནས་ཤིང་སེམས་ཅན་རྣམས་ཀྱི་ཉོན་མོངས་པ་ཐམས་ཅད་ཀྱང་ཞི་བར་བགྱིད་དེ། བཅོམ་ལྡན་འདས་རྣམ་གྲངས་འདིས་ན་\nཆོས་ཐམས་ཅད་བྱང་ཆུབ་སེམས་དཔའི་རང་གི་སྤྱོད་ཡུལ་ལགས་སོ། །རྒྱལ་པོ་ཆེན་པོ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་སྟོབས་ཀྱིས་དེ་སྐད་བསྟན་པ་ན་སྲོག་ཆགས་བརྒྱད་སྟོང་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་\nརྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ། །བྱང་ཆུབ་སེམས་དཔའ་ཉིས་བརྒྱ་ནི་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་སྐྱེས་སོ། །རྒྱལ་པོ་ཆེན་པོ་འདི་སྙམ་དུ་དེའི་ཆེ་དེའི་དུས་ན་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་"
 ],
 [
  "78.219b",
  "ལྕི་བ་ནི་དཔེར་བགྱི་བར་ཡང་སླ་བ་མ་ལགས་སོ། །བཅོམ་ལྡན་འདས་ཀྱི་བཀའ་སྩལ་པ། ཀཽ་ཤ་ཀ་རྡོ་རྗེ་འདི་ནི་ལྕི་སྟེ། ཀཽ་ཤི་ཀ་གལ་ཏེ་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེས་རྡོ་རྗེའི་འདེ་རྡོ་རྗེའི་རང་བཞིན་གྱིས་འཁོར་ཡུག་གི་\nརིལ་བསྣུན་ན་དེ་ཡང་དཔེར་ན་ཕུག་མ་སྤར་གང་གཏོར་བ་བཞིན་དུ་རྣམ་པར་འཐོར་ཏེ། ཀཽ་ཤི་ཀ་རྡོ་རྗེ་འདིའི་སྟོབས་ཀྱི་ཤུགས་ཀྱི་ནི་དེ་ཙམ་མོ། །དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་ཚེ་དང་ལྡན་པ་<span class='add'>  མཽ  </span><span class='add'>  ད་གལ་  </span>གྱི་བུ་ཆེན་པོ་ལ་འདི་\nསྐད་ཅེས་སྨྲས་སོ། བཙུན་པ་<span class='add'>  མཽ  </span><span class='add'>  ད་གལ་  </span>གྱི་བུ་ཆེན་པོ་ཁྱོད་བཅོམ་ལྡན་འདས་ཀྱི་ཉན་ཐོས་རྣམས་ཀྱི་ནང་ན་རྫུ་འཕྲུལ་དང་ལྡན་བའི་མཆོག་ཏུ་བསྟན་པ་ཡིན་ན་རྡོ་རྗེ་འདི་སའི་སྟེང་འདི་ནས་ཐེག་ཤིག །དེ་ནས་ཆེ་དང་ལྡན་པ་\n<span class='add'>  མཽ  </span><span class='add'>  ད་གལ་  </span>གྱི་བུ་ཆེན་པོས་འདི་སྙམ་དུ་བསམས་ཏེ། གལ་ཏེ་བདག་གིས་ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་འདིའི་མདུན་དུ་རྡོ་རྗེ་འདི་གདེག་པར་མ་ནུས་ན་ནི་བདག་ལ་དབང་ཟ་བར་འགྱུར་རོ་སྙམ་ནས་དེ་ས་དེ་འདྲ་བའི་སྟོབས་ཀྱི་ཤུགས་\nཀྱིས་རྡོ་རྗེ་དེ་བཟུང་བ་དང་། སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་རྣམ་པ་དྲུག་ཏུ་གཡོས་རབ་ཏུ་གཡོས་ཏེ། ཆུ་ཡང་གནམ་དུ་རྒལ་ཅིང་། རྒྱ་མཚོ་ཐམས་ཅད་འཁྲུགས་ཀྱང་རྡོ་རྗེ་དེ་བསྐྱོད་པའམ། བསྒུལ་\nབར་མ་ནུས་སོ། །དེ་ནས་ཚེ་དང་ལྡན་པ་<span class='add'>  མཽ  </span><span class='add'>  ད་གལ་  </span>གྱི་བུ་ཆེན་པོ་ངོ་མཚར་དུ་གྱུར་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བདག་བཅོམ་ལྡན་\nའདས་ཀྱིས་ཉན་ཐོས་རྣམས་ཀྱི་ནང་ན་རྫུ་འཕྲུལ་དང་ལྡན་པའི་མཆོག་ཏུ་བསྟན་པ་ལགས་སོ། །བཅོམ་ལྡན་འདས་བདག་དེ་ལྟར་རྫུ་འཕྲུལ་ཆེ་ཞིང་དེ་ལྟར་དབང་ཆེ་བར་གྲགས་ལ་དེ་ལྟར་མཐུ་ཆེ་བ་ལགས་ཏེ། བཅོམ་ལྡན་\nའདས་བདག་གང་གི་ཚེ་འཚལ་ན་རྒྱ་མཚོ་ཆེན་པོ་བཞིའི་ཆབ་ཀྱི་ཕུང་པོ་ལག་མཐིལ་གཅིག་ཏ་འཇོག་གོ །བཅོམ་ལྡན་འདས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ཡང་དཔེར་བགྱི་ན་མི་ལ་ལ་ཞིག་གིས་"
 ],
 [
  "78.219a",
  "ཆེན་པོ་དང་ལྡན་<span class='add'>  པས་  </span>རྡོ་རྗེ་དེ་སྟོབས་ཀྱི་ཤུགས་ཐམས་ཅད་ཀྱིས་འདེག་པར་བསྐྱོད་ན་སྐྲའི་རྩེ་མོ་ཙམ་ཡང་བསྐྱོད་པའམ། བསྒུལ་བར་མ་ནུས་ནས་དེ་ངོ་མཚར་དུ་གྱུར་ཏེ་ཐལ་མོ་སྦྱར་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་\nགསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བདག་ནི་ཚན་པོ་ཆེན་པོའི་སྟོབས་ཀྱི་ཤུགས་དང་ལྡན་ཏེ། གོ་ཆ་དང་ཡ་<span class='add'>  ལད་  </span>བསྐོན་པའི་གླང་པོ་ཆེ་ཡང་ལག་པ་ཡ་ཅིག་གིས་འདེག་པའི་རྔོ་ཐོག་ན། བདག་གིས་རྡོ་རྗེ་འདི་ལྟར་ཆུང་བ་འདི་བསྐྱོད་\nཔའམ། བསྒུལ་བའི་རྔོ་ཡང་མ་ཐོག་ན། འདེག་པར་ལྟ་སྨོས་ཀྱང་ཅི་འཚལ་ཏེ། འདི་ལ་རྒྱུ་ཅི་ཞིག་མཆིས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རྒྱལ་པོ་ཆེན་པོ་རྡོ་རྗེ་འདི་ནི་ལྕི་ཡིས་འདི་ལ་ཁྱོད་ཡི་མ་<span class='add'>  འཆད་  </span><span class='add'>  ཅིག །  </span>\nདེ་ནས་རྒྱལ་པོ་མ་སྐྱེས་དགྲས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། ཀཽ་ཤི་ཀ་ཁྱོད་རྡོ་རྗེ་འཆང་བ་ཞེས་བྱ་ན་རྡོ་རྗེ་འདི་སའི་སྟེང་འདི་ནས་ཐེག་ཤིག །དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་རང་གི་སྟོབས་ཀྱི་\nཤུགས་དང་། རྫུ་འཕྲུལ་གྱི་སྟོབས་དང་། སྟོབས་ཀྱི་ཤུགས་ཐམས་ཅད་བསྟན་ཀྱང་རྡོ་རྗེ་དེ་བསྐྱོད་པའམ། བསྒུལ་བར་མ་ནུས་སོ། །དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་ངོ་མཚར་དུ་གྱུར་ཏེ། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་\nཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བདག་གང་གི་ཚེ་ལྷ་མ་ཡིན་དང་གཡུལ་འགྱེད་པ་དེའི་ཚེ་ལག་པ་གཡས་པས་ལྷ་མ་ཡིན་གྱི་དབང་པོ་ཐག་ཟངས་རིས་ཀྱི་ཤིང་རྟ་དཔག་ཚད་བདུན་བརྒྱ་པ་བདུན་བརྒྱ་པ་དྲག་ཏུ་མཆི་བ་ཡང་འཛིན་\nབའི་རྔོ་ཐོག་ན། བདག་གིས་རྡོ་རྗེ་ཆུང་དུ་འདི་བསྐྱོད་པ་འམ། བསྒུལ་བའི་རྔོ་མ་ཐོག་པ་འདི་བཅོམ་ལྡན་འདས་ཅི་ལགས། སངས་རྒྱས་ཀྱི་བྱིན་གྱིས་བརླབས་ལགས་སམ། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། \nཀཽ་ཤི་ཀ་རྡོ་རྗེ་འདི་ནི་<span class='add'>  ལྕི་  </span>སྟེ། འདི་ལ་ངའི་བྱིན་གྱི་བརླབས་མ་ཡིན་<span class='add'>  པར་  </span>རིག་པར་བྱའོ། ཀཽ་ཤི་ཀ་འདི་ཇི་སྙམ་དུ་སེམས། རིའི་རྒྱལ་པོ་རི་རབ་ལྕི་བ་ཡིན་ནམ། གསོལ་པ། བཅོམ་ལྡན་འདས་རིའི་རྒྱལ་པོ་རི་རབ་ཇི་ཙམ་དུ་"
 ],
 [
  "78.217b",
  "སྒྲིབ་པ་མ་མཆིས་པས་གཟུགས་སུ་གདའ་བ་ཐམས་ཅད་ནི་ནམ་མཁའི་སྤྱོད་ཡུལ་ལགས་སོ། བཅོམ་ལྡན་འདས་དེ་བཞིན་དུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བས་བྱང་ཆུབ་སེམས་དཔའ་ཐབས་ལ་མཁས་པའི་སྤྱོད་\nཡུལ་ནི་ཆོས་ཐམས་ཅད་ལགས་སོ། །བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ། དཔེར་བགྱི་ན་གནོད་པ་མ་མཆིས་པའི་སླད་དུ་གཟུགས་གདའ་བ་ཐམས་ཅད་ནི་ནམ་མཁའི་སྤྱོད་ཡུལ་ལགས་ཏེ། དུག་གི་ཤིང་ལྗོན་པའམ། \nསྨན་གྱི་ཤིང་ལྗོན་པ་འམ། ཚེར་མ་ཅན་གྱི་ཤིང་ལྗོན་པའམ། མེ་ཏོག་གི་ཤིང་ལྗོན་པའམ། འབྲས་བུའི་ཤིང་ལྗོན་པའམ། སྤོས་ཀྱི་ཤིང་ལྗོན་པ་གང་ལགས་པ་དེ་དག་ཐམས་ཅད་ནི་ནམ་མཁའ་ལས་རྣམ་པར་འཕེལ་\nཡང་ནམ་མཁའ་ནི་དེ་དག་གིས་ཀུན་ནས་ཉོན་མོངས་པར་ཡང་མི་འགྱུར། རྣམ་པར་བྱང་བར་ཡང་མི་འགྱུར། རྗེས་སུ་ཆགས་པར་ཡང་མི་འགྱུར། ཁོང་ཁྲོ་བར་ཡང་མི་འགྱུར་ལགས་སོ། །བཅོམ་ལྡན་འདས་དེ་\nབཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཐབས་ལ་མཁས་པ་ཤེས་རབ་ལས་ངེས་པར་བྱུང་བའི་རང་གི་སྤྱོད་ཡུལ་ནི་ཆོས་ཐམས་ཅད་ལགས་ཏེ། སོ་སོ་སྐྱེ་བོའི་ཆོས་གང་དག་ལགས་པ་དང་། སློབ་པའི་ཆོས་དང་། མི་སློབ་\nཔའི་ཆོས་དང་། རང་སངས་རྒྱས་ཀྱི་ཆོས་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཆོས་གང་དག་ལགས་པ་དང་། དེ་བཞིན་གཤེགས་པའི་ཆོས་གང་དག་ལགས་པ་རྣམས་སོ། །དེ་ཅིའི་སླད་དུ་ཞེ་ན། །དེ་དག་ཐམས་ཅད་ནི་<span class='add'>  དེས་  </span>\nམངོན་པར་རྫོགས་པར་རྟོགས་པར་བགྱི་བ་ལགས་སོ། །བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ། དཔེར་བགྱི་ན་ཞུགས་ནི་རྩྭ་འམ་ནགས་ཚལ་གང་ཡར་རུང་སྟེ། དེ་ལས་མི་འབྲོས་ཀྱི་དེ་དག་ཐམས་ཅད་ནི་མེ་སྒྲོན་གསལ་བར་\nའབར་བར་བགྱིད་པས་ཕན་པར་འགྱུར་ལགས་སོ། །བཅོམ་ལྡན་འདས་དེ་བཞིན་དུ་ཤེས་རབ་ཀྱི་མེ་སྒྲོན་འབར་བར་བགྱིད་པས་ཆོས་ཐམས་ཅད་ནི་བྱང་ཆུབ་སེམས་དཔའི་རང་གི་སྤྱོད་ཡུལ་ལགས་སོ། །བཅོམ་ལྡན་"
 ],
 [
  "78.220b",
  "<span class='add'>  མཽ  </span><span class='add'>  ད་གལ་  </span>གྱི་བུ་ཆེན་པོ་ངོ་མཚར་དུ་གྱུར་ཏེ། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། བཅོམ་ལྡན་འདས་འདི་ལྟར་རྡོ་རྗེ་འདི་འཆང་བས་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེ་འདི་ནི་སྟོབས་ཀྱི་ཤུགས་ཆེན་པོ་དང་ལྡན་\nབ་ལགས་ཏེ་ངོ་མཚར་ཏོ། །བཅོམ་ལྡན་འདས་ཇི་ལགས། གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེའི་སྟོབས་དེ་<span class='add'>  ཕ་མ་  </span>ལས་གྱུར་པ་ལགས་སམ། འོན་ཏེ་རྫུ་འཕྲུལ་གྱི་སྟོབས་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་\nཔ། <span class='add'>  མཽ  </span><span class='add'>  ད་གལ་  </span>གྱི་བུ་ཕ་མ་ལས་གྱུར་བའི་སྟོབས་དེ་ནི་གང་ཅི་ཡང་རུང་སྟེ་འཇུག་པ་ཙམ་དུ་མིང་བསྟན་པར་ཟད་དོ། །གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་རྫུ་འཕྲུལ་གྱི་སྟོབས་དེ་མ་ལུས་པར་བསྟན་ན་ལྷ་དང་བཅས་པའི་\nའཇིག་རྟེན་མྱོ་མྱོ་པོར་འགྱུར་རོ། །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་གླང་པོ་ཆེའི་ལྟ་སྟངས་ཀྱིས་ཕྱོགས་ཐམས་ཅད་དུ་ཀུན་དུ་གཟིགས་ཏེ། གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །གསང་བ་\nཔའི་བདག་པོ་ཁྱོད་གྱི་རྡོ་རྗེ་འདི་སའི་སྟེང་འདི་ནས་ཐེག་ཤིག །དེ་ནས་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེས་དེའི་ཚེ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་གཡོས་པར་བྱས་ནས་སའི་སྟེང་དེ་ནས་རྡོ་རྗེ་དེ་ལག་\nཔ་གཡོན་པས་བླངས་ཏེ། སྟེང་གི་བར་སྣང་དུ་འཕངས་ནས་དེས་དེ་བར་སྣང་ལ་ལན་བདུན་སྐོར་ཏེ། ལག་པ་གཡས་པར་གཞག་གོ །དེ་ན་ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དེ་ངོ་མཚར་ཏུ་གྱུར་ཏེ་ཐལ་མོ་སྦྱར་ནས་\nགསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེ་ལ་ཕྱག་འཚལ་ཏེ། འདི་ལྟར་རྡོ་རྗེ་འདི་འཆང་བས་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེ་ཇི་ཙམ་དུ་སྟོབས་ཀྱི་ཤུགས་དང་ལྡན་པ་ནི་ངོ་མཚར་ཏོ། །བཅོམ་ལྡན་འདས་སེམས་ཅན་\nཐམས་ཅད་ཀྱང་འདི་ལྟ་བུའི་སྟོབས་དང་ལྡན་པར་གྱུར་ཅིག་གཅེས་སྨྲས་སོ། །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་རྒྱལ་པོ་མ་སྐྱེས་དགྲས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་དུ་"
 ],
 [
  "78.220a",
  "ཀར་ཥ་པ་ཎ་གཅིག་འཛུབ་མོའི་རྩེ་མོས་བསྒྲེ་བཟློག་པ་དེ་བཞིན་དུ་བདག་གིས་བསྒྲེ་བཟློག་གོ །བཅོམ་ལྡན་འདས་ཉི་མ་དང་ཟླ་བ་འདི་ལྟར་རྫུ་འཕྲུལ་ཆེ་ཞིང་མཐུ་ཆེན་བ་མཆི་བ་ཡང་བདག་གིས་ཐོགས་པར་\nབགྱིད་དོ། །རིའི་རྒྱལ་པོ་རི་རབ་ཀྱང་ལག་པ་ཡ་གཅིག་གིས་བླངས་ཏེ་ཚངས་པའི་འཇིག་རྟེན་གྱི་བར་དུ་འཕེན་ཏོ། །བཅོམ་ལྡན་འདས་བདག་གིས་ཀླུའི་རྒྱལ་པོ་དགའ་བོ་དང་། ཉེ་དགའ་བོ་དེ་གཉིས་ཀྱང་བཏུལ་ལོ། །བཅོམ་ལྡན་\nའདས་བདག་འཇིག་རྟེན་གྱི་ཁམས་འོད་ཟེར་ཅན་དུ་ཡང་མཆིས། བདག་གིས་རི་རབ་ཙམ་གྱི་ཁམས་དེ་དག་ཀྱང་འཚལ་འཚལ་ན། བཅོམ་ལྡན་འདས་བདག་གིས་རྡོ་རྗེ་འདི་ལྟར་ཆུང་བ་འདི་བསྐྱོད་པ་འམ། བསྒུལ་བའི་\n<span class='add'>  རྔོ་  </span>ཡང་མ་ཐོག་པ་འདི་བཅོམ་ལྡན་འདས་བདག་རྫུ་འཕྲུལ་གྱི་སྟོབས་དེ་ལས་ཡོངས་སུ་ཉམས་པའམ་གཅིག་ཏུ་མ་གྱུར་ལགས་སམ། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། <span class='add'>  མཽ  </span><span class='add'>  ད་གལ་  </span>གྱི་བུ་ཆེན་པོ་ཁྱོད་རྫུ་འཕྲུལ་\nགྱི་སྟོབས་དེ་ལས་ཡོངས་སུ་ཉམས་པ་ནི་མེད་མོད་ཀྱི། བྱང་ཆུབ་སེམས་དཔའི་སྟོབས་ཀྱི་བྱིན་གྱི་བརླབས་འདི་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་ཀྱང་རྣམ་པར་བཀྲུག་པར་མི་ནུས་ན། སེམས་ཅན་གཞན་དག་\nགིས་ལྟ་སྨོས་ཀྱང་ཅི་དགོས། <span class='add'>  མཽ  </span><span class='add'>  ད་གལ་  </span>གྱི་བུ་སངས་རྒྱས་ཀྱི་ཞིང་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་ན་རིའི་རྒྱལ་པོ་རི་རབ་ཡོད་པ་རྣམས་ནི་བསྐྱོད་པའམ། བསྒུལ་བར་ནུས་ཀྱི། རྡོ་རྗེ་འདི་ནི་ས་ཕྱོགས་འདི་ནས་བསྐྱོད་པ་འམ། \nབསྒུལ་བར་མི་ནུས་སོ། །ཚེ་དང་ལྡན་བ་<span class='add'>  མཽ  </span><span class='add'>  ད་གལ་  </span>གྱི་བུ་ཆེན་པོས་གསོལ་པ། བཅོམ་ལྡན་འདས་འདི་ལྟར་རྡོ་རྗེ་འདི་འཆང་བས་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེ་ནི་སྟོབས་ཆེ་བ་ལགས་སོ། །བཅོམ་ལྡན་འདས་ཀྱིས་\nབཀའ་སྩལ་པ། <span class='add'>  མཽ  </span><span class='add'>  ད་གལ་  </span>གྱི་བུ་སྟོང་གསུམ་གྱི་ཆེན་པོ་འཇིག་རྟེན་གྱི་ཁམས་ན་རི་རབ་ཇི་སྙེད་ཡོད་པ་དེ་དག་རི་གཅི་ཏུ་གྱུར་ཀྱང་དེ་ནི་གདེག་པར་ནུས་ཀྱི། རྡོ་རྗེ་འདི་ན་གདེག་པར་མི་ནུས་སོ། །དེ་ནས་གནས་བརྟན་"
 ],
 [
  "78.222a",
  "པོ་ཆེན་པོ་བརྩོན་འགྲུས་ཀྱི་རྒྱུ་འཐུན་པ་ནི་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བྱེད་པའོ། །གསོལ་པ། བཅོམ་ལྡན་འདས་བསམ་གཏན་གྱི་རྒྱུ་འཐུན་པ་ཅི་ལགས། བཀའ་སྩལ་པ། \nརྒྱལ་པོ་ཆེན་པོ་བསམ་གཏན་གྱི་རྒྱུ་འཐུན་པ་ནི་ཉེ་བར་ཞི་བའོ། གསོལ་པ། །བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་རྒྱུ་འཐུན་པ་ཅི་ལགས། བཀའ་སྩལ་པ། རྒྱལ་པོ་ཆེན་པོ་ཤེས་རབ་ཀྱི་རྒྱུ་འཐུན་པ་ནི་ཉོན་མོངས་པ་ཐམས་ཅད་སེལ་\nཔའོ། །གསོལ་པ། བཅོམ་ལྡན་འདས་ཆོས་ཉན་པའི་རྒྱུ་འཐུན་པ་ཅི་ལགས། བཀའ་སྩལ་པ། རྒྱལ་པོ་ཆེན་པོ་ཆོས་ཉན་པའི་རྒྱུ་འཐུན་པ་ནི་ཐེ་ཚེམ་སྤོང་བའོ། །གསོལ་པ། བཅོམ་ལྡན་འདས་ཆོས་ཡོངས་སུ་འདྲི་བའི་རྒྱུ་འཐུན་\nཔ་ཅི་ལགས། བཀའ་སྩལ་པ། རྒྱལ་པོ་ཆེན་པོ་ཆོས་ཡོངས་སུ་འདྲི་བའི་རྒྱུ་འཐུན་པ་ནི་སོམ་ཉི་མེད་པའོ། །གསོལ་པ། བཅོམ་ལྡན་འདས་དབེན་<span class='add'>  པར་  </span>གནས་པའི་རྒྱུ་འཐུན་པ་ཅི་ལགས། བཀའ་སྩལ་པ། རྒྱལ་པོ་ཆེན་པོ་དབེན་<span class='add'>  པར་  </span>\nགནས་པའི་རྒྱུ་འཐུན་པ་ནི་བསམ་གཏན་དང་མངོན་པར་ཤེས་པ་ཐོབ་པའོ། །གསོལ་པ། བཅོམ་ལྡན་འདས་བསྒོམ་པའི་རྒྱུ་འཐུན་པ་ཅི་ལགས། བཀའ་སྩལ་པ། རྒྱལ་པོ་ཆེན་པོ་བསྒོམ་པའི་རྒྱུ་འཐུན་པ་ནི་འབྲལ་བའོ། །གསོལ་\nཔ། བཅོམ་ལྡན་འདས་མི་རྟག་པ་ཐོས་པའི་རྒྱུ་འཐུན་པ་ཅི་ལགས། བཀའ་སྩལ་པ། རྒྱལ་པོ་ཆེན་པོ་མི་རྟག་པ་ཐོས་པའི་རྒྱུ་འཐུན་པ་ནི་ཡོངས་སུ་འཛིན་པ་འདོར་བའོ། གསོལ་པ། བཅོམ་ལྡན་འདས་སྡུག་བསྔལ་ཐོས་པའི་རྒྱུ་\nའཐུན་པ་ཅི་ལགས། བཀའ་སྩལ་པ། རྒྱལ་པོ་ཆེན་པོ་སྡུག་བསྔལ་ཐོས་པའི་རྒྱུ་འཐུན་པ་ནི་ཉེ་བར་ལེན་པ་མེད་པའོ། །གསོལ་པ། བཅོམ་ལྡན་འདས་བདག་མེད་པ་ཐོས་པའི་རྒྱུ་འཐུན་པ་ཅི་ལགས། བཀའ་སྩལ་པ། རྒྱལ་\nཔོ་ཆེན་པོ་བདག་མེད་པ་ཐོས་པའི་རྒྱུ་འཐུན་པ་ནི་ངར་འཛིན་པ་དང་། ང་ཡིར་འཛིན་པ་འགོག་པའོ། །གསོལ་པ། བཅོམ་ལྡན་འདས་ཞི་བ་ཐོས་པའི་རྒྱུ་འཐུན་པ་ཅི་ལགས། བཀའ་སྩལ་པ། རྒྱལ་པོ་ཆེན་པོ་ཞི་བ་ཐོས་པའི་"
 ],
 [
  "78.221b",
  "ཞིང་ཅད་ཤེས་པའི་འགྲོ་བར་འགྲོའོ། །གསོལ་པ། བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཅང་ཤེས་ཀྱི་འགྲོ་བ་དུ་ཞིག་མཆིས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རྒྱལ་པོ་ཆེན་པོ་བྱང་ཆུབ་\nསེམས་དཔའ་རྣམས་ཀྱི་ཅང་ཤེས་ཀྱི་འགྲོ་བ་བཞི་སྟེ། བཞི་གང་ཞེ་ན། གང་གི་ཚེ་མིའི་འཇིག་རྟེན་དུ་སྐྱེས་པ་དེའི་ཚེ་འཁོར་ལོས་སྒྱུར་བའི་འགྱུར་ཏེ། དེར་ཡང་སངས་རྒྱས་འབྱུང་བ་མཉེས་པར་བྱེད་པ་དང་། \nལྷའི་དབང་པོ་བརྒྱ་བྱིན་དུ་འགྱུར་ཏེ། དེར་ཡང་སངས་རྒྱས་འབྱུང་བ་མཉེས་པར་བྱེད་པ་དང་། མི་མཇེད་ཀྱི་བདག་པོ་ཚངས་པར་འགྱུར་ཏེ། དེར་ཡང་སངས་རྒྱས་འབྱུང་བ་མཉེས་པར་བྱེད་པ་དང་། ཁྱིམ་བདག་ཚོང་\nདཔོན་དུ་འགྱུར་ཏེ། དེར་ཡང་སངས་རྒྱས་འབྱུང་བ་མཉེས་པར་བྱེད་པ་སྟེ། རྒྱལ་པོ་ཆེན་པོ་བཞི་པོ་དེ་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཅང་ཤེས་ཀྱི་འགྲོ་བའོ། །རྒྱལ་པོ་མ་སྐྱེས་དགྲས་གསོལ་པ། བཅོམ་ལྡན་འདས་<span class='add'>  དད་  </span>\nཔའི་རྒྱུ་འཐུན་<span class='add'>  པ་  </span>ཅི་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རྒྱལ་པོ་ཆེན་པོ་<span class='add'>  དད་  </span>པའི་རྒྱུ་འཐུན་པ་ནི་དགེ་བའི་བཤེས་གཉེན་ནོ། །གསོལ་པ། བཅོམ་ལྡན་འདས་སྦྱིན་པའི་རྒྱུ་འཐུན་པ་ཅི་ལགས། བཀའ་\nསྩལ་པ། རྒྱལ་པོ་ཆེན་པོ་སྦྱིན་པའི་རྒྱུ་འཐུན་པ་ནི་ལོངས་སྤྱོད་དོ། །གསོལ་པ། བཅོམ་ལྡན་འདས་ཐོས་པའི་རྒྱུ་འཐུན་པ་ཅི་ལགས། བཀའ་སྩལ་པ། རྒྱལ་པོ་ཆེན་པོ་ཐོས་པའི་རྒྱུ་འཐུན་པ་ནི་ཤེས་རབ་བོ། །\nགསོལ་པ། བཅོམ་ལྡན་འདས་ཚུལ་ཁྲིམས་ཀྱི་རྒྱུ་འཐུན་པ་ཅི་ལགས། བཀའ་སྩལ་པ། རྒྱལ་པོ་ཆེན་པོ་ཚུལ་ཁྲིམས་ཀྱི་རྒྱུ་འཐུན་པ་ནི་བདེ་འགྲོ་ཐམས་ཅད་དུ་འགྲོ་བའོ། །གསོལ་པ། བཅོམ་ལྡན་འདས་བཟོད་\nཔའི་རྒྱུ་འཐུན་པ་ཅི་ལགས། བཀའ་སྩལ་པ། རྒྱལ་པོ་ཆེན་པོ་བཟོད་པའི་རྒྱུ་འཐུན་པ་ནི་སེམས་ཅན་རྗེས་སུ་སྲུང་བའོ། །གསོལ་པ། བཅོམ་ལྡན་འདས་བརྩོན་འགྲུས་ཀྱི་རྒྱུ་འཐུན་པ་ཅི་ལགས། བཀའ་སྩལ་པ། རྒྱལ་"
 ],
 [
  "78.225a",
  "དབེན་པ་མ་ཡིན་པ་དང་། འདས་པ་དབེན་པ་དང་། མ་འོངས་པ་དབེན་པ་དང་། དེ་ལྟར་བྱུང་བ་དབེན་པ་དང་། འདས་པ་དང། མ་འོངས་པ་དང་། ད་ལྟར་བྱུང་བའི་དུས་དབེན་པ་མ་ཡིན་པ་དང་། སངས་རྒྱས་\nདབེན་པ་དང་། སངས་རྒྱས་དབེན་པ་མ་ཡིན་པ་དང་། ཞིང་དབེན་པ་དང་། ཞིང་དབེན་པ་མ་ཡིན་པ་དང་། ཆོས་དབེན་པ་དང་། ཆོས་དབེན་པ་མ་ཡིན་<span class='add'>  པར་  </span>གང་དེ་ལྟར་ཆོས་རྣམས་རྗེས་སུ་རྟོགས་པ་དེ་ནི་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་\nཔའོ། །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེ་ལ་ལེགས་སོ་ཞེས་བྱ་བ་གནང་སྟེ། སྐྱེས་བུ་དམ་པ་ལེགས་སོ་ལེགས་སོ། །འདི་ནི་དམ་པའི་ཡོངས་སུ་འཛིན་པའོ། །གསང་བ་པའི་\nབདག་པོ་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པ་ནི་གང་ཆོས་ཐམས་ཅད་མི་འཛིན་པ་དང་། མཆོག་ཏུ་འཛིན་པ་མེད་པ་དང་། གང་ཆོས་ཐམས་ཅད་ལ་མཚན་མ་དང་སྤྲོས་པར་མི་འཛིན་པ་དང་། ཀུན་དུ་སྤྱོད་པ་མེད་པ་དང་། \nགང་ཡོངས་སུ་རྟོག་པ་ཐམས་ཅད་ལ་མི་རྟོག་ཅིང་རྣམ་པར་མི་རྟོགས་པའོ། །དེའི་ཚེ་ལྷའི་བུ་རྒྱལ་པོ་བཟང་ཞེས་བྱ་བ་འཁོར་དེ་ཉིད་དུ་འདུས་པར་གྱུར་པ་དེས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་\nའདས་ཉེ་བར་ཞི་བ་ནི་སངས་རྒྱས་ཀྱི་བཀའ་ལགས་སོ། །བཅོམ་ལྡན་འདས་སངས་རྒྱས་ཀྱི་བཀའ་ནི་ཉེ་བར་ཞི་བར་བགྱི་བའི་ཆེད་ལགས་ཏེ། ཉེ་བར་ཞི་བ་གང་ལགས་པ་དེས་སངས་རྒྱས་ཀྱི་བཀའོ། །བཅོམ་ལྡན་འདས་དེ་ལ་\nགང་དག་དམིགས་པ་ཐམས་ཅད་ཉེ་བར་ཞི་བར་མཐོང་བ་དེ་དག་ཉེ་བར་ཞི་ལགས་ཏེ། དེ་དག་ནི་སླད་ཀྱིས་འབར་བ་མ་ལགས། མཆེད་པ་མ་ལགས་འབར་པར་བགྱིད་པ་མ་ལགས་སོ། །གང་དག་ཞི་བ་དང་། རབ་ཏུ་ཞི་\nབ་དང་། ཉེ་བར་ཞི་བ་དེ་དག་དེ་བཞིན་གཤེགས་པའི་དམ་པའི་ཆོས་འཛིན་ཅིང་མི་འདོར་བ་ལགས་ཏེ། ཇི་ལྟར་ཆོས་ཐམས་ཅད་མི་འཛིན་མི་འདོར་བ་དེ་ལྟར་འཛིན་ཏོ། །ལྷའི་བུ་དེས་དེ་སྐད་བསྟན་པས་དགེ་སློང་སྟོང་ནི་སེམས་"
 ],
 [
  "78.226b",
  "མ་ཡིན་ནོ། །ཡི་གེ་དེ་དག་ནི་ཆོས་ཞེའམ། ཆོས་མ་ཡིན་ཞེས་བྱ་བར་རྣམ་པར་མི་རྟོག་གོ །ཡི་གེ་དེ་དག་ནི་སུས་ཀྱང་བསྐྱེད་པའམ། བཀག་པ་མེད་དོ། །ཡི་གེ་དེ་དག་ནི་སུས་ཀྱང་བྱས་པའམ། ཆུད་གཟན་པ་མེད་དོ། །\nཞི་བའི་བློ་གྲོས་ཡི་གེ་བགྲང་བ་ཇི་ལྟ་བར་སེམས་བགྲང་བ་ཡང་དེ་བཞིན་ནོ། །སེམས་བགྲང་བ་ཇི་ལྟར་ཆོས་ཐམས་ཅད་བགྲང་བ་ཡང་དེ་བཞིན་ནོ། །ཆོས་ཐམས་ཅད་བགྲང་བ་ཇི་ལྟ་བར་བགྲང་བ་མེད་པ་ཡང་དེ་བཞིན་ནོ། །\nདེ་ཅིའི་ཕྱིར་ཞེ་ན། ཆོས་ནི་བགྲང་བར་ཉེ་བར་འགྲོ་བར་ཡིན་ཏེ་བགྲང་བ་མེད་པ་ནི་ཆོས་བགྲང་བའོ། །ཇི་ལྟར་ཆོས་བགྲང་བར་ཉེ་བར་མི་འགྲོ་བ་བཞིན་དུ་ཨ་ཞེས་བྱ་བའི་རྗེས་སུ་འཇུག་པ་ཡང་དེ་ལྟ་བུ་སྟེ། གཟོད་མ་ཉིད་ནས་མ་\nསྐྱེས་པ་ལ་འཇུག་པ་སྐྱེ་བ་མེད་པ་ལ་འཇུག་པའོ། མ་སྐྱེས་<span class='add'>  པ་  </span>དང་མ་བྱུང་བ་གང་ཡིན་པ་དེ་ལ་འཇུག་པ་གང་ཡང་མེད་དོ། །དེ་ལྟར་ན་འཇུག་པ་མེད་པ་ནི་རྗེས་སུ་འཇུག་པའོ། །ཞི་བའི་བློ་གྲོས་བགྲང་བ་འདི་ལ་ཞུགས་པ་དེའི་སྤོབས་པ་རྒྱུན་གཅད་པར་\nམི་ནུས་སོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རྒྱུན་ཆད་པ་མེད་པས་དེས་ཆོས་ཉིད་རྗེས་སུ་རྟོགས་སོ། །དེས་ཆོས་ཉིད་མི་ཟད་པར་རྗེས་སུ་རྟོགས་སོ། །དེ་ཇི་ལྟ་ཇི་ལྟར་ཆོས་སྟོན་པ་དེ་ལྟ་དེ་ལྟར་ཆོས་དེ་དག་རྗོད་ཅིང་མངོན་དུ་འགྱུར་རོ། །\nདེ་ཆོས་ཀྱི་རྣམ་པའི་རྗེས་སུ་འཇུག་པ་འདི་ལྟར་བུ་འདིས་སེམས་ཅན་གྱི་རྣམ་པ་ལ་འཇུག་གོ །སེམས་ཅན་གྱི་རྣམ་པའི་རྗེས་སུ་འཇུག་པས་མོས་པས་ཇི་ལྟ་བ་བཞིན་དུ་ཆོས་སྟོན་ཏོ། །ཞི་བའི་བློ་གྲོས་གཟུངས་ཐོབ་པའི་\nབྱང་ཆུབ་སེམས་དཔའ་ནི་སེམས་ཀྱིས་དྲི་མ་མེད་པ་ཡིན་ནོ། །བསམ་པས་རྣམ་པར་དག་པ་ཡིན་ནོ། །སྦྱོར་བས་གཙང་མ་ཡིན་ནོ། །ལྷག་པའི་བསམ་པས་མངོན་དུ་འཕགས་པ་ཡིན་ནོ། །བསྒྲུབ་པ་ལ་\nལེགས་པར་གནས་པ་ཡིན་ནོ། །ཤེས་རབ་ཀྱིས་མངོན་དུ་འཕགས་པ་ཡིན་ནོ། །དམ་བཅས་པ་ཉམས་འོག་ཏུ་ཆུད་པས་བརྟན་པ་ཡིན་ནོ། །བདུད་རྣམས་ཀྱིས་མི་ཤིགས་པ་ཡིན་ནོ། །ཕ་རོལ་མུ་སྟེགས་"
 ],
 [
  "78.223a",
  "སུའི་ལྷག་པའི་བསམ་པ་རྣམ་པར་མི་འཁྲུགས་པ་ལགས། བཀའ་སྩལ་པ། རྒྱལ་པོ་ཆེན་པོ་སུ་སྙིང་རྗེ་ཆེན་པོ་སྐྱེད་པའོ། །གསོལ་པ། བཅོམ་ལྡན་འདས་སྙིང་རྗེ་ཆེན་པོ་སྐྱེད་པ་ཇི་ལྟ་བུ་ལགས། བཀའ་\nསྩལ་པ། རྒྱལ་པོ་ཆེན་པོ་ཇི་ལྟར་སེམས་ཅན་རྣམས་ལ་ཡོངས་སུ་མི་གཏོང་བ་སྐྱེད་པ་ལྟ་བུའོ། །གསོལ་པ། བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་སེམས་ཅན་རྣམས་ཡོངས་སུ་མི་གཏོང་བ་ལགས། བཀའ་སྩལ་པ། རྒྱལ་པོ་ཆེན་པོ་\nགང་གི་ཚེ་བདག་གི་བདེ་བ་ཡོངས་སུ་གཏོང་བའོ། །གསོལ་པ། བཅོམ་ལྡན་འདས་བདག་གི་བདེ་བ་གཏོང་བ་ཇི་ལྟ་བུ་ལགས། བཀའ་སྩལ་པ། རྒྱལ་པོ་ཆེན་པོ་སུ་དཀོན་མཆོག་གསུམ་ཡོངས་སུ་མི་གཏོང་བ་ཡིན་ནོ། །\nགསོལ་པ། བཅོམ་ལྡན་འདས་དཀོན་མཆོག་གསུམ་ཡོངས་སུ་མི་གཏོང་བ་སུ་ལགས། བཀའ་སྩལ་པ། རྒྱལ་པོ་ཆེན་པོ་སུ་ཉོན་མོངས་པ་ཐམས་ཅད་ཡོངས་སུ་གཏོང་བ་དེ་དཀོན་མཆོག་གསུམ་ཡོངས་སུ་མི་གཏོང་བ་\nཡིན་ནོ། །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་རྒྱལ་པོ་མ་སྐྱེས་དགྲས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །ཇི་ཙམ་དུ་དེ་བཞིན་གཤེགས་པས་ཆོས་འདུལ་བ་བསྟན་པ་ལེགས་པར་གསུངས་པ་དང་། ཇི་ཙམ་དུ་དེ་བཞིན་གཤེགས་པས་\nབསླབ་པ་ལེགས་པར་བཅས་པ་དང་། ཇི་ཙམ་དུ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་ཆོས་བསྟན་པ་རྗེས་སུ་འཐུན་པ་དང་། རྒྱུ་དང་འབྲས་བུ་ཆབ་མི་འཚལ་བ་དང་། རྟག་པ་དང་། ཆད་པ་མ་མཆིས་པ་དང་། ལས་དང་བྱ་\nབ་ལ་འཇུག་པ་བསྟན་པ་དང་། དགེ་བ་དང་མི་དགེ་བ་ཆབ་མི་འཚལ་བ་དང་། མི་སླུ་བའི་མཚན་ཉིད་ལེགས་པར་གསུངས་པ་ནི་བཅོམ་ལྡན་འདས་ངོ་མཚར་ལགས་སོ། །བདེ་བར་གཤེགས་པ་ངོ་མཚར་ལགས་སོ། །བཅོམ་\nལྡན་འདས་དགེ་བའི་རྩ་བ་མ་སྐྱེད་པ་དང་། སྡིག་པའི་གྲོགས་པོས་ཡོངས་སུ་ཟིན་པ་དག་མ་གཏོགས་<span class='add'>  པར་  </span>འདི་ལྟར་རྒྱ་ཆེ་ཞིང་འདི་ལྟར་གྱ་ནོམ་པའི་བསྟན་པ་འདི་ལ་བརྩོན་པ་རྣམས་སུ་ཞིག་ཟློག་པར་<span class='add'>  བགྱིད།   </span>གནོད་པར་བགྱིད།"
 ],
 [
  "78.221a",
  "དང་ལྡན་ན་སྟོབས་འདི་ལྟ་བུ་འཐོབ་། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རྒྱལ་པོ་ཆེན་པོ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཅུ་དང་ལྡན་ན་སྟོབས་འདི་ལྟ་བུ་འཐོབ་སྟེ། བཅུ་གང་ཞེ་ན། རྒྱལ་\nཔོ་ཆེན་པོ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་ལུས་དང་སྲོགས་ནི་ཡོངས་སུ་གཏོང་གི་དམ་པའི་ཆོས་ནི་ཡོངས་སུ་མི་གཏོང་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ལ་འདུད་ཅིང་ང་རྒྱལ་འཕེལ་བར་མི་བྱེད་པ་དང་། སེམས་ཅན་\nམཐུ་ཆུང་བ་རྣམས་ལ་བཟོད་ཅིང་ཁོང་ཁྲོ་བར་མི་བྱེད་པ་དང་། སེམས་ཅན་བཀྲེས་པ་རྣམས་ལ་ཁ་ཟས་བཟང་པོ་མཆོག་སྦྱིན་པ་དང་། སེམས་ཅན་འཇིག་པ་རྣམས་ལ་མི་འཇིགས་པ་སྦྱིན་པ་དང་། སེམས་ཅན་ནད་\nཔ་རྣམས་ལ་ཡང་དག་པའི་གསོ་བ་བྱ་བར་སྤྲོ་བ་དང་། སེམས་ཅན་དབུལ་པོ་རྣམས་ལ་ལོངས་སྤྱོད་དག་གིས་ཚིམ་པར་བྱེད་པ་དང་། དེ་བཞིན་གཤེགས་པའི་མཆོད་པའི་མཆོད་རྟེན་ལ་རྡོ་ཐལ་གྱིས་སྐུད་པ་དང་། སེམས་\nཅན་རྣམས་ལ་ཀུན་ཏུ་དགའ་བར་འགྱུར་བའི་ཚིག་སྒྲོགས་པ་དང་། སེམས་ཅན་དབུལ་པོ་སྡུག་བསྔལ་པ། <span class='add'>  ངལ་  </span>བ་ཆད་པ་རྣམས་ཀྱི་ཁུར་ཁྱེར་བ་སྟེ། རྒྱལ་པོ་ཆེན་པོ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཅུ་པོ་དེ་དག་\nདང་ལྡན་ན་སྟོབས་འདི་ལྟ་བུ་འཐོབ་བོ། །གསོལ་པ། བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཅང་ཤེས་པ་ལགས་ཤིང་ཅང་ཤེས་པའི་འགྲོ་བར་འགྲོ་བ་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་\nསྩལ་པ་། རྒྱལ་པོ་ཆེན་པོ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བརྒྱད་དང་ལྡན་ན་ཅང་ཤེས་པར་འགྱུར་ཞིང་ཅང་ཤེས་པའི་འགྲོ་བར་འགྲོ་སྟེ། བརྒྱ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། བཀའ་བློ་བདེ་བ་དང་། དྲང་བ་དང་། \nམཉེན་པ་དང་། དེས་པ་<span class='add'>  དང་།   </span>གཡོ་མེད་པ་དང་། སྒྱུ་མེད་པ་དང་། ཕྲག་དོག་མེད་པ་དང་། སེམས་ལས་སུ་རུང་བ་སྟེ། རྒྱལ་པོ་ཆེན་པོ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བརྒྱད་པོ་དེ་དག་དང་ལྡན་ན་ཅང་ཤེས་པར་འགྱུར་"
 ],
 [
  "78.227b",
  "དང་སྤྲེའུ་དང་མཚུངས་པ་ཡིན་ནོ། །སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཉེས་པར་བྱས་པ་བཟོད་<span class='add'>  པས་མ་  </span>དང་མཚུངས་པ་ཡིན་ནོ། །བཟོ་ཐམས་ཅད་སློབ་པས་ཕ་དང་མཚུངས་པ་ཡིན་ནོ། །ཆོས་རིན་པོ་ཆེ་ཐམས་ཅད་སྦྱིན་པས་རྣམ་ཐོས་ཀྱི་བུ་དང་\nམཚུངས་པ་ཡིན་ནོ། །བསོད་ནམས་དག་གིས་བརྒྱན་པ་ཡིན་ནོ། །མཚན་རྣམས་ཀྱིས་ཀླུབས་པ་ཡིན་ནོ། །དཔེ་བྱད་བཟང་པོ་རྣམས་ཀྱིས་སྤྲས་པ་ཡིན་ནོ། །འཇིག་རྟེན་གྱིས་བལྟ་བར་བྱ་བ་ཡིན་ནོ། །ལྷ་བའི་གཞི་ཡིན་ནོ། །\nའཕགས་པའི་ནོར་བུ་བདུན་དང་ལྡན་པས་མི་དབུལ་བ་ཡིན་ནོ། །སངས་རྒྱས་རྣམས་ཀྱིས་ཡོངས་སུ་བཟུང་བ་ཡིན་ནོ། །རིག་པ་རྣམས་ཀྱིས་བསྔགས་པ་ཡིན་ནོ། མཁས་པ་ཐམས་ཅད་ཀྱིས་སྐུར་པ་མི་གདབ་པ་ཡིན་ནོ། །ལྷ་རྣམས་\nཀྱིས་ལེགས་པར་བསྲུངས་པ་ཡིན་ནོ། །ཀླུ་དང་གནོད་སྦྱིན་རྣམས་ཀྱིས་ལེགས་པར་བཟུང་བ་ཡིན་ནོ། །ཆོས་བསྟན་པ་རྣམས་ལ་དབང་ཕྱུག་ཏུ་གྱུར་པ་ཡིན་ནོ། །མངོན་པར་ཤེས་པ་རྣམས་ལ་དབང་སྒྱུར་བ་ཡིན་ནོ། །སེམས་ཅན་\nགྱི་བསམ་རྣམས་ལ་རྗེས་སུ་སོང་བ་ཡིན་ནོ། །སེམས་ཅན་གྱི་དབང་པོ་རྣམས་ལ་རྗེས་སུ་ཞུགས་པ་ཡིན་ནོ། །ཆོས་བསྟན་པ་ལ་ཆོག་མི་ཤེས་པ་ཡིན་ནོ། །རྙེད་པ་དང་བཀུར་སྟི་དོན་དུ་མི་གཉེར་བ་ཡིན་ནོ། །ཆོས་བསྟན་པ་\nདག་ལ་སེར་སྣ་མེད་པ་ཡིན་ནོ། །ཚུལ་ཁྲིམས་རྣམ་པར་དག་པས་ཉོན་མོངས་པ་མེད་པ་ཡིན་ནོ། །བཟོད་པ་ཡོངས་སུ་དག་པས་གནོད་པ་མེད་པ་ཡིན་ནོ། །བརྩོན་འགྲུས་ཡོངས་སུ་དག་པས་ལས་ཀྱི་མཐའ་ལེགས་པར་མཐར་ཕྱིན་པ་ཡིན་\nནོ། །བསམ་གཏན་ཡོངས་སུ་དག་པས་ཅང་ཤེས་པ་ཡིན་ནོ། །ཤེས་རབ་ཡོངས་སུ་དག་པས་བློ་ལེགས་པར་དཀར་པ་ཡིན་ནོ། །ཚད་མེད་པ་རྣམས་ལ་ཚངས་པའི་བླ་མ་ཡིན་ནོ། །བསམ་གཏན་དང་། ཏིང་ངེ་འཛིན་དང་། སྙོམས་\nཔར་འཇུག་པ་རྣམས་ལ་འཇིག་རྟེན་ལས་འདས་པ་ཡིན་ནོ། །བྱང་ཆུབ་ཀྱི་ལམ་གྱིས་བླ་ན་མེད་པ་ཡིན་ནོ། །དབང་བསྐུར་བ་ཐོབ་པས་ཡོན་ཏན་གྱི་རྣམ་པ་ཐམས་ཅད་དང་ལྡན་པ་ཡིན་ནོ། །ཞི་བའི་བློ་གྲོས་དེ་ལྟར་བྱང་ཆུབ་"
 ],
 [
  "78.228b",
  "པའི་ཡེ་ཤེས་དེ་ལ་སུ་ཞིག་བརྩོན་པར་བགྱིད་པ་དེ་ནི་ཡེ་ཤེས་འཐོབ་པར་འགྱུར་ཏེ། སུ་བརྩོན་<span class='add'>  པར་  </span>མ་མི་བགྱིད་པ་དེས་ནི་ཡེ་ཤེས་འཐོབ་བར་མི་འགྱུར་ལགས་སོ། །བཅོམ་ལྡན་འདས་དེ་ལྟ་ལགས་པས་བྱང་ཆུབ་དོན་དུ་གཉེར་\nབ་རྣམས་ཀྱིས་རྟག་ཏུ་བརྩོན་པ་དང་། བརྩོན་འགྲུས་བརྩམ་པར་བགྱིའོ། །དེ་ལྟར་ན་དེ་དག་ལ་ཆོས་དེ་དག་མངོན་དུ་འགྱུར་ལགས་སོ། །བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ། དཔེར་བགྱི་ན་སྐྱེས་བུ་དམུས་ལོང་གིས་དེ་ལས་\nསྐྱེས་པའི་གཟུགས་རྣམས་མི་མཐོང་ལགས་སོ། །བཅོམ་ལྡན་འདས་དེ་བཞིན་དུ་ཉོན་མོངས་བས་ལྡོངས་པའི་སེམས་ཅན་རྣམས་ཀྱང་དེ་ལས་སྐྱེས་པའི་ཆོས་རྣམས་མི་མཐོང་ལགས་སོ། །བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ། \nདཔེར་བགྱི་ན་སྐྱེས་བུ་མིག་དང་ལྡན་ཡང་སྣང་བ་མ་མཆིས་ན་མི་མཐོང་ལགས་སོ། །བཅོམ་ལྡན་འདས་དེ་བཞིན་དུ་གང་དག་ལྷའི་མིག་དང་ལྡན་དུ་ལགས་ཀྱང་དེ་དག་དགེ་བའི་བཤེས་གཉེན་གྱི་མན་ངག་མ་མཆིས་ན་མོས་པར་\nམི་འགྱུར་། མཐོང་བ་མི་འགྱུར་ལགས་སོ། །བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ། དཔེར་བགྱི་ན་ལྷའི་མིག་ལ་ནི་སྣང་བས་བགྱི་བ་མ་མཆིས་པ་ལགས་སོ། །བཅོམ་ལྡན་འདས་དེ་བཞིན་དུ་ཡོངས་སུ་སྦྱང་བ་བགྱིས་པ་ལ་ཡང་\nརྗེས་སུ་བསྟན་མི་འཚལ་ལོ། །བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ། དཔེར་བགྱི་ན་མངལ་ན་མཆིས་པའི་སེམས་ཅན་ནི་མི་གདའ་མི་མཐོང་ཡང་སྐྱེས་ལགས་སོ། །བཅོམ་ལྡན་འདས་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་བརྩོན་\nའགྲུས་བརྩམས་པའི་བྱང་ཆུབ་ཀྱང་མི་མཐོང་མོད་ཀྱི། སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཀྱིས་ཀྱང་སྐྱེའོ། །བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ། དཔེར་བགྱི་ན་རིའི་རྒྱལ་པོ་གངས་ཅན་ལ་ཤིང་ལྗོན་པ་གང་སྐྱེས་པ་དེ་ནི་བར་མ་དོར་\nཆགས་པ་འམ། སྐམ་པར་མི་འགྱུར་ལགས་སོ། །བཅོམ་ལྡན་འདས་དེ་བཞིན་དུ་འཕགས་པའི་ཆོས་ལ་སྦྱོར་བར་བརྩོན་པ་གང་གི་ཤེས་པ་སྐྱེས་པ་དེ་ཡང་མི་འཇིག་ཅིང་ཡོངས་སུ་ཉམས་པར་མི་འགྱུར་ལགས་སོ།  །"
 ],
 [
  "78.230a",
  "རོ་འམ། རེག་བྱ་འམ། ཆོས་སུ་སྣང་བ་གང་ཅི་ཡང་རུང་སྟེ། དེ་ལ་གང་སྣང་བར་མི་འགྱུར་བ་དེ་མེད་དོ། །དེ་ལ་གཞན་ལས་ཐོས་པ་ལ་རག་ལས་པའི་སྤོབས་པ་མེད་དོ། །གཞན་གྱི་<span class='add'>  ངོར་  </span>ལྟ་བ་\nལ་རག་ལས་པའི་བསྟན་པ་མེད་དོ། །དེ་མི་ཟད་པ་དང་། མཐའ་ཡས་པ་དང་། ཐམས་ཅད་ཀྱི་རྗེས་སུ་འགྲོ་བ་དང་། ཐམས་ཅད་ལ་འཇུག་པའི་རྗེས་སུ་སོང་བ་ཡིན་ནོ། །དེ་ལ་རྒྱུན་ཆད་པ་མེད་\nདོ། །ཆགས་པ་མེད་དོ། །ལུས་ལྕི་བ་མེད་དོ། སེམས་ཞུམ་པ་མེད་དོ། །དེ་སངས་རྒྱས་བརྒྱ་སྟོང་གི་སྤྱན་སྔར་སྟོན་ཀྱང་ཞུམ་པར་མི་འགྱུར་ཏེ། འདི་ལྟར་སངས་རྒྱས་ཀྱི་བྱིན་གྱི་བརླབས་ཀྱིས་བྱིན་གྱིས་བརླབས་པའི་བྱང་ཆུབ་སེམས་\nདཔའ་དེས་གཟུངས་དང་། ཤེས་རབ་དང་། ཡེ་ཤེས་དང་། སྤོབས་པ་ཐོབ་བོ། །དེ་སྟོན་ཀྱང་ཞུམ་པར་མི་འགྱུར། ཀུན་དུ་ཞུམ་པར་མི་འགྱུར་ཞིང་ཟློག་པར་མི་འགྱུར་ཏེ། འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་\nདེ་ཆགས་པ་མེད་པ་གསུམ་གྱི་རྗེས་སུ་སོང་བ་ཡིན་ནོ། །གསུམ་གང་ཞེ་ན། བདག་ལ་ཆགས་པ་མེད་པ་དང་། སེམས་ཅན་ལ་ཆགས་པ་མེད་པ་དང་། ཆོས་ལ་ཆགས་པ་མེད་པའོ། །ཡོངས་སུ་དག་པ་གསུམ་\nགྱི་རྗེས་སུ་སོང་བ་ཡིན་ཏེ། གསུམ་གང་ཞེ་ན། ཆོས་ཀྱི་དབྱིངས་ཡོངས་སུ་དག་པ་དང་། དེ་བཞིན་ཉིད་ཡོངས་སུ་དག་པ་དང་། ཡང་དག་པའི་མཐའ་ཡོངས་སུ་དག་པའོ། །མི་ཟད་པ་གསུམ་གྱི་རྗེས་སུ་སོང་བ་\nཡིན་ཏེ། གསུམ་གང་ཞེ་ན། ཆོས་མི་ཟད་པ་དང་། ཡི་གེ་མི་ཟད་པ་དང་། བསྟན་པ་མི་ཟད་པའོ། །བྱིན་གྱིས་བརླབས་གསུམ་ཐོབ་པ་ཡིན་ཏེ། གསུམ་གང་ཞེ་ན། སྤོབས་པའི་བྱིན་གྱི་བརླབས་དང་། ཆོས་ཀྱི་\nདོན་གྱི་བྱིན་གྱི་བརླབས་དང་། ཆོས་ལ་འཇུག་པའི་བྱིན་གྱི་བརླབས་སོ། །དགའ་བ་གསུམ་ཐོབ་པ་ཡིན་ཏེ། གསུམ་གང་ཞེ་ན། ཡེ་ཤེས་ཀྱིས་དགའ་བ་དང་། ཤེས་རབ་ཀྱིས་དགའ་བ་དང་། ཐེ་ཙོམ་ཆད་པས་དགའ་"
 ],
 [
  "78.228a",
  "སེམས་དཔའ་གཟུངས་ཐོབ་པ་ནི་ཡོན་ཏན་གྱི་བསྔགས་པ་ཚད་མེད་པ་དེ་ལྟ་བུ་དང་ལྡན་པ་ཡིན་ཏེ། ཞི་བའི་བློ་གྲོས་གལ་ཏེ་དེ་བཞིན་གཤེགས་པས་ཕྲིན་ལས་གཞན་མི་མཛད་པར་ལོ་བརྒྱ་སྟོང་དུ་རྒྱུན་དུ་བྱང་ཆུབ་\nསེམས་དཔའ་གཟུངས་ཐོབ་པའི་བསྔགས་པ་བརྗོད་ཀྱང་ཟད་པར་མི་འགྱུར་རོ། །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཞི་བའི་བློ་གྲོས་ཀྱིས། ལྷའི་བུ་རྒྱལ་བུ་བཟང་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །གྲོགས་པོ་དག་དེ་བཞིན་གཤེགས་པས་ཁྱོད་ཀྱི་\nཡོན་ཏན་གྱི་བསྔགས་པ་མཐའ་ཡས་པ་བརྗོད་པ་མཛད་པ་ནི་ཁྱོད་ཀྱིས་རྙེད་པ་ལེགས་པར་རྙེད་དོ། །དེ་སྐད་ཅེས་སྨྲ་བ་དང་། ལྷའི་བྱ་རྒྱལ་པོ་བཟང་གིས་བྱང་ཆུབ་སེམས་དཔའ་ཞི་བའི་བློ་གྲོས་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་འདི་ལ་ཡང་\nདག་པར་དོན་དམ་བར་ན་གང་དེ་ལྟར་བསྔགས་པའི་ཆོས་གང་ཡང་མི་དམིགས་སོ། རིགས་ཀྱི་བུ་གང་ལ་ཁ་དོག་མེད་པ་དང། གཟུགས་མེད་པ་དང། དབྱིབས་མེད་པ་དེའི་ཡོན་ཏན་གྱི་བསྔགས་པ་དང་། གཟུགས་ཀྱི་མཐའ་རྟོགས་\nཔར་མི་ནུས་སོ། །གང་ལ་གཟུགས་དང་། ཁ་དོག་དང། དབྱིབས་འབའ་ཞིག་ཡོད་པ་དེའི་བསྔགས་པ་ནི་བརྗོད་པར་ནུས་སོ། །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ལྷའི་བུ་རྒྱལ་པོ་བཟང་གིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་\nའདས་ཆོས་ཐམས་ཅད་ནི་མ་བསྡུས་པ། ངའི་བ་མ་མཆིས་པ། ཡོངས་སུ་འཛིན་པ་མ་མཆིས་པ། གང་གིས་ཀྱང་ཉེ་བར་སྤྲད་པར་བགྱི་བ་མ་ལགས་པ། གང་གིས་ཀྱང་བསལ་བ་མ་ལགས་པ་སྟེ། འདི་ལ་\nབརྩོན་པ་དང་། ཡང་དག་པར་སྦྱོར་བར་བགྱིའོ། །བཅོམ་ལྡན་འདས་བརྩོན་པ་དང་། ཡང་དག་པར་སྦྱོར་བར་གྱུར་བ་རྣམས་ལ་ཆོས་དེ་དག་མངོན་དུ་འགྱུར་ལགས་སོ། །བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ། དཔེར་བགྱི་<span class='add'>  ན་ས་  </span>ཆེན་པོ་འདི་\nནི་ཆབ་ཀྱི་ཕུང་པོའི་སྟེང་ན་གནས་ཏེ། དེ་ལ་མི་གང་ཞིག་ཁྲོན་པ་འམ། ཁྲོན་པ་ཆེན་པོ་རྐོ་བ་དེ་ཆབ་དང་ལྡན་<span class='add'>  པར་  </span>འགྱུར་ཏེ། གང་མི་རྐོ་བ་དེས་ནི་མི་རྙེད་ལགས་སོ། །བཅོམ་ལྡན་འདས་དེ་བཞིན་དུ་ཐམས་ཅད་ཀྱི་རྗེས་སུ་ཞུགས་"
 ],
 [
  "78.229b",
  "བ་དང་། སྙིང་རྗེ་ཆེན་པོ་ཐོག་མར་གནས་ལགས་སོ། །བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ། དཔེར་བགྱི་ན་གང་གི་ཚེ་གདུགས་འཆར་<span class='add'>  བ་  </span>དེའི་ཚེ་རི་གང་དག་མཐོ་བ་དེ་དག་ལ་ཐོག་མར་འོད་ཟེར་འབབ་བོ། །བཅོམ་ལྡན་འདས་\nདེ་བཞིན་དུ་གང་གི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་ཡེ་ཤེས་ཀྱི་སྣང་བ་ཐོག་མར་བྱུང་བ་དེའི་ཚེ་སེམས་ཅན་གང་དག་དགེ་བའི་རྩ་བ་སྦྱངས་པ་དེ་དག་གིས་ཡེ་ཤེས་ཀྱི་སྣང་བ་དེ་མྱོང་བར་འགྱུར་ལགས་སོ། བཅོམ་ལྡན་འདས་\nའདི་ལྟ་སྟེ། དཔེར་བགྱི་ན་ས་བོན་ཐམས་ཅད་དང་། རྩྭ་དང་། ཤིང་གེལ་བ་དང་། སྨན་དང་། ནགས་ཚལ་ཐམས་ཅད་ནི་སས་བཟེད་དེ་ཐམས་ཅད་ལས་བཅུད་མཉམ་དུ་གཏོང་ངོ། །བཅོམ་ལྡན་འདས་དེ་བཞིན་དུ་\nགཟུངས་ཐོབ་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཡང་སེམས་ཅན་ཐམས་ཅད་ལ་ཆོས་ཀྱི་བསམ་པའི་གཏོང་བས་སེམས་ཆགས་པ་མ་མཆིས་པར་གཏོང་ངོ། །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ལྷའི་བུ་རྒྱལ་པོ་བཟང་\nལ་ལེགས་སོ་ཞེས་བྱ་བ་གནང་སྟེ། ལྷའི་བུ་ཁྱོད་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་དཔེ་དགོད་པ་བསྟན་པ་འདི་ལེགས་པར་སྨྲས་<span class='add'>  པ་ལེགས་སོ་  </span>ལེགས་སོ། །ལྷའི་བུ་རྩ་དང་། ནགས་ཚལ་ཇི་སྙེད་པ་\nདང་། མིང་གི་བརྡ་དང་། ཆོས་ཀྱི་བརྡ་དང་། སྒྲའི་བརྡ་དག་ཇི་སྙེད་པ་དང་། གཟུགས་དང་། ཁ་དོག་གི་བརྡ་དག་ཇི་སྙེད་པ་དང་། སེམས་ཅན་གྱི་སེམས་ཀྱི་སྤྱོད་པ་ལ་འཇུག་པ་ཇི་སྙེད་པ་དང་། མིང་དང་གཟུགས་\nརབ་ཏུ་བརྗོད་པ་ཇི་སྙེད་པ་དང་། སེམས་ཅན་རྣམས་ཀྱི་སྤྱོད་པ་ཇི་སྙེད་པ་དང་། སེམས་ཅན་རྣམས་ཀྱི་ཡོངས་སུ་སྤྱོད་པ་ཟས་<span class='add'>  སྐོམ་  </span>ཇི་སྙེད་པར་ལྷའི་བུ་བྱང་ཆུབ་སེམས་དཔའི་གཟུངས་ཐོབ་པའི་དཔེ་དགོད་པ་\nབསྟན་པ་ཡང་དེ་སྙེད་དོ། ལྷའི་བུ་དག་གཟུངས་ཐོབ་པའི་བྱང་ཆུབ་སེམས་དཔའི་ཚིག་གང་ཅི་ཡང་རུང་སྟེ། སངས་རྒྱས་ཀྱི་བཀའ་མ་ཡིན་པ་མེད་དོ། །གཟུངས་སུ་སྣང་བ་འམ། སྒྲ་འམ། དྲི་འམ།"
 ],
 [
  "78.230b",
  "བའོ། མྱུར་བ་གསུམ་ཐོབ་པ་ཡིན་ཏེ། གསུམ་གང་ཞེ་ན། གསུམ་གང་ཞེ་ན། དྲན་པ་མྱུར་བ་དང་། བློ་གྲོས་མྱུར་བ་དང་། རྟོགས་པ་མྱུར་བའོ། །གཟུངས་ཀྱི་ཡོན་ཏན་བསྔགས་པའི་དཔེ་<span class='add'>  དགོད་  </span>པ་མི་ཟད་པ་བསྟན་པ་འདི་བཤད་པ་ན་\nབྱང་ཆུབ་སེམས་དཔའ་བརྒྱད་བ་རྒྱས་གཟུངས་ཐོབ་པར་གྱུར་ཏོ། གཟུངས་ཀྱི་ཡོན་ཏན་གྱི་བསྔགས་པའི་དཔེ་དགོད་པ་མི་ཟད་པའི་ལེའུ་ཞེས་བྱ་བ་སྟེ། ཉི་ཤུ་རྩ་བཞི་པའོ།།                           །།དེ་\nནས་བཅོམ་ལྡན་འདས་ལ་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་སླད་མའི་ཚེ་སླད་<span class='add'>  མའི་  </span>དུས་ལྔ་བརྒྱ་ཐ་མ་ལ་ཅི་ནས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་འཛམ་བུའི་གླིང་དུ་སྤྱོད་\nཔར་བྱིན་གྱིས་བརླབས་ཏུ་གསོལ། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། གསང་བ་པའི་བདག་པོ་དམ་པའི་ཆོས་ཡོངས་སུ་བཟུང་བའི་ཕྱིར་ངས་དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་ཟླ་བ་ལས་ཆོས་སྤ་བ་དང་། བསྲུང་\nཔའི་གསང་སྔགས་ཀྱི་གཞི་གང་དག་ཐོས་པ་དེ་དག་ཁྱོད་ཀྱིས་དྲན་ནམ། གསོལ་པ། བཅོམ་ལྡན་འདས་དྲན་ལགས་སོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། གསང་བ་པའི་བདག་པོ་དེ་ལྟ་བས་ན་ཆོས་\nཀྱི་རྣམ་གྲངས་འདི་ཡུན་རིང་དུ་གནས་པར་བྱ་བའི་ཕྱིར་ཆོས་<span class='add'>  སྤ་  </span>བ་དང་། བསྲུང་བའི་གསང་སྔགས་ཀྱི་གཞི་དེ་དག་ཁྱོད་ཀྱིས་འཁོར་འདི་ལ་རྗོད་ཅིག དེ་ལྟར་ན་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཡུན་རིང་དུ་གནས་\nཔར་འགྱུར་རོ། །དེ་ནས་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེས་ཕྱོགས་བཅུའི་སངས་རྒྱས་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ཏེ། གསང་སྔགས་ཀྱི་གཞི་འདི་དག་སྨྲས་སོ། །ཏདྱ་ཐཱ། ཛ་ཡ་ཛ་ཡ་མ་ཏི། ཛ་ཡ་ཤ་\nཏྲུ། ཨ་ལེ། ཨ་མ་ལེ། ཨ་མུ་ལི་ཏེ། མ་མེ།མ་མ་མ་ཏི། ནཱ་མ་སན་དྷི། ཨུད་ཏ་མེ། ཨུད་ཏ་མ་ཏི། ཨུད་ཏ་ར་ཎི། ཨ་རེ་ཨ་ར་མ་ཎི། ཨ་རི་ཤ་མ་ཎི། ཨ་མཱུ་ལེ། ཨ་མཱུ་ལ། ཨ་བད་ཊི་ཏི། མཱུ་ལ་ཨ་ནུ་ག་ཏེ། <span class='add'>  ཨད་  </span>"
 ],
 [
  "78.231a",
  "ཏེ་། མད་ཏེ། མ་ཊི་ཏེ། ཨ་ཊི། མ་ཊི་ཏེ། ཁུ་རུ་ཁུ་རུ། སན་དྷི་དྷརྨ་ཨ་ནུ་ག་ཏེ། དྷརྨ་ད་ཀྵེ། དྷརྨ་པྲ་བེ་ཤེ། ས་རེ་ས་རེ་ས་རེ། ཨ་བེ་དྷེ་བེ་ད་སན་དྷི། <span class='add'>    </span><span class='add'>    </span><span class='add'>    </span><span class='add'>    </span><span class='add'>    </span>ཨེ་<span class='add'>  ཏ་ད་  </span>ཨ་ནུ་ག་མེ། བདུད་རྣམས་\nཚར་གཅོད་པ། མུ་སྟེགས་ཅན་རྣམས་<span class='add'>  འཇོམས་  </span>པ། ཆོས་ལ་གནོད་པར་སེམས་པ་རྣམས་རྨུགས་པར་བྱེད་པ། ཉོན་མོངས་པ་རྣམས་སེལ་པ། ཆོས་ཀྱི་ཚུལ་རྣམས་འབར་བར་བྱེད་པ། ཆོས་སྨྲས་པ་རྣམས་ཀུན་\nདུ་སྲུང་། མྱ་ངན་ལས་འདས་པར་འཛུད་པ། བྱང་ཆུབ་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་རྣམས་ཡོངས་སུ་འཛིན་པ། འཁོར་ཡང་དག་པར་འཇོག་པ། ཆོས་ཉན་པ་རྣམས་ལ་ལུས་སྦྱིན་པར་བྱེད་པ། ཡང་དག་པར་\nསོང་བ་རྣམས་ཀྱིས་བསམ་པ། ཡང་དག་པར་ཞུགས་པ་རྣམས་ཀྱིས་བལྟ་བ། གསང་སྔགས་ཀྱི་གཞི་རྣམས་མངོན་དུ་འགྱུར་བ་གསང་སྔགས་ཀྱི་མཚམས་འགུག་པ། བརྗོད་པ་ཤེས་པ། <span class='add'>  ཕྱད་  </span>པ། མི་ཐུལ་བ་\nབསྟན་པའི་ངོ་བོ་ཉིད་ཆུད་ཟ་བར་མ་གྱུར་ཅིག །གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེས་གསང་སྔགས་ཀྱིས་གཞི་འདི་དག་ཡོངས་སུ་བརྗོད་མ་ཐག་ཏུ་དེ་ནས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་ཁམས་འདི་\nརབ་ཏུ་གཡོས་སོ། །སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ན་བདུད་གང་དག་འཁོད་པ་དེ་དག་ཐམས་ཅད་དཔུང་དང་བཅས། གཡོག་འཁོར་དང་བཅས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱི་གན་དུ་\nལྷགས་ནས་ལུས་བཏུང་ཐལ་མོ་སྦྱར་ཏེ། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བདག་ཅག་གིས་ཆོས་སྨྲ་བ་སུའི་ཁའི་སྒོ་ནས་གསང་སྔགས་ཀྱི་གཞི་འདི་དགའ་བྱུང་བ་དེ་\nལ་རིམ་འགྲོ་བགྱིའོ། །བསྙེན་བཀུར་བགྱིའོ། །བཅོམ་ལྡན་འདས་གསང་སྔགས་ཀྱི་གཞི་འདི་དག་གི་དཔལ་ནི་ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་གྱིས་བཟོད་པར་<span class='add'>  རྔོ་  </span>ཐོག་པ་མ་ལགས་སོ། །བཅོམ་ལྡན་འདས་"
 ],
 [
  "78.231b",
  "བདག་ཅག་ཉིད་ཀྱིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་སྤ་བར་བགྱིའོ། །གླགས་ལྟ་བ་གཞན་དག་ཀྱང་ཚར་གཅད་པར་བགྱིའོ། །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་གླང་པོ་ཆེའི་ལྟ་སྟངས་ཀྱིས་ཕྱོགས་བཞི་ཀུན་དུ་གཟིགས་\nཏེ། དེའི་ཚེ་གསང་སྔགས་ཀྱི་གཞི་འདི་དག་བཀའ་སྩལ་ཏོ། ཛ་ཡེ། དུར་ཛ་ཡེ། ཛ་མ་མ་ཏི། ཤ་མེ། ཤ་ཏྲུ་ནིར་གྷ་ཏ་ནི། ཨ་མཱུ་ལེ། ཨ་མཱུ་ལེ། མཱུ་པཱ་ལ་རི་ཚིན་ནེ། མཱ་ར་སཻ་ནྱ་བི་ཏྲ་ས་ནི། མུག་ཏེ་མུག་ཏ་བ་ཏི། ཤུད་དྷེ། \nཨ་བེ་ཏེ། བྷ་ཡ་མོ་ཙ་ནི། བྷ་རོ་ཧ་<span class='add'>  ར་ཎེ།   </span>ཏད་ཏྲེ་བྱ་དྱེ། བི་དྱ་བ་ར་ཨུད་ཏ་མེ། ཕ་རོལ་རྒོལ་བ་ཚར་གཅོད་པ། ཆོས་སྨྲས་པ་དག་ཀུན་སྡུད་པ། ཆོས་ཀྱི་མཛོད་ནི་ཀུན་སྲུང་བ། རིག་སྔགས་འདི་ནི་སངས་རྒྱས་གསུངས། \nཨ་མེ་། ཨ་མ་མེ། མ་མ་ཙྪེ་དེ། ཨརྠེ་<span class='add'>  ཨརྠ་ནི་  </span>རྠ་ར་ཎེ། འཇིག་རྟེན་སྐྱོང་བ་བཞི་དགུག་པའི་ཚིག་རྣམས་སྨྲས་པའོ། །དྷི་རེ། དྷི་ར་བ་ཏི། གུ་བ་ཏེ། ཤུ་བྷེ་ཤུ་བྷ་བ་ཏི། ས་མེ། ལྷའི་དབང་པོ་བརྒྱ་བྱིན་འདིར་དགུག་པར་\nབྱས་པའོ། །མཻ་ཏྲེ་སོ་མ་བ་ཏི། ཀྵན་ཏི་ཀྲྀ་པ་ཀཱ་རུ་ཎ་ཨུད་སྲ་དེ། པྲི་ཏི་ཨུ་པེ་ཀྵས་མ་པན་ཏེ། ཚངས་པ་ཡང་འདིར་དགུག་པར་བྱའོ། །་ཨ་རིཊེ་། ཨི་ར་ཊེ། ཁ་ཁེ་། ཨ་མཱུ་ལེ། མཱུ་ལ་ཤོ་དྷ་ནི། བདུད་ནི་ཚར་གཅོད་\nབྱ་བའི་ཕྱིར། གསང་སྔགས་གཞི་ནི་འདི་དག་སྨྲས། མདོ་སྡེ་ལེགས་པར་བཤད་པ་འདི། མི་ཡི་དབང་པོས་བྱིན་གྱིས་བརླབས། གང་ཚེ་ཤེས་པར་འགྱུར་པ་ན། དེ་ཡི་ཚེ་ན་སྤྱོད་པར་འགྱུར། གསང་སྔགས་\nའདི་དག་རབ་བརྗོད་པས། ས་ནི་རབ་ཏུ་གཡོས་པར་གྱུར། བདུད་རྣམས་ཐམས་ཅད་ལྷགས་གྱུར་ཏེ། འདི་སྐད་ཀྱི་ནི་ཚིག་སྨྲས་སོ། །ཕྱི་མའི་དུས་ན་མདོ་སྡེ་འདི། གང་<span class='add'>  དག་ལ  </span>ག་ཏུ་མཆི་འགྱུར་པ། ཆོས་སྨྲ་\nམཁས་པ་དེ་དག་ནི། བདག་ཅག་རྣམས་ཀྱིས་བསྲུང་བར་བགྱི། དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེ་ལ་བཀའ་སྩལ་པ། གསང་བ་པའི་བདག་པོ་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་དེ་"
 ],
 [
  "78.232b",
  "གཤེགས་པ་དེའི་ཚེའི་ཚད་ནི་བསྐལ་པ་ཁྲི་ཐུབ་བོ། །རིགས་ཀྱི་བུ་དེ་བཞིན་གཤེགས་པ་དེའི་སངས་རྒྱས་ཀྱི་ཞིང་ན་བདུད་གང་དག་འཁོར་བ་དེ་དག་ཁྲོས་ཤིང་སྡང་བར་གྱུར་པ་དང་། དེ་བཞིན་གཤེགས་པ་དེས་\nགསང་སྔགས་ཀྱི་ཚིག་འདི་དག་གིས་དེ་དག་བཏུལ། ལེགས་པར་ཡོངས་སུ་བཏུལ་ཏེ། དེ་དག་ཐམས་ཅད་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྨིན་པར་བྱས་སོ། །རིགས་ཀྱི་བུ་ང་དང་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་\nརྗེ་གཉིས་ཀྱིས་དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་ཟླ་བ་དེའི་གསུང་རབ་ལ་ཚངས་པར་སྤྱོད་པ་སྤྱད་ནས་བྱང་ཆུབ་ཏུ་ངེས་པར་བྱུང་སྟེ། ང་ནི་ཤེས་རབ་འཕགས་ཤེས་བྱ་བར་གྱུར་ཏོ། །གསང་བ་པའི་བདག་པོ་ནི་བདེན་\n<span class='add'>  པས་  </span>བྱིན་ཞེས་བྱ་བར་གྱུར་ཏོ། །ཞི་བའི་བློ་གྲོས་དེ་ལྟར་ངེད་གཉིས་ལྷན་ཅིག་ཏུ་འཐུན་བག་ཡོད་པར་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཚད་མེད་པ་དག་ལ་སྟི་<span class='add'>  སྟང་དུ་བྱས་སོ། །  </span>བྱེད་པར་འགྱུར་རོ། བླ་མར་བྱས་སོ། །རིམ་གྲོ་བྱས་སོ། །\nམཆོད་པ་བྱས་སོ། །ཞི་བའི་བློ་གྲོས་དེ་ལྟར་ན་གསང་སྔགས་ཀྱི་ཚིག་འདི་དག་ནི་བདུད་ཆར་གཅད་པ་དང་། དམ་པའི་ཆོས་ཡོངས་སུ་གཟུང་བའི་ཕྱིར་གཅེས་སྤྲས་བྱེད་པར་འགྱུར་རོ། །དེ་ནས་བཅོམ་ལྡན་འདས་\nཀྱིས་ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་ལ་གཟིགས་ནས་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །གྲོགས་པོ་དག་དེ་བཞིན་གཤེགས་པ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའི་འོག་ཏུ་བསྐལ་པ་གྲངས་མེད་པར་བསྒྲུབས་པའི་\nབྱང་ཆུབ་འདི་ནུབ་པར་མི་འགྱུར་བར་བྱ་བའི་ཕྱིར་གཟུང་བ་དང་། ཡོངས་སུ་བསྲུང་བར་ཁྱེད་ཀྱི་ནང་ནས་སུ་སྤྲོ། དེ་ནས་འཁོར་དེའི་ནང་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཁྲི་ཉིས་སྟོང་དམ་པའི་ཆོས་ཡོངས་སུ་གཟུང་\nབའི་ཕྱིར་ལགས་ཏེ་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་གཙུགས་ནས། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་སྨྲས་སོ། །ལུས་དང་སྲོག་ཀྱང་སྤང་བགྱིས་ལ་།  །"
 ],
 [
  "78.234b",
  "གམ། མཚན་གཅིག་དམ་པའི་ཆོས་འཛིན་པ་དེ་ན་<span class='add'>  ཆེས་  </span>མང་གི །སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པ་རྣམས་སུ་བསྐལ་པ་བརྒྱ་སྟོང་གིས་ནི་དེ་ལྟ་མ་ཡིན་ནོ། །ཚངས་པ་དེ་ལྟ་བས་ན་ཁྱོད་ཀྱིས་དུས་ངན་པ་འདིར་\nདམ་པའི་ཆོས་ཡོངས་སུ་གཟུང་བའི་ཕྱིར་བརྩོན་འགྲུས་སུ་བྱའོ། །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཆེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་དེ་བཞིན་གཤེགས་པའི་གསང་བ་ལག་ན་རྡོ་\nརྗེའི་ལེའུ་ཀླུའི་གཟུངས་ཆེན་པོ་བསྟན་པ་འདི་ཡོང་ཤིག །ཟུང་ཤིག །ལྷོགས་ཤིག །གཞན་དག་ལ་ཡང་རྒྱ་ཆེར་ཡང་དག་པར་སྟན་ཅིག །ཀུན་དགའ་བོ་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཁྱོད་ལ་ཡོངས་སུ་གཏང་ངོ་། །\nདེ་བཞིན་གཤེགས་པའི་གསང་བ་བསམ་གྱིས་མི་ཁྱབ་པ་འདི་སྐྱེས་བོ་ཕལ་པ་ལ་མ་བཤད་ཅིག །ཀུན་དགའ་བོ་སེམས་ཅན་དམན་པ་ལ་མོས་པ་རྣམས་ནི་འདི་ལ་མགོ་རྨོངས་པར་འགྱུར་ཏེ། ཀུན་དགའ་བོ་ཆོས་\nཀྱི་རྣམ་གྲངས་འདི་ནི་དེ་ཙམ་དུ་མོས་པར་དཀའ་བ། དེ་ཙམ་དུ་རྟོགས་པར་དཀའ་བའོ། །སེམས་ཅན་གང་དག་ཅང་ཤེས་པ། སྦྱང་བ་ལེགས་པར་བྱས་པ་ཆོས་འདི་དག་གི་སྣོད་དུ་གྱུར་པ་མ་གཏོགས་ཏེ། དེ་\nདག་ནི་ཆོས་ཀྱི་ཚུལ་གྱི་རྒྱུད་འདི་ཐོས་ན་སྐྲག་པར་མི་འགྱུར་རོ། །དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་། ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་སངས་\nརྒྱས་ཀྱི་མཐུས་བདག་གིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བླངས་ལགས་ཏེ། མཐུ་ཙམ་མཆིས་པས་<span class='add'>  རྔོ་  </span>ཅི་<span class='add'>  ཐོག་  </span>རྐུ་གཟུང་བར་བགྱིའོ། །བཤད་པར་བགྱིའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀུན་དགའ་\nབོ་ཁྱོད་ཀྱིས་སེམས་ཅན་ཆེན་པོ་དམ་པའི་ཆོས་ཡོངས་སུ་གཟུང་བའི་ཕྱིར་ལངས་པ་འདི་དག་མཐོང་ངམ། གསོལ་པ། བཅོམ་ལྡན་འདས་མཐོང་ལགས་སོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།"
 ],
 [
  "78.233a",
  "རྣམ་པར་སྨིན་ལ་མི་རེ་བར་། འཇིག་རྟེན་མགོན་པོས་གསུངས་པ་ཡིན། མདོ་སྡེ་འདི་ནི་གཟུང་བར་བགྱི། རྒྱལ་པོ་བཟང་ལ་སོགས་པ་ལྷའི་བུ་ལྔ་སྟོང་གིས་ཐལ་མོ་སྦྱར་ཏེ། བཅོམ་ལྡན་\nའདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བདག་ཅག་གིས་དེ་བཞིན་གཤེགས་པའི་བྱང་ཆུབ་འདི་གཟུང་བར་བགྱིའོ། །དེའི་ཚིགས་སུ་བཅད་པ་འདི་ཡང་སྨྲས་སོ། །སེམས་ཅན་ཀུན་གྱི་དོན་\nསླད་དུ། སྙིང་རྗེ་བརྟན་པར་བསྐྱེད་ནས་ནི། སངས་རྒྱས་ཀྱིས་གསུངས་ཟབ་པ་ཡི། མདོ་སྡེ་འདི་ནི་གཟུང་བར་བགྱི། དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་དང་། ཚངས་པ་གཙུག་པུད་ཅན་དང་། རྒྱལ་པོ་ཆེན་\nཔོ་རྣམ་ཐོས་ཀྱི་བུས་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་སྨྲས་སོ། །ནད་ཀུན་ལས་ནི་ཐར་བགྱིད་པ། མདོ་འདི་སྨན་དང་འདྲ་བ་ལགས། སྟོན་པ་ལགས་པར་སེམས་བསྐྱེད་དེ། བདག་ཅག་གིས་ཀྱང་གཟུང་བར་\nབགྱི། །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བདག་གིས་ཀྱང་དེ་བཞིན་གཤེགས་པའི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་\nབྱང་ཆུབ་བསྐལ་པ་གྲངས་མ་མཆིས་པར་<span class='add'>  བསྒྲུབས་  </span>པ་འདི་གཟུང་བར་བགྱིའོ། །དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་ཡང་སྨྲས་སོ། ཆོས་འདི་ཡི་གེ་མ་མཆིས་ན། མི་ཡི་དབང་པོས་ཐུགས་<span class='add'>  རྗེ་  </span>ཡིས། ཡི་གེ་\nརྣམས་ཀྱིས་རབ་བཤད་པ། དེ་ནི་བདག་གིས་གཟུང་བར་བགྱི། དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚངས་པ་གཙུག་པུད་ཅན་ལ་བཀའ་སྩལ་པ། ཚངས་པ་གསུམ་པོ་འདི་དག་ནི་དེ་བཞིན་གཤེགས་པ་ལ་\nམཆོད་པ་དང་། རིམ་གྲོ་བྱེད་པ་བླ་ན་མེད་པའོ། །མཆོད་པའི་ལས་བླ་ན་མེད་པའོ། །བསོད་ནམས་ཚད་མེད་པ་འབྱུང་བའོ། །གསུམ་གང་ཞེ་ན། གང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་"
 ],
 [
  "78.232a",
  "བཞིན་གཤེགས་པ་ཉིད་ཀྱིས་བྱིན་གྱིས་བརླབས་པར་ཤེས་པར་གྱིས་ཤིག །བྱིན་གྱིས་བརླབས་འདི་ནི་སུས་ཀྱང་རྣམ་པར་དཀྲུག་པར་མི་ནུས་སོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། གསང་བ་པའི་བདག་པོ་ངས་མངོན་\nཔར་ཤེས་ཏེ། འདས་པའི་དུས་ན་བསྐལ་པ་མ་སྨད་པ་ཞེས་བྱ་བ་ལ། འཇིག་རྟེན་གྱི་ཁམས་མ་སྨད་པ་ཞེས་བྱ་བར་དེ་བཞིན་གཤེགས་པ་རིག་པ་དང་ཞབས་སུ་ལྡན་པ་། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་\nམཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ་བླ་ན་མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རིན་ཆེན་ཟླ་བ་ཞེ་ས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་ངོ་། །དེ་བཞིན་གཤེགས་པ་དེའི་གསུང་རབ་ལ་\nདགེ་སློང་ཆོས་སྨྲས་པ། རྫུ་འཕྲུལ་ཆེ་བ། དབང་ཆེ་བར་གྲགས་པ། མཐུ་ཆེ་བ། ཤེས་རབ་འཕགས་ཞེས་བྱ་བ་དང་། བདེན་པས་བྱིན་ཞེས་བྱ་བ་གཉིས་བྱུང་སྟེ། ཆོས་སྨྲས་བ་དེ་གཉིས་ཀྱིས་དེ་བཞིན་གཤེགས་\nབ་དེ་ལས་གསང་སྔགས་ཀྱི་ཚིག་འདི་དག་བཟུང་ནས། བཅོམ་ལྡན་འདས་དེས་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བ་བསྐལ་པ་ཕྱེད་<span class='add'>  ཚང་  </span>པར་རྗེས་སུ་བསྐོར་ནས། སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་\nན་བདུད་བྱེ་བ་ཕྲག་བརྒྱ་འཁོད་པ་གང་ཡིན་པ་དེ་དག་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱས་ཏེ། བྱང་ཆུབ་ཡང་དག་འཛིན་དུ་བཅུག་གོ །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་བྱང་ཆུབ་སེམས་དཔའ་ཞི་བའི་བློ་\nགྲོས་ཀྱིས་འདི་སྐད་ཅ་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་ཟླ་བ་དེ་བཞུགས་སམ། འོན་ཏེ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀལ་སྩལ་པ། ཞི་\nབའི་བློ་གྲོས་དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་ཟླ་བ་དེ་ནི་ཤར་ཕྱོགས་ལོགས་ཀྱིས་སངས་རྒྱས་ཀྱི་ཞིང་བྱེ་བ་བརྒྱ་སྟོང་ཕྲག་བཅུ་འདས་པ་ན། འཇིག་རྟེན་གྱི་ཁམས་མ་སྨད་པ་ཞེས་བྱ་བ་ཞུགས་སོ། །དེ་བཞིན་"
 ]
]