[
 [
  "78.235b",
  "ཞིང་ཚད་མེད་པ་དག་ནི་རབ་ཏུ་གཡོས་སོ། །ལྟ་བརྒྱ་སྟོང་དག་གིས་ནི་རོལ་མོ་སིལ་སྙན་བླངས་ཤིང་མེ་ཏོག་གི་ཆར་ཡང་རབ་ཏུ་ཕབ་སྟེ། འདི་སྐད་དུ་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་འཛམ་བུ་གླིང་དུ་ཤིན་དུ་ཡུན་རིང་དུ་གནས་<br>པར་གྱུར་ཅིག་ཅེས་ཀྱང་སྨྲས་སོ། །བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས། གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེ་དང་།   བྱང་ཆུབ་སེམས་དཔའ་ཞི་བའི་བློ་གྲོས་དང་། ལྷའི་བུ་རྒྱལ་པོ་བཟང་དང་། རྒྱལ་པོ་<br>མ་སྐྱེས་དགྲ་དང་། བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་དང་། དགེ་སློང་དེ་དག་དང་། ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་དང་། ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དང་། དྲི་ཟར་བཅས་པའི་འཇིག་རྟེན་ཡི་རངས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱིས་<br>གསུངས་པ་ལ་མངོན་པར་བསྟོད་དོ། །དམ་པའི་ཆོས་ཡོངས་སུ་གཏད་པའི་ལེའུ་ཞེས་བྱ་བ་སྡེ་ཉི་ཤུ་རྩ་ལྟ་བུའོ།།                       ་      །།འཕགས་པ་དཀོན་མཆོག་བརྩེགས་པ་ཆེན་<span class='delete'>པོའི་</span><span class='add'>  པོའི་  </span>ཆོས་ཀྱི་རྣམ་གྲངས་ལེའུ་<br>སྟོང་ཕྲག་བརྒྱ་པ་ལས། དེ་བཞིན་གཤེགས་པའི་གསང་བ་བསམ་གྱིས་མི་ཁྱབ་པ་བསྟན་པའི་ལེའུ་ཞེས་བྱ་བ་སྟེ་ལེའུ་གསུམ་པ་རྫོགས་སོ།།    །།རྒྱ་གར་གྱི་མཁན་<span class='delete'>པ་</span><span class='add'>  པོ་  </span>ཛི་ན་མི་ཏྲ་དང་དཱ་ན་ཤཱི་ལ་དང་། མུ་ནེ་བར་མ་<span class='delete'>དང་། </span><span class='add'>  དང་   </span><br>ཞུ་ཆེན་གྱི་ལོ་ཙྪ་བ་བན་དེ་ཡེ་ཤེས་སྡེས་བསྒྱུར་ཅིང་ཞུས་ཏེ། སྐད་གསར་ཆད་<span class='delete'>ཀྱིས་</span><span class='add'>  ཀྱིས་ཀྱང་  </span>བཅོས་ནས་གཏན་ལ་ཕབ་པ།།                          །།འཕགས་པ་དཀོན་མཆོག་བརྩེགས་པ་ཆེན་པོའི་ཆོས་ཀྱི་རྣམ་གྲངས་ལེའུ་<br>སྟོང་ཕྲག་བརྒྱ་པ་ལས་ལེའུ་བཞི་པ་སྟེ། རྨི་ལམ་བསྟན་པ། བམ་དང་པོ།། །། །།རྒྱ་གར་སྐད་དུ་<span class='delete'>ཨཱརྻ་</span><span class='add'>  ཨཱརྱ་  </span><span class='delete'>སྦ་</span><span class='add'>  སྭ  </span>བྣ་ནིར་དེ་ཤ་ནཱ་མ་མ་ཧཱ་ཡཱ་ན་སཱུ་ཏྲ།  བོད་སྐད་དུ། འཕགས་པ་རྨི་ལམ་བསྟན་པ་ཞེས་<br>བྱ་བ་ཐེག་པ་ཆེན་པོའི་<span class='delete'>མདོ། </span><span class='add'>  མདོ།   </span>སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ། །འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན། བཅོམ་ལྡན་འདས་རྒྱལ་པོའི་ཁབ་ན་བྱ་རྒོད་ཀྱི་ཕུང་པོའི་རི་ལ"
 ],
 [
  "78.236a",
  "<span class='delete'>དགེ་</span><span class='add'>  དགེ་  </span>སློང་དྲུག་ཁྲིའི་དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་ཕལ་ཆེར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་ཡང་དག་པར་ཞུགས་པ་དག་དང་ཐབས་གཅིག་ཏུ་བཞུགས་ཏེ། ཉན་ཐོས་ཆེན་པོ་<br>མངོན་<span class='delete'>པར་</span><span class='add'>  པར་  </span>ཤེས་པ་མངོན་པར་ཤེས་པ་ཤ་སྟག་དང་ཡང་ཐབས་གཅིག་<span class='delete'>གོ །</span><span class='add'>  གོ། །  </span>དེ་ནས་བཅོམ་ལྡན་འདས་ཞལ་ཟས་ཀྱི་བྱ་བ་མཛད་ནས་འདི་ལྟ་བུའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་ཏེ། ཏིང་ངེ་འཛིན་དེའི་མཐུས་སྟོང་<br>གསུམ་གྱི་སྟོང་ཆེན་<span class='delete'>པའི་</span><span class='add'>  པོའི་  </span>འཇིག་རྟེན་གྱི་ཁམས་འདི་ན་བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། འཇིག་རྟེན་སྐྱོང་བ་འཁོར་དང་བཅས་པ་གང་དག་ཡོད་པ་དེ་དག་ཐམས་ཅད་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་སྟེ་ལྷགས་པ་དང་། <br>བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ནས་ཐལ་མོ་སྦྱར་ཏེ་ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ། །ཏིང་ངེ་འཛིན་དེའི་མཐུས་ཕྱོགས་བཅུ་ནས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདིར་ལྷགས་པའི་<br>དགེ་སློང་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་ཀྱང་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་སྟེ་ལྷགས་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་བྱས་ཏེ་ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ། །ཏིང་ངེ་འཛིན་དེའི་མཐུས་འཁོར་<br>བརྒྱད་ཀྱི་གང་ཟག་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་བ་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་ཀྱང་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་སྟེ་ལྷགས་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་བྱས་ཏེ་ཕྱོགས་གཅིག་ཏུ་<br><span class='delete'>འཁོར་</span><span class='add'>  འཁོད་  </span><span class='delete'>རོ། །</span><span class='add'>  དོ། །  </span>དེ་ནས་གནས་གཙང་མའི་རིས་ཀྱི་ལྷའི་བུ་དགའ་བ་དང་། རབ་དགའ་བ་དང་། རྟོགས་དགའ་དང་། བཟང་དགའ་དང་། དཔལ་བཟངས་དང་། ཡོངས་སུ་དགའ་ལྡན་དང་། དབང་ཕྱུག་དང་། དབང་ཕྱུག་<br>ཆེན་པོ་ཞེས་བྱ་བ་རྣམས་གནས་གཙང་མའི་རིས་ཀྱི་ལྷའི་བུ་རབ་ཏུ་མང་པོ་དག་དང་ལྷན་ཅིག་ཏུ་བཅོམ་ལྡན་འདས་ག་ལ་དེར་དོང་སྟེ་ལྷགས་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་བྱས་ཏེ"
 ],
 [
  "78.236b",
  "ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ། །ཕྱོགས་གཅིག་ཏུ་འཁོད་ནས་ཀྱང་བཅོམ་ལྡན་འདས་ལ་གནས་གཙང་མའི་རིས་ཀྱི་ལྷའི་བུ་དེ་དག་གིས་འདི་སྐད་གསོལ་ཏོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་སྔོན་གྱི་ཡང་དག་པར་རྫོགས་པའི་སངས་<br>རྒྱས་རྣམས་ཀྱིས་གསུངས་པ་བྱང་ཆུབ་སེམས་དཔའི་མཚན་མ་བསྟན་པ་ཞེས་བགྱི་བའི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ནི་སྔོན་ཡང་བཤད་<span class='delete'>ལ། </span><span class='add'>  ལ་   </span>སླད་ཀྱིས་ཀྱང་འཆད་པར་འགྱུར་བས། བཅོམ་ལྡན་འདས་ཀྱིས་ཀྱང་སྐྱེ་བོ་མང་པོ་ལ་<br>སྨན་པ་དང་། སྐྱེ་བོ་མང་པོ་ལ་བདེ་བ་དང་། འཇིག་རྟེན་ལ་ཐུགས་བརྩེ་བ་དང་། ལྷ་དང་མི་རྣམས་ཀྱི་དོན་<span class='delete'>དང་། </span><span class='add'>  དང་།   </span>སྨན་པ་<span class='delete'>དང་། </span><span class='add'>  དང་།   </span>བདེ་བའི་སླད་དུ་དེ་ཡང་དག་པར་བཤད་དུ་<span class='delete'>གསོལ་། </span><span class='add'>  གསོལ།   </span>བཅོམ་ལྡན་འདས་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ན་<br>ཡང་མ་འོངས་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཐོས་ན། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་འདུན་པ་རྒྱ་ཆེན་པོ་སྐྱེད་པར་འགྱུར་ཞིང་། བདག་ཉིད་ཀྱི་དགེ་བ་ལ་ཡང་དག་པ་ཇི་<br>ལྟ་བ་བཞིན་དུ་མཐོང་བ་ན་གཞན་དག་ལ་རློམ་སེམས་བགྱིད་པར་མི་འགྱུར་ཞིང་བདེ་བས་ཀྱང་བག་མ་མཆིས་པར་མི་འགྱུར་ལ། སྡུག་བསྔལ་བར་གྱུར་པས་ཀྱང་སྒྱིད་ལུག་པར་མི་འགྱུར་ལགས་སོ། །བཅོམ་ལྡན་འདས་<br>ཀྱིས་གནས་གཙང་མའི་རིས་ཀྱི་ལྷའི་བུ་དེ་དག་ལ་ཅང་མི་གསུང་བས་གནང་བར་མཛད་དོ། །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་རྡོ་རྗེས་རབ་འཇོམ་གྱིས་ལྷའི་བུ་དེ་དག་གིས་གསོལ་བ་བཏབ་པར་རིག་<span class='delete'>ཅིང་། </span><span class='add'>  ཅིང་།   </span>འཁོར་མཐའ་ཡས་<br>པ་དག་ལྷགས་པར་ཡང་རིག་ནས་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་གསོལ་ཏོ། །ཡོན་ཏན་བརྒྱས་<span class='delete'>གཏན་</span><span class='add'>  གཏམ་  </span><span class='delete'>པ་</span><span class='add'>  བ་  </span>ལ་འདི་ཞུ་<span class='delete'>ལགས། </span><span class='add'>  ལགས། །  </span>ལྷ་མི་དགའ་མཛད་པ་ལ་འདི་ཞུ་<span class='delete'>ལགས། </span><span class='add'>  ལགས། །  </span>བདུད་འཇོམས་མཛད་པ་པོ་ལ་འདི་ཞུ་<br><span class='delete'>ལགས། </span><span class='add'>  ལགས། །  </span>སྐྱེ་<span class='delete'>མང་</span><span class='add'>  མང་  </span>སྨན་པའི་མཆོག་ལ་འདི་ཞུ་<span class='delete'>ལགས། </span><span class='add'>  ལགས། །  </span>འཁྲུལ་མེད་གསུང་གིས་ཆོས་རྣམས་སྟོན་མཛད་<span class='delete'>ཅིང་། </span><span class='add'>  ཅིང་། །  </span>འགྲོ་བའི་འཇིག་རྟེན་མཁས་པ་བླ་ན་<span class='delete'>མེད། </span><span class='add'>  མེད། །  </span>ཡིད་གཉིས་བརྒྱ་སྟོང་རབ་ཏུ་གཅོད་མཛད་<span class='delete'>ཅིང་།</span><span class='add'>  ཅིང་། །  </span>"
 ],
 [
  "78.237a",
  "<span class='delete'>སྐྱེ་</span><span class='add'>  སྐྱེ་  </span>མང་མིག་སྩོལ་པ་ལ་འདི་ཞུ་<span class='delete'>ལགས། </span><span class='add'>  ལགས། །  </span>ཉི་ལྟར་མཉམ་མེད་མུན་པ་སེལ་འཛད་<span class='delete'>ཅིང་། </span><span class='add'>  ཅིང་། །  </span>ཟླ་ལྟར་ཡོངས་དག་བསིལ་བའི་འོད་ལྡན་<span class='delete'>པ། </span><span class='add'>  པ། །  </span>མི་སྡུག་<span class='delete'>བསྔལ་</span><span class='add'>  སྡུག་  </span>ལ་མི་གཡོ་ལྷུན་འདྲ་<span class='delete'>ཞིང་། </span><span class='add'>  ཞིང་། །  </span>མཚོ་འདྲ་<br>ཡོན་ཏན་མཆོག་ལ་འདི་ཞུ་<span class='delete'>ལགས། </span><span class='add'>  ལགས། །  </span><span class='delete'>དོགས་</span><span class='add'>  དོག་ས་  </span>བཞིན་དུ་ནོངས་པ་བགྱིས་བཟོད་<span class='delete'>ཅིང་། </span><span class='add'>  ཅིང་། །  </span>ཆབ་ལྟར་སྐྱེ་དགུའི་དྲི་མ་<span class='delete'>སྤྱོད་</span><span class='add'>  སྦྱོང་  </span>བར་<span class='delete'>མཛད། </span><span class='add'>  མཛད། །  </span>ཞུགས་བཞིན་ཉོན་མོངས་དྲ་བ་སྲེག་མཛད་<span class='delete'>ཅིང་། </span><span class='add'>  ཅིང་། །  </span>སྲིད་གསུམ་འཁོར་མི་མངའ་ལ་<br>འདི་ཞུ་<span class='delete'>ལགས། </span><span class='add'>  ལགས། །  </span>སྨན་<span class='delete'>བ་</span><span class='add'>  པ་  </span>བཞིན་དུ་འགྲོ་བ་གསོལ་མཛད་<span class='delete'>ཅིང་། </span><span class='add'>  ཅིང་། །  </span>རྣམས་ཐོས་བུ་ལྟར་སྡུག་ལ་ནོར་སྦྱིན་<span class='delete'>མཛད། </span><span class='add'>  མཛད། །  </span>སྤྲིན་བཞིན་སྐོམ་པས་གདུགས་པ་ཞི་མཛད་<span class='delete'>ཅིང་། </span><span class='add'>  ཅིང་། །  </span>དེས་པ་གསུངས་མཆོག་སྟོན་ལ་འདི་ཞུས་<span class='delete'>ལགས། </span><span class='add'>  ལགས། །  </span><br>འགྲོ་བ་ཟུག་རྔུ་སྡུག་བསྔལ་ང་རྒྱལ་<span class='delete'>བཅས་། </span><span class='add'>  བཅས། །  </span>ཐ་བ་ཉོན་མོངས་དྲི་བཅས་གཡོན་ཅན་<span class='delete'>དག །</span><span class='add'>  དག །  </span>འདུལ་མཁས་བདེ་དང་བདེ་བ་སྩོལ་མཛད་<span class='delete'>ཅིང་། </span><span class='add'>  ཅིང་། །  </span>འགྲོ་བས་དྲན་བགྱི་བ་ལ་མཆོག་འདི་<span class='delete'>ཞུ། </span><span class='add'>  ཞུ། །  </span>མཛེམ་དང་སྣང་ལྡན་བློ་<br>གྲོས་བརྟན་ལྡན་<span class='delete'>ཞིང་། </span><span class='add'>  ཞིང་། །  </span>རྟོགས་དང་དྲན་ལྡན་བླ་མ་རྣམས་ཀྱིས་<span class='delete'>མཆོད། </span><span class='add'>  མཆོད། །  </span>མཉམ་མེད་ཚུལ་མི་འཆོས་ཤིང་ཐུགས་མི་<span class='delete'>གནས་། </span><span class='add'>  གནས། །  </span>ཡོན་ཏན་རྒྱ་མཚོ་འདྲ་ལ་མཆོག་འདི་<span class='delete'>ཞུ། </span><span class='add'>  ཞུ། །  </span>སྐྱེ་དགུའི་འཐབ་རྩོད་ཉོན་མོངས་ཞི་<br>མཛད་<span class='delete'>ཅིང་། </span><span class='add'>  ཅིང་། །  </span>རྟག་ཏུ་དེས་ཤིང་ཞལ་བཟང་དགའ་བར་<span class='delete'>མཛད། </span><span class='add'>  མཛད། །  </span>ཤིན་དུ་ཞལ་འཛུམ་མཉེན་ཞིང་བྱམས་པའི་<span class='delete'>ཐུགས། </span><span class='add'>  ཐུགས། །  </span>སྲིད་གསུམ་ཕ་རོལ་གཤེགས་ལ་འདི་ཞུ་<span class='delete'>ལགས། </span><span class='add'>  ལགས། །  </span>སོར་བཅུ་ཐལ་སྦྱར་འདི་ཡིས་<br>བསྟོད་བགྱིས་<span class='delete'>ཤིང་། </span><span class='add'>  ཤིང་། །  </span>བདེ་གཤེགས་སྟོབས་བཅུ་ཁྱོད་ལ་གསོལ་འདེབས་<span class='delete'>ཀྱིས། </span><span class='add'>  ཀྱིས། །  </span>སེམས་ཅན་རིན་ཆེན་དེ་དག་རྣམས་<span class='delete'>ཀྱིས་</span><span class='add'>  ཀྱི་  </span><span class='delete'>སྤྱོད། </span><span class='add'>  སྤྱོད། །  </span>ཞུས་པ་བཞིན་དུ་བཀའ་<span class='delete'>སྩལ་</span><span class='add'>  སྩོལ་  </span>བཤད་དུ་<span class='delete'>གསོལ། </span><span class='add'>  གསོལ། །  </span>བྱང་ཆུབ་ཚུལ་གྱི་<br>སྤྱོད་དེ་ཅི་འདྲ་<span class='delete'>བ། </span><span class='add'>  བ། །  </span>ཐོས་ནས་ལྷ་མི་ཚོགས་ཀྱང་སྤྱོད་འགྱུར་<span class='delete'>བས། </span><span class='add'>  བས། །  </span>འདི་ནི་སྐྱེ་མཆོག་ལགས་ཞེས་བདག་ཅག་<span class='delete'>གིས། </span><span class='add'>  གིས། །  </span>ཇི་ལྟར་འཚལ་འགྱུར་མཚན་མ་བདག་ལ་<span class='delete'>གསུངས། </span><span class='add'>  གསུངས། །  </span>དེ་སྐད་ཅེས་གསོལ་བ་<span class='delete'>དང་། </span><span class='add'>  དང་།   </span>བཅོམ་"
 ],
 [
  "78.237b",
  "ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྡོ་རྗེས་རབ་འཇོམས་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །རྡོ་རྗེས་རབ་འཇོམས་དེའི་ཕྱིར་ལེགས་པར་རབ་ཏུ་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག་དང་། རྣམ་<span class='delete'>བ་</span><span class='add'>  པ་  </span>གང་དག་<br><span class='delete'>དང་། </span><span class='add'>  དང་།   </span>རྟགས་གང་དག་དང་། མཚན་མ་གང་དག་གིས་གང་ཟག་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པ་ཡིན་བར་ཤེས་པར་བྱ་བ་ངས་ཁྱོད་ལ་བཤད་པར་བྱའོ། །བྱང་ཆུབ་སེམས་དཔའ་རྡོ་རྗེས་རབ་འཇོམས་ཀྱིས་བཅོམ་<br>ལྡན་འདས་དེ་ལྟར་འཚལ་ལོ་ཞེས་གསོལ་<span class='delete'>ཏོ། །</span><span class='add'>  ཏོ། །  </span>བཅོམ་ལྡན་འདས་ཀྱི་ལྟར་ཉན་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་དེ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །རྡོ་རྗེས་རབ་འཇོམས་མཚན་མ་བརྒྱ་རྩ་བརྒྱད་ཀྱིས་ནི་གང་<br>ཟག་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པ་ཡིན་བར་རིག་པར་བྱ་སྟེ། བརྒྱ་རྩ་བརྒྱད་གང་ཞེ་ན། གཉིད་ལོག་པའི་རྨི་ལམ་ན་དེ་བཞིན་གཤེགས་པའི་སྐུ་མཛེས་པས་བཀའ་སྩོལ་པའི་གཟུགས་མཐོང་བ་<span class='delete'>དང་། </span><span class='add'>  དང་།   </span>གཞན་ཡང་དེ་བཞིན་<br>གཤེགས་པ་ཅང་མི་གསུང་བ་མཐོང་བ་དང་། གཞན་ཡང་དེ་བཞིན་གཤེགས་པ་དབུ་དང་ཞབས་སུ་བཅས་པར་གཡོགས་པ་མཐོང་བ་དང་། གཞན་ཡང་དེ་བཞིན་གཤེགས་པ་ཞལ་ཕྱིར་ཕྱོགས་པ་མཐོང་བ་དང་། <br>གཞན་ཡང་དེ་བཞིན་གཤེགས་པའི་སྐུ་འཇིམ་པ་ལས་བྱས་པ་མཐོང་བ་<span class='delete'>དང་། </span><span class='add'>  དང་།   </span>གཞན་ཡང་དེ་བཞིན་གཤེགས་པའི་སྐུ་ཚོན་གྱིས་བྲིས་པ་མཐོང་བ་དང་། གཞན་ཡང་འགྲོ་བ་ན་དེ་བཞིན་གཤེགས་པའི་སྐུ་མཐོང་བ་<br><span class='delete'>དང་། </span><span class='add'>  དང་།   </span>གཞན་ཡང་དེ་བཞིན་གཤེགས་པ་གཞན་དག་ལ་ཆོས་སྟོན་པར་མཐོང་བ་དང་། གཞན་ཡང་དེ་བཞིན་གཤེགས་པ་རྫུ་འཕྲུལ་གྱིས་ནམ་མཁའ་ལ་གཤེགས་པ་མཐོང་བ་དང་། གཞན་ཡང་དེ་བཞིན་<br>གཤེགས་པ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་མཐོང་བ་<span class='delete'>དང་། </span><span class='add'>  དང་།   </span>གཞན་ཡང་དེ་བཞིན་གཤེགས་པ་ཞུགས་ལ་བཞེན་པ་མཐོང་བ་དང་། གཞན་ཡང་རྨི་ལམ་ན་དེ་བཞིན་གཤེགས་པའི་སྐུ་གདུང་དག་རྙེད་པ་<span class='delete'>དང་། </span><span class='add'>  དང་།   </span>གཞན་ཡང"
 ],
 [
  "78.239a",
  "དང་། གཞན་ཡང་རྨི་ལམ་ན་གླེགས་བམ་རྙེད་པ་དང་། གཞན་ཡང་རྨི་ལམ་ན་གཟུངས་ཀྱི་སྒྲ་ཐོས་པ་དང་། གཞན་ཡང་རྨི་ལམ་ན་ཏིང་ངེ་འཛིན་གྱི་སྒྲ་ཐོས་པ་དང་། གཞན་ཡང་རྨི་ལམ་ན་ཤིན་དུ་རྒྱས་<br>པའི་སྡེའི་མདོ་སྡེའི་སྒྲ་ཐོས་པ་དང་། གཞན་ཡང་རྨི་ལམ་ན་ཆོས་སྨྲ་བའི་དགེ་སློང་ཆེ་གེ་མོ་ཞེས་བྱ་བ་རྣམས་ཀྱི་མིང་ཐོས་པ་དང་། གཞན་ཡང་རྨི་ལམ་ན་བདག་ཚིགས་སུ་བཅད་པ་ལ་སྤོབས་པ་ཐོབ་པར་ཀུན་དུ་ཤེས་པ་དང་། <br>གཞན་ཡང་རྨི་ལམ་ན་བདག་མདོ་སྡེ་ལ་སྤོབས་པ་ཐོབ་པར་ཀུན་དུ་ཤེས་པ་དང་། གཞན་ཡང་རྨི་ལམ་ན་ཆོས་ཀྱི་གཏེར་གྱི་སྒྲ་ཐོས་པ་དང་། གཞན་ཡང་རྨི་ལམ་ན་འཇིག་རྟེན་གྱི་ཁམས་གཞན་གྱི་དེ་བཞིན་གཤེགས་པའི་མཚན་<br>ཐོས་པ་དང་། གཞན་ཡང་འཇིག་རྟེན་གྱི་ཁམས་གཞན་གྱི་བྱང་ཆུབ་སེམས་དཔའ་ཆེ་གེ་མོ་ཞེས་བྱ་བའི་མིང་ཐོས་པ་དང་། གཞན་ཡང་བདག་རྒྱ་མཚོའི་དབུས་ན་འདུག་པར་ཀུན་དུ་ཤེས་པ་དང་། གཞན་ཡང་བདག་རིན་<br>པོ་<span class='delete'>ཚེ་</span><span class='add'>  ཆེ་  </span>དག་ཐུ་བར་ཀུན་དུ་ཤེས་པ་དང་། གཞན་ཡང་བདག་རི་རབ་ཀྱི་རྩེ་མོར་སོན་པར་ཀུན་དུ་ཤེས་པ་དང་། གཞན་ཡང་བདག་རི་ལ་འཛེག་པར་ཀུན་དུ་ཤེས་པ་དང་། གཞན་ཡང་བདག་རིའི་རྩེ་མོ་ན་འདུག་པར་ཀུན་དུ་ཤེས་<br>པ་དང་། གཞན་ཡང་བདག་ཤིང་ལྗོན་པ་ལ་འཛེག་པར་ཀུན་དུ་ཤེས་པ་དང་། གཞན་ཡང་བདག་གླང་པོ་ཆེའི་གཙོ་བོ་མཐོ་བ་དང་། གཞན་ཡང་བདག་གླང་པོ་ཆེའི་གཙོ་བོ་ལ་ཞོན་པར་ཀུན་དུ་ཤེས་པ་དང་། གཞན་ཡང་<br>བདག་རྟ་ལ་ཞོན་པར་ཀུན་དུ་ཤེས་པ་དང་། གཞན་ཡང་བདག་བདེན་པའི་བྱིན་གྱི་བརླབས་བྱེད་པར་ཀུན་དུ་ཤེས་པ་དང་། གཞན་ཡང་འབྲས་བུའི་ཤིང་ལྗོན་པ་དག་མཐོང་བ་དང་། གཞན་ཡང་མེ་ཏོག་གི་ཤིང་ལྗོན་པ་དག་<br>མཐོང་བ་དང་། གཞན་ཡང་སྔོན་མ་མཐོང་བའི་གྲོང་ཁྱེར་མཐོང་བ་དང་། གཞན་ཡང་མཚོ་མ་དྲོས་པ་མཐོང་བ་དང་། གཞན་ཡང་ལྷའི་བུ་མཐོང་བ་དང་། གཞན་ཡང་ཀླུ་མཐོང་བ་དང་། གཞན་ཡང་བདག་འཛམ་བུའི་"
 ],
 [
  "78.238b",
  "ཡང་དེ་བཞིན་གཤེགས་པ་ཉག་གཅིག་མཐོང་བ་དང་། གཞན་ཡང་དེ་བཞིན་གཤེགས་པ་སྐྱེ་བོ་མང་པོས་<span class='delete'>ཡོངས་</span><span class='add'>  ཡོངས་སུ་  </span>བསྐོར་བ་མཐོང་བ་དང་། གཞན་ཡང་དེ་བཞིན་གཤེགས་པའི་གདུགས་མཐོང་བ་དང་། གཞན་<br>ཡང་དེ་བཞིན་གཤེགས་པའི་འཆགས་དག་མཐོང་བ་དང་། གཞན་ཡང་དེ་བཞིན་གཤེགས་པའི་གདན་མཐོང་བ་དང་། གཞན་ཡང་དེ་བཞིན་གཤེགས་པ་ལ་ཞལ་ཟས་འབུལ་བར་ཀུན་དུ་ཤེས་པ་དང་། གཞན་ཡང་<br>བདག་དེ་བཞིན་གཤེགས་པ་ལ་ན་བཟའ་འབུལ་བར་ཀུན་དུ་ཤེས་པ་དང་། གཞན་ཡང་བདག་དེ་བཞིན་གཤེགས་པ་ལ་མེ་ཏོག་འབུལ་བར་ཀུན་ཤེས་པ་དང་། གཞན་ཡང་བདག་<span class='delete'>རིལ་</span><span class='add'>  རི་ལ་  </span>འདུག་པར་ཀུན་དུ་ཤེས་པ་<span class='delete'>དང་། </span><span class='add'>  དང་།   </span><br>གཞན་ཡང་རྨི་ལམ་ན་བདག་གཅེར་བུར་འདུག་པར་ཀུན་དུ་ཤེས་པ་དང་། གཞན་ཡང་རྨི་ལམ་ན་བདག་ཕྱོགས་མཚམས་ན་འདུག་པར་ཀུན་དུ་ཤེས་པ་དང་། གཞན་ཡང་རྨི་ལམ་ན་<span class='delete'>བདག །</span><span class='add'>  བདག་  </span>སྔོན་མ་མཐོང་བའི་ཡུལ་དུ་ཕྱིན་<br>པར་ཀུན་དུ་ཤེས་པ་དང་། གཞན་ཡང་རྨི་ལམ་ན་བདག་ཆུ་<span class='delete'>བོའི་</span><span class='add'>  བོའི་  </span>ནང་ན་འདུག་པར་ཀུན་དུ་ཤེས་པ་དང་། གཞན་ཡང་རྨི་ལམ་ན་སྤྲིན་ལས་ཆར་འབབ་པ་མཐོང་བ་དང་། གཞན་ཡང་རྨི་ལམ་<span class='delete'>ནས་</span><span class='add'>  ན་ས་  </span>གཡོས་པར་ཀུན་དུ་ཤེས་<br>པ་དང་། གཞན་ཡང་རྨི་ལམ་ན་བདག་གཡུལ་འགྱེད་པའི་ནང་དུ་སོན་<span class='delete'>བར་</span><span class='add'>  པར་  </span>ཀུན་དུ་ཤེས་པ་དང་། གཞན་ཡང་རྨི་<span class='delete'>ལམ་</span><span class='add'>  ལམ་ན་  </span>བདག་ན་བར་དུ་ཀུན་ཤེས་པ་དང་། གཞན་ཡང་རྨི་ལམ་ན་བདག་གཡངས་ས་ནས་གཡང་དུ་ལྷུང་<br>ཞིང་རྟོན་པ་མེད་པར་ཀུན་དུ་ཤེས་པ་དང་། གཞན་ཡང་རྨི་ལམ་ན་<span class='delete'>བདག །</span><span class='add'>  བདག་  </span><span class='delete'>གསང་</span><span class='add'>  གསད་  </span>བ་ལས་བཏང་བར་ཀུན་དུ་ཤེས་པ་དང་། གཞན་ཡང་རྨི་ལམ་ན་བདག་དགྲའི་ནང་ན་འདུག་པར་ཀུན་དུ་ཤེས་པ་དང་། གཞན་<span class='delete'>ཡང་</span><span class='add'>  ཡང་  </span><br>རྨི་ལམ་ན་བདག་ནམ་མཁའ་ལ་འགྲོ་བར་ཀུན་དུ་ཤེས་པ་དང་། གཞན་ཡང་རྨི་ལམ་ན་བདག་གིས་ལག་པ་ན་སྒྲོན་མ་ཐོགས་པ་ཀུན་དུ་ཤེས་པ་དང་། གཞན་ཡང་རྨི་ལམ་ན་བྱང་ཆུབ་སེམས་དཔའ་ཕྱིར་བྱུང་བ་མཐོང་བ་"
 ],
 [
  "78.238a",
  "རྨི་ལམ་ན་དེ་བཞིན་གཤེགས་པའི་དབུ་སྐྲ་རྙེད་པ་དང་། གཞན་ཡང་རྨི་ལམ་ན་སྔོན་མ་མཐོང་བའི་མཆོད་རྟེན་དག་མཐོང་བ་<span class='delete'>དང་། </span><span class='add'>  དང་།   </span>གཞན་ཡང་རྨི་ལམ་ན་དེ་བཞིན་གཤེགས་པའི་མཆོད་<br>རྟེན་རིན་པོ་ཆེས་བརྒྱན་པ་<span class='delete'>དང་</span><span class='add'>  དག་  </span>མཐོང་བ་<span class='delete'>དང་། </span><span class='add'>  དང་།   </span>གཞན་ཡང་དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་ཆོ་འཕྲུལ་མཛད་པ་དག་མཐོང་བ་<span class='delete'>དང་། </span><span class='add'>  དང་།   </span>གཞན་ཡང་དེ་བཞིན་གཤེགས་པའི་འོད་མཐོང་བ་<span class='delete'>དང་། </span><span class='add'>  དང་།   </span>གཞན་ཡང་<br>རྨི་ལམ་ན་དེ་བཞིན་གཤེགས་པའི་སྒྲ་ཐོས་ལ་མ་མཐོང་བ་<span class='delete'>དང་། </span><span class='add'>  དང་།   </span>གཞན་ཡང་བདག་དེ་བཞིན་གཤེགས་པའི་སྐུ་ཡིན་<span class='delete'>བར་</span><span class='add'>  པར་  </span>ཀུན་དུ་ཤེས་པ་དང་། གཞན་ཡང་དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་ལ་མེ་ཏོག་<br>གམ། མེ་ཏོག་ཕྲེང་ངམ། སྤོས་སམ། བྱུག་པ་འབུལ་ཞིང་སྐུད་པར་ཀུན་དུ་ཤེས་པ་དང་། གཞན་ཡང་དེ་བཞིན་གཤེགས་པས་ན་བཟའ་དྲི་མ་ཅན་གསོལ་བ་མཐོང་བ་དང་། གཞན་ཡང་རྨི་ལམ་ན་སྔོན་མ་<br>ཐོས་པའི་ཆོས་དག་ཐོས་པ་དང་། གཞན་ཡང་རྨི་ལམ་ན་མ་བསྟན་པའི་ཆོས་དག་ཤེས་ལ་<span class='delete'>སང་</span><span class='add'>  སད་  </span>ན་ཆོས་འཆད་པ་སུ་ཡང་མེད་ཅིང་ཅི་ཡང་མི་དྲན་པ་དང་། སྔོན་མ་མཐོང་བའི་དགེ་སློང་ཆོས་སྨྲ་བ་དག་མཐོང་<br>བ་དང་། གཞན་ཡང་རྨི་ལམ་ན་བདག་ཆོས་ཀྱི་ཁྲི་སྟན་ལ་འདུག་སྟེ་ཆོས་སྟོན་པར་ཀུན་དུ་ཤེས་པ་དང་། གཞན་ཡང་རྨི་ལམ་ན་བདག་འཇིགས་པ་མེད་པར་ཀུན་དུ་ཤེས་པ་དང་། གཞན་ཡང་རྨི་ལམ་<br>ན་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་མཐོང་བ་དང་། གཞན་ཡང་དེ་བཞིན་གཤེགས་པ་འཆག་པ་མཐོང་བ་དང་། གཞན་ཡང་དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་འཁོར་ལོ་སྐོར་བ་མཐོང་བ་དང་། གཞན་ཡང་དེ་བཞིན་<br>གཤེགས་པ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའི་མཆོད་རྟེན་མཐོང་བ་དང་། གཞན་ཡང་དེ་བཞིན་གཤེགས་པའི་ཆོས་གོས་རྙེད་པ་དང་། གཞན་ཡང་དེ་བཞིན་གཤེགས་པའི་ལྷུང་བཟེད་རྙེད་པ་དང་། གཞན་"
 ],
 [
  "78.241a",
  "<span class='delete'>ལས་</span><span class='add'>  ལས་  </span>ཀྱི་སྒྲིབ་པ་དེ་རྣམ་པར་དག་པར་འགྱུར་རོ། །གལ་ཏེ་ས་གཞན་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཞིག་གིས་མཚན་མ་དེ་ལྟ་བུ་མཐོང་ན་ནི་བདུད་ཀྱི་ལས་སུ་རིག་པར་བྱའོ། །རྡོ་རྗེས་རབ་<br><span class='delete'>འཛོམས་</span><span class='add'>  འཇོམས་  </span>གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་དེ་བཞིན་གཤེགས་པའི་སྐུ་ཚོན་གྱིས་བྲིས་པ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་ལྔ་པོ་གང་ཡང་རུང་བ་དག་ཏུ་བལྟ་སྟེ། སངས་རྒྱས་སྐུ་བྲིས་པ་ལ་སྤོས་<br>སམ། མེ་ཏོག་དག་གིས་མཆོད་པར་བྱེད་པར་ཀུན་དུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་པར་བལྟའོ། །ཇི་སྟེ་ཐལ་མོ་སྦྱོར་ན་ནི་ས་གཉིས་པར་བལྟའོ། །ཇི་སྟེ་བསྟོད་པ་བྱེད་ན་ནི་ས་གསུམ་པར་བལྟའོ། །ཇི་སྟེ་<br>ཡན་ལག་ལྔས་ཕྱག་འཚལ་ན་ནི་ས་བཞི་<span class='delete'>བར་</span><span class='add'>  པར་  </span>བལྟའོ། །ཇི་སྟེ་སྐོར་བ་བྱེད་ན་ནི་ས་ལྔ་<span class='delete'>བར་</span><span class='add'>  པར་  </span>བལྟའོ། །དེས་ཆོས་ཟབ་མོ་དག་ལ་བཟོད་པ་བསྐྱེད་པར་བྱ་སྟེ། དེའི་འོག་ཏུ་ལུང་བསྟན་པ་ཐོབ་པར་ཡང་འགྱུར་རོ། །རྡོ་རྗེས་<br>རབ་<span class='delete'>འཛོམས་</span><span class='add'>  འཇོམས་  </span>གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་དེ་བཞིན་གཤེགས་པའི་སྐུ་བཞུད་པ་མཐོང་ན། དེས་ནི་བརྙས་ཐབས་<span class='delete'>སུ་</span><span class='add'>    </span>བྱས་ཤིང་ཁ་ཏོན་དང་ལུང་ཕོག་པ་ཡིན་<span class='delete'>པས་</span><span class='add'>  པས་  </span>དེས་བག་ཡོད་པར་<br>བརྩོན་འགྲུས་བརྩམ་པར་བྱ་ཞིང་ཡང་དང་ཡང་དུ་ཆོས་མཉན་པ་ཡང་<span class='delete'>སྤྱད་</span><span class='add'>  སྦྱིན་  </span>པར་བྱ། དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་དག་ཀྱང་བྱི་དོར་བྱའོ། །དེས་ན་དེའི་ལས་ཀྱི་སྒྲིབ་པ་དེ་རྣམ་པར་དག་པར་འགྱུར་ཏེ། བྱང་<br>ཆུབ་སེམས་དཔའ་དེ་ནི་ས་གསུམ་པར་བལྟའོ། །ཇི་སྟེ་བྱང་ཆུབ་སེམས་དཔའ་གཞན་ཞིག་འགྲོ་བ་ན་དེ་བཞིན་གཤེགས་པ་མཐོང་ན་དེ་ལ་མཚན་མ་ཅིར་འགྱུར་ཞེ་ན། གལ་ཏེ་བཀད་སར་འགྲོ་ལ་དེ་བཞིན་<br>གཤེགས་པ་མཐོང་ན་ས་དང་པོ་པར་བལྟའོ། །གལ་ཏེ་གཙུག་ལགས་ཁང་དུ་འགྲོ་ལ་དེ་བཞིན་གཤེགས་པ་མཐོང་ན་ས་གཉིས་པར་བལྟའོ། །གལ་ཏེ་ཆོས་ཉན་དུ་འགྲོ་ལ་དེ་བཞིན་གཤེགས་པ་མཐོང་ན་ས་"
 ],
 [
  "78.239b",
  "གླིང་གཞན་དུ་སོན་པར་ཀུན་དུ་ཤེས་པ་དང་། གཞན་ཡང་བདག་གོས་དཀར་པོ་གྱོན་པར་ཀུན་དུ་ཤེས་པ་དང་། གཞན་ཡང་བདག་གི་མགོ་ལ་རིན་པོ་ཆེའི་ཕྲེང་བ་ཐོགས་པར་ཀུན་དུ་ཤེས་པ་དང་། གཞན་ཡང་བདག་<br>གི་མགོ་ལ་མེ་ཏོག་གི་ཕྲེང་<span class='delete'>བརྒྱན་</span><span class='add'>  བ་རྒྱན་  </span>དང་བཅས་པ་ཐོགས་པར་ཀུན་དུ་ཤེས་པ་དང་། གཞན་ཡང་བདག་མེ་ཏོག་སིལ་མ་དག་སྲེལ་བར་ཀུན་དུ་ཤེས་པ་དང་། གཞན་ཡང་བདག་རྔ་བོ་ཆེ་རྡུང་<span class='delete'>བའམ། </span><span class='add'>  བ་འམ།   </span>རོལ་མོའི་སྒྲ་གཞན་དག་<br>འབྱིན་པར་ཀུན་དུ་ཤེས་པ་དང་། གཞན་ཡང་ཉི་མ་<span class='delete'>སྤྱད་</span><span class='add'>  སྤྱང་  </span>ཀིས་ཟིན་པ་འམ། ཟླ་བ་སྦྱང་ཀིས་ཟིན་པར་མཐོང་བ་དང་། གཞན་ཡང་བདག་མི་གཙང་བས་འགགས་པར་ཀུན་དུ་ཤེས་པ་དང་། གཞན་ཡང་བདག་རྒྱལ་པོར་<br>གྱུར་པར་ཀུན་དུ་ཤེས་པ་དང་། གཞན་ཡང་བདག་རྒྱལ་པོའི་སྤྱན་སྔ་འམ། རྒྱལ་<span class='delete'>པོ་</span><span class='add'>  པོའི་  </span>བློན་པོ་ཆེན་པོ་འམ། སྐྱེ་བོ་ཕལ་པོ་ཆེའི་ནང་ན་འདུག་པར་ཀུན་དུ་ཤེས་པ་དང་། གཞན་ཡང་བདག་བསྐྱེད་མོས་ཚལ་ན་འདུག་པར་<br>ཀུན་དུ་ཤེས་པ་དང་། གཞན་ཡང་སྔོན་མ་མཐོང་བའི་གཙུག་ལག་ཁང་ངམ། གྲོང་ངམ། ཡུལ་ལམ། ལྗོངས་མཐོང་བ་དང་། གཞན་ཡང་རྨི་ལམ་ན་གདུགས་རྙེད་པ་དང་། གཞན་ཡང་རྨི་ལམ་ན་བདག་སྐྱེ་བོ་ཕལ་པོ་ཆེ་ལ་<br>ཆོས་སྟོན་པར་ཀུན་དུ་ཤེས་པ་དང། གཞན་ཡང་བདག་གྲོང་གཞན་དུ་ཞུགས་པར་ཀུན་དུ་ཤེས་པ་དང་། གཞན་<span class='delete'>ཀྱང་</span><span class='add'>  ཡང་  </span>ཟམ་པ་འདོགས་པར་ཀུན་དུ་ཤེས་པ་དང་། གཞན་ཡང་བདག་གྲུ་སྦྱོང་བར་ཀུན་དུ་ཤེས་པ་དང་། གཞན་<br>ཡང་རྨི་ལམ་ན་སྤྲིན་ལས་འབྲུག་གྲག་<span class='delete'>པའམ། </span><span class='add'>  པ་འམ།   </span>གློག་འབྱུང་བར་ཀུན་དུ་ཤེས་པ་དང་། གཞན་ཡང་རྨི་ལམ་ན་མཚོན་ཆ་འམ་གོ་ཆ་རྙེད་པ་དང་། གཞན་ཡང་རྨི་ལམ་ན་སྣོད་དག་རྙེད་པ་དང་། གཞན་ཡང་རྨི་ལམ་ན་<br>བདག་སེམས་ཅན་རྣམས་ལ་ལམ་སྟོན་པར་ཀུན་དུ་ཤེས་པ་དང་། གཞན་ཡང་རྨི་ལམ་ན་བདག་བསྐྱེད་མོས་ཚལ་དུ་འཇུག་པར་ཀུན་དུ་ཤེས་པ་དང་། གཞན་ཡང་རྨི་ལམ་ན་ལོ་ཏོག་ཕུན་སུམ་ཚོགས་པ་མཐོང་བ་"
 ],
 [
  "78.240a",
  "དང་། གཞན་ཡང་བདག་སེམས་ཅན་ནད་པ་རྣམས་གསོ་བར་ཀུན་དུ་ཤེས་པ་དང་། གཞན་ཡང་བདག་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་པའི་སྒྲ་ཐོས་པ་དང་། གཞན་ཡང་བདག་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པར་ཀུན་<br>དུ་ཤེས་པ་དང་། གཞན་ཡང་རྨི་ལམ་ན་བུམ་པ་གང་བརྙེད་པ་སྟེ། རྡོ་རྗེས་རབ་<span class='delete'>འཛོམས་</span><span class='add'>  འཇོམས་  </span>རྨི་ལམ་གྱི་མཚན་མ་བརྒྱ་རྩ་བརྒྱད་པོ་འདི་དག་ཀུན་དུ་སྣང་ན་གང་ཟག་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པ་ཡིན་པར་རིག་པར་<span class='delete'>བྱའོ། །</span><span class='add'>  བྱའོ། །  </span><br>རྡོ་རྗེས་རབ་<span class='delete'>འཛོམས་</span><span class='add'>  འཇོམས་  </span>དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་དེ་བཞིན་གཤེགས་པས་བཀའ་སྩལ་པ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་གལ་ཏེ་གཟུངས་ཐོབ་པར་གྱུར་པ་ཞིག་གམ། མངོན་པར་ཤེས་<br>པ་ཐོབ་པར་གྱུར་པ་ཞིག་གམ། བདེན་པའི་བྱིན་གྱིས་བརླབས་གྲུབ་པར་གྱུར་པ་ཞིག་ཡིན་ན་ནི་ས་བརྒྱད་<span class='delete'>བར་</span><span class='add'>  པར་  </span>ལུང་བསྟན་པར་འགྱུར་བར་བལྟའོ། །ཡོན་ཏན་དེ་དག་འཐོབ་ཏུ་ཉེ་བ་ཞིག་ཡིན་ན་ནི་ས་དང་པོ་བདུན་<br>པོ་དག་ལས་ས་གང་ཡང་རུང་བར་བལྟའོ། །རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་དེ་བཞིན་གཤེགས་པ་ཅང་མི་གསུང་བ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེས་ནི་ཆོས་ལ་<br>སྒྲིབ་པར་འགྱུར་བའི་ལས་བསགས་པ་ཡིན་པས། དེས་ཆོས་མཉན་པ་ཡང་དག་པར་འཛིན་དུ་གཞུག་པར་བྱ་ཞིང་ཁ་ཏོན་ལ་ཡང་དག་པར་བརྩོན་པའི་གང་ཟག་རྣམས་ལ་ཡང་བདེ་བའི་བསྙེན་བཀུར་དག་ཉེ་བར་<br>བསྒྲུབ་པར་བྱའོ། །དེས་ན་དེའི་ལས་ཀྱི་སྒྲིབ་པ་དེ་རྣམ་པར་དག་པར་འགྱུར་ཏེ། གང་ཟག་དེ་ནི་ས་དང་<span class='delete'>པ་</span><span class='add'>  པོ་  </span>བདུན་པོ་དག་ལས་ས་གང་ཡང་རུང་བར་བལྟའོ། །དེའི་ཚེ་དེ་ས་དང་པོ་ལ་གནས་པ་ཞིག་ཡིན་ན་ནི་དེས་སྦྱང་<br>བའི་ཕྱིར་ལོ་བདུན་ཏུ་ཕུང་པོ་གསུམ་པའི་ཆོས་ཀྱི་རྣམ་གྲངས་ཉིན་ལན་གསུམ་མཚན་ལན་གསུམ་གདོན་<span class='delete'>བར་</span><span class='add'>  པར་  </span>བྱའོ། །ཇི་སྟེ་ས་གཉིས་པ་ལ་གནས་པ་ཞིག་ཡིན་ན་ནི་དེས་ལོ་དྲུག་ཏུ་གདོན་<span class='delete'>བར་</span><span class='add'>  པར་  </span>བྱའོ། །ཇི་སྟེ་ས་"
 ],
 [
  "78.240b",
  "གསུམ་པ་ལ་གནས་པ་ཞིག་ཡིན་ན་ནི་དེས་ལོ་ལྔར་གདོན་པར་བྱའོ། །ཇི་སྟེ་ས་བཞི་པ་ལ་གནས་པ་ཞིག་ཡིན་ན་ནི་དེས་ལོ་བཞིར་གདོན་པར་བྱའོ། །ཇི་སྟེ་ས་ལྔ་པ་ལ་གནས་པ་ཞིག་ཡིན་ན་ནི་དེས་ལོ་གསུམ་དུ་གདོན་པར་<br>བྱའོ། །ཇི་སྟེ་ས་དྲུག་པ་ལ་གནས་པ་ཞིག་ཡིན་ན་ནི་དེས་ལོ་གཉིས་སུ་གདོན་པར་བྱའོ། །ཇི་སྟེ་ས་བདུན་པ་ལ་གནས་པ་ཞིག་ཡིན་ན་<span class='delete'>ནི་</span><span class='add'>  ནི་དེ  </span><span class='delete'>ས་</span><span class='add'>  ས་  </span>ལོར་གདོན་པར་བྱའོ། །རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་<br>སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་དེ་བཞིན་གཤེགས་པ་དབུ་དང་ཞབས་སུ་བཅས་པར་གཡོགས་པ་མཐོང་ན་དེས་ནི་སེམས་ཅན་རྣམས་དགེ་བའི་བཤེས་གཉེན་ལ་ལྟ་བ་དང་། ཆོས་ཉན་པ་དང་ཕྲལ་བ་ཡིན་བས་དེས་<br>ཞེ་འགྲས་པ་མེད་པའི་སེམས་ཀྱིས་སྤོབས་པར་བྱེད་པའི་དངོས་པོ་ཉེ་བར་བསྒྲུབ་པར་<span class='delete'>བྱའོ། །</span><span class='add'>  བྱའོ། །  </span>དེས་ན་དེའི་ལས་ཀྱི་སྒྲིབ་པ་དེ་རྣམ་པར་དག་པར་འགྱུར་ཏེ། གང་ཟག་དེ་ནི་ལས་དང་པོ་པར་བལྟའོ། །རྡོ་རྗེས་རབ་<span class='delete'>འཛོམས་</span><span class='add'>  འཇོམས་  </span><br>གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་དེ་བཞིན་གཤེགས་པ་ཞལ་ཕྱིར་ཕྱོགས་པ་མཐོང་ན་དེས་ནི་རབ་ཏུ་འབྱུང་བའི་བར་ཆད་བྱས་ཤིང་ཆོས་ཉན་པ་རྣམས་ལ་ཡང་སྒྲིབ་པ་བསྐྱེད་པ་ཡིན་པས་དེས་<br>ཆོས་ཀྱི་ཁྲི་སྟན་བཤམ་པའི་ངང་ཚུལ་ཅན་དུ་བྱ། སེམས་ཅན་རྣམས་ཀྱང་ཆོས་ཉན་དུ་གཟུང་བར་<span class='delete'>བྱའོ། </span><span class='add'>  བྱའོ། །  </span>དེས་ན་དེའི་ལས་ཀྱི་སྒྲིབ་པ་དེ་རྣམ་པར་དག་པར་འགྱུར་ཏེ། གང་ཟག་དེའི་ས་དང་པོ་བདུན་པོ་དག་ལས་ས་གང་<br>ཡང་རུང་བར་བལྟའོ། །རྡོ་རྗེས་རབ་<span class='delete'>འཛོམས་</span><span class='add'>  འཇོམས་  </span>གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་དེ་བཞིན་གཤེགས་པའི་སྐུ་འཇིམ་པ་ལས་བྱས་པ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་པར་བལྟ་སྟེ། དེས་<br>ནི་ཆོས་སྨྲ་བའི་སྤྱོད་པ་ལ་དཔྱས་བྱས་པ་ཡིན་བས་དེས་དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་ནམ། ཆོས་ཡིག་ཁང་དུ་མགོ་ལ་མར་མེ་གཞག་པར་བྱ་ཞིང་དེས་ཞེ་འགྲས་པ་མེད་པའི་སེམས་སུ་བྱའོ། །དེས་ན་དེའི་"
 ],
 [
  "78.242b",
  "ནས་རིང་པོ་མ་ལོན་པ་ཞིག་ཡིན་ན་ནི་ལས་དང་པོ་པར་བལྟ་སྟེ། དེས་<span class='delete'>གཞན་</span><span class='add'>  ཞག་  </span>བདུན་དུ་ཆོས་སྨྲ་<span class='delete'>པ་</span><span class='add'>  བ  </span>འམ། དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་གྱི་སྤྱན་སྔར་མཚན་ཐོག་ཐག་ཏུ་མར་མེ་བཟུང་བར་བྱ་ཞིང་ཉིན་ལན་གསུམ་མཚན་<br>ལན་གསུམ་དུ་སྡིག་པ་ཡང་བཤམས་པ་བྱ། སེམས་ཅན་རྣམས་དམ་པའི་ཆོས་ཡོངས་སུ་བཟུང་བ་ཡང་དག་པར་འཛིན་དུ་གཞུག་པར་ཡང་བྱ་སྟེ། དེས་ན་དེའི་ལས་ཀྱི་<span class='delete'>སྒྲིབ་</span><span class='add'>  སྒྲིབ་པ་  </span>དེ་རྣམ་པར་དག་པར་འགྱུར་རོ། །རྡོ་རྗེས་རབ་<br>འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གི་རྨི་ལམ་ན་དེ་བཞིན་གཤེགས་པའི་སྐུ་གདུང་དག་རྙེད་ན་དེ་ནི་གསུམ་པར་བལྟ་སྟེ། ཚེ་རྗེས་ན་ཡང་སངས་རྒྱས་དང་ཕྲད་པར་འགྱུར་ཞིང་ལུང་བསྟན་པ་<span class='delete'>ལ་</span><span class='add'>  ཡང་  </span>ཐོབ་<br>པར་<span class='delete'>འགྱུར། </span><span class='add'>  འགྱུར།   </span>ཕ་རོལ་དུ་ཕྱིན་པ་<span class='delete'>དང་</span><span class='add'>  དག་  </span>ཀྱང་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ། །ས་གཞན་ལ་གནས་པ་ཞིག་གིས་རྨི་ལམ་ན་དེ་བཞིན་གཤེགས་པའི་སྐུ་གདུང་དག་རྙེད་ན་དེའི་མཚན་མ་ནི་འདི་དག་ཡིན་<span class='delete'>ཏེ་། </span><span class='add'>  ཏེ།  </span><br>གང་གིས་དབུ་སྐྲ་དག་རྙེད་ན་དེ་ནི་ས་དང་པོ་པར་བལྟའོ། །སེན་མོས་ནི་ས་གཉིས་པར་རོ། །རིང་བསྲེལ་གྱིས་ནི་ས་གསུམ་པར་རོ། །<span class='delete'>ཚམས་</span><span class='add'>  ཚེམས་  </span>ཀྱིས་ནི་ས་བཞི་པར་རོ། །མཆེ་བས་ནི་ས་ལྔ་པར་རོ། །<br>མཛོད་སྤུས་ནི་ས་དྲུག་པར་རོ། །ཕྱག་གིས་ནི་ས་བདུན་པར་རོ། །གཙུག་ཏོར་གྱིས་ནི་ས་བརྒྱད་པར་རོ། །སྐུ་སོ་སོར་ཕྱེ་བས་ནི་ས་དགུ་པར་རོ། །སྐུ་རིལ་པོ་ནི་ས་བཅུ་པར་རོ། །རྡོ་རྗེས་རབ་འཇོམས་<br>གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་དེ་བཞིན་གཤེགས་པའི་དབུ་སྐྲ་འཐོར་བ་དག་རྙེད་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དགུ་པར་བལྟ་<span class='delete'>སྟེ། </span><span class='add'>  སྟེ།   </span>སྔོན་གྱིས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་<br>པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱིས་ཀྱང་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་པ་ཡིན་ལ། དེའི་ལས་ཀྱི་སྒྲིབ་པ་ཐམས་ཅད་ཀྱང་ཚེ་རྗེས་པས་རྣམ་པར་དག་པར་འགྱུར་རོ། །གལ་ཏེ་ཁྱིམ་པའི་"
 ],
 [
  "78.241b",
  "གསུམ་པར་བལྟའོ། །གལ་ཏེ་ནང་དུ་ཡང་དག་འཇོག་<span class='delete'>ནས་</span><span class='add'>  ན་ས་  </span>བཞི་པར་བལྟའོ། །གལ་ཏེ་དབེན་པ་ལ་འདུག་ན་ས་ལྔ་པར་བལྟའོ། །གལ་ཏེ་སྨྲ་ཞིང་འགྲོ་ལ་མཐོང་<span class='delete'>ནས་</span><span class='add'>  ན་ས་  </span>དྲུག་པར་བལྟའོ། །གལ་ཏེ་རབ་ཏུ་འདུད་ཅིང་<br>འགྲོ་ལ་མཐོང་<span class='delete'>ནས་</span><span class='add'>  ན་ས་  </span>བདུན་པར་བལྟའོ། །གལ་ཏེ་ཆོས་འཕྲུལ་བྱེད་ཅིང་འགྲོ་ལ་མཐོང་<span class='delete'>ནས་</span><span class='add'>  ན་ས་  </span>བརྒྱད་པར་བལྟའོ། །གལ་ཏེ་སྤྲུལ་པ་སྤྲུལ་ཞིང་འགྲོ་<span class='delete'>ནས་</span><span class='add'>  ན་ས་  </span>དགུ་<span class='delete'>བར་</span><span class='add'>  པར་  </span>བལྟའོ། །གལ་ཏེ་གཡས་གཡོན་ཏུ་བལྟ་ཞིང་འགྲོ་ལ་<br>སྨྲ་ཞིང་སྟོང་པ་ཉིད་རྗོད་<span class='delete'>ནས་</span><span class='add'>  ན་ས་  </span>བཅུ་པར་བལྟའོ། །རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་དེ་བཞིན་གཤེགས་པ་འཁོར་གྱི་ནང་ན་ཆོས་སྟོན་པ་མཐོང་ལ་རྣམ་པར་མི་ཤེས་ན་བྱང་ཆུབ་<br>སེམས་དཔའ་དེའི་ས་བཅུ་པོ་དག་ལས་ས་གང་ཡང་རུང་བར་བལྟ་སྟེ། དེས་ནི་སྟོན་པ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའི་ཆོས་སྨྲ་<span class='delete'>པ་</span><span class='add'>  བ་  </span>ལ་འདི་ནི་ཤེས་བཞིན་དུ་སྤྱོད་པ་མ་ཡིན་ནོ་ཞེས་སྨད་པ་ཡིན་པས་དེས་དགེ་བའི་བཤེས་གཉེན་<br>དང་མི་འབྲལ་བར་ཐོས་པ་ཡོངས་སུ་བཙལ་བར་བྱ་ཞིང་དེས་ཀླགས་ལྟ་བ་མེད་པར་ཡང་བྱའོ། །དེས་ན་དེའི་ལས་ཀྱི་སྒྲིབ་པ་དེ་རྣམ་པར་དག་པར་འགྱུར་རོ། །གལ་ཏེ་དེ་བཞིན་གཤེགས་པ་དེ་སྦྱིན་པའི་གཏམ་སྟོན་<br>པ་ཐོས་ན་ནི་དེ་ས་དང་བོ་པར་བལྟའོ། །ཚུལ་ཁྲིམས་ཀྱི་གཏམ་གྱིས་ནི་ས་གཉིས་<span class='delete'>བར་</span><span class='add'>  པར་  </span>རོ། །བཟོད་པའི་གཏམ་གྱིས་ནི་ས་གསུམ་པར་རོ། །བརྩོན་འགྲུས་ཀྱི་གཏམ་གྱི་ནི་ས་བཞི་པར་<span class='delete'>རོ་། </span><span class='add'>  རོ། །  </span>བསམ་གཏམ་གྱི་གཏམ་<br>གྱིས་ནི་ས་ལྔ་པར་རོ། །ཤེས་རབ་ཀྱི་གཏམ་གྱིས་ནི་ས་དྲུག་པར་རོ། །སྙིང་རྗེ་ཆེན་པོའི་གཏམ་གྱིས་<span class='delete'>ནི་</span><span class='add'>  ནི་ས་  </span>བདུན་པར་རོ། །སོ་སོ་ཡང་དག་པར་རིག་པའི་གཏམ་གྱིས་ནི་ས་བརྒྱད་པར་རོ། །ཏིང་ངེ་<br>འཛིན་གྱི་གཏམ་གྱིས་ནི་ས་དགུ་པར་<span class='delete'>རོ། ། </span><span class='add'>  རོ།   །  </span>སྟོབས་ཡོངས་སུ་རྫོགས་པའི་གཏམ་གྱིས་ནི་ས་བཅུ་པར་རོ། །རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གི་རྨི་ལམ་ན་དེ་བཞིན་གཤེགས་པའི་རྫུ་འཕྲུལ་"
 ],
 [
  "78.242a",
  "གྱིས་ནམ་མཁའ་ལ་<span class='delete'>གཤིགས་</span><span class='add'>  གཤེགས་  </span>པ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བདུན་པ་ལ་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་པར་བལྟ་སྟེ། དེས་ནི་ནང་དུ་ཡང་དག་འཇོག་ལ་གདུ་བར་བྱ་ཞིང་ཆོས་ཟབ་མོ་ལ་བཟོད་པ་དང་<br>ལྡན་པར་ཡང་བྱའོ། །དེས་ན་མྱུར་དུ་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པར་འགྱུར་རོ། །གལ་ཏེ་དེ་བཞིན་གཤེགས་པ་ནམ་མཁའ་ལ་བཞུགས་པར་མཐོང་ན་ནི་ས་དང་པོར་རོ། །གཤེགས་པས་ནི་ས་གཉིས་པར་<br>རོ། །ས་ལ་བཞུགས་ཤིང་འོད་རབ་ཏུ་འགྱེད་པས་ནི་ས་གསུམ་<span class='delete'>པར་</span><span class='add'>  པར་རོ།  །  </span>བཞུགས་ཤིང་ཆོས་སྟོན་པས་ནི་ས་བཞི་པར་རོ། །ཆོ་འཕྲུལ་མཛད་པས་ནི་ས་ལྔ་པར་རོ། །ས་ལ་བཞུགས་ཤིང་སྙོམས་པར་ཞུགས་པས་ནི་ས་དྲུག་པར་རོ། །ས་ལ་བཞུགས་<br>ཤིང་འོད་གྱེན་དུ་གཏོང་བས་ནི་ས་བདུན་པར་རོ། །བཞེངས་ཤིང་ནམ་མཁའ་ལ་གཤེགས་པ་དང་མི་སྣང་བར་མཛད་པས་ནི་ས་བརྒྱད་པ་ལ་གནས་པར་འགྱུར་རོ། །རྡོ་རྗེས་རབ་འཇོམ་གཞན་ཡང་བྱང་ཆུབ་སེམས་<br>དཔའ་གང་གིས་རྨི་ལམ་ན་དེ་བཞིན་གཤེགས་པ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་མཐོང་<span class='delete'>ན་། </span><span class='add'>  ན།   </span>དེས་ནི་དམ་པའི་ཆོས་སྤངས་པ་དང་། རབ་ཏུ་བྱུང་ནས་ཀྱང་ཚུལ་འཆོས་པ་དང་། བརྫུན་གྱིས་རྙེད་པ་ཡོངས་སུ་<br>བཙལ་བ་ཡིན་<span class='delete'>བས་</span><span class='add'>  པས་  </span>དེས་དཀོན་མཆོག་གསུམ་ལ་བསྙེན་བཀུར་བྱ་བ་ལ་བརྩོན་པར་བྱ་ཞིང་ཆོས་སྨྲ་བ་རྣམས་ལ་ཡང་གོས་ཀྱི་སྦྱིན་པ་བྱ། སྒོ་གསུམ་ཡང་ཤིན་དུ་བསྡམ་པར་བྱའོ། །དེས་ན་དེའི་ལས་ཀྱི་སྒྲིབ་པ་<br>དེ་རྣམ་པར་དག་པར་འགྱུར་<span class='delete'>ཏོ། །</span><span class='add'>  ཏེ། །  </span>དེས་ནི་ས་དང་<span class='delete'>པོ་</span><span class='add'>  པོ་ལྔ་པོ་  </span>དག་ལས་ས་གང་ཡང་རུང་བར་བལྟའོ། །རྡོ་རྗེས་རབ་<span class='delete'>འཛོམས་</span><span class='add'>  འཇོམས་  </span>གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་དེ་བཞིན་གཤེགས་པ་ཞུགས་<br>ལ་བཞེན་པ་མཐོང་<span class='delete'>ན་། </span><span class='add'>  ན།   </span>དེས་ནི་སྡིག་པའི་གྲོགས་པོའི་དབང་གིས་དམ་པའི་ཆོས་ནུབ་པ་ལ་རྗེས་སུ་ཡི་རང་བར་བྱས་པ་ཡིན་ཏེ། བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་པར་བལྟའོ། །བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་"
 ],
 [
  "78.243a",
  "ཚུལ་དུ་གནས་པ་ཞིག་གིས་དབུ་སྐྲ་དག་རྙེད་ན་དེ་ནི་ས་དང་པོར་པར་བལྟའོ། །གལ་ཏེ་ཁྱིམ་ནས་ངེས་པར་<span class='delete'>བྱང་</span><span class='add'>  བྱུང་  </span>བ་ཞིག་གིས་རྙེད་<span class='delete'>ནས་</span><span class='add'>  ན་ས་  </span>གཉིས་པར་བལྟའོ། །སྲང་དུ་སོང་བ་ཞིག་གིས་<br>རྙེད་<span class='delete'>ནས་</span><span class='add'>  ན་ས་  </span>གསུམ་པར་བལྟའོ། །གལ་ཏེ་<span class='delete'>གསུམ་</span><span class='add'>  སུམ་  </span>མདོར་རྙེད་<span class='delete'>ནས་</span><span class='add'>  ན་ས་  </span>བཞི་པར་བལྟའོ། །གྲོང་ཁྱེར་གྱི་སྒོར་རྙེད་ན་ས་ལྔ་པར་བལྟའོ། །ཕྱིར་བྱུང་བས་རྙེད་ན་ས་དྲུག་པར་བལྟའོ། །བསྐྱེད་མོས་ཚལ་ན་འདུག་<br>པས་རྙེད་ན་ས་བདུན་པར་བལྟའོ། །སྐྱེ་<span class='delete'>བོའི་</span><span class='add'>  བོའི་  </span>ནང་ན་འདུག་པས་རྙེད་ན་ས་བརྒྱད་པར་བལྟའོ། །ནམ་མཁའ་ལས་རྙེད་ན་ས་དགུ་པར་བལྟའོ། །སྙོམས་པར་ཞུགས་པས་རྙེད་ན་ས་བཅུ་པར་<br>བལྟའོ། །རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་སྔོན་མ་མཐོང་བའི་མཆོད་རྟེན་དག་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ལས་ཀྱི་སྒྲིབ་པ་ཆུང་ཞིང་དེ་ལ་བདུད་<span class='delete'>ཀྱིས་</span><span class='add'>  ཀྱི་  </span>ལས་<br>ཀྱང་ཆུང་བར་རིག་པར་བྱ་སྟེ། གལ་ཏེ་དེ་དགེ་བའི་བཤེས་གཉེན་དག་ལ་སྟེན་པར་བྱེད་ན་ཆོས་ཀྱི་བཟོད་པ་ཡང་རྟོགས་པར་འགྱུར་ཞིང་གཟུངས་ཀྱང་ཐོབ་པར་འགྱུར་ཏེ། དེ་ནི་ས་བཅུ་པོ་ཐམས་<br>ཅད་དུ་ཤེས་པར་བྱའོ། །གལ་ཏེ་དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་འཇིམ་པ་ལས་བྱས་<span class='delete'>བ་</span><span class='add'>  པ་  </span><span class='delete'>མ་</span><span class='add'>  མཐོང་  </span><span class='delete'>ཟོད་</span><span class='add'>    </span>ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་པར་བལྟའོ། །གལ་ཏེ་རྡོ་ལས་བྱས་པ་མཐོང་ན་ས་<br>གཉིས་པར་བལྟའོ། །གལ་ཏེ་རྡོ་ཐལ་གྱིས་བྱི་དོར་བྱས་པ་མཐོང་ན་ས་གསུམ་པར་བལྟའོ། །གལ་ཏེ་སྟེགས་བུ་དང་གདུགས་བྱི་དོར་བྱས་པ་མཐོང་ན་ས་བཞི་པར་<span class='delete'>བལྟའོ། </span><span class='add'>  བལྟའོ། །  </span>གལ་ཏེ་<span class='delete'>རྡོའི་</span><span class='add'>  རྡོའི་  </span><br>ཀ་བ་བྱི་དོར་བྱས་པ་མཐོང་<span class='delete'>ནས་</span><span class='add'>  ན་ས་  </span>ལྔ་པར་བལྟའོ། །གལ་ཏེ་གསེར་གྱིས་སྦྲེལ་བ་མཐོང་ན་ས་དྲུག་པར་བལྟའོ། །གལ་ཏེ་རིན་པོ་ཆེའི་དྲ་བས་ཀུན་དུ་གཡོགས་པ་མཐོང་ན་ས་བདུན་<span class='delete'>པར་</span><span class='add'>  པར་བལྟའོ། །  </span><span class='delete'>རོ། །</span><span class='add'>    </span>གལ་ཏེ་དྲིལ་བུ་གཡེར"
 ],
 [
  "78.243b",
  "ཀའི་དྲ་བས་ཀུན་ནས་གཡོགས་པ་མཐོང་ན་ས་བརྒྱད་པར་བལྟའོ། །ས་དང་པོ་བདུན་པོ་དག་ལ་མཐོང་པ་གང་ཡིན་<span class='delete'>བ་</span><span class='add'>  པ་  </span>དེ་ནི་<span class='delete'>བདུད་</span><span class='add'>  བདུད་ཀྱི་ལས་  </span>ཀྱང་རིག་པར་བྱའོ། །ས་དགུ་པ་དང་། ས་བཅུ་པ་དག་ལ་ནི་རྨི་ལམ་ལོག་པར་<br>མཐོང་བ་མེད་དོ། །རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་རིན་པོ་ཆེས་<span class='delete'>བརྒྱད་</span><span class='add'>  བརྒྱན་  </span><span class='delete'>བདག་</span><span class='add'>  པ་དག་  </span>མཐོང་ན། དེ་ནི་<span class='delete'>རང་</span><span class='add'>  རིང་  </span>པོར་མི་ཐོགས་པར་<br>མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་བར་འགྱུར་ཞིང་དེ་ལ་ལྷ་རྣམས་ཀྱང་སེམས་པར་འགྱུར་ཏེ། བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བརྒྱད་པར་རིག་པར་བྱའོ། །རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་<br>དཔའ་གང་གིས་རྨི་ལམ་ན་དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་ཆོ་འཕྲུལ་མཛད་པ་དག་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ཚེ་འདི་ཉིད་ལ་ལས་ཀྱི་སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་དག་པར་འགྱུར་<span class='delete'>ཏོ། །</span><span class='add'>  ཏོ། །  </span>བྱང་ཆུབ་<br>སེམས་དཔའ་དེ་ནི་ས་བརྒྱད་པར་བལྟ་ཞིང་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱིས་ཀྱང་བསམས་པ་ཡིན་ནོ། །དེས་སྡིག་པའི་གྲོགས་པོ་དག་ཡོངས་སུ་སྤང་བར་བྱ་ཞིང་ས་དང་པོ་ལ་དད་པར་བྱ། ས་<br>གཉིས་པ་ལ་ཡེ་ཤེས་ཡོངས་སུ་བཙལ། ས་གསུམ་པ་ལ་མོས་པ་མང་དུ་བྱ། ས་བཞི་པ་ལ་སེམས་དག་པར་བྱ། ས་ལྔ་པ་ལ་དད་པས་མོས་པར་བྱ། ས་དྲུག་པ་ལ་སེམས་མཉམ་པར་བྱ། <br>ས་བདུན་པ་ལ་དོན་དམ་པ་ལ་མོས་པར་བྱ། ས་བརྒྱད་པ་ལ་བཀོད་པ་དག་ལ་མོས་པར་བྱ། ས་དགུ་པ་ལ་ནི་བྱིན་གྱིས་བརླབས་བྱའོ། །ས་བཅུ་པ་ལ་ནི་གང་དག་གཞན་ལ་གནས་པ་དེའི་མཚན་<br>མ་བྱུང་བར་གྱུར་པ་དེ་དག་གི་ཆོས་དེ་ལ་ཕྱིན་ཅི་ལོག་མེད་པར་བལྟའོ། །ས་དང་པོ་དང་བདུན་པའི་བར་དག་ལ་ནི་བདུད་ཀྱི་ལས་ཀྱང་རིག་པར་<span class='delete'>བྱའོ། </span><span class='add'>  བྱའོ། །  </span>གོང་མ་དག་ལ་ནི་བདུད་ཀྱི་བར་ཆད་བྱེད་པར་མི་ནུས་སོ། །རྡོ་རྗེས་"
 ],
 [
  "78.244a",
  "རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་དེ་བཞིན་གཤེགས་པའི་འོད་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་གསུམ་པར་བལྟ་སྟེ། དེས་ནི་གཞན་<br>དག་གིས་བསམ་པ་ཡོངས་སུ་རྫོགས་པར་བྱ་བ་ལ་བསླབ་པར་བྱའོ། །གལ་ཏེ་བརྩོན་འགྲུས་བྱས་ན་གཟུངས་ཐོབ་པར་འགྱུར་ཞིང་ས་བཅུ་པོ་ཐམས་ཅད་དུ་ཡང་འགྱུར་རོ། །རྡོ་རྗེས་རབ་འཇོམ་གཞན་ཡང་<br>བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་དེ་བཞིན་གཤེགས་པའི་སྒྲ་ཐོས་ལམ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བཞི་པར་བལྟ་སྟེ། དེས་ནི་རྒྱལ་པོར་གྱུར་ཅིང་ལོངས་སྤྱོད་དང་ལྡན་པ་ན་སེམས་ཅན་<br>རྣམས་སངས་རྒྱས་ལ་ལྟ་བ་དང་ཕྲལ་ཞིང་རབ་ཏུ་བྱུང་ནས་ཀྱང་གཡོས་ཆོས་ལ་དཔྱས་བྱས་པ་ཡིན་པས་དེས་ཕུང་པོ་གསུམ་པའི་ཆོས་ཀྱི་རྣམ་གྲངས་ཟླ་བར་ཉིན་མཚན་དུ་མངོན་པར་བྱའོ། །དེས་ན་དེའི་<br>ལས་ཀྱི་སྒྲིབ་པ་དེ་རྣམ་པར་དག་པར་འགྱུར་རོ། །རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་བདག་དེ་བཞིན་གཤེགས་པའི་སྐུ་ཡིན་<span class='delete'>བར་</span><span class='add'>  པར་  </span>ཀུན་དུ་ཤེས་ན་བྱང་ཆུབ་<br>སེམས་དཔའ་དེ་ནི་ས་དང་པོ་པར་རིག་པར་བྱ་<span class='delete'>ཞིང་</span><span class='add'>  ཞིང་ས་  </span>དགུ་པའི་བར་དུ་རིག་པར་བྱ་སྟེ། བྱང་ཆུབ་སེམས་དཔའ་དེས་ནི་གཟུངས་བསྒྲུབ་པར་ནུས་ཤིང་ཏིང་ངེ་འཛིན་བསྒྲུབ་པར་ཡང་ནུས་ལ་མངོན་པར་ཤེས་པ་བསྒྲུབ་<br>པར་ཡང་ནུས་སོ། །བྱང་ཆུབ་སེམས་དཔའ་དེ་ལ་ནི་སངས་རྒྱས་ཀྱང་དགོངས་པར་མཛད་པས་དེས་ཀྱང་སེམས་མཉམ་པར་<span class='delete'>བྱའོ། </span><span class='add'>  བྱའོ། །  </span>དེས་ན་མྱུར་དུ་བྱང་ཆུབ་འགྲུབ་པར་འགྱུར་ཞིང་མངོན་པར་<br>རྫོགས་པར་བྱང་ཆུབ་པར་ཡང་འགྱུར་རོ། །གང་གིས་དེ་བཞིན་གཤེགས་པ་བཞེངས་པ་ལ་བསོད་སྙོམས་འབུལ་པ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་པར་<span class='delete'>བལྟའོ། </span><span class='add'>  བལྟའོ། །  </span>གང་བཞུགས་པ་"
 ],
 [
  "78.245a",
  "རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་དེ་བཞིན་གཤེགས་པ་ན་བཟའ་དྲི་མ་ཅན་གསོལ་བ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ལས་ཀྱི་སྒྲིབ་པ་ཆེ་བ་སྟེ། <br>ས་དང་པོ་བཞི་པོ་དག་ལས་ས་གང་ཡང་རུང་བར་བལྟའོ། །གལ་ཏེ་དེ་ལ་ཤིན་དུ་གནོད་པ་བྱེད་པའི་རྐྱེན་མི་འདོད་པ་དག་འབྱུང་བར་འགྱུར་ན་<span class='delete'>ས་</span><span class='add'>    </span>ས་དང་པོ་པར་བལྟའོ། །གལ་ཏེ་འདྲེན་མར་འབྱུང་ན་ས་གཉིས་པར་<br>བལྟའོ། །གལ་ཏེ་ལུས་ཀྱིས་འབྱུང་ན་ས་གསུམ་པར་བལྟའོ། །གལ་ཏེ་སེམས་ཀྱིས་འབྱུང་ན་ས་བཞི་པར་བལྟའོ། །གལ་ཏེ་རྨི་ལམ་ན་བདག་ལ་བདག་གནོད་པ་བྱེད་ན་དེ་ནི་ས་ལྔ་བར་བལྟའོ། །<br>ཡོངས་སུ་རྫོགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་ནི་ཐ་ན་རྨི་ལམ་ན་ཡང་ལས་ཀྱི་རྣམ་པར་སྨིན་པ་མྱོང་བ་མེད་དོ། །དེས་མངོན་པའི་ང་རྒྱལ་མེད་པར་བྱ་ཞིང་ཕྲག་དོག་མེད་པར་སེམས་ཅན་རྣམས་ཀྱང་གཞན་<br>མཆོད་པ་ཡང་དག་པར་འཛིན་དུ་གཞུགས་པར་བྱ། དེས་ཡང་དང་ཡང་དུ་ཕུང་པོ་གསུམ་པའི་མདོ་སྡེ་ཡང་ཁ་ཏོན་དུ་བྱ་སྟེ། དེས་ན་དེའི་ལས་ཀྱི་སྒྲིབ་པ་དེ་རྣམ་པར་དག་པར་འགྱུར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>རྡོ་རྗེས་རབ་འཇོམས་<br>གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་སྔོན་མ་ཐོས་པའི་ཆོས་དག་ཐོས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་སངས་རྒྱས་མང་པོ་ལ་བསྙེན་བཀུར་བྱས་པ་དང་། ཆོས་སྨྲ་བའི་གང་ཟག་མང་པོ་དག་ལ་ཡང་<br>བསྙེན་བཀུར་བྱས་པ་ཡིན་<span class='delete'>བར་</span><span class='add'>  པར་  </span>རིག་པར་བྱ་སྟེ། བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་བདུན་པོ་དག་ལས་ས་གང་ཡང་རུང་བར་བལྟ་སྟེ། དེས་ནི་ཇི་སྐད་སྨྲས་པ་དེ་བཞིན་དུ་བྱེད་པར་བྱ་སྟེ། དེས་ནི་མྱུར་བ་ཉིད་དུ་<br>བྱང་ཆུབ་ཏུ་ངེས་པར་འབྱུང་བར་འགྱུར་རོ། །གལ་ཏེ་ཆོས་ཀྱི་གཏམ་སྣ་ཚོགས་དག་ཐོས་ན་ནི་ས་དང་པོ་པར་བལྟའོ། །གལ་ཏེ་ཡོ་བྱད་བསྙུངས་པའི་གཏམ་དག་ཐོས་ན་ནི་ས་གཉིས་པར་བལྟའོ། །གལ་ཏེ་"
 ],
 [
  "78.244b",
  "ལ་འབུལ་བ་དེ་ནི་ས་གཉིས་པར་བལྟའོ། །གང་བཀོད་པ་ཕུན་སུམ་ཚོགས་པ་ལ་འབུལ་བ་དེ་ནི་ས་གསུམ་པར་བལྟའོ། །གང་གཉེན་མང་བ་ཀྱིས་ཡོངས་སུ་བསྐོར་བ་ལ་འབུལ་བ་དེ་ནི་ས་བཞི་པར་བལྟའོ། །གང་<br>སྐྱེ་བོ་མང་པོས་ཡོངས་སུ་བསྐོར་བ་ལ་འབུལ་བ་དེ་ནི་ས་ལྔ་པར་རོ། །གང་སྐྱེ་བོ་གཉིས་གས་ཡོངས་སུ་བསྐོར་བ་ལ་འབུལ་བ་དེ་ནི་ས་དྲུག་པར་རོ། །གང་བཀོད་པ་ཐམས་ཅད་ལ་སྙོམས་པར་ཞུགས་པ་ལ་<br>འབུལ་བ་དེ་ནི་ས་བདུན་པར་རོ། །གང་བསྟོད་པ་མཛད་པ་ལ་འབུལ་བ་དེ་ནི་ས་བརྒྱད་པར་རོ། །གང་ཆོ་འཕྲུལ་མཛད་པ་ལ་འབུལ་བ་དེ་ནི་ས་དགུ་པར་ཏེ། ཐམས་<span class='delete'>ཅད་</span><span class='add'>  ཅད་དུ་  </span>ཡང་བདུད་ཀྱི་ལས་ནི་རྟོགས་<br>པར་བྱའོ། །རྡོ་རྗེས་རབ་<span class='delete'>འཇོམས་</span><span class='add'>  འཇོམ་  </span>གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་བདག་དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་ལ་མེ་ཏོག་གམ། མེ་ཏོག་ཕྲེང་ངམ། སྤོས་སམ། ཙན་དན་གྱི་ཕྱེ་མ་དག་<br>གསོལ་<span class='delete'>ལམ། །</span><span class='add'>  ལམ།    </span>བྱུག་པས་སྐུད་པར་ཀུན་ཏུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་<span class='delete'>ལྔ་</span><span class='add'>    </span>ལྔ་པོ་དག་ལས་ས་གང་ཡང་རུང་བར་བལྟ་སྟེ། སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ལས་གལ་ཏེ་སད་པ་ན། སྦྱིན་པའི་<br>མཚན་མ་དེ་དག་ཀྱང་དྲན་ཞིང་སྦྱིན་པ་ལ་སེམས་ཀྱིས་རློམ་སེམས་སུ་མི་བྱེད་ན་དེ་ནི་ས་དང་པོར་པར་བལྟའོ། །གལ་ཏེ་ཚུལ་ཁྲིམས་ལ་སེམས་ཀྱིས་རློམ་སེམས་སུ་མི་བྱེད་ན་ས་གཉིས་པར་བལྟའོ། །གལ་<br>ཏེ་བཟོད་པ་ལ་སེམས་ཀྱིས་རློམ་སེམས་སུ་མི་བྱེད་ན་ས་གསུམ་པར་བལྟའོ། །གལ་ཏེ་བརྩོན་འགྲུས་ལ་སེམས་ཀྱིས་རློམ་སེམས་སུ་མི་བྱེད་ན་ས་བཞི་པར་བལྟའོ། །གལ་ཏེ་བསམ་གཏན་ལ་སེམས་<br>ཀྱིས་རློམ་སེམས་སུ་མི་<span class='delete'>བྱེ་</span><span class='add'>  བྱེད་  </span>ན་ས་ལྔ་པར་བལྟའོ། །དེས་ཀྱང་སེམས་ཅན་ཐམས་ཅད་ལ་ཞེ་འགྲས་པ་མེད་པའི་སེམས་སུ་བྱ་སྟེ། དེས་ན་མྱུར་བ་ཉིད་དུ་ཕྱིར་མི་ལྡོག་པའི་ས་གནོན་པར་འགྱུར་<span class='delete'>རོ།</span><span class='add'>  རོ། །  </span>རྡོ་"
 ],
 [
  "78.246a",
  "གང་ཡང་རུང་བར་བལྟའོ། །གལ་ཏེ་ཚིགས་སུ་བཅད་པའི་སྡེ་སྨྲ་ལ་མདོའི་སྡེ་མ་ཡིན་ན་ནི་ས་དང་པོ་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གལ་སྟེ་<span class='delete'>མདོའི་</span><span class='add'>  མདོའི་  </span>སྡེ་སྨྲ་ན་ནི་ས་གཉིས་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གལ་ཏེ་ཚིག་སུ་བཅད་པའི་<br>སྡེ་དང་མདོའི་སྡེ་སྨྲ་ན་ནི་ས་གསུམ་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གལ་ཏེ་སྣ་ཚོགས་སྨྲ་ན་ནི་ས་བཞི་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གལ་ཏེ་ཟབ་མོ་སྨྲ་ན་ནི་ས་ལྔ་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>སོ་སོ་ཡང་དག་པར་རིག་པར་སྨྲ་ན་ནི་ས་དྲུག་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>རྡོ་རྗེས་རབ་<br>འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་བདག་ཆོས་ཀྱི་ཁྲི་སྟན་ལ་འདུག་སྟེ་ཆོས་སྟོན་པ་ཀུན་དུ་ཤེས་ན་དེས་ནི་སྔོན་གྱི་སངས་རྒྱས་རྣམས་ཀྱི་ཁྲི་སྟན་བཤམས་ཤིང་བདག་ཉིད་ཀྱི་བཤམས་<br>པ་ཡིན་ཏེ། བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ཟབ་མོ་ལ་བཟོད་པའི་སྣོད་དུ་གྱུར་ཅིང་ས་དང་པོ་བརྒྱད་པོ་དག་ལས་ས་གང་ཡར་རུང་བར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གལ་<span class='delete'>ཏེ་</span><span class='add'>  ཏེ་མ་  </span>མགུ་བར་བྱས་ཏེ་སྟོན་ན་ནི་ས་དང་པོ་པར་བལྟའོ། །གལ་ཏེ་མགུ་<br>བར་བྱས་ཏེ་སྟོན་ན་ནི་ས་གཉིས་པར་བལྟའོ། །གལ་ཏེ་འབྲེལ་པར་སྟོན་ན་ནི་ས་གསུམ་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གལ་ཏེ་རྒྱུན་རྗེས་སུ་འབྲེལ་པར་སྟོན་ན་ནི་ས་བཞི་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གལ་ཏེ་ཤེས་པ་ཆེན་པོའི་ཡུལ་སྟོན་ན་ནི་ས་ལྔ་པར་<br><span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གལ་ཏེ་ཉན་ཐོས་ཀྱི་ཡུལ་སྟོན་ན་ནི་ས་དྲུག་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའི་ཡུལ་སྟོན་ན་ནི་ས་བདུན་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གལ་ཏེ་སངས་རྒྱས་ཀྱི་ཡུལ་སྟོན་ན་ནི་བྱང་ཆུབ་སེམས་དཔའ་དེ་ས་བརྒྱད་པར་<br><span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་བདག་གནས་སུ་སོན་པར་ཀུན་དུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ལས་ཀྱི་སྒྲིབ་པ་ལས་རྣམ་པར་རྒལ་ཅིང་བདུད་ཀྱི་ལས་ལས་ཤིན་<br>དུ་འདས་པ་ཡིན་ཏེ། ས་དགུ་པོ་དག་ལས་ས་གང་ཡང་རུང་བར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གང་མི་རྫི་བར་གནས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གང་ནོར་རྙེད་ཅིང་གནས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་གཉིས་"
 ],
 [
  "78.245b",
  "ཐེ་ཚོམ་གཅོད་པའི་གཏམ་དག་ཐོས་ན་ནི་ས་གསུམ་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གལ་ཏེ་གཟུངས་ཀྱི་གཏམ་དག་ཐོས་ན་ནི་ས་བཞི་བར་བལྟའོ། །གལ་ཏེ་མཚན་ཉིད་ཀྱི་གཏམ་དག་ཐོས་ན་ནི་ས་ལྔ་བར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གལ་ཏེ་དོན་<br>དམ་པའི་གཏམ་དག་ཐོས་ན་ནི་ས་དྲུག་པར་བལྟའོ། །གལ་ཏེ་གཏམ་ཐམས་ཅད་ཐོས་ན་ནི་ས་བདུན་པར་བལྟ་སྟེ། ས་དང་ས་དག་ལ་དེ་ལྟར་ཤེས་པར་བྱ་ཞིང་ལས་ཀྱི་སྒྲིབ་པ་དག་ཀྱང་རྟོགས་པར་བྱའོ། །རྡོ་རྗེས་<br>རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་མ་བསྟན་པའི་ཆོས་དག་ཤེས་ལ། དེས་སང་ན་<span class='delete'>ནི་</span><span class='add'>    </span>མི་ཤེས་ན་དེས་ནི་ཆོས་ལ་སྒྲིབ་པའི་ལས་བྱས་ཤིང་ཟང་ཟིང་དང་བཅས་པའི་སེམས་ཀྱིས་ཆོས་ཀྱི་<br>སྦྱིན་<span class='delete'>བ་</span><span class='add'>  པ་  </span>བྱིན་པ་ཡིན་པས། དེས་ཆོས་སྨྲ་བ་ལ་<span class='delete'>བསྟེན་</span><span class='add'>  བསྙེན་  </span>བཀུར་བྱ་ཞིང་དངོས་པོ་ཐམས་ཅད་མི་བསྲི་བར་ཆོས་སྨྲ་བ་དག་ལ་དབུལ་བར་བྱའོ། །དེས་ན་དེའི་ལས་ཀྱི་སྒྲིབ་པ་དེ་རྣམ་པར་དག་པར་འགྱུར་ཏེ། བྱང་ཆུབ་སེམས་<br>དཔའ་དེ་ནི་ས་གཉིས་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གལ་ཏེ་རྨི་ལམ་ན་ཆོས་ཐོས་ནས་མ་མཐོང་ན་དེ་ནི་ས་དང་པོ་པར་བལྟའོ། །གལ་ཏེ་སང་ནས་ཀྱང་མ་བརྗེད་ན་དེ་ནི་ས་གཉིས་པར་བལྟའོ། །གང་ལ་ཉམས་པར་མི་འགྱུར་བའི་བྱང་<br>ཆུབ་སེམས་དཔའ་དེ་ནི་ལུང་བསྟན་པའི་ཆོས་ཅན་ཡིན་ཞིང་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་པོ་དག་དང་ལྡན་བར་ཡང་བལྟ་སྟེ། ས་གཞན་དག་གི་བར་ན་གནས་པས་ནི་བཟུང་ནས་མི་ཉམས་ཤིང་ཉམས་པར་ཡང་མི་འགྱུར་རོ། །དེས་ལས་<br>ཀྱི་སྒྲིབ་པ་དང་བདུད་ཀྱི་ལས་དག་ཀྱང་རྟོགས་པར་བྱའོ། །རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་སྔོན་མ་མཐོང་བའི་དགེ་སློང་ཆོས་སྨྲས་བ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱིས་<br>བསམས་པ་ཡིན་ཞིང་དེ་ལ་ལས་ཀྱི་སྒྲིབ་པ་ཆུང་བ་དང་། བདུད་ཀྱི་ལས་ཆུང་བར་རིག་པར་<span class='delete'>བྱའོ། </span><span class='add'>  བྱའོ། །  </span>གལ་ཏེ་བརྩོན་འགྲུས་བྱས་ན་སྣང་བ་ཐོབ་པར་ཡང་འགྱུར་ཏེ། བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་དྲུག་པོ་དག་ལས་ས་"
 ],
 [
  "78.246b",
  "པར་བལྟའོ། །གང་ཆོས་རྙེད་ཅིང་གནས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་གསུམ་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གང་དགེ་བའི་བཤེས་གཉེན་ལ་ལྟ་ཞིང་གནས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བཞི་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གལ་ཏེ་ཚུལ་བཞིན་གྱི་སེམས་<br>གནས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་ལྔ་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གང་ལུས་བདེ་བ་ཉིད་ལ་གནས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དྲུག་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གང་སེམས་བདེ་བ་ཉིད་ལ་གནས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བདུན་པར་<br><span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གང་མངོན་བར་ཤེས་པ་ལ་གནས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བརྒྱད་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གང་ལུང་བསྟན་པ་ལ་གནས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དགུ་པར་བལྟའོ། །རྡོ་རྗེས་རབ་འཇོམས་གཞན་<br>ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་ཉེ་བ་སྟེ། ས་བཅུ་པོ་དག་ལས་ས་གང་ཡང་རུང་བར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>བྱང་ཆུབ་སེམས་དཔའ་གང་<br>གིས་བྱང་ཆུབ་ཀྱི་སྙིང་<span class='delete'>པ་</span><span class='add'>  པོ་  </span>ནི་མཐོང་ལ་བྱང་ཆུབ་ཀྱི་ཤིང་མ་མཐོང་ན་དེའི་ས་དང་པོ་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གང་གིས་བྱང་ཆུབ་ཀྱི་ཤིང་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་གཉིས་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གང་གིས་ཤིང་ལྗོན་པ་མང་པོས་ཡོངས་སུ་<br>བསྐོར་བར་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་གསུམ་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གང་གིས་ལོ་མ་ཕུན་སུམ་ཚོགས་པར་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བཞི་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གང་གིས་མེ་ཏོག་ཕུན་སུམ་ཚོགས་པ་མཐོང་ན་<br>བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་ལྔ་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གང་གིས་འབྲས་བུ་ཕུན་སུམ་ཚོགས་པར་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དྲུག་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གང་གིས་གདན་བཤམས་པར་མཐོང་ན་བྱང་ཆུབ་སེམས་<br>དཔའ་དེ་ནི་ས་བདུན་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གང་གིས་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་མིས་ཡོངས་སུ་བསྐོར་བ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བརྒྱད་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གང་གིས་ཀླུས་ཡོངས་སུ་བསྐོར་བ་མཐོང་ན་བྱང་ཆུབ་"
 ],
 [
  "78.247b",
  "གདན་བཤམས་པར་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་གཉིས་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གང་གིས་གདན་སྣ་ཚོགས་བཤམས་པར་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་གསུམ་པར་བལྟའོ། །གང་གིས་གདན་<br>ལ་མེ་ཏོག་མངོན་བར་བཀྲམ་པར་མཐོང་ན་བྱང་ཆུབ་སེམས་དེ་ནི་ས་བཞི་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གང་གིས་སྟེང་དུ་བླ་རེ་སྣ་ཚོགས་བྲེས་པར་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་ལྔ་བར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གང་གིས་བར་སྣང་<br>ལས་གླུ་དབྱངས་ཀྱི་སྒྲ་དག་ཐོས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དྲུག་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གང་གིས་གདན་གྱི་སྟེང་ན་རིན་པོ་<span class='delete'>ཚེའི་</span><span class='add'>  ཆེའི་  </span>དྲ་བས་ཡོངས་སུ་གཡོགས་པའི་གདུགས་དཀར་པོ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་<br>ནི་ས་བདུན་པར་བལྟའོ། །རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་དེ་བཞིན་གཤེགས་པ་<span class='delete'>ཡོང་</span><span class='add'>  ཡོངས་  </span>སུ་མྱ་ངན་ལས་འདས་པའི་མཆོད་རྟེན་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་<br>ས་དང་པོ་བརྒྱད་པོ་དག་ལས་ས་གང་ཡང་རུང་བར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>དེ་ནི་བྱང་ཆུབ་ཏུ་ཉེ་ཞིང་ལས་ཀྱི་སྒྲིབ་པ་ཆུང་བར་བལྟ་སྟེ། གང་གིས་དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་རྡུལ་ཆགས་པར་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་<br>དེ་<span class='delete'>ན་</span><span class='add'>  ནི་  </span>ས་དང་པོ་པར་བལྟའོ། །གང་གིས་རྡུལ་མེད་ཅིང་དག་པར་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་གཉིས་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གང་གིས་རྩྭའི་རིགས་འདྲེས་པ་དག་སྐྱེས་པར་མཐོང་ན་<span class='delete'>ཡང་</span><span class='add'>    </span>བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་<br>གསུམ་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གང་གིས་རྩྭ་སྔོན་པོ་དག་སྐྱེས་པར་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བཞི་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གང་གིས་མེ་ཏོག་རྒྱས་པའི་ཤིང་ལྗོན་པ་སྣ་ཚོགས་ཀྱིས་ཡོངས་སུ་བསྐོར་བར་མཐོང་<br>ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་ལྔ་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གང་གིས་མེ་ཏོག་དང་འབྲས་བུ་ཕུན་སུམ་ཚོགས་པར་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དྲུག་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གང་གིས་འདབ་ཆགས་སྣ་"
 ],
 [
  "78.248a",
  "ཚོགས་དག་སྐང་འབྱིན་པར་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བདུན་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གང་གིས་རྒྱལ་མཚན་<span class='delete'>ད་</span><span class='add'>  དང་།   </span><span class='delete'>ང། </span><span class='add'>    </span>བླ་རེ་<span class='delete'>དང་། </span><span class='add'>  དང་།   </span>གདུགས་དག་གིས་བརྒྱན་པར་མཐོང་ན་བྱང་ཆུབ་<br>སེམས་དཔའ་དེ་ནི་ས་བརྒྱད་པར་བལྟའོ། །རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་དེ་བཞིན་གཤེགས་པའི་ཆོས་གོས་རྙེད་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་<br>དང་པོ་བརྒྱད་པོ་དག་ལས་ས་གང་ཡང་རུང་བར་བལྟ་སྟེ། དེས་ནི་སངས་རྒྱས་རྗེས་སུ་དྲན་<span class='delete'>བ་</span><span class='add'>  པ་  </span>ལ་མངོན་པར་བརྩོན་པས་ཡེ་ཤེས་ཡོངས་སུ་བཙལ་བར་བྱའོ། །བྱང་ཆུབ་སེམས་དཔའ་དེ་<br>ནི་ལས་ཀྱི་སྒྲིབ་པ་ཆུང་བ་ཡིན་<span class='delete'>ཏེ་། </span><span class='add'>  ཏེ།   </span>གལ་ཏེ་དེ་བཞིན་གཤེགས་པའི་ཆོས་གོས་དྲི་མ་ཅན་རྙེད་ན་ནི་བྱང་ཆུབ་སེམས་དཔའ་དེ་ས་དང་པོ་པར་བལྟའོ། །གལ་ཏེ་དེ་བཞིན་གཤེགས་པའི་ཆོས་<br>གོས་དྲི་མ་མེད་པ་རྙེད་ན་ནི་བྱང་ཆུབ་སེམས་དཔའ་དེ་ས་གཉིས་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གལ་ཏེ་དེ་བཞིན་གཤེགས་པའི་ཆོས་གོས་ཚོན་གྱིས་བསྒྱུར་བ་རྙེད་ན་ནི་བྱང་ཆུབ་སེམས་དཔའ་དེ་ས་གསུམ་པར་<br>བལྟའོ། །གལ་ཏེ་དེ་བཞིན་གཤེགས་པའི་ཆོས་གོས་བཅགས་ཤིང་ཤིན་དུ་བྱི་དོར་བྱས་པ་རྙེད་ན་ནི་བྱང་ཆུབ་སེམས་དཔའ་དེ་ས་བཞི་པར་<span class='delete'>བལྟའོ། </span><span class='add'>  བལྟའོ།   </span>གལ་ཏེ་དེ་བཞིན་གཤེགས་པའི་<br>ཆོས་གོས་འོད་དང་ལྡན་<span class='delete'>བ་</span><span class='add'>  པ་  </span>རྙེད་ན་ནི་བྱང་ཆུབ་སེམས་དཔའ་དེ་ས་ལྔ་པར་བལྟའོ། །གལ་ཏེ་དེ་བཞིན་གཤེགས་པའི་ཆོས་གོས་<span class='delete'>ཚོ་</span><span class='add'>  ཆོ་  </span>འཕྲུལ་བྱེད་པ་རྙེད་ན་ནི་བྱང་ཆུབ་སེམས་དཔའ་དེ་ས་དྲུག་པར་<br>བལྟའོ། །གལ་ཏེ་དེ་བཞིན་གཤེགས་པའི་ཆོས་<span class='delete'>དགོས་</span><span class='add'>  གོས་  </span>གཅིག་རྙེད་ན་ནི་བྱང་ཆུབ་སེམས་དཔའ་དེ་ས་བདུན་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གལ་ཏེ་དེ་བཞིན་གཤེགས་པའི་ཆོས་གོས་གསུམ་ཆར་རྙེད་ན་ནི་"
 ],
 [
  "78.248b",
  "བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བརྒྱད་པར་བལྟ་སྟེ། གལ་ཏེ་བརྩོན་ན་ནི་མཚན་མ་དེ་དག་འབྱུང་བར་འགྱུར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>ཇི་སྟེ་མི་བརྩོན་ན་ནི་བྱང་ཆུབ་སེམས་དཔའ་ལ་བདུད་ཀྱི་ལས་མ་གཏོགས་པར་ལས་<br>དེ་མེད་དོ། །རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་དེ་བཞིན་གཤེགས་པའི་ལྷུང་བཟེད་རྙེད་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་སངས་རྒྱས་རྣམས་ཀྱིས་དགོངས་པ་ཡིན་ཏེ། <br>བྱང་ཆུབ་སེམས་དཔའ་དེ་ས་བརྒྱད་པ་ལ་ཆོས་ཀྱི་སྣང་བའི་སྣོད་དུ་གྱུར་བར་འགྱུར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>དེས་ཀྱང་སྒྲིབ་པ་མེད་པའི་བཟོད་པ་བསྒོམ་<span class='delete'>བར་</span><span class='add'>  པར་  </span>བྱ་སྟེ། དེས་ན་དེ་བྱང་ཆུབ་ཏུ་ངེས་པར་འབྱུང་བར་འགྱུར་རོ། །གལ་<br>ཏེ་ལྷུང་བཟེད་སྐྱོན་ཅན་རྙེད་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span><span class='delete'>ལག་</span><span class='add'>  གལ་  </span>ཏེ་སྐྱོན་མེད་པ་སྟོང་པ་རྙེད་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་གཉིས་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གལ་ཏེ་རོ་ཞིམ་པོས་ཡོངས་<br>སུ་གང་བ་རྙེད་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་གསུམ་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གལ་ཏེ་མེ་ཏོག་དང་བཅས་པ་རྙེད་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བཞི་པར་<span class='delete'>བལྟའོ། </span><span class='add'>  བལྟའོ།   </span>གལ་ཏེ་འབྲས་བུ་དང་བཅས་པ་རྙེད་<br>ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་ལྔ་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གལ་ཏེ་ཁ་ཟས་དང་བཅས་པ་རྙེད་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དྲུག་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གལ་ཏེ་དྲིས་ཡོངས་སུ་གང་བ་རྙེད་ན་བྱང་ཆུབ་སེམས་<br>དཔའ་དེ་ནི་ས་བདུན་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གལ་ཏེ་མེ་ཏོག་ཕྲེང་གིས་དཀྲིས་པ་རྙེད་ན་བྱང་ཆུབ་སེམས་དེ་ནི་ས་བརྒྱད་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གལ་ཏེ་ཆོས་གོས་དང་བཅས་ཏེ་རྙེད་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་<br>ས་དགུ་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གལ་ཏེ་ནམ་མཁའ་ལས་རྙེད་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བཅུ་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>དེ་ལ་གང་རློམ་སེམས་མེད་པ་མ་གཏོགས་པར་བདུད་ཀྱི་ལས་ནི་རྟོགས་པར་བྱའོ། །རྡོ་རྗེས་རབ་"
 ],
 [
  "78.247a",
  "སེམས་དཔའ་དེ་ནི་ས་དགུ་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གང་གིས་ལྷས་ཡོངས་སུ་བསྐོར་ཅིང་མེ་ཏོག་གིས་ཀྱང་གཏོར་ལ་ཨ་ལ་ལ་ཞེས་བྱའི་སྒྲ་ཡང་ཐོས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བཅུ་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>རྡོ་རྗེས་<br>རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་དེ་བཞིན་གཤེགས་པ་འཆག་པ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེས་ནི་བརྙས་པར་བྱས་ཤིང་ཆོས་ཀྱི་སྦྱིན་པ་བྱིན་པ་ཡིན་<span class='delete'>པས་</span><span class='add'>  པས་  </span>དེ་ནི་བརྩོན་འགྲུས་དང་<br>ལྡན་<span class='delete'>བས་</span><span class='add'>  པས་  </span>གཞན་དག་གིས་ཡོངས་སུ་ཐོབ་པར་བྱ་བ་<span class='delete'>དང་། </span><span class='add'>  དང་།   </span>ཉེས་པར་མི་འཛིན་པ་ལ་<span class='delete'>སྤོ་</span><span class='add'>  སྤྲོ་  </span>བར་བྱ་སྟེ། བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བདུན་པོ་དག་ལས་གང་ཡང་རུང་བར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གང་གིས་དེ་བཞིན་གཤེགས་པ་མི་<br>མཛེས་པར་<span class='delete'>འཚག་</span><span class='add'>  འཆག་  </span>པ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གང་གིས་མཛེས་པར་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་གཉིས་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གང་གིས་བདུན་བཤམས་པར་མཐོང་ན་བྱང་<br>ཆུབ་སེམས་དཔའ་དེ་ནི་ས་གསུམ་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གང་གིས་བཞུགས་པར་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བཞི་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གང་གིས་ཤིང་ལྗོན་པས་ཡོངས་སུ་བསྐོར་<span class='delete'>པ་</span><span class='add'>  བ་  </span>དང་བཅས་པར་མཐོང་ན་<br>བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་ལྔ་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གང་གིས་མེ་ཏོག་ཀུན་དུ་བཀྲམ་པར་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དྲུག་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གང་གིས་བླ་རེས་ཀུན་ནས་བཀབ་པར་མཐོང་ན་བྱང་ཆུབ་སེམས་<br>དཔའ་དེ་ནི་ས་<span class='delete'>དགུ་</span><span class='add'>  བདུན་  </span><span class='delete'>བར་</span><span class='add'>  པར་  </span>བལྟའོ། །རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་འཁོར་ལོ་སྐོར་བ་མཐོང་ན། བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བདུན་པོ་<br>དག་ལས་ས་གང་ཡང་རུང་བ་ལས་ཕྱིར་མི་ལྡོག་ཅིང་ལས་ཀྱི་སྒྲིབ་པ་ཡོང་སུ་དག་པ་ཡིན་<span class='delete'>བར་</span><span class='add'>  པར་  </span><span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གང་གིས་གདན་མ་བཤམས་པ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གང་གིས་"
 ],
 [
  "78.249a",
  "<span class='delete'>འཇོམས་</span><span class='add'>  འཇོམས་  </span>གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་དེ་བཞིན་གཤེགས་པ་ཉག་གཅིག་མཐོང་ན་དེས་རབ་ཏུ་དབེན་<span class='delete'>པར་</span><span class='add'>  པར་གནས་པར་  </span>བྱ་ཞིང་སྟོང་པ་ཉིད་ཀྱི་ཏིང་ངེ་འཛིན་ལ་ཡང་གནས་<br>པར་བྱ་སྟེ། བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བརྒྱད་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>དེས་ནི་ལས་ཀྱི་སྒྲིབ་པ་སྦྱང་བའི་ཕྱིར་བསམ་པ་རྣམ་པར་དག་པས་རབ་ཏུ་བརྩོན་པར་བྱ་སྟེ། དེས་ན་དེའི་ལས་ཀྱི་སྒྲིབ་པ་དེ་རྣམ་<br>པར་དག་པར་འགྱུར་རོ། །རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གི་རྨི་ལམ་ན་དེ་བཞིན་གཤེགས་པ་སྐྱེ་བོ་མང་པོས་ཡོངས་སུ་བསྐོར་བ་མཐོང་ན་དེས་སྐྱེ་བོ་བསྡུ་ཞིང་ཉོན་མོངས་<br>པ་བཟོད་པར་བྱའོ། །བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བཅུ་པོ་ཐམས་ཅད་ལས་ས་གང་ཡང་རུང་བར་བལྟ་སྟེ། བྱང་ཆུབ་ནི་བརྩོན་འགྲུས་ལ་རག་ལས་པ་ཡིན་<span class='delete'>ནོ། །</span><span class='add'>  ནོ། །  </span><span class='delete'>གལ་</span><span class='add'>  གལ་ཏེ་  </span>དེ་བཞིན་གཤེགས་པ་<br>དམངས་རིགས་དང་རྗེའུ་རིགས་ཀྱིས་ཡོངས་སུ་བསྐོར་བ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གལ་ཏེ་དེ་བཞིན་གཤེགས་པ་རྒྱལ་རིགས་ཀྱིས་ཡོངས་སུ་བསྐོར་བ་མཐོང་<br>ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་གཉིས་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གལ་ཏེ་དེ་བཞིན་གཤེགས་པ་བྲམ་ཟེས་ཡོངས་སུ་བསྐོར་བ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་གསུམ་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གལ་ཏེ་དེ་<br>བཞིན་གཤེགས་པ་རྒྱལ་པོ་དག་གིས་ཡོངས་སུ་བསྐོར་བ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བཞི་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གལ་ཏེ་དེ་བཞིན་གཤེགས་པ་ཀླུ་དག་གིས་ཡོངས་སུ་བསྐོར་བ་མཐོང་ན་བྱང་<br>ཆུབ་སེམས་དཔའ་དེ་ནི་ས་ལྔ་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གལ་ཏེ་དེ་བཞིན་གཤེགས་པ་རྒྱལ་པོ་ཆེན་པོ་དག་གིས་ཡོངས་སུ་བསྐོར་བ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དྲུག་པར་<span class='delete'>བལྟའོ། </span><span class='add'>  བལྟའོ།   </span>གལ་ཏེ་"
 ],
 [
  "78.249b",
  "དེ་བཞིན་གཤེགས་པ་བརྒྱ་བྱིན་དག་གིས་ཡོངས་སུ་བསྐོར་བ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བདུན་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གལ་ཏེ་དེ་བཞིན་གཤེགས་པ་ཚངས་པ་དག་གིས་ཡོངས་སུ་བསྐོར་བ་<br>མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བརྒྱད་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གལ་ཏེ་དེ་བཞིན་གཤེགས་པ་གནས་བཙང་མའི་རིས་ཀྱི་ལྷ་རྣམས་ཀྱིས་ཡོངས་སུ་བསྐོར་བ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་<br>དགུ་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གལ་ཏེ་དེ་བཞིན་གཤེགས་པ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱིས་ཡོངས་སུ་བསྐོར་བ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བཅུ་པར་བལྟ་སྟེ། བདུད་ཀྱི་ལས་ནི་<br>མ་གཏོགས་<span class='delete'>སོ། །།།།</span><span class='add'>  སོ།། །།  །།  </span>བམ་པོ་གཉིས་<span class='delete'>པ། །</span><span class='add'>  པ།   </span>རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་དེ་བཞིན་<br>གཤེགས་པའི་གདུགས་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་དགུ་པོ་དག་ལས་ས་གང་ཡང་རུང་བར་བལྟ་སྟེ། བདུད་ཀྱི་ལས་མ་གཏོགས་པར་ལས་ཀྱི་སྒྲིབ་པ་ནི་ཡོད་དོ། །<br>གལ་ཏེ་རྙེད་པ་དང་། བཀུར་སྟི་དང་། ཚིགས་སུ་བཅད་པ་ལ་དགའ་བར་མི་བྱེད་ན་མྱུར་བར་བྱང་ཆུབ་ཏུ་<span class='delete'>དེས་</span><span class='add'>  ངེས་  </span>པར་འབྱུང་བར་འགྱུར་རོ། །གལ་ཏེ་ལོ་མའི་གདུགས་མཐོང་ན་<br>བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་བར་བལྟའོ། །གལ་ཏེ་འོད་མའི་གདུགས་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་གཉིས་པར་བལྟའོ། །གལ་ཏེ་གྲོ་བའི་གདུགས་<br>མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་གསུམ་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གལ་ཏེ་ཤིང་གི་གདུགས་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བཞི་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གང་ཏེ་ཤིང་འདབ་ཀྱི་"
 ],
 [
  "78.251a",
  "བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ལས་ཀྱི་སྒྲིབ་པ་ཆུང་བ་ཡིན་ནོ། །གང་དེ་བཞིན་གཤེགས་པ་གྲོང་དུ་གཤེགས་ཤིང་བཞེངས་པ་ལ་བསོད་སྙོམས་འབུལ་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་པར་<br>བལྟའོ། །གང་དེ་བཞིན་གཤེགས་པ་གྲོང་ན་བཞུགས་པ་ལ་བསོད་སྙོམས་འབུལ་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་གཉིས་པར་བལྟའོ་གང་དེ་བཞིན་གཤེགས་པ་སྒོར་གཤེགས་པ་ལ་བསོད་སྙོམས་འབུལ་<br>ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་གསུམ་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གང་དེ་བཞིན་གཤེགས་པ་<span class='delete'>སྲུང་</span><span class='add'>  སྲང་  </span>དུ་གཤེགས་པ་ལ་བསོད་སྙོམས་འབུལ་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་<span class='delete'>ས་</span><span class='add'>  ས་བཞི་  </span>པར་བལྟའོ། །གང་དེ་བཞིན་གཤེགས་པ་གྲོང་ཁྱེར་གྱི་སྒོར་<br>གཤེགས་པ་ལ་བསོད་སྙོམས་འབུལ་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་ལྔ་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གང་དེ་བཞིན་གཤེགས་པ་དགོན་པ་ན་བཞུགས་པ་ལ་བསོད་སྙོམས་འབུལ་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དྲུག་པར་བལྟའོ། གང་<br>དེ་བཞིན་གཤེགས་པ་གཙུག་ལག་ཁང་དུ་གཤེགས་པ་ལ་བསོད་སྙོམས་འབུལ་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བདུན་པར་<span class='delete'>བལྟའོ། </span><span class='add'>  བལྟའོ། །  </span>རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་བདག་དེ་བཞིན་<br>གཤེགས་པ་<span class='delete'>ལ་</span><span class='add'>  ལ་ན་  </span>བཟའ་འབུལ་བར་ཀུན་དུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་བརྒྱད་པོ་དག་ཏུ་བལྟའོ། །དེས་ནི་མཚན་མ་མེད་པའི་ཏིང་ངེ་འཛིན་ལ་བརྩོན་པར་བྱ་སྟེ། དེས་ན་བྱང་ཆུབ་ཏུ་ངེས་པར་འབྱུང་བར་འགྱུར་རོ། །<br>གལ་ཏེ་དེ་བཞིན་གཤེགས་པ་ལ་གུས་པར་བྱས་ཏེ་ན་བཟའ་འབུལ་བར་བྱེད་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གལ་ཏེ་དེ་བཞིན་གཤེགས་པ་ལ་ན་བཟའ་དཀར་པོ་འཕུལ་བར་བྱེད་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་<br>ས་གཉིས་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གལ་ཏེ་དེ་བཞིན་གཤེགས་པ་ལ་ན་བཟའ་དམར་པོ་འབུལ་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་གསུམ་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གལ་ཏེ་དེ་བཞིན་གཤེགས་པ་ལ་ན་བཟའ་ཁྲ་བོ་འབུལ་ན་བྱང་ཆུབ་སེམས་དཔའ་"
 ],
 [
  "78.250a",
  "གདུགས་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་ལྔ་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གལ་ཏེ་ལྕག་ཀྱི་གདུགས་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དྲུག་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གལ་ཏེ་གསེར་<br>གྱི་གདུགས་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བདུན་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གལ་ཏེ་རིན་པོའི་<span class='delete'>ཚེའི་</span><span class='add'>  ཆེའི་  </span>གདུགས་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བརྒྱད་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གལ་ཏེ་དྲིལ་<br>བུ་གཡེར་ཀའི་དྲ་བ་སྤངས་པའི་གདུགས་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དགུ་པར་བལྟ་སྟེ། ས་དྲུག་པོ་དག་ལ་ནི་བདུད་ཀྱི་ལས་ཀྱང་རྟོགས་པར་བྱའོ། །རྡོ་རྗེས་རབ་འཇོམས་<br>གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་དེ་བཞིན་གཤེགས་པའི་ཆགས་དག་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བཅུ་པོ་དག་ལས་ས་གང་ཡང་རུང་བར་བལྟའོ། །<br>དེས་བརྩོན་འགྲུས་བརྩམས་ན་ངེས་པར་འབྱུང་བར་འགྱུར་ཏེ། བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ལུང་བསྟན་པ་ཡིན་པར་གཟུང་ཞིང་ལུང་བསྟན་པའི་མཚམས་བཅད་པ་ཡིན་<span class='delete'>ནོ། །</span><span class='add'>  ནོ། །  </span>གལ་<br>ཏེ་ཁྱིམ་དུ་ཆགས་དག་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>ལག་ཏེ་སྒོ་ན་འདུག་སྟེ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་གཉིས་པར་བལྟའོ། །གལ་<br>ཏེ་སྐྱེད་མོས་ཚལ་ན་འདུག་སྟེ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་གསུམ་པར་བལྟའོ། །གལ་ཏེ་འཆག་སྟེ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བཞི་པར་ལྟའོ། །གལ་ཏེ་གནས་ཁང་ན་<br>འདུག་<span class='delete'>སྟེ། </span><span class='add'>  སྟེ་  </span>མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་ལྔ་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གལ་ཏེ་སྙོམས་པར་ཞུགས་པ་ན་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དྲུག་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གལ་ཏེ་ཆུ་ཀླུང་གི་ནང་དུ་མཐོང་ན་བྱང་ཆུབ་"
 ],
 [
  "78.251b",
  "དེ་ནི་ས་བཞི་<span class='delete'>པ་</span><span class='add'>  པ  </span><span class='delete'>བར་</span><span class='add'>  ར་  </span><span class='delete'>ལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གལ་ཏེ་དེ་བཞིན་གཤེགས་པ་ལ་ན་བཟའ་གསེར་གྱི་ཁ་དོག་ལྟ་བུ་འབུལ་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་ལྔ་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གལ་ཏེ་དེ་བཞིན་གཤེགས་པ་ལ་ན་བཟའ་རིན་པོ་ཆེས་<span class='delete'>སྨྲས་</span><span class='add'>  སྤྲས་  </span>པ་འབུལ་ན་བྱང་<br>ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དྲུག་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གལ་ཏེ་དེ་བཞིན་གཤེགས་པ་ལ་ན་བཟའ་ཚོན་གྱིས་བྲིས་པ་འབུལ་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བདུན་པར་བལྟའོ། །གལ་ཏེ་དེ་བཞིན་གཤེགས་པ་ལ་ན་བཟའ་འོད་<br>ཆགས་པ་འབུལ་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བརྒྱད་པར་བལྟའོ། །རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་བདག་དེ་བཞིན་གཤེགས་<span class='delete'>པ་</span><span class='add'>  པ་ལ་  </span>མེ་ཏོག་དག་འབུལ་བར་ཀུན་དུ་<br>ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དྲུག་པོ་དག་ལས་ས་གང་ཡང་རུང་བར་བལྟ་སྟེ། གང་ཟག་དེ་ནི་ལས་ཀྱི་སྒྲིབ་པ་ཆེ་ཞིང་ལུང་མནོད་པ་ལ་བརྩོན་ཡང་ཚེགས་ཆེན་པོས་སྣང་བར་<span class='delete'>འགྱུར་</span><span class='add'>  འགྱུར་  </span>རོ། །གལ་ཏེ་དེ་བཞིན་<br>གཤེགས་པ་ལ་མེ་ཏོག་རྙིས་པ་དག་འབུལ་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་<span class='delete'>བར་</span><span class='add'>  པར་  </span><span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གལ་ཏེ་དེ་བཞིན་གཤེགས་པ་ལ་མེ་ཏོག་སར་པ་དག་འབུལ་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་<span class='delete'>ནི་</span><span class='add'>  ནི་  </span>ས་གཉིས་པར་<br><span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གལ་ཏེ་དེ་བཞིན་གཤེགས་པ་ལ་མེ་ཏོག་ཁ་དོག་སྣ་ཚོགས་དག་འབུལ་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་གསུམ་པར་བལྟའོ། །གལ་ཏེ་དེ་བཞིན་གཤེགས་པ་ལ་མེ་ཏོག་དག་གིས་འཐོར་བར་<br>བྱེད་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བཞི་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གལ་ཏེ་དེ་བཞིན་གཤེགས་པའི་ཕྱག་ཏུ་ལག་པས་མེ་ཏོག་འབུལ་བར་བྱེད་ན་བྱང་ཆུབ་སེམས་དེ་ནི་ས་ལྔ་<span class='delete'>བར་</span><span class='add'>  པར་  </span><span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གལ་ཏེ་དེ་བཞིན་གཤེགས་པ་ལ་<br>ལྷའི་མེ་ཏོག་འབུལ་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དྲུག་<span class='delete'>པ་</span><span class='add'>    </span><span class='delete'>བར་</span><span class='add'>  པར་  </span><span class='delete'>ལྟ་</span><span class='add'>  བལྟ་  </span>སྟེ། བདུད་ཀྱི་ལས་ནི་མ་<span class='delete'>གཏོགས་</span><span class='add'>  གཏོགས་  </span>སོ། །གང་ཟག་གཉིས་པོ་ལས་དང་པོ་པ་དང་། སོམ་ཉི་ཅན་ཡང་མ་<span class='delete'>གཏོགས་</span><span class='add'>  གཏོགས་  </span>སོ། །རྡོ་རྗེས་རབ་འཇོམས་གཞན་"
 ],
 [
  "78.250b",
  "སེམས་དཔའ་དེ་ནི་ས་བདུན་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གལ་ཏེ་རི་ལ་འདུག་སྟེ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བརྒྱད་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གལ་ཏེ་ནམ་མཁའ་ལ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དགུ་པར་བལྟའོ། །<br>གལ་ཏེ་ཆོ་འཕྲུལ་མཛད་པར་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བཅུ་པར་བལྟ་སྟེ། བདུད་ཀྱི་ལས་ནི་མ་གཏོགས་སོ། །རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་དེ་བཞིན་<br>གཤེགས་པའི་གདན་མཐོང་ན། བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་དྲུག་པོ་དག་ཏུ་བལྟ་སྟེ། དེས་རབ་ཏུ་ཞི་བ་ལ་མངོན་པར་དགའ་<span class='delete'>བ་</span><span class='add'>    </span>བར་<span class='delete'>བྱའོ། །</span><span class='add'>  བྱའོ། །  </span>དེས་ན་བྱང་ཆུབ་ཏུ་ངེས་པར་འབྱུང་བར་འགྱུར་<br>ཏེ། བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ལས་ཀྱི་སྒྲིབ་པ་<span class='delete'>ཆུད་</span><span class='add'>  ཆུང་  </span>པ་ཡིན་<span class='delete'>ནོ། །</span><span class='add'>  ནོ། །  </span>གང་གིས་གདན་ལེགས་པར་མ་བྱས་པ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གང་གིས་གདན་ལེགས་པར་བྱས་པ་མཐོང་<br>ན། བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་གཉིས་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གང་གིས་གདན་<span class='delete'>བྱོ་</span><span class='add'>  བྱི་  </span>དོར་བྱས་པ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་གསུམ་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གང་གིས་གདན་ཁྲ་བོ་མཐོང་ན་བྱང་ཆུབ་<br>སེམས་དཔའ་དེ་ནི་ས་བཞི་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གང་གིས་གདན་བཤམས་པ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་ལྔ་བར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གང་གིས་གདན་ལེགས་པར་བཤམས་པ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་<br>དེ་ནི་ས་དྲུག་པར་བལྟ་སྟེ། བདུད་ཀྱི་ལས་རྟོགས་པར་བྱའོ། །རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་བདག་དེ་བཞིན་གཤེགས་པ་ལ་ཞལ་ཟས་འབུལ་པར་<br>ཀུན་དུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་བདུན་པོ་དག་ཏུ་བལྟའོ། །གལ་ཏེ་དེས་བརྩོན་འགྲུས་བྱས་ན་བྱང་ཆུབ་ཏུ་ངེས་པར་འབྱུང་བར་ཡང་འགྱུར་ཏེ།་"
 ],
 [
  "78.252b",
  "སེམས་དཔའ་དེ་ནི་ས་བཞི་པར་བལྟ་སྟེ། བདུད་ཀྱི་ལས་ཀྱང་རྟོགས་པར་བྱའོ། །རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་བདག་ཕྱོགས་མཚམས་ན་འདུག་པར་ཀུན་དུ་ཤེས་<span class='delete'>ན་། </span><span class='add'>  ན།   </span>གང་<br><span class='delete'>བྲག་</span><span class='add'>  ཟག་  </span>དེ་ནི་དགེ་བའི་བཤེས་གཉེན་གྱིས་<span class='delete'>ཡོངས་</span><span class='add'>  ཡོངས་  </span><span class='delete'>སུ་</span><span class='add'>  སུ་  </span>སྤངས་པ་སྟེ་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་པར་<span class='delete'>བལྟའོ། </span><span class='add'>  བལྟའོ། །  </span>དེ་ནི་བློ་ཆུང་བ་དང་། ལེ་ལོ་ཆེ་བ་དང་། སེམས་ལ་མྱ་ངན་མང་བ་དང་། གནོད་པ་མང་བ་དང་། སྐྱེ་བོ་མང་<br>པོ་སྡང་བ་དང་། ནད་མང་བ་དང་། སེམས་གཡེང་<span class='delete'>བར་</span><span class='add'>  བར་ཡང་  </span>འགྱུར་<span class='delete'>རོ། </span><span class='add'>  རོ། །  </span>དགེ་བའི་རྩ་བ་དག་ལ་རབ་ཏུ་འབྱུང་བར་འགྱུར་ཞིང་ཕྱིར་ཡང་ལྡོག་པར་<span class='delete'>འགྱུར་</span><span class='add'>  འགྱུར་  </span>རོ། །ལོངས་སྤྱོད་<span class='delete'>དང་</span><span class='add'>  དག་  </span>ཀྱང་ཚེགས་ཆེན་པོས་ཐོབ་པར་འགྱུར་ཞིང་ཉོན་<br>མོངས་པ་མང་པོར་ཡང་<span class='delete'>འགྱུར་</span><span class='add'>  འགྱུར་  </span>རོ། །དེས་ནི་རྙེད་པའི་ཕྱིར་ཆོས་སྨྲ་བ་ལ་སྨད་ཅིང་ཆོས་ཀྱང་སྤངས་<span class='delete'>ལམ་</span><span class='add'>  ལ་མ་  </span><span class='delete'>ངང་</span><span class='add'>  དད་  </span>པ་དང་། མ་མོས་པ་དང་། ངོ་ཚ་མེད་པས་ཆོས་སྨྲ་བ་ལ་བསྙེན་བཀུར་བྱས་པ་ཡིན་<span class='delete'>བས་</span><span class='add'>  པས་  </span>དེས་དྲང་པོས་<br><span class='delete'>ཆོ་</span><span class='add'>  ཆོས་  </span>སྨྲ་བ་ལ་བསྟེན་པར་བྱའོ། །དེས་གལ་ཏེ་ཞེས་འགྲས་པ་མེད་པའི་སེམས་ཀྱིས་རྫས་ཐམས་ཅད་<span class='delete'>ཡོངས་</span><span class='add'>  ཡོངས་  </span>སུ་གཏང་བར་འགྱུར་ན། དེས་ན་བྱང་ཆུབ་ཏུ་ངེས་པར་འབྱུང་བར་འགྱུར་ཏེ། བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དྲུག་པའི་<br>བར་དག་ལ་ཡང་རེག་པར་འགྱུར་བས། དེས་ཀྱང་སྐྱོན་ཆུང་ངུ་དང་། འབྲིང་དང་། ཆེན་པོ་དེ་དག་གཞོམ་པ་ལ་བརྩོན་བར་བྱའོ། །རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་བདག་སྔོན་མ་མཐོང་<br>བའི་ཡུལ་དུ་ཕྱིན་པར་ཀུན་དུ་ཤེས་ན། དེ་ལ་བདུད་ཀྱི་ལས་དང་ལས་ཀྱི་སྒྲིབ་པ་དག་ཡོད་པ་ཡིན་བས་དེས་རྟོགས་ནས་བརྩོན་པར་བྱས་ན་རྣམ་པར་དག་པར་འགྱུར་རོ། །བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་གསུམ་<br>པོ་དག་ལས་ས་གང་ཡང་རུང་བར་བལྟ་སྟེ། དཀོན་མཆོག་གསུམ་ལ་དགེ་བའི་རྩ་བ་བསྐྱེད་པ་ལ་བརྩོན་<span class='delete'>བས་</span><span class='add'>  པས་  </span>ནི་ས་དང་པོ་ལ་སྦྱོར་བར་འགྱུར་རོ། །སྟོང་པ་ཉིད་སྒོམ་བས་ནི་ས་གཉིས་པ་ལ་སྦྱོར་བར་འགྱུར་རོ། །"
 ],
 [
  "78.253b",
  "བོ་དག་ཏུ་བལྟའོ། །དེ་ན་དབང་ཕྱུག་དང་ལྡན་<span class='delete'>བ་</span><span class='add'>  པ་  </span>ན་ཆོས་སྨྲ་བ་དག་ལ་ཐོ་བརྩམས་ཤིང་རབ་ཏུ་བྱུང་ནས་ཀྱང་རྙེད་པ་དང་། བཀུར་སྟིས་ཟིལ་གྱིས་ནོན་<span class='delete'>བས་</span><span class='add'>  པས་  </span>ཆོས་སྨྲ་བ་དག་ལ་སྔགས་པ་མ་ཡིན་<span class='delete'>བ་</span><span class='add'>  པ་  </span>བརྗོད་ལ། མངོན་པར་བརྩོན་<span class='delete'>བ་</span><span class='add'>  པ་  </span>རྣམས་ལ་<br>ཡང་གདམས་<span class='delete'>དག་</span><span class='add'>  ངག་  </span>ལོག་པར་སྨྲས་པ་ཡིན་པས་དེས་བཟོད་པ་ལྷུར་བླང་བ་དང་། ཐོས་པ་ལ་བརྩོན་པར་བྱ་བ་དང་། རྙེད་པ་དང་། བཀུར་སྟི་ལ་ལྷག་པར་ཆགས་པ་མེད་པར་བྱ་ཞིང་གལ་ཏེ་གཞན་ལ་ཕན་པ་ལ་ཤིན་ཏུ་<br>བརྩོན་པར་བྱས་ན་དེས་དེའི་ལས་ཀྱི་<span class='delete'>སྒྲིབ་</span><span class='add'>  སྒྲྀབ་  </span>པ་དེ་འབྱང་བར་འགྱུར་རོ། །དེ་ལ་གང་གིས་རྡུལ་གྱིས་ཡོག་པའི་སྤྲིན་ལས་ཆར་འབབ་པ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གང་གིས་རླུང་གིས་འཁྲུགས་པར་མཐོང་ན་<br>བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་གཉིས་པར་བལྟའོ། །གང་གིས་སྤྲིན་གྱིས་འཁྲུགས་པར་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་གསུམ་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གང་གི་འབྲུག་གྲག་པའི་སྤྲིན་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བཞི་<br>པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གང་གིས་གློག་གིས་དངངས་པར་བྱེད་པ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་ལྔ་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གང་གིས་ཐོག་འབབ་པ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དྲུག་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གང་གིས་ཆར་ཆུའི་རྒྱུན་མཐོང་<br>ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བདུན་པར་བལྟ་སྟེ། ས་དང་ས་དག་ལ་བདུད་ཀྱི་ལས་ནི་ཤེས་པར་བྱའོ། །རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་<span class='delete'>ན་</span><span class='add'>  ན་  </span>ས་གཡོས་པར་ཀུན་དུ་ཤེས་ན་བྱང་ཆུབ་<span class='delete'>སེམས་</span><span class='add'>  སེམས་  </span><br>དཔའ་དེ་ནི་ས་དང་པོ་པར་བལྟ་སྟེ། ལས་དང་པོ་<span class='delete'>བ་</span><span class='add'>  པ་  </span>དམིགས་པ་ལ་མང་དུ་སྤྱོད་པ་ཡིན་ཞིང་དེ་ལ་ནི་བདུད་ཀྱི་ལས་དང་། ལས་ཀྱི་སྒྲིབ་པ་ཡང་ཤས་ཆེ་<span class='delete'>བ་</span><span class='add'>  བ་  </span>ཡིན་ཏེ། སེམས་ཅན་མང་པོ་འཇིགས་པར་བྱས་པ་ཡིན་<span class='delete'>པས་། </span><span class='add'>  པས།   </span>དེས་<br>གལ་ཏེ་སེམས་ཅན་རྣམས་ལ་མི་འཇིགས་པའི་སྦྱིན་<span class='delete'>བ་</span><span class='add'>  པ་  </span>བྱིན་ཞིང་རྣམ་པ་གསུམ་བསྡམས་པར་གྱུར་<span class='delete'>ན་</span><span class='add'>  ན་དེ་  </span>དེའི་ལས་ཀྱི་སྒྲིབ་པ་དེ་རྣམ་པར་དག་པར་འགྱུར་རོ། །དེ་ལ་ཡང་དང་ཡང་<span class='delete'>དུས་</span><span class='add'>  དུ་ས་  </span>གཡོ་བར་མཐོང་ན་དེ་ནི་ལས་དང་པོ་པའི་"
 ],
 [
  "78.253a",
  "ཆོས་ལ་བཟོད་པས་ནི་ས་གསུམ་པ་ལ་སྦྱོར་བར་འགྱུར་རོ། །གལ་ཏེ་ས་དྲུག་པའི་བར་དག་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ལ་མཚན་མ་དེ་དག་བྱུང་བར་གྱུར་ན་བདུད་ཀྱི་ལས་སུ་རྟོགས་<br>པར་བྱའི་ལས་ཀྱི་སྒྲིབ་པ་ནི་མ་ཡིན་ནོ། །རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་བདག་ཆུ་བོའི་ནང་ན་འདུག་པར་ཀུན་དུ་ཤེས་ན། བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་ལྔ་པོ་དག་ལས་ས་གང་<br>ཡང་རུང་བར་བལྟ་སྟེ། དེ་ལ་ནི་མི་དགེ་བའི་ཆོས་དང་། དགེ་བའི་ཆོས་གཉིས་ཀ་ཡང་ཤས་ཆེ་བ་ཡིན་<span class='delete'>ནོ། །</span><span class='add'>  ནོ། །  </span>དེ་གལ་ཏེ་སྲོག་<span class='delete'>ཡོང་</span><span class='add'>  ཡོངས་  </span>སུ་གཏོང་བས་ཡོངས་སུ་གདུང་བར་མི་འགྱུར་ཞིང་སྡིག་པའི་གྲོགས་པོ་ཡང་ཡོངས་སུ་<br>སྤོང་བར་བྱེད་ལ། གཡོ་མེད་པས་ཆོས་ལ་མོས་པའི་གང་ཟག་ལ་བསྟེན་པར་བྱེད་ན་དེས་དེའི་ལས་ཀྱི་སྒྲིབ་པ་དེ་རྣམ་པར་<span class='delete'>དག་</span><span class='add'>  དག་པར་  </span>འགྱུར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>དེ་ནི་གནོད་པ་དང་རྩུབ་པའི་སེམས་ཀྱིས་ཆོས་གནས་པར་<span class='delete'>བྱ་</span><span class='add'>  བྱ་བ  </span><span class='delete'>འི་</span><span class='add'>  འི་  </span>ཕྱིར་དགེ་བའི་<br>བཤེས་གཉེན་དག་ལ་བསྟེན་པ་ཡིན་ནོ། །བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་བདག་གིས་ཆུ་བོ་འཁྲུགས་པའི་ནང་དུ་སོང་བར་ཀུན་དུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་པར་བལྟའོ། །གང་གིས་བདག་ཆུ་བོ་<br>དབུ་བ་ཅན་གྱི་ནང་དུ་སོང་བར་ཀུན་དུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་གཉིས་པར་བལྟའོ། །གང་གིས་བདག་ཆུ་བོ་དབའ་རླབས་ཆེན་པོའི་ནང་དུ་སོང་བར་ཀུན་དུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་གསུམ་པར་<br>བལྟའོ། །གང་གིས་བདག་ཆུ་བོའི་ཀློང་འཁྱིལ་<span class='delete'>བའི་</span><span class='add'>  བའི་  </span>ནང་དུ་སོང་བར་ཀུན་དུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བཞི་པར་བལྟའོ། །གང་གིས་བདག་ཆུ་བོ་རབ་ཏུ་དང་བའི་ནང་དུ་སོང་བར་ཀུན་དུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་<br>དེ་ནི་ས་ལྔ་པར་བལྟའོ། །རྡོ་རྗེ་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་སྤྲིན་ལས་ཆར་འབབ་པར་མཐོང་ན་དེ་ལ་བདུད་ཀྱི་ལས་མང་སྟེ། བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་བདུན་"
 ],
 [
  "78.252a",
  "ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་བདག་རི་ལ་འདུག་པར་ཀུན་དུ་ཤེས་ན་དེས་ནི་འགྱོད་པ་བསྐྱེད་པ་དང་། ཆོས་སྤངས་པ་ཡིན་ཏེ། ལས་ཀྱི་སྒྲིབ་པ་ཆེ་བ་དང་། ནད་མང་བ་དང་། <br>ཤེས་རབ་ཆུང་བར་<span class='delete'>ཡང་</span><span class='add'>  ཡང་  </span><span class='delete'>འགྱུར་</span><span class='add'>  འགྱུར་  </span>རོ། །གལ་ཏེ་<span class='delete'>སེམས་</span><span class='add'>  སེམས་ཅན་  </span>ཐམས་ཅད་ལ་ཞེས་འགྲས་པ་མེད་པའི་ཡིད་ཀྱིས་བརྩོན་པར་བྱས་ན་དེས་བྱང་ཆུབ་ཏུ་ངེས་པར་འབྱུང་བར་འགྱུར་ཏེ། བྱང་ཆུབ་སེམས་དཔའ་འདི་ནི་ས་ལྔ་<br>པོ་དག་ལས་ས་གང་ཡང་རུང་བར་བལྟའོ། །དེས་ལོ་བདུན་དུ་ཕུང་པོ་གསུམ་པའི་ཆོས་ཀྱི་རྣམ་གྲངས་ལ་ཉིན་ལན་གསུམ་མཚན་ལན་གསུམ་དུ་གདོན་པར་བྱ་ཞིང་ས་དང་པོ་ལ་ཡེ་ཤེས་སྣང་བ་ལ་<br>བརྩོན་པ་རྣམས་ལ་བདེ་བའི་བསྙེན་བཀུར་ཉེ་བར་བསྒྲུབ་པར་བྱའོ། །ས་གཉིས་པ་ལ་ནི་རིམ་གྲོ་དང་བསྙེན་བཀུར་<span class='delete'>བྱའོ། </span><span class='add'>  བྱའོ། །  </span>ས་གསུམ་པ་ལ་ནི་དཀོན་མཆོག་གསུམ་ལ་མཆོད་པར་བྱའོ། །ས་བཞི་པ་ལ་ནི་ཆོས་<br>ཟབ་མོ་དག་ལ་བཟོད་པ་བསྒོམ་<span class='delete'>བར་</span><span class='add'>  པར་  </span>བྱ་སྟེ། བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་ལྔ་པོ་དག་ཏུ་བལྟའོ། །རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གི་རྨི་ལམ་ན་བདག་གཅེར་བུར་འདུག་པར་<br>ཀུན་དུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ལས་ཀྱི་སྒྲིབ་པ་ཆུང་བ་<span class='delete'>སྟེ་། །</span><span class='add'>  སྟེ།   </span>དེས་<span class='delete'>པ་</span><span class='add'>    </span><span class='delete'>སྟོང་</span><span class='add'>  སྟོང་པ་  </span>ཉིད་ལ་བརྩོན་བར་བྱའོ། །བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་བཞི་པོ་དག་ཏུ་བལྟ་སྟེ། གང་གིས་བདག་གཅེར་བུར་<br>གྲོང་ན་འདུག་པར་ཀུན་དུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་པར་བལྟའོ། །གང་གིས་བདག་གཅེར་བུར་གྲོང་ཁྱེར་གྱིས་དབུས་ན་འདུག་པར་ཀུན་དུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་<br>ས་གཉིས་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གང་གིས་བདག་གཅེར་བུར་དགོན་པ་ན་འདུག་པར་ཀུན་དུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་གསུམ་པར་བལྟའོ། །གང་གིས་བདག་ཅེར་བུར་རི་ལ་འདུག་པར་ཀུན་དུ་ཤེས་ན་བྱང་ཆུབ་"
 ],
 [
  "78.254b",
  "དེས་དེའི་ལས་ཀྱི་སྒྲིབ་པ་དེ་རྣམ་པར་དག་པར་འགྱུར་ཞིང་བྱང་ཆུབ་ཏུ་ངེས་<span class='delete'>བར་</span><span class='add'>  པར་  </span>འབྱུང་བར་ཡང་འགྱུར་རོ། །དེ་ལ་བདག་གང་ན་<span class='delete'>ག་</span><span class='add'>  ག  </span>ནས་པར་གཡུལ་འགྱེད་པ་མཐོང་ན་དེ་ནི་ས་དང་པོ་པར་བལྟའོ། །མཚོན་ཆ་འདེབས་པར་<br>མཐོང་ན་ས་གཉིས་པར་བལྟའོ། །བོང་བ་དང་དབྱུག་པ་འབབ་པར་མཐོང་ན་ས་གསུམ་པར་བལྟའོ། །གཤི་བ་དང་བརྒྱད་བཀག་པ་མཐོང་ན་ས་བཞི་པར་བལྟ་སྟེ། མི་བརྩོན་པ་ལ་ནི་བདུད་ཀྱི་ལས་ཀྱང་རིག་<br>པར་བྱའོ། །རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་བདག་ན་<span class='delete'>པར་</span><span class='add'>  བར་  </span>ཀུན་དུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་གཉིས་པོ་དག་ལས་ས་གང་རུང་བར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>དེ་ལ་ནི་<br>འཇིག་རྟེན་པ་དང་། འཇིག་རྟེན་ལས་འདས་པའི་བྱ་བ་ཐམས་ཅད་ལ་བར་ཆད་མང་བ་ཡིན་ནོ། །དེས་ནི་ཆོས་ཀྱིས་ཀུན་དུ་བསྡུ་བ་བྱས་ནས་ཡང་ཕྱིར་བཤིག་པ་དང་། ཡོ་བྱད་དག་བྱིན་ནས་ཀྱང་ཕྱིར་ཕྲོགས་<br>པ་ཡིན་བས། དེས་གལ་ཏེ་ཆོས་སྨྲ་བའི་གང་ཟག་རྣམས་ལ་ཇི་ལྟར་འོས་པའི་མཆོད་པ་དག་ཕུལ་ཞིང་ཞེ་འགྲས་པ་མེད་པའི་སེམས་ཀྱིས་འབུལ་བར་བྱེད་ན། དེས་དེའི་ལས་ཀྱིས་སྒྲིབ་པ་དེ་རྣམ་<span class='delete'>པར་</span><span class='add'>  པར་དག་པར་  </span><br>འགྱུར་ཞིང་། བྱང་ཆུབ་ཏུ་ངེས་པར་འབྱུང་བར་ཡང་འགྱུར་<span class='delete'>རོ་། །</span><span class='add'>  རོ། །  </span>ས་གཞན་ལ་གནས་པ་དག་གིས་བདག་ན་<span class='delete'>པར་</span><span class='add'>  བར་  </span>ཀུན་དུ་ཤེས་ན་དེས་ནི་བདུད་ཀྱི་ལས་སུ་རྟོགས་པར་བྱའོ། །རྡོ་རྗེས་རབ་འཇོམས་<br>གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་བདག་གཡང་ས་ནས་གཡང་དུ་ལྷུང་ཞིང་རྟོན་པ་མེད་པར་ཀུན་དུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་སྔོན་གྱི་མཐར་བསམ་པ་ཉམས་པར་གྱུར་ཅིང་ཤིན་དུ་<br>གཡོན་ཅན་དང་། མ་མོས་པ་མང་བ་དང་། ལས་ཀྱི་སྒྲིབ་པ་ཐམས་ཅད་མང་བ་དང་། བདུད་ཀྱི་ལས་མང་བ་དང་། ལུས་<span class='delete'>ཉམས་</span><span class='add'>  ཉམ་  </span>ཆུང་བ་དང་། སེམས་ཞན་པ་ཡིན་ཏེ། དེ་ལ་ནི་ཆོས་ཀྱི་ལུང་ཕོག་ན་མྱུར་"
 ],
 [
  "78.254a",
  "བྱང་ཆུབ་སེམས་དཔའ་སྟེ། ས་དང་པོ་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གྲོང་ཁྱེར་ཞིག་པ་འམ། ལྗོངས་<span class='delete'>ཀྱི་</span><span class='add'>  ཀྱི་མི་  </span>ཀུན་དུ་འཁྲུགས་པར་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་གཉིས་པར་བལྟའོ། །ཡུན་རིང་དུ་གཡོ་བར་<br>མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་གསུམ་པར་བལྟའོ། །བདེན་པའི་བྱིན་གྱི་རླབས་ཀྱིས་གཡོ་བར་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བཞི་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>བདུད་ཀྱི་ལས་ཀྱིས་གཡོ་བར་མཐོང་ན་བྱང་ཆུབ་<br>སེམས་དཔའ་དེ་ནི་ས་ལྔ་པར་བལྟའོ། །གཡོ་བས་མཐོ་འཚམ་པར་བྱེད་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དྲུག་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གཟུངས་ལ་བརྩོན་བས་གཡོ་བར་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བདུན་<br><span class='delete'>བར་</span><span class='add'>  པར་  </span><span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གཡོས་ནས་དབང་ཐང་ཆེ་བར་གྲགས་པའི་ལྷ་རྣམས་འདུ་བར་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བརྒྱད་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གཡོས་ནས་ཀླུ་དང་ཚངས་པས་གཟི་བྱིན་སྐྱེད་པར་མཐོང་ན་བྱང་ཆུབ་<br>སེམས་དཔའ་དེ་ནི་ས་དགུ་པར་བལྟའོ། །ས་གཡོས་ནས་དེ་བཞིན་གཤེགས་པའི་སྒྲ་ཐོས་སམ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བཅུ་པར་བལྟ་སྟེ། ས་དང་ས་དག་ལ་དེ་ལྟར་ཁོང་དུ་ཆུད་པར་བྱའོ། །<br>རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་བདག་གཡུལ་འགྱེད་པའི་ནང་དུ་སོན་པར་ཀུན་དུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་བཞི་པོ་དག་ལས་ས་གང་ཡང་རུང་བར་<br>བལྟའོ། །ས་གོང་མས་བདུན་<span class='delete'>བ་</span><span class='add'>  པ་  </span>མན་ཅད་ལ་མི་བརྩོན་པ་དག་ལ་ནི་བདུད་ཀྱི་ལས་ཀྱང་འབྱུང་<span class='delete'>ངོ་། །</span><span class='add'>  ངོ་། །  </span>དེ་ནི་ཆོས་མ་ཡིན་པ་སྨྲ་བ་དག་ཡོངས་སུ་བཟུང་ཞིང་རྙེད་པ་དང་། བཀུར་སྟི་ལ་ལྷག་པར་ཆགས་པས་ཆོས་སྨྲ་<br>བ་དག་ཡོངས་སུ་སྤངས་ལ་དེ་ལ་དེས་ཆོས་སྨྲས་པ་དག་ལ་གཡོས་བསྙེན་བཀུར་བྱས་པ་ཡིན་པས། དེས་གལ་ཏེ་ཐབས་མཁས་པ་ལ་བསླབས་ཤིང་ལྷག་པའི་བསམ་<span class='delete'>བས་</span><span class='add'>  པས་  </span>ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་པོ་དག་ལ་སྤྱད་<span class='delete'>ན་</span><span class='add'>  ན།   </span>"
 ],
 [
  "78.255a",
  "དུ་མཐོང་ཞིང་འདུན་པ་སྐྱེས་ནས་ཀྱང་ཡང་ཕྱིར་ནུར་བར་འགྱུར་ཞིང་དེ་ནི་སྦྱིན་པ་སྦྱིན་ན་ཡང་འགྱོད་པ་དང་བཅས་པས་སྦྱིན་པར་འགྱུར་ལ། བྱིན་ནས་ཀྱང་སོམ་ཉིར་འགྱུར་བ་དང་། ཆོས་ཀྱི་རྗེས་སུ་འཐུན་པའི་<br>ཆོས་སྨྲ་ན་ཡང་ནུར་བར་འགྱུར་ཏེ། དེས་ལོངས་སྤྱོད་རྒུད་པར་མཐོང་བ་དང་། དེས་བསྟན་པ་རྒུད་པར་མཐོང་བ་དང་། དེས་བཟོད་པ་རྒུད་པ་མཐོང་བ་དང་། དེ་དམིགས་པ་<span class='delete'>མེད་</span><span class='add'>  མང་  </span><span class='delete'>བར་</span><span class='add'>  བར་  </span>འགྱུར་བ་དང་། ཆོས་མ་ཡིན་པ་སྨྲ་བ་<br>གང་ཡིན་པ་ལ་སྟེན་པ་དང་། ཟབ་མོ་ལ་མོས་པའི་གང་ཟག་རྣམས་ལ་མོས་པ་མ་ཡིན་པ་མང་དུ་འགྱུར་ཏེ། བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་གཉིས་པར་བལྟའོ། །གང་གིས་བདག་གཡང་ས་ནས་<span class='delete'>ལྷུང་</span><span class='add'>  ལྷུང  </span>ས་ནས་<br>མཚོན་ཆའི་ནང་དུ་སོན་བར་ཀུན་དུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་པར་བལྟའོ། །གང་གིས་བདག་བྲག་ལས་གཡང་དུ་ལྷུང་བར་ཀུན་དུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་གཉིས་པར་བལྟའོ། །<br>ས་གཞན་ལ་གནས་པ་དག་ལ་ནི་ལས་ཀྱི་སྒྲིབ་པས་གཡང་དུ་ལྷུང་བས་ཀུན་དུ་ཤེས་པ་འབྱུང་གི་བདུད་ཀྱི་ལས་ཀྱི་ནི་མ་ཡིན་ནོ། །དེས་གལ་ཏེ་ཟླ་བ་གསུམ་གྱི་བར་དུ་ཉིན་ལན་གསུམ་མཚན་ལན་གསུམ་<br>དུ་འཇིག་རྟེན་དང་མི་མཐུན་པའི་སྦྱིན་པ་སྤྱད་པར་བྱས་ཤིང་ཤེས་པ་དང་ལྡན་པ་ཡང་མཆོད་<span class='delete'>ལ། །</span><span class='add'>  ལ།   </span>ཞེས་འབྲས་པ་མེད་པའི་སེམས་སུ་ཡང་བྱས་<span class='delete'>ན། །</span><span class='add'>  ན།   </span>དེས་དེའི་ལས་ཀྱི་སྒྲིབ་པ་དེ་རྣམ་པར་དག་པར་འགྱུར་ཞིང་། <br>བྱང་ཆུབ་ཏུ་ངེས་པར་འབྱུང་བར་ཡང་འགྱུར་<span class='delete'>རོ། </span><span class='add'>  རོ། །  </span>རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་<span class='delete'>གི །</span><span class='add'>  གི །  </span>རྨི་ལམ་ན་བདག་བསད་པ་ལས་ཐར་པར་ཀུན་དུ་ཤེས་ན་དེ་ལ་བདུད་ཀྱི་ལས་<br>མང་གི་<span class='delete'>ལས་</span><span class='add'>  ལས་ཀྱི་  </span>སྒྲིབ་པ་ནི་མེད་<span class='delete'>དོ། </span><span class='add'>  དོ། །  </span>དེས་སྨོན་པ་མེད་པའི་ཏིང་ངེ་འཛིན་བསྒོམ་པར་བྱ་ཞིང་བྱམས་པ་ལ་གནས་པར་ཡང་བྱ་སྟེ། བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་དྲུག་པོ་དག་ཏུ་<span class='delete'>བལྟའོ།</span><span class='add'>  བལྟའོ། །  </span>"
 ],
 [
  "78.255b",
  "གང་གིས་བདག་དགོན་པར་བསང་པ་ལས་ཐར་པར་ཀུན་དུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་གཉིས་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གང་གིས་བདག་གྲོང་གི་ཉེན་ཀོར་དུ་གསང་པ་ལས་ཐར་པར་ཀུན་དུ་ཤེས་ན་བྱང་<br>ཆུབ་སེམས་དཔའ་དེ་ནི་ས་ལྔ་པར་བལྟའོ། །གང་གིས་བདག་ཉེ་དུའི་ནང་དུ་<span class='delete'>གསང་</span><span class='add'>  གསད་  </span>པ་ལས་ཐར་པར་ཀུན་དུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དྲུག་པར་བལྟའོ། །མི་བརྩོན་པ་དང་། ལས་དང་པོ་པ་དང་། <br>ལྷག་པའི་བསམ་པ་ཉམ་ཆུང་བ་ལ་ནི་བྱང་ཆུབ་ལས་ཟློག་པའི་ཕྱིར་བདུད་<span class='delete'>ཀྱི་</span><span class='add'>  ཀྱི་  </span>ལས་ཀྱང་འབྱུང་བར་འགྱུར་རོ། །རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་བདག་དགྲའི་ནང་<br>དུ་སོང་བར་ཀུན་དུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་ལྔ་པོ་དག་ཏུ་བལྟ་<span class='delete'>སྟེ། </span><span class='add'>  སྟེ།   </span>དེས་ནི་རྒྱལ་པོར་གྱུར་པ་ན་ཚུལ་ཁྲིམས་དང་ལྡན་<span class='delete'>བ་</span><span class='add'>  པ་  </span>ལ་ནི་བརྩམས་པས་དགྲ་བོ་མང་བ་དང་། བར་ཆད་མང་བ་ཡིན་ཏེ། <br>དེས་མི་གནས་པ་ལ་སྤྱད་པར་བྱ་ཞིང་སྒྲིབ་པ་མེད་པའི་མཐའ་ལ་ཡང་མོས་པར་<span class='delete'>བྱ། །</span><span class='add'>  བྱ།   </span>གཅིག་ཏུ་ཕན་པ་ལ་ཡང་བརྩོན་<span class='delete'>བར་</span><span class='add'>  པར་  </span>བྱ་སྟེ། དེས་ནི་ངའི་ལས་ཀྱི་སྒྲིབ་པ་དེ་རྣམ་པར་དག་པར་འགྱུར་ཞིང་བྱང་ཆུབ་ཏུ་<br>ངེས་པར་འབྱུང་བར་ཡང་འགྱུར་རོ། །གང་གིས་བདག་མཚོན་སྣ་ཚོགས་ཐོགས་པའི་ནང་དུ་སོང་བར་ཀུན་དུ་ཤེས་ན། བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་པར་བལྟའོ། །གང་གིས་བདག་མཚོན་སྣ་གཅིག་<br>ཐོགས་པའི་ནང་དུ་སོང་བར་ཀུན་དུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་གཉིས་པར་བལྟའོ། །གང་གིས་བདག་དབྱུག་པ་ཐོགས་པ་རྣམས་ཀྱི་ནང་དུ་སོང་བར་ཀུན་དུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་<span class='delete'>ས་</span><span class='add'>  ས་  </span><br>གསུམ་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གང་གིས་བདག་རྡོ་བ་ཐོགས་པ་རྣམས་ཀྱི་ནང་དུ་སོང་བར་ཀུན་ཏུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བཞི་<span class='delete'>བར་</span><span class='add'>  པར་  </span><span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གང་གིས་བདག་ལག་པ་སྟོང་པ་རྣམས་ཀྱི་ནང་དུ་སོང་བར་ཀུན་ཏུ་ཤེས་ན་བྱང་ཆུབ་"
 ],
 [
  "78.256a",
  "སེམས་དཔའ་དེ་ནི་ས་ལྔ་<span class='delete'>བར་</span><span class='add'>  པར་  </span>བལྟ་སྟེ། གཞན་དག་ལ་ནི་བདུད་ཀྱི་ལས་སུ་རིག་པར་བྱའོ། །རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་བདག་ནམ་མཁའ་ལ་འགྲོ་བར་<br>ཀུན་དུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་པར་འགྱུར་བ་དང་། དམིགས་པ་ལས་འདའ་བར་འགྱུར་བའི་མཚམས་ལ་གནས་པ་དང་། ལྷ་རྣམས་ཀྱིས་བསམ་པ་ཡིན་ཏེ་དེས་ནི་གཙང་སྦྲར་<br>སྤྱད་པ་དང་། རྟག་ཏུ་བརྩོན་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཡང་དག་པར་འཛིན་དུ་གཞུག་པར་བྱ་ཞིང་སེམས་ཅན་རྣམས་དང་ཕྱོགས་གཅིག་ཏུ་ཡུན་རིང་དུ་གནས་པར་མི་བྱའོ། །དེས་ན་དེའི་ལས་ཀྱི་སྒྲིབ་པ་དེ་<br>རྣམ་པར་དག་པར་འགྱུར་ཞིང་། བྱང་ཆུབ་ཏུ་ངེས་པར་འབྱུང་བར་ཡང་འགྱུར་རོ། །བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་བདུན་པོ་དག་ལས་ས་གང་ཡང་རུང་བར་བལྟའོ། །གལ་ཏེ་ནམ་མཁའ་ལ་སྦྱིན་པ་སྦྱིན་<br>ཞིང་འགྲོ་བར་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་པར་བལྟའོ། །དྲང་སྲོང་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་ལྔ་པར་<span class='delete'>བལྟའོ། </span><span class='add'>  བལྟའོ། །  </span>དགེ་སྦྱོང་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་གསུམ་<br>པར་བལྟའོ། །ཀླུ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བཞི་པར་བལྟའོ། །ལྷ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་ལྔ་པར་བལྟའོ། །ཚངས་པ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དྲུག་པར་བལྟའོ། །<br>བྱང་ཆུབ་སེམས་དཔའ་འམ། དེ་བཞིན་གཤེགས་པ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བདུན་པར་བལྟ་སྟེ། བདུད་ཀྱི་ལས་ནི་མ་གཏོགས་སོ། །རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་<br>གང་གིས་རྨི་ལམ་ན་བདག་གི་ལག་པ་ན་སྒྲོན་མ་ཐོགས་པར་ཀུན་དུ་ཤེས་ན་དེས་ཆོས་ཀྱི་སྣང་བ་བསྒྲུབ་པར་བྱ་སྟེ། བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་ལྔ་པོ་དག་ཏུ་བལྟའོ། །གལ་ཏེ་དེས་ལུས་དང་།"
 ],
 [
  "78.257b",
  "<span class='delete'>བའི་</span><span class='add'>  པའི་  </span>གཟུངས་ཀྱི་སྒྲ་ཐོས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་<span class='delete'>བར་</span><span class='add'>  པར་  </span><span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>ཡི་གེས་མངོན་པར་བསྒྲུབས་པའི་གཟུངས་ཀྱི་སྒྲ་ཐོས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་གཉིས་པར་<span class='delete'>བལྟའོ།་ </span><span class='add'>  བལྟའོ། །  </span>ལེགས་པར་བྲིས་པས་མངོན་<span class='delete'>བར་</span><span class='add'>  པར་  </span><br>བསྒྲུབས་པའི་གཟུངས་ཀྱི་སྒྲ་ཐོས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་གསུམ་པར་བལྟའོ། །ཀླུས་ཡོངས་སུ་བཟུང་<span class='delete'>ཞིང་</span><span class='add'>  བའི་  </span>གཟུངས་ཀྱི་སྒྲ་ཐོས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བཞི་<span class='delete'>པ་</span><span class='add'>  པར་  </span><span class='delete'>བར་</span><span class='add'>    </span><span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>ལྷས་ཡོངས་སུ་བཟུང་བའི་<br>གཟུངས་ཀྱི་སྒྲ་ཐོས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་ལྔ་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གང་གིས་དོན་དམ་པའི་གཟུངས་ཀྱི་སྒྲ་ཐོས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དྲུག་པར་བལྟའོ། །རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་<br>དཔའ་གང་གིས་རྨི་ལམ་ན་ཏིང་ངེ་འཛིན་གྱི་སྒྲ་ཐོས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བརྒྱད་པོ་དག་ལས་ས་གང་ཡང་རུང་བར་བལྟ་སྟེ། དེས་ནི་འཇིག་རྟེན་གསུམ་ལ་ལྷག་པར་ཆགས་པ་མེད་པར་བྱ་ཞིང་རྟག་ཏུ་དབེན་<br>བ་ལ་མངོན་བར་དགའ་བར་ཡང་བྱའོ། །དེ་ལ་ནི་ལས་ཀྱི་སྒྲིབ་པ་ཆུང་ཞིང་དེ་ལ་བདུད་ཀྱི་ལས་ཀྱང་ཆུང་མོད་ཀྱི། འོན་ཀྱང་དེ་ལ་ཉོན་མོངས་པའི་སྒྲིབ་པ་ཤས་ཆེ་བས་དེས་ཆོས་སྣ་ཚོགས་དག་མཉན་<span class='delete'>བར་</span><span class='add'>  པར་  </span>བྱ་ཞིང་སོ་སོར་བརྟག་<br>པ་མང་དུ་ཡང་བྱའོ། །དེས་ན་དེའི་ལས་ཀྱི་སྒྲིབ་པ་དེ་རྣམ་པར་དག་པར་འགྱུར་ཞིང་བྱང་ཆུབ་ཏུ་ངེས་པར་འབྱུང་བར་ཡང་འགྱུར་རོ། །དེ་ལ་རྟོག་པ་དང་<span class='delete'>བཅས་། </span><span class='add'>  བཅས།   </span>དཔྱོད་པ་དང་བཅས་པའི་ཏིང་འཛིན་ནི་ས་དང་པོ་ལ་གནས་<br>བའི་<span class='delete'>འོ། །</span><span class='add'>  འོ། །  </span>རྟོག་པ་མེད་ལ་དཔྱོད་པ་ཙམ་གྱི་ཏིང་ངེ་འཛིན་ནི་ས་གཉིས་པ་ལ་གནས་པའི་<span class='delete'>འོ། །</span><span class='add'>  འོ། །  </span>རྟོག་པ་ཡང་མེད་པ་དཔྱོད་པ་ཡང་མེད་པའི་ཏིང་ངེ་འཛིན་ནི་ས་གསུམ་པ་ལ་གནས་བའི་འོ། །ཚངས་པའི་གནས་པ་ནི་ས་བཞི་པ་ལ་གནས་<br>པའི་<span class='delete'>འོ། །</span><span class='add'>  འོ། །  </span>སྟོང་པ་ཉིད་ཀྱི་ཏིང་ངེ་འཛིན་ནི་ས་ལྔ་པ་ལ་གནས་པའི་<span class='delete'>འོ། །</span><span class='add'>  འོ། །  </span>དགོས་པ་ཐམས་ཅད་མངོན་བར་སྒྲུབ་པ་ནི་ས་དྲུག་པ་ལ་གནས་པའི་<span class='delete'>འོ། །</span><span class='add'>  འོ། །  </span>རིག་པ་ཆེན་པོའི་ས་བདུན་པ་ལ་གནས་པའི་<span class='delete'>འོ། །</span><span class='add'>  འོ། །  </span>སངས་རྒྱས་ཀྱི་བཀོད་པ་བསྒྲུབ་པ་ནི་ས་"
 ],
 [
  "78.257a",
  "ཕྱིར་བྱུང་བ་མཐོང་ན་ས་དྲུག་པར་བལྟ་སྟེ། བདུད་ཀྱི་ལས་ནི་མ་གཏོགས་སོ། །རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་གླེགས་བམ་རྙེད་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་<br>ས་དང་པོ་གསུམ་པོ་དག་ལས་ས་གང་ཡང་རུང་བར་བལྟ་སྟེ། བྱང་ཆུབ་སེམས་དཔའ་དེ་ལ་ནི་ཕྱིར་རྒོལ་བ་དང་། སྐུར་བ་འདེབས་པ་མང་པོ་དག་འབྱུང་བར་འགྱུར་ཡང་བར་ཆད་བྱེད་<span class='delete'>བར་</span><span class='add'>  པར་  </span>ནི་མི་འགྱུར་རོ། །<br>དེས་སྡིག་པ་<span class='delete'>བཤམས་</span><span class='add'>  བཤགས་  </span>པ་ལན་མང་དུ་བྱ་ཞིང་རྟག་ཏུ་མངོན་བར་བརྩོན་བར་ཡང་བྱ་སྟེ། དེས་ན་དེའི་ལས་ཀྱི་སྒྲིབ་པ་རྣམ་པར་དག་པར་ཡང་འགྱུར་ཞིང་བྱང་ཆུབ་ཏུ་ངེས་པར་འབྱུང་བར་ཡང་འགྱུར་<span class='delete'>ཏེ། </span><span class='add'>  རོ། །  </span><span class='delete'>གལ་</span><span class='add'>  གལ་  </span>ཏེ་<br>འཇིག་རྟེན་པ་དང་། ཉན་ཐོས་དང་ལྡན་བའི་གླེགས་བམ་རྙེད་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་བར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་ལྡན་པའི་གླེགས་བམ་རྙེད་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་<br>གཉིས་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གང་གིས་ཟབ་མོ་དང་ལྡན་བའི་གླེགས་བམ་རྙེད་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་གསུམ་པར་བལྟའོ། །བརྩོན་<span class='delete'>བ་</span><span class='add'>  པ་  </span>དག་ལ་ལྷའི་བུས་བྱིན་ནམ། བྱང་ཆུབ་སེམས་དཔའ་འམ། དེ་བཞིན་གཤེགས་<br>པ་ཆོས་ཀྱི་གདན་ལ་བཞུགས་པས་བྱིན་ན་དེ་ནི་ས་བདུན་བའི་བར་དག་ཏུ་ཡང་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་གཟུངས་ཀྱི་སྒྲ་ཐོས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་<br>དང་པོ་དྲུག་པོ་དག་ལས་ས་གང་ཡང་རུང་བར་བལྟ་སྟེ། སངས་རྒྱས་རྣམས་ལས་མངོན་སུམ་དུ་གཟུངས་ཐོབ་པ་ཡིན་ནོ། །བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ལས་ཀྱི་སྒྲིབ་པ་ཆུང་ལ་བདུད་ཀྱི་ལས་མང་བ་ཡིན་<span class='delete'>བས་</span><span class='add'>  པས་  </span>དེས་ན་སྤོབས་<br><span class='delete'>བ་</span><span class='add'>  པ་  </span>སྦྱིན་<span class='delete'>བར་</span><span class='add'>  པར་  </span>བྱ་ཞིང་གླགས་ལྟ་བ་མེད་པ་ལ་བརྩོན་<span class='delete'>བར་</span><span class='add'>  པར་  </span>ཡང་བྱ་སྟེ། དེས་ན་དེའི་ལས་ཀྱི་སྒྲིབ་པ་དེ་རྣམ་པར་དག་པར་འགྱུར་ཞིང་བྱང་ཆུབ་ཏུ་ངེས་པར་འབྱུང་བར་ཡང་འགྱུར་རོ། །གལ་ཏེ་ཚིགས་སུ་བཅད་པས་མངོན་པར་བསྒྲུབས་"
 ],
 [
  "78.256b",
  "སྲོག་ལ་མི་ལྟ་བར་ཟང་ཟིང་མེད་པ་ལ་རབ་ཏུ་སྦྱོར་བར་བྱེད་ཅིང་ཡེ་ཤེས་ཀྱི་སྤྱོད་པ་ལ་ཡང་ནེམ་ནུར་མེད་པར་བྱས་ན། དེས་ན་དེའི་ལས་ཀྱི་སྒྲིབ་པ་རྣམ་པར་དག་པར་འགྱུར་ཞིང་བྱང་ཆུབ་ཏུ་ངེས་པར་འབྱུང་བར་<br>ཡང་འགྱུར་རོ། །དེ་<span class='delete'>ལས་</span><span class='add'>  ལ་ས་  </span>དང་པོ་ལ་གནས་པ་ནི་དམིགས་པ་ལ་མངོན་པར་བརྩོན་པ་ལ་དགའ་<span class='delete'>འབར་</span><span class='add'>  བར་  </span>བྱེད་<span class='delete'>དོ། །</span><span class='add'>  དོ། །  </span>ས་གཉིས་པ་ལ་གནས་པ་ནི་བསམ་གཏན་ལ་མངོན་པར་དགའ་བར་བྱེད་དོ། །ས་གསུམ་<br>པ་ལ་གནས་པ་ནི་བྱམས་པ་ལ་དགའ་བར་བྱེད་དོ། །ས་བཞི་པ་ལ་གནས་པ་ནི་སྙིང་རྗེ་ལ་དགའ་བར་བྱེད་དོ། །ས་ལྔ་པ་ལ་གནས་པ་ནི་གཏང་སྙོམས་ལ་དགའ་བར་བྱེད་<span class='delete'>དོ། །</span><span class='add'>  དོ། །  </span>ས་དང་པོ་ལ་གནས་པ་སྣང་བར་འདོད་པས་<br>ནི་སངས་རྒྱས་རྗེར་སུ་དྲན་པ་བསྒོམ་པར་བྱའོ། །ས་གཉིས་པ་ལ་གནས་པས་ནི་མཆོག་ཏུ་དགའ་བ་སྦྱིན་པར་<span class='delete'>བྱའོ། །</span><span class='add'>  བྱའོ། །  </span>ས་གསུམ་པ་ལ་གནས་པས་ནི་ཐོས་པ་བཙལ་བར་<span class='delete'>བྱའོ། །</span><span class='add'>  བྱའོ། །  </span>ས་བཞི་པ་ལ་གནས་པས་ནི་གཟུངས་<span class='delete'>བསྒོམ་</span><span class='add'>  བསྒོྃམ་  </span><br>བར་བྱའོ། །ས་ལྔ་པ་ལ་གནས་པས་ནི་<span class='delete'>ཞི་</span><span class='add'>    </span>སྟོང་པ་ཉིད་ལ་བསྒོམ་བར་བྱ་སྟེ། དེས་ན་སྣང་བ་འཐོབ་པར་འགྱུར་རོ། །རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་བྱང་ཆུབ་སེམས་དཔའ་ཕྱིར་<br>བྱུང་བ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་དྲུག་པོ་དག་ལས་ས་གང་ཡང་རུང་བར་བལྟ་སྟེ། དེ་ཚེ་རྗེས་ནས་ཕྱིར་མི་ལྡོག་པའི་ས་འཐོབ་པར་འགྱུར་ཞིང་འདི་ཙམ་ཞིག་ན་སངས་རྒྱས་སུ་འགྱུར་རོ་ཞེས་ལུང་བསྟན་པར་<br>འགྱུར་བའི་མཚམས་བཅད་པ་ཡང་ཡིན་ནོ། །གང་གིས་རྐང་པས་ཕྱིར་བྱུང་བར་མཐོང་ན་དེ་ནི་ས་དང་པོ་<span class='delete'>བར་</span><span class='add'>  པར་  </span><span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གང་གིས་གླང་གི་ཤིང་རྟས་ཕྱིར་བྱུང་བ་མཐོང་ན་དེ་ནི་ས་གཉིས་པར་<span class='delete'>བལྟའོ། </span><span class='add'>  བལྟའོ། །  </span>གང་གིས་རྟའི་ཤིང་རྟས་ཕྱིར་<br>བྱུང་བ་མཐོང་ན་དེ་ནི་ས་གསུམ་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གང་གིས་གླང་པོ་ཆེའི་ཤིང་རྟས་ཕྱིར་བྱུང་བ་མཐོང་ན་དེ་ནི་ས་བཞི་<span class='delete'>བར་</span><span class='add'>  པར་  </span>བལྟའོ། །གང་གིས་མིའི་ཤིང་རྟས་ཕྱིར་བྱུང་བ་མཐོང་ན་དེ་ནི་ས་ལྔ་པར་བལྟའོ། །གང་གིས་ནམ་མཁའ་ལས་"
 ],
 [
  "78.258b",
  "པར་འབྱུང་བར་ཡང་འགྱུར་རོ། །གང་གིས་སྔོན་མ་མཐོང་བའི་དགེ་སློང་གི་མིང་ཐོས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་པར་བལྟའོ། །གང་གིས་སྔོན་མ་ཐོས་པའི་དགེ་སློང་གི་མིང་ཐོས་ན་དེ་ནི་ས་གཉིས་<br>པར་བལྟའོ། །གང་གིས་འཇིག་རྟེན་གྱི་ཁམས་གཞན་གྱི་དགེ་སློང་གི་མིང་ཐོས་ན་དེ་ནི་ས་གསུམ་པར་<span class='delete'>བལྟའོ་</span><span class='add'>  བལྟའོ། །  </span>གང་གིས་སྐྱེ་བ་གཅིག་གིས་ཐོགས་པའི་མིང་ཐོས་ན་དེ་ནི་ས་བཞི་པར་བལྟ་སྟེ། ས་གོང་མ་དག་ཏུ་ཡང་འདོད་<br>པར་བྱའོ། །རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་བདག་ཚིགས་སུ་བཅད་པ་ལ་སྤོབས་པ་ཐོབ་པར་ཀུན་དུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་གསུམ་པོ་<br>དག་ཏུ་བལྟ་སྟེ། བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་སྤོབས་པ་ཕུན་སུམ་ཚོགས་པ་ཡིན་ནོ། །དེས་གལ་ཏེ་ཆོས་གསུམ་ཡོངས་སུ་སྤངས་ན་མྱུར་དུ་སྣང་བ་འཐོབ་པར་འགྱུར་ཏེ། ཆོས་གསུམ་གང་ཞེ་ན། བྱང་ཆུབ་སེམས་<br>དཔའ་གང་གཞན་མཆོད་པ་ལ་ཕྲག་དོག་བྱེད་པ་དང་། རྙེད་པ་དང་བཀུར་སྟི་འདོད་པ་དང་། གཡོ་ལ་བསྟེན་པ་སྟེ། ཆོས་གསུམ་པོ་དེ་དག་ཡོངས་སུ་སྤངས་པར་བྱའོ། །དེས་ན་དེའི་ལས་ཀྱི་སྒྲིབ་པ་དེ་རྣམ་པར་དག་པར་འགྱུར་<br>ཞིང་བྱང་ཆུབ་ཏུ་ངེས་པར་འབྱུང་བར་ཡང་འགྱུར་རོ། །<span class='delete'>གལ་</span><span class='add'>  གལ་ཏེ་  </span><span class='delete'>ཏ་ེ་</span><span class='add'>    </span>ཚིགས་སུ་བཅད་པ་ཉུང་ངུ་ལ་སྤོབས་ན་དེ་ནི་ས་དང་པོ་པར་བལྟའོ། །ཚིགས་སུ་བཅད་པ་སྣ་ཚོགས་ལ་སྤོབས་ན་ས་གཉིས་པར་རོ། །ཟབ་མོའི་ཚིགས་སུ་<br>བཅད་པ་ལ་སྤོབས་ན་ས་གསུམ་པར་རོ། །རྣམ་པ་མང་པོ་དག་ལ་སྤོབས་ན་ས་གོང་མར་རོ། །རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་བདག་མདོ་སྡེ་ལ་སྤོབས་པ་ཐོབ་པར་ཀུན་དུ་ཤེས་<br>ན་དེ་ནི་ས་དང་པོ་བརྒྱད་པོ་དག་ཏུ་བལྟ་སྟེ། དེ་ལ་དགྲ་བོ་མང་པོ་<span class='delete'>དང་། </span><span class='add'>  དང་།   </span>ཡོན་ཏན་མང་<span class='delete'>པ་</span><span class='add'>  བ་  </span><span class='delete'>དང་། </span><span class='add'>  དང་།   </span>ཡོན་ཏན་མང་<span class='delete'>པ་</span><span class='add'>  བ་  </span>ཡིན་<span class='delete'>བས་</span><span class='add'>  པས་  </span>དེས་ཡང་དག་པར་མགུ་བར་བྱེད་པའི་ངང་ཚུལ་ཅན་དུ་བྱ་ཞིང་ཁྱད་པར་དུ་འཕགས་པ་དག་ལ་"
 ],
 [
  "78.258a",
  "བརྒྱད་པ་ལ་གནས་པའི་<span class='delete'>འོ། །</span><span class='add'>  འོ། །  </span>རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་ཤིན་དུ་རྒྱས་པའི་སྡེའི་མདོ་སྡེའི་སྒྲ་ཐོས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་དྲུག་པོ་དག་ཏུ་བལྟ་སྟེ། དེས་<br>ནི་ཆོས་ལ་མོས་པ་དང་། <span class='delete'>དེས་</span><span class='add'>  ངེས་  </span>པར་གྱུར་པ་ལ་བཟོད་པར་བྱའོ། །བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་སྒྲིབ་པ་ཆུང་བ་དང་། རྟོགས་པ་བུལ་བ་ཡིན་པས་དེས་གཅིག་ཏུ་ཡོངས་སུ་ཞུ་བའི་<span class='delete'>དང་</span><span class='add'>  ངང་  </span>ཚུལ་ཅན་དང། བསྙེན་བཀུར་བྱ་བ་ལ་གདུ་བར་<br>བྱ་སྟེ། དེས་ན་དེའི་ལས་ཀྱི་སྒྲིབ་པ་དེ་རྣམ་པར་དག་པར་འགྱུར་རོ། །སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་མདོ་སྡེའི་སྒྲ་ཐོས་ན་ས་དང་པོ་<span class='delete'>བར་</span><span class='add'>  པར་  </span><span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་མདོ་སྡེའི་སྒྲ་ཐོས་ན་ས་གཉིས་པར་<br><span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པའི་མདོ་སྡེའི་སྒྲ་ཐོས་ན་ས་གསུམ་པར་བལྟའོ། །བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་མདོ་སྡེའི་སྒྲ་ཐོས་ན་ས་བཞི་པར་བལྟའོ། །བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་མདོ་སྡེའི་སྒྲ་<br>ཐོས་ན་ས་ལྔ་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་མདོ་སྡེའི་སྒྲ་ཐོས་ན་ས་དྲུག་པར་བལྟའོ། །མངོན་པར་བརྩོན་པ་དང་། སངས་རྒྱས་ཀྱིས་བྱིན་གྱིས་བརླབས་པ་དང་། ལྷག་པའི་བསམ་པ་ཕུན་སུམ་<br>ཚོགས་པའི་གང་ཟག་ནི་མ་གཏོགས་སོ། །རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་ཆོས་སྨྲ་བའི་དགེ་སློང་ཆེ་གེ་མོ་ཞེས་བྱ་བ་རྣམས་ཀྱི་མིང་ཐོས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་<br>དང་པོ་བཞི་པོ་དག་ཏུ་བལྟ་སྟེ། དེས་ནི་དགེ་བའི་བཤེས་གཉེན་ལ་བསྟེན་པར་བྱའོ། །བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་བར་ཆད་མང་བ་<span class='delete'>དང་། </span><span class='add'>  དང་།   </span>སེམས་ལ་འགྱོད་པ་མང་བ་དང། ཤེས་རབ་ཞན་པ་ཡིན་ཏེ། དེས་སེམས་<br>ཅན་ཐམས་ཅད་ལ་ཞེ་འགྲས་པ་མེད་པའི་སེམས་<span class='delete'>དང་། </span><span class='add'>  དང་།   </span>ཐབས་ལ་མཁས་པ་<span class='delete'>དང་། </span><span class='add'>  དང་།   </span>ཐབས་ཀྱི་སྡོམ་པ་<span class='delete'>དང་། </span><span class='add'>  དང་།   </span>ཡིད་ལ་ནེམ་ནུར་མེད་པར་བྱའོ། །དེས་ན་དེའི་ལས་ཀྱི་སྒྲིབ་པ་དེ་རྣམ་པར་དག་པར་འགྱུར་ཞིང་བྱང་ཆུབ་ཏུ་ངེས་"
 ],
 [
  "78.259a",
  "མཆོད་པར་བྱ་བ་དང་། ཇི་ལྟ་བ་བཞིན་དུ་སྤྱོད་པའི་གང་ཟག་ལ་ཡང་མཆོད་པར་བྱ་ཞིང་ཤེས་པས་ལྷག་པའི་ང་རྒྱལ་དུ་ཡང་མི་བྱའོ། །དེས་ན་དེའི་ལས་ཀྱི་སྒྲིབ་པ་དེ་ཡང་རྣམ་པར་དག་པར་འགྱུར་ཞིང་རྨི་ལམ་དུ་<br>རྨིས་པའི་ལས་ཀྱི་སྒྲིབ་པ་དེ་ཡང་རྣམ་པར་དག་པར་འགྱུར་ལ་མྱོང་བར་འགྱུར་བ་ཆུང་བར་ཡང་འགྱུར་ཞིང་བྱང་ཆུབ་ཏུ་ངེས་པར་འབྱུང་བར་ཡང་འགྱུར་རོ། །དེ་ལ་བཞི་<span class='delete'>བསྒྲུབ་</span><span class='add'>  བ་སྒྲུབ་  </span>པ་ལ་སྤོབས་ན་ས་དང་པོ་ལ་གནས་པར་འགྱུར་རོ། །<br>ཡོ་བྱད་བསྙུངས་པ་སྒྲུབ་པའི་མདོ་སྡེ་ལ་སྤོབས་ན་ས་གཉིས་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>སྣ་ཚོགས་སྒྲུབ་པའི་མདོ་སྡེ་ལ་སྤོབས་ན་ས་གསུམ་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>སྔོན་གྱི་ཚུལ་སྒྲུབ་པའི་<span class='delete'>མོད་</span><span class='add'>  མདོ་  </span>སྡེ་ལ་སྤོབས་ན་ས་བཞི་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>དུས་གསུམ་སྒྲུབ་པའི་མདོ་སྡེ་<br>ལ་སྤོབས་ན་ས་ལྔ་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>ཕ་རོལ་དུ་ཕྱིན་པའི་མདོ་སྡེ་ལ་སྤོབས་ན་ས་དྲུག་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>མདོ་སྡེ་ཟབ་མོ་ལ་སྤོབས་ན་ས་བདུན་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>ཐམས་ཅད་རྣམ་པར་གཏན་ལ་འབེབས་པ་ལ་སྤོབས་<span class='delete'>ནས་</span><span class='add'>  ན་ས་  </span>བརྒྱད་པར་བལྟའོ། །རྡོ་རྗེས་<br>རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་ཆོས་ཀྱི་གཏེར་གྱི་སྒྲ་ཐོས་ན་དེ་ནི་ས་དང་པོ་བདུན་པོ་དག་ཏུ་བལྟའོ། །བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ཉོན་མོངས་པ་མང་ལ་ལས་ཀྱི་སྒྲིབ་པ་ཆུང་བ་ཡིན་ཏེ། དེས་<br>ཡོངས་སུ་འདྲི་<span class='delete'>པའི་</span><span class='add'>  བའི་  </span>རང་བཞིན་ཅན་དུ་བྱ་ཞིང་<span class='delete'>དང་</span><span class='add'>  དད་  </span>པས་མོས་པར་ཡང་བྱའོ། །དེས་ན་དེའི་ལས་ཀྱི་སྒྲིབ་བ་དེ་རྣམ་པར་དག་པར་འགྱུར་ཞིང་བྱང་ཆུབ་ཏུ་ངེས་བར་འབྱུང་བར་ཡང་འགྱུར་རོ། །གང་གིས་བདག་གྲོང་ན་འདུག་<br><span class='delete'>བ་</span><span class='add'>  པ་  </span>ན་ཆོས་ཀྱི་གཏེར་གྱི་སྒྲ་ཐོས་པར་ཀུན་དུ་ཤེས་ན་དེ་ནི་ས་དང་པོ་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གང་གིས་བདག་གནས་ཁང་དུ་འདུག་པར་ཀུན་དུ་ཤེས་ན་དེ་ནི་ས་གཉིས་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>གང་གིས་བདག་གཙུག་ལག་ཁང་ན་འདུག་པར་ཀུན་<br>དུ་ཤེས་ན་དེ་ནི་ས་གསུམ་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>གང་གིས་བདག་དགོན་པ་ན་འདུག་པར་ཀུན་དུ་ཤེས་ན་དེ་ནི་ས་བཞི་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>གང་གིས་བདག་སྟན་ལ་འདུག་པར་ཀུན་དུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་ལྔ་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>གང་"
 ],
 [
  "78.260b",
  "རིན་པོ་ཆེ་དག་ཐུ་བར་ཀུན་དུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་གསུམ་པོ་དག་ལས་ས་གང་ཡང་རུང་བར་བལྟ་<span class='delete'>སྟེ། །</span><span class='add'>  སྟེ།   </span>དེ་ལ་ནི་རྣམ་པར་ཐོ་འཚམ་པ་མང་ཞིང་དཀར་པོའི་ཆོས་རྣམས་ཀྱང་སྡུག་བསྔལ་བས་ཡང་དག་པར་<br>འཐོབ་པར་འགྱུར་ཏེ། དེས་ཆོས་འདོད་པར་བྱ་བ་<span class='delete'>ལ། </span><span class='add'>  ལ།   </span>ཆོས་སྨྲ་བ་དག་ལ་འཁྲུལ་པ་མི་བཙལ་ཞིང་བྱས་པ་གཟོ་བར་ཡང་བྱའོ། །དེས་ན་དེའི་ལས་ཀྱི་སྒྲིབ་པ་རྣམ་པར་དག་པར་འགྱུར་ཞིང་བྱང་ཆུབ་ངེས་པར་འབྱུང་བར་<br>ཡང་འགྱུར་རོ། །གང་གིས་ས་བརྐོས་ནས་རིན་པོ་ཆེ་དག་རྙེད་ན། དེ་ནི་ས་དང་པོ་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གང་གིས་ས་རྡུལ་དང་འདྲེས་པ་རྙེད་ན་དེ་ནི་ས་གཉིས་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གང་གིས་རྩྭ་དང་<span class='delete'>འདྲེས་</span><span class='add'>  འདྲེས་  </span>པ་རྙད་ན་དེ་<span class='delete'>ན་</span><span class='add'>  ན་ས་  </span>གསུམ་པར་<br><span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>མངོན་པར་བརྩོན་པར་བདག་གི་མཚན་མ་ནི་དེ་དག་ཡིན་<span class='delete'>གྱི་། </span><span class='add'>  གྱི།   </span>མངོན་བར་མི་བརྩོན་པ་དག་ལ་ནི་བདུད་ཀྱི་ལས་དག་ཀྱང་ཡོད་དེ་ལྷག་པར་ཡང་ས་དྲུག་པ་ལ་འབྱུང་<span class='delete'>ངོ་། །</span><span class='add'>  ངོ་། །  </span>ས་བཞི་པ་ལ་མི་བརྩོན་པ་དང་ལྡན་བ་དག་<br>བདུད་ཀྱི་ལས་དང་ལས་ཀྱི་སྒྲིབ་པ་ལས་མ་གྲོལ་བ་ཡིན་ནོ། །རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་བདག་རི་རབ་ཀྱི་རྩེ་<span class='delete'>མར་</span><span class='add'>  མོར་  </span>སོན་<span class='delete'>བར་</span><span class='add'>  པར་  </span>ཀུན་དུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་<br>ནི་ས་དང་པོ་ལྔ་<span class='delete'>བོ་</span><span class='add'>  པོ་  </span>དག་ལས་ཕྱིར་མི་ལྡོག་པར་བལྟ་སྟེ། དེ་ལ་ནི་སྡིག་པའི་གྲོགས་པོའི་དབང་<span class='delete'>དང་། </span><span class='add'>  དང་།   </span><span class='delete'>གཡོལ་</span><span class='add'>  གཡོ་ལ་  </span>བསྟེན་པ་དང་། མ་མོས་པ་མང་བས་ཡོན་ཏན་གང་ཡིན་<span class='delete'>བ་</span><span class='add'>  པ་  </span>དག་ཅུང་ཟད་ཀྱང་མི་སྐྱེ་སྟེ། དེས་ནི་དགེ་བའི་<br>བཤེས་གཉེན་ལ་བསྟེན་པར་བྱ་ཞིང་གཡོ་མེད་པ་དང་མོས་པ་མང་དུ་ཡང་བྱའོ། །དེས་ན་དེའི་ལས་ཀྱི་སྒྲིབ་པ་དེ་རྣམ་པར་དག་བར་འགྱུར་ཞིང་བྱང་ཆུབ་ཏུ་ངེས་པར་འབྱུང་བར་ཡང་འགྱུར་རོ། །གང་གིས་བདག་རི་རབ་ལ་<br><span class='delete'>འཇོག་</span><span class='add'>  འཛེག་  </span>པར་ཀུན་དུ་ཤེས་ན་དེ་ནི་ས་དྲུག་པར་རོ། །<span class='delete'>འཇོགས་</span><span class='add'>  འཛེགས་  </span>ཏེ་འགྲེང་ན་ས་བདུན་པར་རོ། །བདག་ཕྱོགས་བཞིར་རྣམ་པར་ལྟ་ན་ས་བརྒྱད་པར་རོ། །འདུག་ན་ས་དགུ་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>སྒུལ་བར་བྱེད་ན་ས་བཅུ་པར་རོ། །ས་དང་པོ་"
 ],
 [
  "78.260a",
  "ལས་ཀྱི་སྒྲིབ་པ་དེ་རྣམ་པར་དག་པར་འགྱུར་ཞིང་བྱང་ཆུབ་ཏུ་ཏུ་ངེས་པར་འབྱུང་བར་ཡང་འགྱུར་རོ། །གཟུངས་ཐོབ་པའི་མིང་ཐོས་ན་ས་དང་པོ་པར་འགྱུར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>མངོན་པར་འབྱུང་བའི་ན་ས་གཉིས་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span><br>དཀའ་བ་སྤྱོད་པའི་ན་ས་གསུམ་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>བྱང་ཆུབ་ཀྱི་སྙིག་པོར་བདུད་འདུལ་བར་བྱེད་པའི་ན་ས་བཞི་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བའི་ན་ས་ལྔ་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>མང་དུ་ཐོས་ཤིང་མཐོང་ན་གོང་མར་ཡང་འགྱུར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span><br>གནས་མེད་ཅིང་ལྷག་པའི་བསམ་<span class='delete'>མཉམ་</span><span class='add'>  པ་ཉམ་  </span>ཆུང་བ་ཞིག་གི་<span class='delete'>གནས་</span><span class='add'>  ན་ས་  </span>དང་པོ་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>འགྱོད་པ་དང་བཅས་པར་གནས་པའི་ན་ས་གཉིས་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>སྡིག་པ་བྱེད་པའི་ན་ས་གསུམ་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>མངོན་པར་བག་མེད་པའི་ན་ས་<br>བཞི་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>ཞི་གནས་མང་བའི་ན་ས་ལྔ་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་བདག་རྒྱ་མཚོའི་དབུས་ན་འདུག་པར་ཀུན་དུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་<br>བརྒྱད་པོ་དག་ལས་ས་གང་ཡང་རུང་བར་ལུང་བསྟན་པར་བལྟ་སྟེ། དེས་ནི་ཐོས་པའི་མཐར་ཕྱིན་པར་བྱ་ཞིང་དེས་བརྩོན་འགྲུས་དང་ལྡན་པ་དང་། ཤེས་རབ་ལ་མོས་པར་ཡང་<span class='delete'>བྱའོ། །</span><span class='add'>  བྱའོ། །  </span>དེས་ན་དེའི་ལས་ཀྱི་སྒྲིབ་པ་དེ་རྣམ་པར་དག་<br>པར་འགྱུར་ཞིང་བྱང་ཆུབ་ཏུ་ངེས་པར་འབྱུང་བར་ཡང་འགྱུར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>གང་གིས་མ་ཕྱིན་པར་མཐོང་ན་དེ་ནི་ས་དང་པོ་<span class='delete'>བར་</span><span class='add'>  པར་  </span><span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གང་གིས་འགྲམ་དུ་སོན་པར་མཐོང་ན་དེ་ནི་ས་གཉིས་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གང་གིས་སྤང་ལེབ་ལ་འདུག་<br>པར་མཐོང་ན་དེ་ནི་ས་གསུམ་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>གང་གིས་ཀོ་གྲུར་ཞུགས་པ་མཐོང་ན་དེ་ནི་ས་བཞི་པར་རོ། །གང་གིས་གྲུ་ན་འདུག་པར་མཐོང་ན་དེ་ནི་ས་ལྔ་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>གང་གིས་ཆུ་ན་འདུག་པར་མཐོང་ན་དེ་ནི་ས་དྲུག་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>གང་གིས་གྲུ་ན་བགྲེང་<br>བར་མཐོང་ན་དེ་ནི་ས་བདུན་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>གང་གིས་རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱིས་བཀང་བའི་གྲུ་ཕ་རོལ་དུ་སྒྲོལ་བར་མཐོང་ན་དེ་ནི་ས་བརྒྱད་པར་རོ། །རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་བདག་"
 ],
 [
  "78.259b",
  "གིས་བདག་བསྐྱེད་མོས་ཚལ་ན་འདུག་པར་ཀུན་དུ་ཤེས་ན་དེ་ནི་ས་དྲུག་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>གང་གིས་བདག་རིའི་རྩེ་མོ་ལ་འདུག་པར་ཀུན་དུ་ཤེས་ན་དེ་ནི་ས་བདུན་པར་བལྟའོ། །རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་<br>ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་སྔོན་མ་ཐོས་པའི་འཇིག་རྟེན་གྱི་ཁམས་གཞན་གྱི་དེ་བཞིན་གཤེགས་པའི་མཚན་ཐོས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་བརྒྱད་པོ་དག་ཏུ་ལུང་བསྟན་པ་ཡིན་<br>ཏེ་ང་རྒྱལ་གྱི་དབང་གིས་ངེས་པར་འབྱུང་བར་འགྱུར་རོ། །དེས་ནི་བདུད་ཀྱི་ལས་མང་དུ་ཉེ་བར་བསགས་ཤིང་དེ་ལ་ལས་ཀྱི་སྒྲིབ་པ་མང་བ་ཡང་ཡིན་ནོ། །དེས་གལ་ཏེ་མཆོད་པར་འོས་པ་མཆོད་ཅིང་སྤྱོད་ལམ་<br>བརྟགས་པ་མ་ཡིན་ན། དེས་དེའི་ལས་ཀྱི་སྒྲིབ་པ་དེ་རྣམ་པར་དག་པར་འགྱུར་ཞིང་བྱང་ཆུབ་ཏུ་ངེས་པར་འབྱུང་བར་ཡང་འགྱུར། དེ་ལ་གཏོང་བ་ལ་ང་རྒྱལ་བྱེད་ན་ས་དང་པོ་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>ཚུལ་ཁྲིམས་ལ་ང་རྒྱལ་<br>བྱེད་ན་ས་གཉིས་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>ཐོས་པ་ལ་ང་རྒྱལ་བྱེད་ན་ས་གསུམ་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>མངོན་པར་བརྩོན་པ་ལ་ང་རྒྱལ་བྱེད་ན་ས་བཞི་<span class='delete'>བར་</span><span class='add'>  པར་  </span><span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>ཡོ་བྱད་བསྙུངས་པ་ལ་ང་རྒྱལ་བྱེད་ན་ས་ལྔ་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>ཤེས་པ་ལ་ང་རྒྱལ་བྱེད་ན་ས་དྲུག་<span class='delete'><br></span><span class='add'>    </span><span class='delete'>བར་</span><span class='add'>  པར་  </span><span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>སྤོབས་པ་ལ་ང་རྒྱལ་བྱེད་ན་ས་བདུན་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>བྱིན་གྱིས་བརླབས་ལ་ང་རྒྱལ་བྱེད་ན་ས་བརྒྱད་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>བྱ་བ་ཐམས་ཅད་མཐར་ཕྱིན་པར་བྱེད་ན་ནི་ང་རྒྱལ་ཡིན་ནོ། །རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་<br>སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་འཇིག་རྟེན་གྱི་ཁམས་ཆེ་གེ་མོ་ཞིག་བྱང་ཆུབ་སེམས་དཔའ་ཆེ་གེ་མོ་ཞེས་བྱ་བའི་མིང་ཐོས་ན། བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་ལྔ་པོ་དག་ཏུ་བལྟ་སྟེ། བྱང་ཆུབ་སེམས་<br>དཔའ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱིས་བསམས་པ་<span class='delete'>དང་། </span><span class='add'>  དང་།   </span>ཉོན་མོངས་ཆུང་བ་ཡིན་བར་རིག་པར་<span class='delete'>བྱའོ། །</span><span class='add'>  བྱའོ། །  </span>དེས་གལ་ཏེ་ལྷག་པའི་ང་རྒྱལ་མེད་པར་བྱས་ཤིང་ཉེ་དུ་རྣམས་ལ་ཡང་བཀུར་སྟི་<span class='delete'>ཆར་</span><span class='add'>  ཆེར་  </span>བྱས་ན་<span class='delete'>དེས་</span><span class='add'>  དེས་  </span>དེའི་"
 ],
 [
  "78.261a",
  "ནས་ས་བདུན་པའི་བར་དག་གིས་ནི་མངོན་པར་བརྩོན་པ་འམ། བསམ་པ་ཕུན་སུམ་ཚོགས་<span class='delete'>པའམ། </span><span class='add'>  པ་འམ།   </span>དགེ་བའི་བཤེས་གཉེན་གྱི་ལག་ཏུ་སོན་<span class='delete'>པའམ། </span><span class='add'>  པ་འམ།   </span>བདུད་ཀྱི་ལས་ཀྱིས་མཐོང་བར་འགྱུར་རོ། །རྡོ་རྗེས་<br>རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་བདག་རི་ལ་འཛེག་པར་ཀུན་དུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་ལྔ་པོ་དག་ཏུ་བལྟ་སྟེ། བྱང་ཆུབ་སེམས་དཔའ་དེ་ལ་ནི་རྣམ་པ་ཐམས་<br>ཅད་དུ་གནོད་པ་དག་ཀུན་འབྱུང་བར་འགྱུར་རོ། །དེས་ནི་ཆོས་སྨྲ་བ་ལ་བརྙས་པར་བྱས་པ་ཡིན་པས་<span class='delete'>དེད་</span><span class='add'>  དེས་  </span>དངོས་པོ་ཐམས་ཅད་སྦ་བ་མེད་པར་བྱའོ། །དེས་ན་དེའི་ལས་ཀྱི་སྒྲིབ་པ་དེ་རྣམ་པར་དག་པར་འགྱུར་ཞིང་བྱང་ཆུབ་<br>ཏུ་ངེས་པར་འབྱུང་བར་ཡང་འགྱུར་ཏེ། ས་དང་པོ་ལ་ནི་ཕུང་པོ་གསུམ་པའི་ཆོས་ཀྱི་རྣམ་གྲངས་གདོན་པར་<span class='delete'>བྱའོ། །</span><span class='add'>  བྱའོ། །  </span>ས་གཉིས་པ་ལ་ནི་སངས་རྒྱས་རྗེས་སུ་དྲན་པ་བསྒོམ་<span class='delete'>པར་</span><span class='add'>  པར་  </span><span class='delete'>བྱའོ། །</span><span class='add'>  བྱའོ། །  </span>ས་གསུམ་པ་ལ་ནི་སྟོང་པ་<br>ཉིད་བསྒོམ་བར་<span class='delete'>བྱའོ། །</span><span class='add'>  བྱའོ། །  </span>ས་བཞི་པ་ལ་ནི་སྙིང་རྗེ་ཆེན་པོ་བསྒོམ་པར་བྱའོ། །ས་ལྔ་པ་ལ་ནི་ལྷག་མཐོང་བསྒོམ་པར་བྱའོ། །གང་གིས་བདག་རི་ལ་འཛེག་པར་ཀུན་དུ་ཤེས་ན་དེ་ནི་ས་དང་པོ་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གང་གིས་<br>དབུས་སུ་ཕྱིན་ན་དེ་ནི་ས་གཉིས་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>གང་གིས་རྩེ་མོར་ཕྱིན་ན་དེ་ནི་ས་གསུམ་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>གང་མངོན་པར་ལྟ་བར་བྱེད་ན་དེ་ནི་ས་བཞི་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>གང་ན་འདུག་ན་དེ་ནི་ས་ལྔ་<span class='delete'>བར་</span><span class='add'>  པར་  </span><span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>རྡོ་རྗེས་རབ་<span class='delete'>འཇོམས་</span><span class='add'>  འཇོམས་  </span><br>གཞན་ཡང་<span class='delete'>ཡང་</span><span class='add'>    </span>བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་བདག་རིའི་རྩེ་མོ་ན་འདུག་པར་ཀུན་དུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་བདུན་པོ་དག་ཏུ་བལྟ་སྟེ། བྱང་ཆུབ་སེམས་དཔའ་དེ་ལ་ནི་ལས་<br>ཀྱི་སྒྲིབ་པ་ཆུང་ལ་བདུད་ཀྱི་ལས་ཤས་ཆེ་བ་ཡིན་པས་དེ་ནི་སྡུག་པའི་དངོས་པོ་ཡོངས་སུ་གཏང་བར་བྱ་ཞིང་ཉེ་དུ་ཡང་མཆོད་པར་བྱ། ཉེ་དུ་གཞན་དག་ཀྱང་དགའ་བར་<span class='delete'>བྱ། </span><span class='add'>  བྱའོ། །  </span>དེས་ན་དེའི་ལས་ཀྱི་སྒྲིབ་"
 ],
 [
  "78.262a",
  "<span class='delete'>པར་</span><span class='add'>  པར་ཡང་  </span>འགྱུར་རོ། །དེ་ལ་གླང་པོ་ཆེའི་གཙོ་བོ་ཡོངས་སུ་མ་དག་པ་མཐོང་ན་ས་དང་པོར་རོ། །ཐལ་དཀར་མཐོང་ན་ས་གཉིས་པར་རོ། །མཆེ་བ་དྲུག་པ་མཐོང་ན་ས་གསུམ་པར་རོ། །<br>རྒྱན་གྱིས་བརྒྱན་པ་མཐོང་ན་ས་བཞི་པར་རོ། །རྒྱལ་མཚན་དང་། གདུགས་ཐོགས་པ་མཐོང་ན་ས་ལྔ་པར་རོ། །སྒྲ་འབྱིན་པར་མཐོང་ན་ས་དྲུག་པར་རོ། །བམ་པོ་གསུམ་པ་སྟེ་ཐ་མ་<br>རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་བདག་གླང་པོ་ཆེའི་གཙོ་བོ་ལ་ཞོན་པར་ཀུན་དུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་བདུན་པོ་དག་ཏུ་བལྟ་སྟེ། <br>བྱང་ཆུབ་སེམས་དཔའ་སྐྱེ་བ་གཅིག་གིས་ཐོགས་པ་<span class='delete'>དང་། </span><span class='add'>  དང་།   </span>དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱིས་དགོངས་ཤིང་དེ་ལ་ཡེ་ཤེས་འཇུག་པ་དང་། <br>དབང་ཕྱུག་ཆེན་པོ་ཡང་ཡོད་པ་ཡིན་<span class='delete'>བས་</span><span class='add'>  པས་  </span>དེས་ན་གུས་པ་དང་བཅས་པ་<span class='delete'>དང་། </span><span class='add'>  དང་།   </span>བྱང་ཆུབ་སེམས་དཔའ་ཡང་དག་པར་འཛིན་དུ་གཞུག་པ་དང་། རྒྱུ་མེད་པ་དང་། ངན་ངོན་ཙམ་གྱིས་ཆོག་ཤེས་པ་དང་། ཡིད་<br>དུ་འཐད་པ་སྦྱིན་པར་<span class='delete'>བྱའོ། །</span><span class='add'>  བྱའོ། །  </span>དེས་ན་དེའི་ལས་ཀྱི་སྒྲིབ་པ་ཆུང་བར་དག་པར་འགྱུར་ཞིང་བྱང་ཆུབ་ཏུ་ངེས་པར་འབྱུང་བར་ཡང་འགྱུར་རོ། །གང་གིས་བདག་གླང་པོ་ཆེའི་གཙོ་བོ་ཐ་མལ་པ་ལ་ཞོན་པར་ཀུན་དུ་ཤེས་ན་<br>དེ་ནི་ས་དང་པོ་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གང་གིས་གོས་དཀར་པོ་བགོས་ཏེ་ཞོན་པར་ཀུན་དུ་ཤེས་ན་དེ་ནི་ས་གཉིས་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གང་གིས་ཚོན་དམར་པོ་ཅན་བགོས་ཏེ་ན་དེ་ནི་ས་གསུམ་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གང་གིས་ཚོན་སྣ་ཚོགས་ཅན་བགོས་<br>ཏེ་དེ་ནི་ས་བཞི་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གང་གིས་དྲི་ཞིམ་པོས་<span class='delete'>ཁ་</span><span class='add'>  ཁ་བ  </span>སྒྱུར་བའི་གོས་དག་བགོས་ཤིང་རྒྱན་གྱིས་བརྒྱན་ཏེ་ན་དེ་ནི་ས་ལྔ་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གང་གིས་གཅོད་<span class='delete'>པ་</span><span class='add'>  པ  </span>ན་ཐོགས་ཏེ་ན་དེ་ནི། ས་དྲུག་པར་བལྟའོ། །"
 ],
 [
  "78.261b",
  "<span class='delete'>བ་</span><span class='add'>  པ་  </span>དེ་རྣམ་པར་དག་པར་<span class='delete'>བྱང་</span><span class='add'>    </span><span class='delete'>ཆུབ་</span><span class='add'>    </span>འགྱུར་ཞིང་བྱང་ཆུབ་ཏུ་ངེས་པར་འབྱུང་བར་ཡང་འགྱུར་རོ། །རི་ཆེན་པོ་བདུན་པོ་དག་ནི་ས་བདུན་པོ་རྣམས་<span class='delete'>ཀྱི་</span><span class='add'>  ཀྱི  </span><span class='delete'>འོ། །</span><span class='add'>  འོ། །  </span>རི་རབ་ནི་ས་ལྷག་མ་རྣམས་<span class='delete'>ཀྱི་</span><span class='add'>  ཀྱི  </span>འོ། །རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་<span class='delete'>སེམས་</span><span class='add'>  སེམས་  </span><br>དཔའ་གང་གིས་རྨི་ལམ་ན་བདག་ཤིང་ལྗོན་པ་ལ་འཛེག་པར་ཀུན་དུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་བཞི་པོ་དག་ལས་ས་གང་ཡང་རུང་བར་བལྟ་སྟེ། དེ་ལ་ནི་བདུད་ཀྱི་ལས་དང་ལས་ཀྱི་སྒྲིབ་པ་ཡང་འབྲིང་ཙམ་སྟེ། <br>དེས་ནི་དགེ་བའི་བཤེས་གཉེན་གང་དག་སྣང་བ་ཐོབ་པ་རྣམས་<span class='delete'>དང་། </span><span class='add'>  དང་།   </span>གང་དག་གིས་དུས་དུས་སུ་དེའི་ཆོས་ཀྱི་ཐེ་ཚོམ་སེལ་<span class='delete'>བར་</span><span class='add'>  བར་  </span>ནུས་པའི་<span class='delete'>དགེ་</span><span class='add'>  དགེ་བའི་  </span>བཤེས་གཉེན་དག་ལ་བསྟེན་པར་བྱའོ། །དེས་ན་དེའི་ལས་<br>ཀྱི་སྒྲིབ་པ་དེ་རྣམ་པར་དག་པར་འགྱུར་ཞིང་བྱང་ཆུབ་ཏུ་ངེས་པར་འབྱུང་བར་ཡང་འགྱུར་རོ། །དེ་ལ་གྲིབ་ཤིང་ལོ་མ་ཕུན་སུམ་ཚོགས་པ་ལ་འཛེགས་ན་ས་དང་པོར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>སྤོས་ཀྱི་ཤིང་ལ་ན་ས་གཉིས་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>མེ་ཏོག་གི་ཤིང་<br>ལ་ན་ས་གསུམ་པར་རོ། །འབྲས་བུའི་ཤིང་ལ་ན་ས་བཞི་པར་ཏེ། མངོན་<span class='delete'>བར་</span><span class='add'>  པར་  </span>བརྩོན་<span class='delete'>བ་</span><span class='add'>  པ་  </span>དག་གི་མཚན་མ་དེ་དག་ཡིན་གྱི། མངོན་<span class='delete'>བར་</span><span class='add'>  པར་  </span>མི་བརྩོན་<span class='delete'>བ་</span><span class='add'>  པ་  </span>དག་ལ་ནི་བདུད་ཀྱི་ལས་ཀྱང་ཡོད་<span class='delete'>དོ། །</span><span class='add'>  དོ། །  </span>ས་གོང་མ་པ་དག་གིས་ནི་<br>ཐམས་ཅད་ཕུན་སུམ་ཚོགས་པའི་ཤིང་ལྗོན་པ་དག་མཐོང་བར་འགྱུར་<span class='delete'>ཏེ། </span><span class='add'>  ཏེ།   </span>ལས་ཀྱི་རྣམ་པར་སྨིན་པ་ནི་མ་གཏོགས་<span class='delete'>སོ། །</span><span class='add'>  སོ། །  </span>རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་<br>ལམ་ན་གླང་པོ་ཆེའི་གཙོ་བོ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་དྲུག་པོ་དག་ལས་ས་གང་ཡང་རུང་བར་བལྟ་སྟེ། བྱང་ཆུབ་སེམས་དཔའ་དེས་སྦྱིན་པ་<span class='delete'>སྤྱད་</span><span class='add'>  སྤྱད་  </span>པ་ལྟར་ཤེས་རབ་དེ་ལྟར་མ་<span class='delete'>སྤྱད་</span><span class='add'>  སྤྱད་  </span>པས་<br>དེ་ལ་དགེ་བའི་རྩ་བ་དག་དཀའ་བས་སྐྱེ་བར་འགྱུར་ཏེ། དེས་ནི་དད་པར་བྱ་ཞིང་ངེས་པར་བརྟག་པ་མང་དུ་ཡང་བྱའོ། །དེས་ན་དེའི་ལས་ཀྱི་སྒྲིབ་པ་དེ་རྣམ་པར་<span class='delete'>དག་</span><span class='add'>  དག་པར་  </span>འགྱུར་ཞིང་བྱང་ཆུབ་ཏུ་ངེས་པར་འབྱུང་"
 ],
 [
  "78.262b",
  "གང་གིས་རྒྱན་གྱིས་བརྒྱན་པའི་གདུགས་ཐོགས་ཏེ་ན་དེ་ནི་ས་བདུན་<span class='delete'>བར་</span><span class='add'>  པར་  </span>བལྟའོ། །ས་གོང་མ་པ་དག་གིས་ནི་ཐམས་ཅད་ཕུན་སུམ་ཚོགས་པར་མཐོང་སྟེ། ལས་ཀྱི་སྒྲིབ་པ་<span class='delete'>དང་། </span><span class='add'>  དང་།   </span>མངོན་པར་མི་བརྩོན་པ་ནི་མ་གཏོགས་<span class='delete'>སོ། །</span><span class='add'>  སོ། །  </span><br>རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་བདག་རྟ་ལ་ཞོན་པར་ཀུན་དུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་བཞི་པོ་དག་ཏུ་བལྟ་སྟེ། དེས་ནི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་<br>པ་ལ་བརྟེན་པར་བྱའོ། །དེ་ལ་ནི་བདུད་ཀྱི་ལས་ཤས་ཆེ་ལ་ལས་ཀྱི་སྒྲིབ་པ་ཆུང་བ་ཡིན་<span class='delete'>བས་</span><span class='add'>  པས་  </span>དེས་སྟོང་པ་ཉིད་གཙོ་བོར་བྱ་བ་དང་། ལྷག་མཐོང་མང་དུ་བྱ་བ་<span class='delete'>དང་། </span><span class='add'>  དང་།   </span>ནན་ཏན་གྱིས་བསྒྲུབ་པར་<span class='delete'>བྱའོ། །</span><span class='add'>  བྱའོ། །  </span>དེས་ན་དེའི་ལས་<br>ཀྱི་སྒྲིབ་པ་དེ་རྣམ་པར་དག་པར་འགྱུར་ཞིང་བྱང་ཆུབ་ཏུ་ངེས་པར་འབྱུང་བར་ཡང་འགྱུར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>དེ་ལ་བདག་རྟ་འགྲེང་བ་ཞོན་པར་ཀུན་དུ་ཤེས་ན་ས་དང་པོ་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>འགྲོ་བ་ལ་ཞོན་པར་ཀུན་དུ་ཤེས་ན་ས་<br>གཉིས་པར་བལྟའོ། །རྒྱུག་པ་ལ་ཞོན་<span class='delete'>པར་</span><span class='add'>  པར་  </span>ཀུན་དུ་ཤེས་ན་ས་གསུམ་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>བརྒྱན་པ་ལ་ཞོན་པར་ཀུན་དུ་ཤེས་ན་ས་བཞི་པར་བལྟ་<span class='delete'>སྟེ། </span><span class='add'>  སྟེ།   </span>བདུད་ཀྱི་ལས་ནི་མ་གཏོགས་<span class='delete'>སོ། །</span><span class='add'>  སོ། །  </span>ས་གོང་མ་དག་ལ་<span class='delete'>ནི་</span><span class='add'>  ནི།  </span><br>ཐམས་ཅད་ཕུན་སུམ་ཚོགས་པར་མཐོང་སྟེ། བྱང་ཆུབ་སེམས་དཔའི་ལྷག་པའི་ང་རྒྱལ་ཅན་རྣམས་དང་། བདུད་ཀྱི་ལས་ནི་མ་གཏོགས་སོ། །རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་<br>རྨི་ལམ་ན་བདག་བདེན་པའི་བྱིན་གྱིས་བརླབས་བྱེད་པར་ཀུན་དུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བཅུ་པོ་ཐམས་ཅད་ལས་ས་གང་ཡང་རུང་བར་བལྟ་སྟེ། དེ་ལ་ནི་བདུད་ཀྱི་ལས་ཆུང་ལ། ལས་ཀྱི་སྒྲིབ་པ་ཤས་ཆེ་<span class='delete'>བ་</span><span class='add'>  བ་  </span><br>ཡིན་<span class='delete'>བས། </span><span class='add'>  པས།   </span>དེས་ནི་ཡུལ་མང་པོ་ལ་<span class='delete'>དེས་</span><span class='add'>  ངེས་  </span><span class='delete'>བར་</span><span class='add'>  པར་  </span>བརྟག་པར་བྱ་<span class='delete'>ཞིང་། </span><span class='add'>  ཞིང་།   </span>ཏིང་ངེ་འཛིན་བསྒྲུབ་པ་ལ་མཁས་པར་ཡང་བྱ། སྤྱོད་ལམ་དྲང་པོ་དང་། སོགས་པ་དང་བྲལ་བར་ཡང་བྱའོ། །དེས་ན་དེའི་ལས་ཀྱི་སྒྲིབ་པ་དེ་རྣམ་པར་དག་"
 ],
 [
  "78.264b",
  "དེ་ནི་ས་བརྒྱད་<span class='delete'>བར་</span><span class='add'>  པར་  </span><span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>ས་དྲུག་པོ་དག་ལ་ནི་བདུད་ཀྱི་ལས་མ་གཏོགས་<span class='delete'>སོ། །</span><span class='add'>  སོ། །  </span>རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་ལྷའི་བུ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་ལྔ་པོ་<br>དག་ལས་ས་གང་ཡང་རུང་བར་བལྟའོ། །དེ་ལ་ལས་ཀྱི་སྒྲིབ་པ་དང་བདུད་ཀྱི་ལས་ནི་ཆུང་ལ་འདོད་པ་ཙམ་ན་ཡོད་དེ། དེས་ཟླ་བ་གསུམ་དུ་བརྩོན་<span class='delete'>བར་</span><span class='add'>  པར་  </span>བྱས་ན་ལས་ཀྱི་སྒྲིབ་པ་རྣམ་པར་དག་པར་འགྱུར་ཞིང་། <br>རྣམ་པར་མ་དག་པ་ཡང་ཆུང་<span class='delete'>དུར་</span><span class='add'>  ངུར་  </span>འགྱུར་ལ་སྣང་བ་ཐོབ་པར་ཡང་འགྱུར་རོ། །བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ཕྱོགས་བཅུའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱིས་བསམས་པ་ཡིན་ཏེ། དེ་གལ་ཏེ་སྐྱོ་བར་མི་<br>འགྱུར་ཞིང་མངོན་<span class='delete'>བར་</span><span class='add'>  པར་  </span>བརྩོན་པར་འགྱུར་ན་དེས་དེའི་ལས་ཀྱི་སྒྲིབ་པ་དེ་རྣམ་པར་དག་པར་འགྱུར་ཞིང་བྱང་ཆུབ་ཏུ་ངེས་པར་འབྱུང་བར་ཡང་འགྱུར་རོ། །དེ་ལ་རྒྱལ་ཆེན་བཞི་བའི་རིས་ཀྱི་ལྷའི་བུ་མཐོང་ན་ས་<br>དྲུག་པོ་དག་<span class='delete'>ཏུའོ། །</span><span class='add'>  ཏུའོ། །  </span>སུམ་བཅུ་རྩ་གསུམ་པས་ནི་ས་བདུན་བར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>དགའ་ལྡན་བས་ནི་ས་བརྒྱད་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>ཚངས་རིས་བས་ནི་ས་དགུ་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>གནས་གཙང་མ་བས་ནི་ས་བཅུ་པར་རོ། །ས་དང་པོ་ལ་མངོན་པར་<br>བརྩོན་<span class='delete'>བས་</span><span class='add'>  པས་  </span>ནི་ས་ཐམས་ཅད་ཀྱང་མཐོང་སྟེ། བདུད་ཀྱི་ལས་ཀྱང་ཡོད་དོ། །ས་བཅུ་པོ་དག་ལྷག་པའི་བསམ་པ་ཕུན་སུམ་ཚོགས་པས་ནི་ཐམས་ཅད་མཐོང་<span class='delete'>ངོ་། །</span><span class='add'>  ངོ་། །  </span>རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་<span class='delete'>སེམས་</span><span class='add'>  སེམས་  </span><br>དཔའ་གང་གིས་རྨི་ལམ་ན་ཀླུ་མཐོང་ན་དེ་ནི་ས་བརྒྱད་པོ་དག་ལས་གང་ཡང་རུང་བར་བལྟ་སྟེ། དེ་ནི་ཆོས་ལ་རྗེས་སུ་འཐུན་པའི་བཟོད་པ་དང་ལྡན་པ་ཡིན་ནོ། །དེ་ནི་བརྩམས་ནས་ཡང་ཕྱིར་རྣམ་པར་རྩེ་<br>བར་འགྱུར་བ་དང། སྦྱོར་བ་བཟུང་ནས་ཀྱང་ཡང་ཕྱིར་སྤོང་བར་འགྱུར་ཏེ། དེས་ནི་ལོངས་སྤྱོད་ཀྱི་གཞི་ལས་ཆོས་སྨྲ་བ་ལ་སྐུར་པ་བཏབ་པ་ཡིན་པས་དེས་སྡུག་པའི་དངོས་པོ་ཡོངས་སུ་བཏང་པ་ལ་མངོན་པར་"
 ],
 [
  "78.263a",
  "པར་འགྱུར་ཞིང་བྱང་ཆུབ་ཏུ་ངེས་པར་འབྱུང་བར་ཡང་འགྱུར་རོ། །གང་སྦྱིན་<span class='delete'>བ་</span><span class='add'>  པ་  </span>དང་ལྡན་པའི་བྱིན་གྱིས་བརླབས་བྱེད་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་པར་བལྟའོ། །བཅིངས་པ་ལས་ཐར་པར་བྱ་བའི་ཕྱིར་ན་ས་<br>གཉིས་པར་བལྟའོ། །ནད་པ་ཐར་པར་བྱ་བའི་ཕྱིར་ན་ས་གསུམ་པར་བལྟའོ། །གྲོང་ཁྱེར་གྱི་ཕྱིར་ན་ས་བཞི་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>རྒྱལ་པོའི་ཕྱིར་ན་ས་ལྔ་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>གླིང་བཞི་པའི་ཕྱིར་ན་ས་དྲུག་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>སྟོང་གི་ཕྱིར་ན་ས་བདུན་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>སྟོང་གཉིས་<br>པའི་ཕྱིར་ན་ས་བརྒྱད་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>སྟོང་གསུམ་པའི་ཕྱིར་ན་ས་དགུ་པར་རོ། །འོད་འབྱུང་བ་དང་། ས་གཡོ་བ་དང་། ལྷ་རྣམས་ཀྱིས་མེ་ཏོག་གི་ཆར་དབབ་པའི་ཕྱིར་ན་ས་བཅུ་པར་ཏེ། ས་དྲུག་པོ་དག་ལ་ནི་བདུད་ཀྱི་ལས་མ་<br>གཏོགས་སོ། །རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་འབྲས་བུའི་ཤིང་ལྗོན་པ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་བདུན་པོ་དག་ཏུ་བལྟ་སྟེ། ལུང་བསྟན་པ་ཡོངས་<br>སུ་རྫོགས་པའི་ཆོས་དང་ལྡན་པ་ཡིན་ནོ། །དེས་ནི་རྙེད་པ་དང་བཀུར་སྟི་ལམ་ཆགས་དང་། དྲང་པོ་དང་ཉེས་པ་མི་འཛིན་པར་<span class='delete'>བྱའོ། </span><span class='add'>  བྱའོ། །  </span>དེས་ན་དེའི་ལས་ཀྱི་སྒྲིབ་པ་དེ་རྣམ་པར་དག་པར་འགྱུར་ཞིང་བྱང་ཆུབ་ཏུ་ངེས་པར་འབྱུང་བར་<br>ཡང་འགྱུར་རོ། །གང་གིས་འབྲས་བུ་ཉུང་ངུའི་ཤིང་ལྗོན་པ་མཐོང་ན་དེ་ནི་ས་དང་པོ་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གང་གིས་འབྲས་བུ་མང་པོའི་ཤིང་ལྗོན་པ་མཐོང་ན་དེ་ནི་ས་གཉིས་པར་བལྟའོ། །གང་གིས་འབྲས་བུ་རོ་ཞིམ་པོའི་ཤིང་<br>ལྗོན་པ་མཐོང་ན་དེ་ནི་ས་གསུམ་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གང་གིས་འབྲས་བུ་དྲི་ཞིམ་པོའི་ཤིང་ལྗོན་པ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བཞི་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གང་གིས་འབྲས་བུ་སྨན་དུ་རུང་བའི་ཤིང་ལྗོན་པ་མཐོང་ན་བྱང་ཆུབ་སེམས་<br>དཔའ་དེ་ནི་ས་ལྔ་པར་བལྟའོ། །གང་གིས་ལྷ་ཡུལ་གྱི་འབྲས་བུའི་ཤིང་ལྗོན་པ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དྲུག་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གང་གིས་བདུད་རྩིའི་རོ་དང་ལྡན་པའི་འབྲས་བུའི་ཤིང་ལྗོན་པ་མཐོང་ན་བྱང་"
 ],
 [
  "78.263b",
  "ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བདུན་པར་བལྟའོ། །རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་མེ་ཏོག་གི་ཤིང་ལྗོན་པ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་བདུན་པོ་དག་ལས་ས་གང་ཡང་<br>རུང་བར་བལྟ་སྟེ། དེས་ནི་དགེ་བའི་རྩ་བ་སྣ་ཚོགས་བྱ་བ་ལ་བརྩོན་པར་བྱ་ཞིང་དགེ་བའི་རྩ་བའི་ཆོས་དེ་ལ་ཀུན་དུ་སྤྱོད་པ་ན་<span class='delete'>ངེས་</span><span class='add'>  དེས་  </span>འཁོར་བཞི་པོ་དག་དང་མ་འདྲེས་པར་རི་ཁྲོད་དུ་འགྲོ་བ་ལ་བརྩོན་པར་བྱའོ། །དེས་ན་དེའི་<br>ལས་ཀྱི་སྒྲིབ་པ་དེ་རྣམ་པར་དག་པར་འགྱུར་ཞིང་བྱང་ཆུབ་ཏུ་ངེས་པར་འབྱུང་བར་ཡང་འགྱུར་རོ། །གང་གིས་མེ་ཏོག་མང་ལ་དྲི་མི་ཞིམ་པའི་ཤིང་ལྗོན་པ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་པར་བལྟའོ། །གང་གིས་<br>མེ་ཏོག་དྲི་ཞིམ་པོའི་ཤིང་ལྗོན་པ་མཐོང་ན་བྱ་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་གཉིས་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གང་གིས་མེ་ཏོག་མང་ཤིང་དྲི་ཞིམ་པའི་ཤིང་ལྗོན་པ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་གསུམ་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གང་གིས་<br>མེ་ཏོག་དང་འབྲས་བུར་བཅས་པའི་ཤིང་ལྗོན་པ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བཞི་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གང་གིས་ལོ་མ་ཉུང་བའི་མེ་ཏོག་གི་ཤིང་ལྗོན་པ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་ལྔ་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གང་གིས་<br>ལྷའི་མེ་ཏོག་གི་ཤིང་ལྗོན་པ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དྲུག་<span class='delete'>དཔར་</span><span class='add'>  པར་  </span><span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གང་གིས་བྱང་ཆུབ་ཀྱི་ཤིང་ལྗོན་པ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བདུན་པར་བལྟ་སྟེ། བདུད་ཀྱི་ལས་ནི་མ་གཏོགས་སོ། །<br>ས་གོང་མ་དག་ལ་<span class='delete'>ནོ་</span><span class='add'>  ནི་  </span>མཚན་མ་ལྡོག་པ་མེད་དོ། །རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་སྔོན་མ་མཐོང་བའི་གྲོང་ཁྱེར་མཐོང་ན་དེ་ནི་ས་དང་པོ་དྲུག་པོ་དེ་དག་ཏུ་བལྟ་སྟེ། བྱང་ཆུབ་<br>སེམས་དཔའ་དེ་ལ་ནི་ཆོས་ཀྱི་སྒྲིབ་པ་མེད་དོ། །བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་དང་ཉེ་བར་རིག་བྱ་སྟེ། དེས་ནི་སྟོང་པ་ཉིད་བསྒོམ་པའི་ཕྱིར་ཡིད་དམ་ལ་བརྟན་པ་དང་། བདེ་བ་དང་།"
 ],
 [
  "78.264a",
  "སྡུག་བསྔལ་དག་གིས་ཞེ་འགྲས་པ་མེད་པའི་སེམས་སུ་བྱའོ། །དེས་ན་དེའི་ལས་ཀྱི་སྒྲིབ་པ་དེ་རྣམ་པར་དག་པར་འགྱུར་རོ། །བྱང་ཆུབ་<span class='delete'>སེམས་</span><span class='add'>    </span>ཏུ་ངེས་པར་འབྱུང་བར་ཡང་འགྱུར་རོ། །གྲོང་ཁྱེར་དང་པོ་བརྩིགས་མ་<br>ཐག་ཏུ་མཐོང་ན་ས་དང་པོ་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གྲོང་ཁྱེར་ཕྱིས་<span class='delete'>བྱོ་</span><span class='add'>  བྱི་  </span>དོར་བྱས་པ་མཐོང་ན་ས་གཉིས་<span class='delete'>པའོ། །</span><span class='add'>  པར་རོ། །  </span><span class='delete'>རབ་</span><span class='add'>  ར་བ་  </span>ཕུན་སུམ་ཚོགས་པས་ནི་ས་གསུམ་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>བསྐྱེད་མོས་ཚལ་ཕུན་སུམ་ཚོགས་པས་ནི་ས་བཞི་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span><br><span class='delete'>འབབ་</span><span class='add'>  འབབ་  </span>ཆུ་ཕུན་སུམ་ཚོགས་པས་ནི་ས་ལྔ་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>རྫིང་བུ་ཕུན་སུམ་ཚོགས་<span class='delete'>བས་</span><span class='add'>  པས་  </span>ནི་ས་དྲུག་པར་ཏེ། སྡིག་པའི་གྲོགས་པོའི་ལག་ཏུ་སོང་བ་དང་། དམིགས་པ་ཅན་དང་། མངོན་པར་མི་བརྩོན་པ་དང་། <br>བདུད་ཀྱི་ལས་ནི་མ་གཏོགས་སོ། །ས་གོང་མ་དག་པ་ནི་ཐམས་ཅད་ཕུན་སུམ་ཚོགས་པར་མཐོང་<span class='delete'>ངོ་། །</span><span class='add'>  ངོ་། །  </span>རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་མཚོ་མ་དྲོས་པ་མཐོང་ན་<br>དེ་ནི་ས་དང་པོ་བརྒྱད་པོ་དག་ཏུ་བལྟ་སྟེ། དེ་ལ་ཉོན་མོངས་པ་ནི་ཆུང་ངོ་། །གལ་ཏེ་ལྷག་པའི་བསམ་བས་བརྩོན་བར་བྱེད་ཅིང་ལུས་དང་། སྲོག་དང་། ཡོ་བྱད་དག་ལ་ལྷག་པར་ཆགས་པར་མི་བྱེད་ན་དེ་ལ་མྱུར་དུ་<br>སྣང་བ་སྐྱེ་བར་འགྱུར་རོ། །<span class='delete'>དེས་</span><span class='add'>  དེས་  </span>གཞན་གྱི་བསམ་པ་ཡོངས་སུ་རྫོགས་པར་བྱ་བ་ལ་མངོན་བར་བརྩོན་བར་བྱ་སྟེ། དེས་ན་དེའི་ལས་ཀྱི་སྒྲིབ་པ་དེ་རྣམ་པར་དག་པར་འགྱུར་ཞིང་བྱང་ཆུབ་ཏུ་ངེས་པར་འབྱུང་བར་ཡང་འགྱུར་<br>རོ། །གང་གིས་མཚོ་མ་དྲོས་པའི་འགྲམ་མཐོང་ན་དེ་ནི་ས་དང་པོ་པར་བལྟའོ། །གང་གིས་དབུས་མཐོང་ན་དེ་ནི་ས་གཉིས་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>གང་གིས་ཐམས་ཅད་མཐོང་ན་དེ་ནི་ས་གསུམ་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>གང་གིས་ལག་པས་རེག་ན་དེ་ནི་ས་བཞི་<br>པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>གང་གིས་ཁྲུས་བྱས་ན་དེ་ནི་ས་ལྔ་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>གང་འགྲམ་ན་འདུག་ན་དེ་ནི་ས་དྲུག་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>གང་གིས་མཚོ་མ་དྲོས་པའི་ཀླུ་མཐོང་ན་དེ་ནི་ས་བདུན་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>གང་གིས་གནས་དང་གཟི་བྱིན་སྦྱིན་བར་མཐོང་ན་"
 ],
 [
  "78.265a",
  "བརྩོན་<span class='delete'>བར་</span><span class='add'>  པར་  </span>བྱའོ། །དེས་ན་དེའི་ལས་ཀྱི་སྒྲིབ་པ་དེ་རྣམ་པར་དག་པར་འགྱུར་ཞིང་བྱང་ཆུབ་ཏུ་ངེས་པར་འབྱུང་བར་ཡང་འགྱུར་རོ། །གང་གིས་རི་ལ་གནས་པའི་ཀླུ་མཐོང་ན་དེ་ནི་ས་དང་པོ་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span><br>གང་གིས་ནགས་ཁུང་ན་གནས་པ་མཐོང་ན་དེ་ནི་ས་གཉིས་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གང་གིས་ཆུ་ཀླུང་གི་ཕ་རོལ་དུ་མཐོང་ན་དེ་ནི་ས་གསུམ་<span class='delete'>པ་</span><span class='add'>  པ  </span><span class='delete'>རབ་</span><span class='add'>  ར་བ  </span><span class='delete'>ལྟའོ། །</span><span class='add'>  ལྟའོ། །  </span>གང་གིས་ནགས་<span class='delete'>ཁྱོད་</span><span class='add'>  ཁྲོད་  </span>ཏུ་མཐོང་ན་དེ་ནི་ས་བཞི་བར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གང་<br>གིས་སྐྱེ་བོའི་ནང་དུ་མཐོང་ན་དེ་ནི་ས་ལྔ་པར་བལྟའོ། །གང་གིས་རྒྱལ་པོའི་ཕོ་བྲང་གི་ནང་དུ་མཐོང་ན་དེ་ནི་ས་དྲུག་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གང་གིས་སྐྱེ་བོ་མང་པོས་ཡོངས་སུ་བསྐོར་བ་མཐོང་ན་དེ་ནི་ས་བདུན་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གང་<br>གིས་ནམ་མཁའ་ལ་མཐོང་ན་དེ་ནི་ས་བརྒྱད་པར་བལྟའོ། །ས་དང་པོ་དྲུག་པོ་དག་ལ་ནི་བདུད་ཀྱི་ལས་མ་གཏོགས་པར་བལྟའོ། །རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་བདག་<br>འཛམ་བུའི་གླིང་གཞན་དུ་སོན་<span class='delete'>བར་</span><span class='add'>  པར་  </span>ཀུན་དུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་དྲུག་པོ་དག་ཏུ་བལྟ་སྟེ། བཟོད་པ་ཐོབ་པ་ཡིན་ནོ། །དེ་ལ་སྒྲིབ་པ་ནི་ཆུང་ན་དེ་མངོན་པར་མི་བརྩོན་བ་དང་། ལེ་ལོ་དང་<br>གཡོ་ལ་སྟེན་པ་དང་། ངའོ་སྙམ་པའི་ང་རྒྱལ་གྱི་ཚུལ་གྱིས་སྣང་བ་ཐོབ་པར་མི་འགྱུར་བས་དེས་ཚུལ་དེ་དག་ཇི་ལྟ་བ་དེ་བཞིན་དུ་རབ་ཏུ་བརྩོན་<span class='delete'>བར་</span><span class='add'>  པར་  </span>བྱའོ། །དེས་ན་དེའི་ལས་ཀྱི་སྒྲིབ་པ་དེ་རྣམ་པར་དག་པར་<br>འགྱུར་ཞིང་བྱང་ཆུབ་ཏུ་ངེས་པར་འབྱུང་བར་ཡང་འགྱུར་རོ། །གང་གིས་འཛམ་བུའི་གླིང་ཉམས་མི་དགའ་བ་མཐོང་ན་དེ་ནི་ས་དང་པོ་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>གང་གིས་ཉམས་དགའ་བ་མཐོང་ན་དེ་ནི་ས་གཉིས་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>གང་<br>གིས་གྲོང་དང་། གྲོང་ཁྱེར་དང་། གྲོང་རྡལ་མཛེས་པར་མཐོང་ན་དེ་ནི་ས་གསུམ་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>གང་གིས་བསྐྱེད་མོས་ཚལ་མེ་ཏོག་ཀུན་ཏུ་རྒྱས་པར་མཐོང་ན་དེ་ནི་ས་བཞི་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>གང་གིས་ལྗོངས་ཀྱི་"
 ],
 [
  "78.265b",
  "མི་འདུས་པར་མཐོང་ན་དེ་ནི་ས་ལྔ་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>གང་གིས་ཀུན་དགའི་ར་བ་དང་། ཚལ་ཕུན་སུམ་ཚོགས་པ་མཐོང་ན་དེ་ནི་ས་དྲུག་པར་<span class='delete'>ཏེ། །</span><span class='add'>  ཏེ།   </span>བདུད་ཀྱི་ལས་ནི་མ་གཏོགས་སོ། །རྡོ་རྗེས་རབ་འཇོམས་གཞན་<br>ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་བདག་གོས་དཀར་པོ་གྱོན་པར་ཀུན་དུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་བརྒྱད་པོ་དག་ཏུ་བལྟ་སྟེ། དེ་ནི་ལས་ཀྱི་སྒྲིབ་པ་རྣམ་པར་དག་པ་<br>ལ་བདུད་ཀྱི་ལས་ཤས་ཆེ་བ་ཡིན་<span class='delete'>བས་</span><span class='add'>  པས་  </span>དེ་ཆོས་ལ་འདུན་པ་སྐྱེས་ཀྱང་། ཡང་ཕྱིར་ནུར་བར་འགྱུར་ཞིང་དེའི་ཡོན་ཏན་དག་ལ་བར་ཆད་མང་བར་འགྱུར་བས་དངོས་པོ་ཐམས་ཅད་མི་<span class='delete'>སྤ་</span><span class='add'>  སྦ་  </span>བར་བྱ་ཞིང་ཡེ་ཤེས་ལ་<br>བརྩོན་པར་བྱའོ། །དེས་ན་དེའི་ལས་ཀྱི་སྒྲིབ་པ་དེ་རྣམ་པར་དག་པར་འགྱུར་ཞིང་བྱང་ཆུབ་ཏུ་ངེས་པར་འབྱུང་བར་ཡང་འགྱུར་རོ། །ཡོ་བྱད་ཐམས་ཅད་དང་། གདིང་བ་ཐམས་ཅད་དང་། མང་དུ་ཐོས་<br>པར་བྱ་བ་དང་། སྐྱོན་དང་། ལུས་དང་། སྲོག་དང་། དགེ་བའི་རྩ་བ་དག་ལ་ཡང་མངོན་<span class='delete'>བར་</span><span class='add'>  པར་  </span>བརྟག་པར་བྱའོ། །གང་གིས་གོས་དཀར་པོ་གཙང་མ་རྙིང་པ་གྱོན་པར་མཐོང་ན་དེ་ནི་ས་དང་པོ་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>གང་<br>གིས་སར་པ་ཁ་ཚར་མེད་པ་གྱོན་པར་མཐོང་ན་དེ་ནི་ས་གཉིས་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>གང་གིས་ཁ་ཚར་ཅན་ན་དེ་ནི་ས་གསུམ་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>གང་གིས་བྱི་དོར་བྱས་པ་ན་དེ་ནི་ས་བཞི་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>གང་གིས་བཀྲུས་ཤིང་བཅགས་<br>པ་ན་དེ་ནི་ས་ལྔ་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>གོས་རིན་པོ་ཆེས་ནི་ས་དྲུག་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span><span class='delete'>དང་</span><span class='add'>  ངང་  </span>རིས་ཅན་གྱིས་ནི་ས་བདུན་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span><span class='delete'>ལྟའི་</span><span class='add'>  ལྷའི་  </span>གོས་ཀྱིས་ནི་ས་བརྒྱད་པར་རོ། །རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་<br>ལམ་ན་བདག་གི་མགོ་ལ་རིན་པོ་ཆེའི་ཕྲེང་<span class='delete'>བའམ། </span><span class='add'>  བ་འམ།   </span>རྒྱན་གྱི་ཕྲེང་བ་ཐོགས་པར་ཀུན་དུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་དགུ་པོ་དག་ཏུ་བལྟ་སྟེ། དེ་ལ་བདུད་ཀྱི་ལས་ཡང་མེད། ལས་ཀྱི་སྒྲིབ་པ་ཡང་མེད་ན་རང་གི་ཉེས་"
 ],
 [
  "78.266b",
  "བར་ཀུན་དུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་བདུན་པོ་དག་ཏུ་བལྟ་སྟེ། དེས་ནི་བྱང་ཆུབ་སེམས་དཔའ་དག་ཡང་དག་པར་འཛིན་དུ་གཞུག་པར་བྱའོ། །གང་ཟག་དེ་ནི་གཡོག་འཁོར་མང་བ་དང་། རྐྱེན་<br>མང་བ་ཡིན་ཏེ། དེས་གལ་ཏེ་བསམ་པ་རྣམ་པར་སྦྱང་བར་བྱས་ན་དེས་དེའི་ལས་ཀྱི་སྒྲིབ་པ་དེ་རྣམ་པར་དག་པར་འགྱུར་ཞིང་བྱང་ཆུབ་ཏུ་ངེས་པར་འབྱུང་བར་ཡང་འགྱུར་རོ། །གང་གིས་བདག་ཁ་དོག་དང་<br>ལྡན་པའི་མེ་ཏོག་སྲིལ་མ་དག་སྲེལ་བར་ཀུན་དུ་ཤེས་ན་དེ་ནི་ས་དང་པོ་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>དྲི་དང་ལྡན་པས་ནི་ས་གཉིས་པར་རོ། །རེག་དང་ལྡན་པས་ནི་ས་གསུམ་པར་རོ། །སྣ་ཚོགས་ཀྱིས་ནི་ས་བཞི་པར་རོ། །ཆུ་<br>ལས་སྐྱེས་པ་དང་། སྐམ་ལས་སྐྱེས་པས་ནི་ས་ལྔ་པར་རོ། །ཐམས་ཅད་ཁ་འབུས་པར་གྱུར་པས་ནི་ས་དྲུག་པར་ཏེ། ས་གོང་མ་བཞི་པོ་དག་ལ་མངོན་པར་བརྩོན་<span class='delete'>པའམ་</span><span class='add'>  པ་འམ་  </span>བདུད་ཀྱི་ལས་ཀྱི་མཚན་མ་ནི་དེ་དག་ཡིན་ཏེ། <br>ཡིད་དུ་འོང་བ་དང་། ཡིད་དུ་མི་འོང་བ་ཐམས་ཅད་ཀྱང་འབུལ་བར་བྱེད་<span class='delete'>དོ། །</span><span class='add'>  དོ། །  </span>རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་བདག་རྔ་བོ་ཆེ་རྡུང་<span class='delete'>བའམ། །</span><span class='add'>  བའམ། །  </span>རོལ་མོའི་སྒྲ་འབྱིན་པར་ཀུན་དུ་ཤེས་ན་བྱང་ཆུབ། <br>སེམས་དཔའ་དེ་ནི་ས་དགུ་པོ་དག་ལས་ས་གང་ཡང་རུང་བར་བལྟ་སྟེ། དེ་ལ་ལས་ཀྱི་སྒྲིབ་པ་དང་། བདུད་ཀྱི་ལས་ཤས་ཆེ་བ་ཡིན་པས་དེས་བརྩོན་འགྲུས་བརྩམ་ཞིང་ཐོས་པ་ལ་མངོན་པར་བརྩོན་པར་བྱའོ། །དེས་སེམས་ཅན་<br>ཐམས་ཅད་ལ་སེམས་མཉམ་པར་བྱའོ། །དེས་ན་དེའི་ལས་ཀྱི་སྒྲིབ་པ་དེ་རྣམ་པར་དག་པར་འགྱུར་ཞིང་བྱང་ཆུབ་ཏུ་ངེས་པར་འབྱུང་བར་ཡང་འགྱུར་རོ། །གང་ཐིབས་པོར་སོང་སྟེ་རྔ་བོ་ཆེ་རྡུང་བར་བྱེད་ན་དེ་ནི་ས་དང་པོ་<br>པར་རོ། །གང་ས་མཉམ་པར་སོང་སྟེ་རྡུང་ན་དེ་ནི་ས་གཉིས་པར་རོ། །གང་གྲོང་དུ་སོང་སྟེ་རྡུང་ན་དེ་ནི་ས་གསུམ་པར་རོ། །གང་གྲོང་ཁྱེར་ཆེན་པོར་ན་དེ་ནི་ས་བཞི་པར་རོ། །གང་སྐྱེ་བོ་ཕལ་པོ་ཆེའི་"
 ],
 [
  "78.267b",
  "ཡང་མང་དུ་<span class='delete'>བྱའོ། །</span><span class='add'>  བྱའོ། །  </span>དེས་ན་དེའི་ལས་ཀྱི་སྒྲིབ་པ་དེ་རྣམ་པར་དག་པར་འགྱུར་ཞིང་བྱང་ཆུབ་ཏུ་ངེས་པར་འབྱུང་བར་<span class='delete'>འགྱུར་</span><span class='add'>    </span><span class='delete'>བར་</span><span class='add'>    </span>ཡང་འགྱུར་རོ། །ལུས་ཐམས་ཅད་མི་གཙང་བའི་རྫབ་ཀྱིས་བསྐུས་ན་ས་དང་པོ་པར་<br><span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>ལུས་ཀྱི་གཞོགས་ཕྱེད་བསྐུས་ན་ས་གཉིས་པར་<span class='delete'>རོ། </span><span class='add'>  རོ། །  </span>ཡན་ལག་<span class='delete'>ངང་</span><span class='add'>  དང་  </span><span class='delete'>ཉིད་</span><span class='add'>  ཉིང་  </span><span class='delete'>ལ་</span><span class='add'>  ལག་  </span>བསྐུས་ན་ས་གསུམ་པར་རོ། །ས་དྲུག་པའི་བར་དག་ལ་ནི་བདུད་ཀྱི་ལས་སུ་རྟོགས་པར་བྱའོ། །རྡོ་རྗེས་རབ་<br>འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་བདག་རྒྱལ་པོར་གྱུར་པར་ཀུན་དུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བཅུ་པོ་ཐམས་ཅད་ལས་ས་གང་ཡང་རུང་བར་བལྟ་སྟེ། དེ་ལ་དགེ་བའི་<br>རྩ་བ་སྟུག་ལ་བར་ཆད་ཀྱང་སྟུག་པ་ཡིན་བས་དེས་ན་རློམ་སེམས་མེད་པར་བྱ་ཞིང་གཞན་ལ་གཡོ་མི་བྱ་བ་དང། ཀུན་བགེག་པའི་ངང་ཚུལ་ཅན་དང་། བདག་ལ་མི་སྟོད་པ་དང་། གཞན་ལ་མི་སྨད་པར་བྱའོ། །<br>དེས་ན་དེའི་ལས་ཀྱི་སྒྲིབ་པ་དེ་རྣམ་པར་དག་པར་འགྱུར་ཞིང་། བྱང་ཆུབ་ཏུ་ངེས་པར་འབྱུང་བར་ཡང་འགྱུར་རོ། །གྲོང་ན་འདུག་སྟེ་རྒྱལ་པོར་ཀུན་དུ་ཤེས་ན་ས་དང་པོ་པར་བལྟའོ། །གཙུག་ལག་ཁང་ན་<br>འདུག་སྟེ་རྒྱལ་པོར་ཀུན་དུ་ཤེས་ན་དེ་ནི་ས་གཉིས་པར་བལྟའོ། །བསྐྱེད་མོས་ཚལ་ན་འདུག་སྟེ་རྒྱལ་པོར་ཀུན་དུ་ཤེས་ན་དེ་ནི་ས་གསུམ་པར་བལྟའོ། །ལྷ་ཁང་ན་འདུག་སྟེ་རྒྱལ་པོར་ཀུན་དུ་ཤེས་ན་<br>དེ་ནི་ས་བཞི་པར་བལྟའོ། །གྲོང་ཁྱེར་ཆེན་པོ་ན་འདུག་སྟེ། རྒྱལ་པོར་ཀུན་དུ་ཤེས་ན་དེ་ནི་ས་ལྔ་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>རིའི་རྩེ་མོ་ན་འདུག་སྟེ་རྒྱལ་པོར་ཀུན་དུ་ཤེས་ན་དེ་ནི་ས་དྲུག་<span class='delete'>བར་</span><span class='add'>  པར་  </span>བལྟའོ། །འཛམ་བུའི་གླིང་<br>གི་རྒྱལ་པོར་ཀུན་དུ་ཤེས་ན་དེ་ནི་ས་བདུན་པར་བལྟའོ། །འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོར་ཀུན་དུ་ཤེས་ན་<span class='delete'>དེའི་</span><span class='add'>  དེ་ནི་  </span>ས་བརྒྱད་པར་བལྟའོ། །རྒྱ་མཚོའི་དབུས་སུ་ན་དེ་ནི་ས་དགུ་པར་རོ། །རི་བར་ཀྱི་རྩེ་མོར་"
 ],
 [
  "78.266a",
  "པས་<span class='delete'>དེས་</span><span class='add'>  ངེས་  </span>པར་མི་འབྱུང་བས་དེས་ཐོས་པ་ཡོངས་སུ་བཙལ་བར་བྱ་ཞིང་ཆོས་ཀྱང་བསྒོམ་པར་བྱ། ཐབ་མོ་མེད་པ་དང་རྩོད་པ་མེད་པར་ཡང་བྱའོ། །དེས་ན་དེའི་ལས་ཀྱི་སྒྲིབ་པ་དེ་རྣམ་པར་དག་པར་<br>འགྱུར་ཞིང་བྱང་ཆུབ་ཏུ་ངེས་པར་འབྱུང་བར་ཡང་འགྱུར་རོ། །རིན་པོ་ཆེ་སྣ་གཅིག་གི་ཕྲེང་བས་ནི་ས་དང་པོར་རོ། །རིན་པོ་ཆེ་སྣ་བདུན་གྱིས་ནི་ས་བདུན་པའི་བར་དུའོ། །འཁོར་ལོས་སྒྱུར་བའི་ནོར་བུ་རིན་པོ་ཆེས་ནི་<br>ས་བརྒྱད་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>ལྷའི་ནོར་བུ་རིན་པོ་ཆེས་ནི་ས་དགུ་པར་ཏེ། བདུད་ཀྱི་ལས་ནི་མ་གཏོགས་<span class='delete'>སོ། །</span><span class='add'>  སོ། །  </span>ལས་དང་པོ་པས་མཚན་མ་དེ་དག་མཐོང་ན་འཕྱར་བར་འགྱུར་ཞིང་ལེ་ལོ་སྐྱེ་བར་ཡང་འགྱུར། བག་འབེབས་<br><span class='delete'>བར་</span><span class='add'>  པར་  </span>ཡང་བྱེད། གཞན་ལ་བརྙས་པར་ཡང་བྱེད་པས་དེའི་ཕྱིར་དེས་བདུད་ཀྱི་ལས་ནི་རྟོགས་པར་བྱའོ། །རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་བདག་གི་མགོ་ལ་མེ་ཏོག་གི་ཕྲེང་བ་ཐོགས་<br><span class='delete'>བར་</span><span class='add'>  པར་  </span>ཀུན་དུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་བརྒྱད་པོ་དག་ཏུ་བལྟ་སྟེ། དེ་ལ་ལས་ཀྱི་སྒྲིབ་པ་ནི་མེད་ལ་བདུད་ཀྱི་ལས་ནི་ཡོད་<span class='delete'>དོ། །</span><span class='add'>  དོ། །  </span>དེས་གལ་ཏེ་དང་པོ་<span class='delete'>དང་</span><span class='add'>  དང་།    </span>དབུས་དང་ཐ་མར་ངེས་པར་རྟོགས་ནས་དད་པར་བྱས་ཤིང་ཐམས་ཅད་ཡོངས་སུ་<br>གཏོང་བས་སྐྱོ་བ་མེད་པར་བྱས་ནས། དེས་དེའི་ལས་ཀྱི་སྒྲིབ་པ་དེ་རྣམ་པར་དག་པར་འགྱུར་ཞིང་བྱང་ཆུབ་ཏུ་ངེས་པར་འབྱུང་བར་ཡང་འགྱུར་<span class='delete'>རོ། </span><span class='add'>  རོ། །  </span>མེ་ཏོག་སྣ་གཅིག་གི་ཕྲེང་བས་ནི་ས་དང་པོར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>མེ་ཏོག་སྣ་གཉིས་ཀྱི་ཕྲེང་བས་ནི་ས་གཉིས་<br>པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>མེ་ཏོག་སྣ་ཚོགས་ཀྱི་འཕྲེང་བས་ནི་ས་གསུམ་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>མེ་ཏོག་ཐམས་ཅད་ཀྱི་འཕྲེང་བས་ནི་ས་<span class='delete'>ལྔ་</span><span class='add'>  བཞི་  </span><span class='delete'>བར་</span><span class='add'>  པར་  </span><span class='delete'>རོ། </span><span class='add'>  རོ། །  </span>ཀླུའི་མེ་ཏོག་གི་ཕྲེང་བས་ནི་ས་ལྔ་བར་<span class='delete'>རོ། </span><span class='add'>  རོ། །  </span>ལྷའི་མེ་ཏོག་གི་ཕྲེང་བས་ནི་ས་དྲུག་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>ལྷའི་མེ་ཏོག་<br>སྣ་ཚོགས་ཀྱི་ཕྲེང་བས་ནི་ས་བདུན་པར་<span class='delete'>རོ། </span><span class='add'>  རོ། །  </span>ལྷ་དང་མིའི་མེ་ཏོག་གི་ཕྲེང་བ་འོད་འབྱུང་བས་ནི་ས་བརྒྱད་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་བདག་མེ་ཏོག་སིལ་མ་དག་སྲེལ་"
 ],
 [
  "78.268a",
  "ན་དེ་ནི་ས་བཅུ་པར་བལྟ་སྟེ། བདུད་ཀྱི་ལས་ལ་མངོན་<span class='delete'>པར་</span><span class='add'>  པར་  </span>བརྩོན་པ་དང་། སངས་རྒྱས་<span class='delete'>དང། </span><span class='add'>  དང་།   </span>བྱང་ཆུབ་སེམས་དཔས་མ་དགོངས་པས་ནི་མ་གཏོགས་སོ། །རྡོ་རྗེས་རབ་འཇོམས་གཞན་<br>ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་བདག་རྒྱལ་པོའི་སྤྱན་སྔ་འམ། རྒྱལ་པོའི་བློན་པོ་ཆེན་<span class='delete'>པོའམ། །</span><span class='add'>  པོའམ། །  </span>སྐྱེ་བོ་ཕལ་པོ་ཆེའི་མདུན་ན་འདུག་པར་ཀུན་དུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བརྒྱད་པོ་དག་<br>ཏུ་བལྟ་སྟེ། ཀུན་ནས་ཉོན་མོངས་པ་དང་བཅས་པ་<span class='delete'>ཡིབ་</span><span class='add'>  ཡིན་  </span><span class='delete'>བས་</span><span class='add'>  པས་  </span>དེས་ནི་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་ཞིང་ཉེ་དུའི་མཆོད་པ་སྤང་བར་བྱ་བ་དང་། ཤིན་དུ་ཡོངས་སུ་དག་པར་བྱའོ། །དེས་ན་དེའི་<span class='delete'>ལས་</span><span class='add'>  ལས་ཀྱི་  </span>སྒྲིབ་པ་དེ་<br>རྣམ་པར་དག་པར་འགྱུར་ཞིང་བྱང་ཆུབ་ཏུ་ངེས་པར་འབྱུང་བར་ཡང་འགྱུར་རོ། །དེ་ལ་སྦྱིན་<span class='delete'>བས་</span><span class='add'>  པས་  </span>ཀུན་ནས་ཉོན་མོངས་པར་གྱུར་ན་ས་དང་པོ་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>ཚུལ་ཁྲིམས་ཀྱིས་ནི་ས་གཉིས་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>ཐོས་པས་<br>ནི་ས་གསུམ་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>ཏིང་ངེ་འཛིན་གྱིས་ནི་ས་བཞི་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>གཟུངས་ཀྱིས་ནི་ས་ལྔ་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>མངོན་པར་ཤེས་པ་རྣམས་ཀྱིས་ནི་ས་དྲུག་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>ཆོས་སྟོན་པས་ནི་ས་བདུན་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>གཡོག་<br>འཁོར་ཕུན་སུམ་ཚོགས་པས་ནི་ས་བརྒྱད་པར་རོ། །རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་བདག་བསྐྱེད་མོས་ཚལ་དུ་སོན་<span class='delete'>བར་</span><span class='add'>  པར་  </span>ཀུན་དུ་ཤེས་ན་བྱང་ཆུབ་སེམས་<br>དཔའ་དེ་ནི་ས་དང་པོ་དགུ་པོ་དག་ཏུ་བལྟ་སྟེ། དེས་ནི་བསམ་<span class='delete'>གཏམ་</span><span class='add'>  གཏན་  </span>གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་མངོན་<span class='delete'>བར་</span><span class='add'>  པར་  </span>བརྩོན་པར་བྱའོ། །བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་འཇིག་རྟེན་གྱི་ཟང་ཟིང་ནི་རྙེད་ལ། ཤེས་པས་ནི་མ་ཡིན་<span class='delete'>བས་</span><span class='add'>  པས་  </span><br>བདུད་ཀྱི་ལྕགས་ཀྱུས་ཀུན་དུ་དྲངས་པ་ཡིན་ཏེ། ལས་ཀྱི་སྒྲིབ་པ་ནི་ཆུང་ངོ་། །དེས་ན་ཆོས་སྨྲས་བ་ལ་ཉེ་བར་འཚོ་བ་དག་བསྒྲུབ་བར་བྱ་ཞིང་ནང་དུ་ཡང་དག་འཇོག་ཀྱང་བསྒྲུབ་བར་བྱའོ། །དེས་ན་དེའི་ལས་ཀྱི་"
 ],
 [
  "78.268b",
  "སྒྲིབ་པ་དེ་རྣམ་པར་དག་པར་འགྱུར་ཞིང་བྱང་ཆུབ་ཏུ་ངེས་པར་འབྱུང་བར་ཡང་འགྱུར་རོ། །དེ་ལ་ས་དང་པོ་ལ་ནི་སྤྱོད་པའི་ཤེས་པ་མེད་དོ། །ས་གཉིས་པ་ལ་ནི་ཐོས་པའི་ཤེས་པ་མེད་དོ། །<br>ས་གསུམ་པ་ལ་ནི་ངེས་པའི་ཤེས་པ་མེད་<span class='delete'>དོ། །</span><span class='add'>  དོ། །  </span>ས་བཞི་པ་ལ་<span class='delete'>ནི་</span><span class='add'>  ནི་  </span>བསམ་གཏན་གྱི་ཤེས་པ་མེད་<span class='delete'>དོ། །</span><span class='add'>  དོ། །  </span>ས་ལྔ་པ་ལ་ནི་གཟུངས་ཀྱི་ཤེས་པ་མེད་<span class='delete'>དོ། །</span><span class='add'>  དོ། །  </span>ས་དྲུག་པ་ལ་ནི་སོ་སོ་ཡང་དག་པར་རིག་པའི་<br>ཤེས་པ་མེད་<span class='delete'>དོ། །</span><span class='add'>  དོ། །  </span>ས་བདུན་པ་ལ་ནི་སྒྲུབ་པའི་ཤེས་པ་མེད་<span class='delete'>དོ། །</span><span class='add'>  དོ། །  </span>ས་བརྒྱད་པ་ལ་ནི་བཀོད་པའི་ཤེས་པ་མེད་<span class='delete'>དོ། །</span><span class='add'>  དོ། །  </span>ས་དགུ་པ་ལ་ནི་སྨོན་ལམ་གྱི་ཤེས་པ་མེད་<span class='delete'>དོ། །</span><span class='add'>  དོ། །  </span>རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་<br>བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་སྔོན་མ་མཐོང་བའི་གཙུག་ལག་ཁང་ངམ། གྲོང་ངམ། ཡུལ་<span class='delete'>ལམ་། </span><span class='add'>  ལམ།   </span><span class='delete'>ལྗོངས། </span><span class='add'>  ལྗོངས།   </span>མ་ཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་དྲུག་པོ་དག་ཏུ་བལྟ་སྟེ། <br>དེ་ནི་བར་ཆད་མང་བ་ཡིན་བས་དེས་སངས་རྒྱས་རྗེས་སུ་དྲན་པ་བསྒོམ་པར་བྱ་ཞིང་དད་པར་ཡང་བྱ། བྱ་བ་ཐམས་ཅད་ལ་དད་བའི་སྦྱིན་བས་མོས་པར་ཡང་བྱའོ། །དེས་ན་དེའི་ལས་ཀྱི་སྒྲིབ་པ་དེ་རྣམ་པར་<br>དག་པར་འགྱུར་ཞིང་བྱང་ཆུབ་ཏུ་ངེས་པར་འབྱུང་བར་ཡང་འགྱུར་རོ། །གང་གིས་མཚན་མའི་བྱ་བ་དེ་དག་བྱི་དོར་མ་བྱས་བར་མཐོང་ན་དེ་ནི་ས་དང་པོར་རོ། །གང་གིས་བྱི་དོར་བྱས་པར་མཐོང་ན་དེ་ནི་ས་གཉིས་པར་རོ། །<br>གང་གིས་རྒྱན་གྱིས་<span class='delete'>བརྒྱད་</span><span class='add'>  བརྒྱན་  </span>པར་མཐོང་ན་དེ་ནི་ས་གསུམ་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>འཁོར་བཞི་པོ་དག་འདུས་ན་དེ་ནི་ས་ལྔ་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>ལྷའི་འཁོར་དག་འདུས་ན་དེ་ནི་ས་དྲུག་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་<br>དཔའ་གང་གིས་རྨི་ལམ་ན། གདུགས་རྙེད་ན་དེ་ནི་ས་དང་པོ་བདུན་པོ་དག་ཏུ་བལྟའོ། །སངས་རྒྱས་ཀྱི་བྱིན་གྱིས་བརླབས་ཀྱང་ཡོད། བར་ཆད་ཀྱང་མང་། མི་ཆོམས་པ་ཡང་"
 ],
 [
  "78.267a",
  "དབུས་སུ་ན་དེ་ནི་ས་ལྔ་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>གང་སྐྱབས་སུ་སོང་སྟེ་ན་དེ་ནི་ས་དྲུག་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>གང་རི་ལ་ན་དེ་ནི་ས་བདུན་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>གང་རི་བོའི་རྩེ་མོར་ན་དེ་ནི་ས་བརྒྱད་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>གང་ནམ་མཁའ་ལ་<br>འདུག་སྟེ་ན་དེ་ནི་ས་དགུ་པར་རོ། །ཡེ་ཤེས་ལ་བརྩོན་བ་ལ་བདུད་ཀྱི་ལས་ནི་མ་གཏོགས་སོ། །རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་ཉི་མ་གཟས་ཟིན་<span class='delete'>པའམ། </span><span class='add'>  པ་འམ།   </span><br>ཟླ་བ་གཟས་ཟིན་པར་ཀུན་དུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་དྲུག་པོ་དག་དུ་བལྟ་སྟེ། ཆོས་ཀྱིས་ཕོངས་བར་འགྱུར་བའི་ལས་དང་ལྡན་ཞིང་ཉོན་མོངས་པ་མང་བ་ཡིན་བས་དེས་ནི་དངོས་པོ་ཐམས་<br>ཅད་ཡོངས་སུ་བཏང་བར་བྱ་ཞིང་། རྣམ་པར་སྨིན་པ་མི་འདོད་པ་ལ་ཡང་མངོན་<span class='delete'>བར་</span><span class='add'>  པར་  </span>བརྩོན་<span class='delete'>བར་</span><span class='add'>  པར་  </span>བྱའོ། །དེས་ན་དེའི་ལས་ཀྱི་སྒྲིབ་པ་དེ་རྣམ་པར་དག་པར་འགྱུར་ཞིང་བྱང་ཆུབ་ཏུ་ངེས་པར་འབྱུང་བར་ཡང་<br>འགྱུར་རོ། །ཉི་མ་དང་ཟླ་བ་འཆར་ཀར་གཟས་ཟིན་པར་ཀུན་དུ་ཤེས་ན་དེ་ནི་ས་དང་པོ་པར་<span class='delete'>བལྟའོ། </span><span class='add'>  བལྟའོ། །  </span>སྔ་དྲོའི་དུས་སུ་ན་ས་གཉིས་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>སྤྲིན་ཡང་འཁྲུགས་ན་ས་གསུམ་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>རླུང་ཡང་<br>འཁྲུགས་ན་ས་བཞི་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>རྡུལ་གྱིས་ངེས་པར་བཅོམ་ན་ས་ལྔ་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>ཉི་མ་ཕྱེད་པའི་དུས་སུ་ན་ས་དྲུག་པར་ཏེ། ལས་ཀྱི་སྒྲིབ་པ་དང་། བདུད་ཀྱི་ལས་ནི་མ་གཏོགས་<span class='delete'>སོ། །</span><span class='add'>  སོ། །  </span>རྡོ་རྗེས་རབ་འཇོམས་<br>གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་བདག་མི་གཙང་བས་བསྐུས་པར་ཀུན་དུ་ཤེས་<span class='delete'>ན་། </span><span class='add'>  ན།   </span>བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་གསུམ་པོ་དག་ཏུ་བལྟ་སྟེ། སྔོན་འཕགས་པ་ལ་<br>སྐུར་པ་བཏབ་པའི་བྱང་ཆུབ་སེམས་དཔའ་དམུ་རྒོད་ཡིན་<span class='delete'>བས་</span><span class='add'>  པས་  </span>དེས་ལོ་གསུམ་དུ་<span class='delete'>ཕོང་</span><span class='add'>  ཕུང་  </span>པོ་གསུམ་པ་ལ་ཇི་ལྟར་ལུང་ཕོག་པ་བཞིན་དུ་<span class='delete'>གདོང་</span><span class='add'>  གདོན་  </span>པར་བྱ་ཞིང། གདལ་ཡང་མ་དད་པར་མི་བྱ་བར་མོས་པ"
 ],
 [
  "78.269b",
  "འཇུག་པའི་གཏམ་གྱིས་ནི་ས་ལྔ་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>ལེགས་པར་སྦྱར་བ་ཡོངས་སུ་རྗོད་པའི་གཏམ་གྱིས་ནི་ས་དྲུག་པར་རོ། །བདག་མེད་པའི་གཏམ་གྱིས་ནི་ས་བདུན་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>ཡེ་ཤེས་བཀོད་པའི་<br>གཏམ་གྱིས་ནི་ས་བརྒྱད་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>སངས་རྒྱས་ཀྱི་བཀོད་པའི་གཏམ་གྱིས་ནི་ས་དགུ་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>ལུས་ཀྱི་ཚད་ཀྱི་གཏམ་གྱིས་ནི་ས་བཅུ་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>ས་དང་པོ་ལ་ནི་ཡོ་བྱད་ལ་རྩོལ་བ་<span class='delete'>དང་</span><span class='add'>  དང་  </span><br>བཅས་<span class='delete'>པའོ། །</span><span class='add'>  པའོ། །  </span>ས་གཉིས་པ་ལ་ནི་ཚུལ་ཁྲིམས་ལ་རྩོལ་བ་དང་བཅས་<span class='delete'>པའོ། །</span><span class='add'>  པའོ། །  </span>ས་གསུམ་པ་ལ་ནི་འོད་ལ་རྩོལ་བ་དང་བཅས་<span class='delete'>པའོ། །</span><span class='add'>  པའོ། །  </span>ས་བཞི་པ་ལ་ནི་ནོར་བདུན་ལ་རྩོལ་བ་དང་བཅས་<br>པའོ། །ས་ལྔ་པ་ལ་ནི་གནས་པ་ལ་རྩོལ་བ་དང་བཅས་<span class='delete'>པའོ། །</span><span class='add'>  པའོ། །  </span>ས་དྲུག་པ་ལ་ནི་རྣམ་པར་གཏན་ལ་དབབ་པ་ལ་རྩོལ་བ་དང་བཅས་<span class='delete'>པའོ། །</span><span class='add'>  པའོ། །  </span>ས་བདུན་པ་ལ་ནི་ངེས་པ་ལ་རྩོལ་བ་དང་བཅས་<span class='delete'>པའོ། །</span><span class='add'>  པའོ། །  </span><br>ས་བརྒྱད་པ་ལ་ནི་མངོན་བར་ཤེས་པ་དང་སོ་སོ་ཡང་དག་པར་རིག་པ་ལ་རྩོལ་<span class='delete'>པ་</span><span class='add'>  བ་  </span>དང་བཅས་<span class='delete'>པའོ། །</span><span class='add'>  པའོ། །  </span>ས་དགུ་པ་ལ་ནི་སྤྱོད་པ་ལ་རྩོལ་བ་དང་བཅས་<span class='delete'>པའོ། །</span><span class='add'>  པའོ། །  </span>ས་བཅུ་པ་ལ་ནི་ཚད་མེད་པ་ལ་རྩོལ་བ་དང་<br>བཅས་པའོ། །དེའི་ས་དང་པོ་ལ་ནི་དགེ་བའི་རྩ་བ་ལ་བར་ཆད་ཡོད་<span class='delete'>དོ། །</span><span class='add'>  དོ། །  </span>ས་གཉིས་པ་ལ་ནི་ཚུལ་ཁྲིམས་ལ་བར་ཆད་ཡོད་<span class='delete'>དོ། །</span><span class='add'>  དོ། །  </span>ས་གསུམ་པ་ལ་ནི་མངོན་པར་བརྩོན་པ་ལ་བར་ཆད་ཡོད་<span class='delete'>དོ། །</span><span class='add'>  དོ། །  </span>ས་<br>བཞི་བ་ལ་ནི་དམིགས་པ་ལ་བར་ཆད་ཡོད་<span class='delete'>དོ། །</span><span class='add'>  དོ། །  </span>ས་ལྔ་པ་ལ་ནི་རྣམ་པ་ལ་བར་ཆད་ཡོད་<span class='delete'>དོ། །</span><span class='add'>  དོ། །  </span>ས་དྲུག་པ་ལ་ནི་ཟབ་མོའི་བཟོད་པ་ལ་བར་ཆད་ཡོད་<span class='delete'>དོ། །</span><span class='add'>  དོ། །  </span>ས་བདུན་པ་ལ་ནི་རྣམ་པར་འབྱེད་པའི་ཡེ་ཤེས་<br>ལ་བར་ཆད་ཡོད་དོ། །ས་བརྒྱད་པ་ལ་ནི་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བ་ལ་བར་ཆད་ཡོད་<span class='delete'>དོ། །</span><span class='add'>  དོ། །  </span>ས་དགུ་པ་ལ་ནི་རྣམ་པར་ཤེས་པའི་ཚོགས་ལ་བར་ཆད་ཡོད་<span class='delete'>དོ། །</span><span class='add'>  དོ། །  </span>ས་བཅུ་པ་ལ་ནི་ཞིང་"
 ],
 [
  "78.269a",
  "ཡིན་ནོ། །དེས་ནི་ཆོས་སྨྲ་བ་ལ་བརྙས་པར་མི་བྱ་སྟེ། དེས་ན་དེའི་ལས་ཀྱི་སྒྲིབ་པ་དེ་རྣམ་པར་དག་པར་འགྱུར་ཞིང་བྱང་ཆུབ་ཏུ་ངེས་པར་འབྱུང་བར་ཡང་འགྱུར་རོ། །དེ་ལ་ལོ་མའི་གདུགས་ཀྱིས་<br>ནི་ས་དང་པོར་རོ། །འོད་མའི་གདུགས་ཀྱིས་ནི་ས་གཉིས་པར་རོ། །གྲོ་བའི་གདུགས་ཀྱིས་ནི་ས་གསུམ་པར་རོ། །རས་ཀྱི་གཟུགས་ཀྱིས་ནི་ས་བཞི་པར་རོ། །ཁྲ་བོས་ནི་ས་ལྔ་པར་རོ། །<br>དྲིལ་བུ་གཡེར་ཀས་ཡོངས་སུ་བསྐོར་བས་ནི་ས་དྲུག་པར་རོ། །རིན་པོ་ཆེའི་དྲ་བས་སྦྱངས་པས་ནི་ས་བདུན་པར་རོ། །བདུད་ཀྱི་ལས་དང་། མངོན་པར་མི་བརྩོན་པ་ནི་མ་གཏོགས་སོ། །རྡོ་རྗེས་རབ་འཇོམས་<br>གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་བདག་སྐྱེ་བོ་ཕལ་པོ་ཆེའི་དབུས་ན་འདུག་སྟེ་ཆོས་སྟོན་བར་ཀུན་དུ་ཤེས་ན། བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བཅུ་པོ་ཐམས་ཅད་དུ་བལྟ་<span class='delete'>སྟེ། </span><span class='add'>  སྟེ།   </span><br>དེས་ས་དག་ལ་བདུད་ཀྱི་ལས་དང་ལས་ཀྱི་སྒྲིབ་པ་ཡང་། ཇི་ལྟ་བ་བཞིན་དུ་རྟོགས་པར་བྱ་ཞིང་། དེས་སྤོབས་པ་ཡོངས་སུ་བཙལ་བར་བྱ་སྟེ། སྤོབས་པ་རྙེད་ནས་ཀྱང་རྣམ་པར་ངེས་པ་སྒྲུབ་པའི་<br>ལུང་དབོག་པར་བྱའོ། །དངོས་པོ་ཐམས་ཅད་ལ་ཡང་ལྷག་པར་ཞེན་པ་མེད་པར་བྱ་ཞིང་། དེས་དངོས་པོ་རྙེད་པ་ལ་ཡང་ཡང་དག་པར་དགའ་བར་འགྱུར་བའི་ངང་ཚུལ་ཅན་དུ་བྱའོ། །དེས་ན་དེའི་<br>ལས་ཀྱི་སྒྲིབ་པ་དེ་རྣམ་པར་དག་པར་འགྱུར་ཞིང་། བྱང་ཆུབ་ཏུ་ངེས་པར་འབྱུང་བར་ཡང་འགྱུར་རོ། །སྦྱིན་པའི་གཏམ་སྟོན་པར་ཀུན་དུ་ཤེས་ན་ས་དང་པོ་ལ་གནས་པར་འགྱུར་རོ། །དགེ་བ་<br>བཅུའི་ལས་ཀྱི་ལམ་གྱིས་ནི་ས་གཉིས་པར་རོ། །ཐོས་པའི་གཏམ་གྱིས་ནི་ས་གསུམ་པར་རོ། །སྦྱངས་པའི་ཡོན་ཏན་དང་ཡོ་<span class='delete'>བྱད་</span><span class='add'>  བྱད་བསྙུངས་  </span><span class='delete'>བ༈ །༈ །</span><span class='add'>    </span><span class='delete'>༈ །</span><span class='add'>    </span><span class='delete'>སངས་</span><span class='add'>    </span>པའི་གཏམ་གྱིས་ནི་ས་བཞི་པར་རོ། །སྙོམས་པར་"
 ],
 [
  "78.270a",
  "ཡོངས་སུ་དག་བར་བྱ་བ་ལ་བར་ཆད་ཡོད་དོ། །རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་བདག་གྲོང་ཁྱེར་གནས་པར་བྱེད་པར་ཀུན་དུ་ཤེས་ན། བྱང་ཆུབ་སེམས་<br>དཔའ་དེ་ནི་ས་བརྒྱད་པོ་དག་ལ་ཕྱིར་མི་ལྡོག་པར་ལུང་བསྟན་དུ་ཉེ་བ་ཡིན་ཏེ། དེས་ནི་ཟབ་མོ་ལ་མོས་པའི་གང་ཟག་ལ་བསྟེན་པར་བྱ་ཞིང་། བསྙེན་བཀུར་བྱ། མཆོད་པར་བྱའོ། །ཆོས་ལ་ཐེ་ཙོམ་<br>མང་ཞིང་སྒྲིབ་པ་ཡོད་པས་དེས་ཆོས་སྨྲ་བ་ལ་བསྟེན་ཅིང་བསྙེན་བཀུར་བྱེད། མཆོད་པར་བྱེད་ན་འགྱོད་པ་སེལ་བར་འགྱུར་ལ། དེས་ན་དེའི་ལས་ཀྱི་སྒྲིབ་པ་དེ་རྣམ་པར་དག་པར་འགྱུར་ཞིང་། བྱང་ཆུབ་ཏུ་<br>ངེས་པར་འབྱུང་བར་ཡང་<span class='delete'>འགྱུ་</span><span class='add'>  འགྱུར་  </span>རོ། །དེ་ལ་ས་དང་པོ་ལ་གནས་པ་ནི་སངས་རྒྱས་སུ་འགྱུར་རམ། འོན་ཀྱང་མི་འགྱུར་སྙམ་དུ་བྱང་ཆུབ་ལ་ཐེ་ཙོམ་ཟའོ། །ས་གཉིས་པ་ལ་གནས་པ་ལ་ནི་ཡང་དག་པར་<br>བླང་བ་ལ་ཐེ་ཙོམ་ཟའོ། །ས་གསུམ་པ་ལ་གནས་པ་ནི་ཡེ་ཤེས་ལ་ཐེ་ཙོམ་ཟའོ། །ས་བཞི་པ་ལ་གནས་པ་ནི་ཏིང་ངེ་འཛིན་སྒྲུབ་པ་ལ་ཐེ་ཙོམ་ཟའོ། །ས་ལྔ་པ་ལ་གནས་པ་ནི་ཡང་དག་<br>པ་ཇི་ལྟ་བ་བཞིན་གྱི་ཤེས་པ་ལ་ཐེ་ཙོམ་ཟའོ། །ས་དྲུག་པ་ལ་གནས་པ་ནི་ལམ་དང་འབྲས་བུ་ལ་ཐེ་ཙོམ་ཟའོ། །ས་བདུན་པ་ལ་གནས་པ་ནི་ངེས་པའི་ཚིག་ལ་ཐེ་ཙོམ་ཟའོ། །ས་བརྒྱད་པ་ལ་གནས་<br>པ་ནི་རྣམ་པར་འཕྲུལ་བ་ལ་ཐེ་ཙོམ་ཟའོ། །རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་བདག་ཟམ་པ་འདོགས་ཤིང་ཆུ་<span class='delete'>བོའི་</span><span class='add'>  བོའི་  </span>དབུས་སུ་སོང་བར་ཀུན་དུ་ཤེས་ན་བྱང་ཆུབ་<br>སེམས་དཔའ་དེ་ནི་ས་དང་པོ་བདུན་པོ་དག་ཏུ་བལྟ་སྟེ། དེ་ལ་ལས་ཀྱི་སྒྲིབ་པ་ཤས་ཆེ་ཞིང་བདུད་ཀྱི་ལས་ཀྱང་ཤས་ཆེ་བས་དེས་ནི་འདུན་པ་དྲག་པོར་བྱ་ཞིང་རྟེན་པ་མེད་པ་དང་། དབྱེ་བ་ལ་མི་གནས་པར་"
 ],
 [
  "78.270b",
  "བྱ་བ་དང་། ཚོགས་པ་ལ་མངོན་པར་སྟོན་པར་བྱས་ན་མི་སྐྱེ་བའི་ཆོས་ཀྱི་སྣང་བ་རྣམ་པར་དག་པར་འགྱུར་རོ། །གང་གིས་ཤེས་པའི་སྣང་བ་ལ་བར་ཆད་ཡོད་པ་དེ་ནི་ས་དང་པོར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>གང་གིས་ཇི་ལྟར་བརྩོན་<span class='delete'>བའི་</span><span class='add'>  པའི་དགེ་བའི་  </span><br><span class='delete'>དགེ་</span><span class='add'>    </span><span class='delete'>བའི་</span><span class='add'>    </span>རྩ་བ་ལ་ལུས་ཉམས་བདེ་བ་མེད་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་གཉིས་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>སེམས་ཀྱི་བར་དག་ལ་ཉམས་བདེ་བ་མེད་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་གསུམ་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>གང་ལ་སྣང་བ་འགའ་<br>ཞིག་ཡོད་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བཞི་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>གང་ལ་མི་འཇིགས་པ་ཆུང་བ་དེ་ནི་ས་ལྔ་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>གང་ལ་ཡོངས་སུ་སྨིན་པར་བྱ་བ་ལ་བར་ཆད་ཡོད་པ་དེ་ནི་ས་དྲུག་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>གང་གིས་བསྟན་<br>པ་ལ་བར་ཆད་ཡོད་པ་དེ་ནི་ས་བདུན་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་བདག་གྲུ་འདྲེན་པར་ཀུན་དུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དྲུག་པོ་<br>དག་ཏུ་བལྟ་སྟེ། ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་པོ་ཐམས་ཅད་ལ་ཆ་མཉམ་པར་སྤྱོད་ཅིང་བར་ཆད་དང་བཅས་པ་ཡིན་པས་དེས་ནི་མི་གནས་པས་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་པོ་ཐམས་ཅད་ལ་བསྟེན་པར་བྱའོ། །<br>དེས་ན་དེའི་ལས་ཀྱི་སྒྲིབ་པ་དེ་རྣམ་པར་དག་པར་འགྱུར་ཞིང་བྱང་ཆུབ་ཏུ་ངེས་པར་འབྱུང་བར་ཡང་འགྱུར་རོ། །གྲུའི་ཤིང་མ་སྦྱངས་པ་འདྲེན་<span class='delete'>བར་</span><span class='add'>  པར་  </span>ཀུན་དུ་ཤེས་ན་ས་དང་པོར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>སྦྱངས་པས་ནི་ས་<br>གཉིས་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>གཤིབས་པས་ནི་ས་གསུམ་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>མ་གཤིབས་པས་ནི་ས་བཞི་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>སྐྱེ་བོ་ཞུགས་པས་ནི་ས་ལྔ་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>སྒྲོལ་བས་ནི་ས་དྲུག་པར་རོ། །རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་<br>བྱང་ཆུབ་སེམས་དཔའ་གང་<span class='delete'>གིས་</span><span class='add'>  གི་  </span>རྨི་ལམ་ན་སྤྲིན་ལས་<span class='delete'>དབྲུག་</span><span class='add'>  འབྲུག་  </span>གྲག་<span class='delete'>པའམ། </span><span class='add'>  པ་འམ།   </span>གློག་འབྱུང་བར་བདག་གིས་ཀུན་དུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་ལྔ་པོ་དག་ཏུ་བལྟ་<span class='delete'>སྟེ། །</span><span class='add'>  སྟེ།   </span>དེ་ལ་བདུད་ཀྱི་ལས་ནི་ཤས་"
 ],
 [
  "78.272a",
  "ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་བརྒྱད་པོ་དག་ཏུ་བལྟ་སྟེ། དེའི་རྨི་ལམ་དུ་བདུད་ཀྱི་ལས་དང་། ལས་ཀྱི་སྒྲིབ་པ་དག་རྣམ་པར་སྨིན་པར་འགྱུར་ཞིང་རྨི་ལམ་ན་སྐྲག་པར་<br>ཡང་འགྱུར་ལ། དེ་སད་པ་ན་ཡིད་མི་བདེ་བ་ཉམས་སུ་མྱོང་བར་ཡང་འགྱུར་པས། དེས་སྟོང་པ་ཉིད་བསྒོམ་པར་བྱ་ཞིང་ཆོས་ཟབ་མོ་ཡང་མཉན་པར་བྱ། ནང་དུ་ཡང་དག་འཇོག་ཀྱང་གཟུང་བར་བྱ། <br>རྨུགས་པ་དང་གཉིད་ཀྱང་སྤང་བར་བྱ། བྱང་ཆུབ་རྣམ་པར་གཏན་ལ་འབེབས་པ་ལ་མཁས་པའི་གང་ཟག་ལ་ཡང་བསྟེན་པར་བྱའོ། །དེས་ན་དེའི་<span class='delete'>ལས་</span><span class='add'>  ལས་ཀྱི་  </span>སྒྲིབ་པ་དེ་རྣམ་པར་དག་པར་འགྱུར་ཞིང་<br>བྱང་ཆུབ་ཏུ་ངེས་པར་འབྱུང་བར་ཡང་འགྱུར་རོ། །རྒྱལ་སྲིད་རྣམ་པར་ཉམས་པས་འཇིགས་ན་ས་དང་པོར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>ཚུལ་ཁྲིམས་རལ་བས་འཇིགས་ན་ས་གཉིས་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>ཆོས་ནུབ་པས་འཇིགས་<br>ན་ས་གསུམ་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>ཆོས་སྨྲ་བ་འཆི་བས་འཇིགས་ན་ས་བཞི་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>མེས་ཚིག་པས་འཇིགས་ན་ས་ལྔ་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>བདག་<span class='delete'>བསང་</span><span class='add'>  བསད་  </span>པ་དང་འགོ་བའི་ནད་ཀྱིས་འཇིགས་ན་ས་དྲུག་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>རི་ལས་<br>གཡང་དུ་ལྟུང་བས་འཇིགས་ན་ས་བདུན་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>སྟོན་པ་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བས་འཇིགས་ན་ས་བརྒྱད་པར་ཏེ། ས་བརྒྱད་པོ་དག་ལ་མངོན་པར་བརྩོན་པ་ལ་བདུད་ཀྱི་ལས་ཀྱང་<br>རྟོགས་པར་བྱའོ། །རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་ལོ་ཏོག་ཕུན་སུམ་ཚོགས་པར་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་བརྒྱད་པོ་དག་ཏུ་<br>བལྟ་སྟེ། ས་དང་པོ་ལ་གནས་པས་ས་གཉིས་པ་ལ་མངོན་པར་བརྩོན་<span class='delete'>བས་</span><span class='add'>  པས་  </span>དེ་ལྟ་བུར་མཐོང་ན་བདུད་ཀྱི་ལས་ལ་ཡིད་རྟོན་པར་འགྱུར་བ་འམ། སྔོན་གྱི་རྒྱལ་བ་ལ་བྱ་བ་ལྷག་པར་<span class='delete'>བྱས་</span><span class='add'>  བྱས་པ་  </span>"
 ],
 [
  "78.271b",
  "བཞི་དག་གིས་མངོན་<span class='delete'>བར་</span><span class='add'>  པར་  </span>བརྩོན་<span class='delete'>བར་</span><span class='add'>  པར་  </span>བྱའོ། །དེས་ན་དེའི་ལས་ཀྱི་སྒྲིབ་པ་དེ་རྣམ་པར་དག་པར་འགྱུར་ཞིང་བྱང་ཆུབ་ཏུ་ངེས་པར་འབྱུང་བར་ཡང་འགྱུར་རོ། །ས་དྲུག་པོ་དག་ལ་ནི་ཕྱིར་མི་ལྡོག་པའི་ཆོས་<br>རྣམས་སྤྱད་པར་བྱའོ། །ས་བདུན་པ་ལ་ནི་ངའོ་སྙམ་པའི་ང་རྒྱལ་ཤེས་པར་བྱའོ། །རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་བདག་སེམས་ཅན་རྣམས་ལ་<br>ལམ་སྟོན་པར་ཀུན་དུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བཅུ་པོ་ཐམས་ཅད་དུ་འགྱུར་ཏེ། དེས་ལས་ཀྱི་སྒྲིབ་པ་དང་། ཉོན་མོངས་པའི་སྒྲིབ་པ་དང་། ཉོན་མོངས་པའི་སྒྲིབ་པའི་དངོས་པོ་ཇི་ལྟ་བ་བཞིན་<br>དུ་རྟོགས་པར་བྱ་ཞིང་ཆོས་སྨྲ་བ་ལ་བསྙེན་བཀུར་བྱ་བ་དང་། དངོས་པོ་ཐམས་ཅད་ཡོངས་སུ་བཏང་བར་བྱ་བ་དང་། བརྩོན་འགྲུས་བརྩམས་པར་ཡང་བྱའོ། །དེས་ན་དེའི་ལས་ཀྱི་སྒྲིབ་པ་དེ་རྣམ་པར་<br>དག་པར་འགྱུར་ཞིང་བྱང་ཆུབ་ཏུ་ངེས་པར་འབྱུང་བར་ཡང་འགྱུར་རོ། །བཞོན་པའི་ལམ་གཙང་མ་སྟོན་ན་ས་དང་པོར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>བསྐྱེད་མོས་ཚལ་གྱི་ལམ་<span class='delete'>གྱི་</span><span class='add'>  གྱི  </span>ས་ནི་གཉིས་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>གྲོང་ཁྱེར་གྱི་ལམ་གྱིས་<br>ནི་ས་གསུམ་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>ལམ་པོ་ཆེས་ནི་ས་བཞི་པར་རོ། །རིའི་ལམ་གྱིས་ནི་ས་ལྔ་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>རྒྱ་མཚོའི་ལམ་གྱིས་ནི་ས་དྲུག་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span><span class='delete'>ལྟའི་</span><span class='add'>  ལྷའི་  </span>ལམ་གྱིས་ནི་ས་བདུན་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>འདི་ནི་ཉན་ཐོས་ཀྱི་སའི་ལམ་མོ་ཞེས་<br>བྱ་བས་ནི་ས་བརྒྱད་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>བྱང་ཆུབ་སེམས་དཔའི་ལམ་གྱིས་ནི་ས་དགུ་པར་རོ། །སངས་རྒྱས་ཀྱི་ལམ་གྱིས་ནི་ས་བཅུ་པར་<span class='delete'>ཏེ། </span><span class='add'>  ཏེ།   </span>ས་དང་པོ་དྲུག་པོ་དག་ལ་བདུད་ཀྱི་ལས་དང་། ལས་ཀྱི་སྒྲིབ་པ་ཡང་<br>རྟོགས་པར་བྱའོ། །ས་གོང་མ་བཞི་པོ་དག་ལ་ནི་སྐྱོན་དེ་དག་མེད་དོ། །རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་བདག་བསྐྱེད་མོས་ཚལ་དུ་ཞུགས་པར་ཀུན་དུ་"
 ],
 [
  "78.271a",
  "ཆེ་ལ་ལས་ཀྱི་སྒྲིབ་པ་ནི་ཆུང་བས་དེས་ངེས་པར་བརྟག་པ་མང་དུ་བྱ་ཞིང་སྡུག་པའི་དངོས་པོ་ཡོངས་སུ་བཏང་སྟེ། གཟུངས་ཡང་དག་པར་བསྒྲུབ་པར་<span class='delete'>བྱའོ། །</span><span class='add'>  བྱའོ། །  </span>དེས་ན་དེའི་ལས་ཀྱི་སྒྲིབ་པ་<br>དེ་རྣམ་པར་དག་པར་འགྱུར་ཞིང་བྱང་ཆུབ་ཏུ་ངེས་པར་འབྱུང་བར་ཡང་འགྱུར་རོ། །གང་གིས་སྤྲིན་ནམ་གློག་མཐོང་ནས་སྐྲག་ན་དེ་ནི་ས་དང་པོར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>གང་མི་སྐྲག་ན་དེ་ནི་ས་གཉིས་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>གང་ཆོས་ཡིད་ལ་<br>བྱེད་ན་དེ་ནི་ས་གསུམ་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>གང་སངས་རྒྱས་ཡིད་ལ་བྱེད་ཅིང་རིའི་རྩེ་མོ་ན་འདུག་ན་དེ་ནི་ས་བཞི་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>གང་ནམ་མཁའ་ལ་ནི་ས་ལྔ་པར་ཏེ། དེ་ལ་བདུད་ཀྱི་ལས་ནི་མ་གཏོགས་སོ། །ཀླུ་འོངས་ཤིང་<br>བྱི་དོར་རམ་སྒོམ་པར་བྱེད་ནས་གོང་མ་དག་ཏུའོ། །རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་མཚོན་ཆ་འམ་གོ་ཆ་རྙེད་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་གསུམ་པོ་དག་<br>ཏུ་བལྟ་སྟེ། དེ་ལ་བདུད་ཀྱི་ལས་དང་ལས་ཀྱི་སྒྲིབ་པ་ཆེ་བ་ཡིན་<span class='delete'>བས་</span><span class='add'>  པས་  </span>དེས་ནི་བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་ཀུན་དུ་བསྟེན་<br>པར་བྱའོ། །དེས་ན་དེའི་ལས་ཀྱི་སྒྲིབ་པ་དེ་རྣམ་པར་དག་པར་འགྱུར་ཞིང་བྱང་ཆུབ་ཏུ་ངེས་པར་འབྱུང་བར་ཡང་འགྱུར་རོ། །གང་གིས་མཚོན་ཆ་འམ་གོ་ཆ་དྲི་མ་ཅན་རྙེད་ན་དེ་ནི་ས་དང་པོ་པར་བལྟ་<br>འོ། །དྲི་མ་མེད་པས་ནི་ས་གཉིས་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>རྣོན་པོས་ནི་ས་གསུམ་པར་རོ། །རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་སྣོད་དག་རྙེད་ན་བྱང་ཆུབ་<span class='delete'>སེམས་</span><span class='add'>  སེམས་  </span><br>དཔའ་དེ་ནི་ས་བདུན་པོ་དག་ཏུ་བལྟ་སྟེ། དེས་མཚན་མ་ཇི་ལྟ་བ་བཞིན་དུ་ཡོངས་སུ་གདུལ་བར་བྱའོ། །དེ་ལ་ནི་བདུད་ཀྱི་ལས་དང་། ལས་ཀྱི་སྒྲིབ་པ་ཡང་མ་ངེས་པ་ཡིན་<span class='delete'>བས་</span><span class='add'>  པས་  </span>དེས་བསྡུ་བའི་དངོས་པོ་"
 ],
 [
  "78.273b",
  "རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་བདག་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པར་ཀུན་དུ་ཤེས་ན། བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་ཕྱི་མ་གསུམ་པོ་དག་ཏུ་བལྟ་སྟེ། དེས་<br>ནི་བདུད་ཀྱི་ལས་རྟོགས་པར་བྱ་ཞིང་རྟག་ཏུ་མངོན་<span class='delete'>བར་</span><span class='add'>  པར་  </span>བརྩོན་<span class='delete'>བར་</span><span class='add'>  པར་  </span>ཡང་བྱ་ལྷག་པའི་བསམ་<span class='delete'>བ་</span><span class='add'>  པ་  </span>བསྒྲུབ་པར་ཡང་བྱའོ། །དེས་ན་དེའི་ལས་ཀྱི་སྒྲིབ་པ་དེ་རྣམ་པར་དག་པར་འགྱུར་ཞིང་བྱང་ཆུབ་ཏུ་ངེས་པར་འབྱུང་བར་<br>ཡང་འགྱུར་རོ། །རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་བུམ་པ་གང་བ་རྙེད་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བཅུ་པོ་ཐམས་ཅད་དུ་<span class='delete'>བལྟ་</span><span class='add'>  བལྟ  </span>འོ། །དེས་ན་ཡུལ་ཇི་ལྟ་བ་བཞིན་<br>རྟོགས་པར་བྱ་སྟེ། གལ་ཏེ་གྲོང་ནས་རྙེད་ན་དེ་ནི་ས་དང་པོ་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གལ་ཏེ་སྒོ་ནས་སྙེད་ན་དེ་ནི་ས་གཉིས་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གལ་ཏེ་ལམ་ནས་རྙེད་ན་དེ་ནི་ས་གསུམ་པར་བལྟའོ། །གལ་ཏེ་ཤིང་དྲུང་ནས་རྙེད་ན་<br>དེ་ནི་ས་བཞི་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གལ་ཏེ་འགྲེང་སྟེ་རྙེད་ན་དེ་ནི་ས་ལྔ་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གལ་ཏེ་འདུག་ཏེ་རྙེད་ན་དེ་ནི་ས་དྲུག་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གལ་ཏེ་ལམ་ནས་རྙེད་ན་དེ་ནི་ས་བདུན་<span class='delete'>བར་</span><span class='add'>  པར་  </span><span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གལ་ཏེ་ནམ་མཁའ་ལས་རྙེད་<br>ན་དེ་ནི་ས་བརྒྱད་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གལ་ཏེ་ཟས་ཟ་བའི་ཚེ་རྙེད་ན་དེ་ནི་ས་དགུ་པར་<span class='delete'>བལྟའོ། །</span><span class='add'>  བལྟའོ། །  </span>གལ་ཏེ་བཞོན་པ་ལ་ཞོན་པ་འམ། བསྐྱེད་མོས་ཚལ་ན་འདུག་པ་ན་བརྒྱན་གྱིས་བརྒྱན་པ་རྙེད་ན་དེ་ནི་ས་བཅུ་པར་བལྟ་<span class='delete'>སྟེ། །</span><span class='add'>  སྟེ།   </span><br>བདུད་ཀྱི་ལས་དང་ལས་ཀྱི་སྒྲིབ་པ་ནི་རྟོགས་པར་<span class='delete'>བྱའོ། །</span><span class='add'>  བྱའོ། །  </span>དེས་ན་དེའི་ལས་ཀྱི་སྒྲིབ་པ་དེ་རྣམ་པར་དག་པར་འགྱུར་ཞིང་བྱང་ཆུབ་ཏུ་ངེས་པར་འབྱུང་བར་ཡང་འགྱུར་རོ། །རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་<br>སེམས་དཔའི་མཚན་མ་བརྒྱ་རྩ་བརྒྱད་པོ་དེ་དག་གིས་ནི་གང་ཟག་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པ་ཡིན་<span class='delete'>བར་</span><span class='add'>  པར་  </span>རིག་པར་བྱ་ཞིང་ཤེས་པར་བྱའོ། །དེ་ནས་དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱིས་ཚིགས་སུ་བཅད་པ་འདི་དག་"
 ],
 [
  "78.273a",
  "ན་དེ་ནི་ས་བཞི་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>གང་སྐྱ་རྦབ་ཀྱི་ནད་ཀྱིས་བཏབ་པ་གསོ་བར་བྱེད་ན་དེ་ནི་ས་ལྔ་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>གང་ཤ་བཀྲའི་ནད་ཀྱིས་བཏབ་པ་གསོ་བར་བྱེད་ན་དེ་ནི་ས་དྲུག་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>གང་སྐེམ་ནད་ཀྱིས་བཏབ་<br>པ་གསོ་བར་བྱེད་ན་དེ་ནི་ས་བདུན་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>གང་འབྱུང་པོས་ཟིན་པ་གསོ་བར་བྱེད་ན་དེ་ནི་ས་བརྒྱད་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>བདུད་ཀྱི་ལས་ནི་མ་གཏོགས་<span class='delete'>སོ། །</span><span class='add'>  སོ། །  </span>སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་དེས་<br>བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་ལྷག་པའི་བསམ་པ་ཕུན་སུམ་ཚོགས་པར་བྱའོ། །རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་བདག་བྱང་ཆུབ་ཏུ་ལུང་<br>བསྟན་པའི་སྒྲ་ཐོས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བཅུ་པོ་དག་ལས་ས་གང་ཡང་རུང་བར་བལྟ་<span class='delete'>སྟེ། །</span><span class='add'>  སྟེ།   </span>དེས་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ལུང་བསྟན་པ་བཅུ་པོ་དག་ཏུ་ཇི་ལྟར་ལུང་བསྟན་པ་ལ་བདུད་ཀྱི་<br>ལས་དང་། ལས་ཀྱི་སྒྲིབ་པ་དག་རྟོགས་པར་བྱའོ། །བཅུ་གང་ཞེ་ན། ས་དང་པོ་ལ་བྱང་ཆུབ་ཏུ་ལུང་སྟོན་པ་དང་། ས་གཉིས་པ་ལ་བྱང་ཆུབ་ཀྱི་སྤྱོད་པར་ལུང་སྟོན་པ་དང་། ས་གསུམ་པ་ལ་བཟོད་པར་ལུང་<br>སྟོན་པ་དང་། ས་བཞི་པ་ལ་སྨོན་ལམ་དུ་ལུང་སྟོན་པ་དང་། ས་ལྔ་པ་ལ་མཉམ་པ་ཉིད་དུ་ལུང་སྟོན་པ་དང་། ས་དྲུག་པ་ལ་ཡེ་ཤེས་སུ་ལུང་སྟོན་པ་དང་། ས་བདུན་པ་ལ་ཐབས་ལ་མཁས་པར་ལུང་སྟོན་པ་<span class='delete'>དང་། །</span><span class='add'>  དང་།   </span>ས་<br>བརྒྱད་པ་ལ་ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱི་ས་ལས་ཡང་དག་པར་འདས་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ལུང་སྟོན་པ་དང་། ས་དགུ་པ་ལ་སྐྱེ་བ་གཅིག་གིས་ཐོགས་པར་ལུང་སྟོན་པ་དང་། ས་བཅུ་པ་ལ་སངས་རྒྱས་<br>སུ་དབང་བསྐུར་བར་ལུང་སྟོན་པའོ། །དེས་ནི་སྙིང་རྗེ་ཆེན་པོ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཐབས་ལ་མཁས་པ་ལ་བསྟེན་པར་བྱའོ། །དེས་ན་བྱང་ཆུབ་ཏུ་ངེས་པར་འབྱུང་བར་ཡང་འགྱུར་རོ། །རྡོ་རྗེས་"
 ],
 [
  "78.272b",
  "འམ། བར་ཆད་མང་བ་ཡིན་<span class='delete'>བས་</span><span class='add'>  པས་  </span>དེས་ནི་འཇིག་རྟེན་ཐམས་ཅད་ལ་རྟེན་པར་མི་བྱ་ཞིང་མི་ལྟ་བར་ཡོངས་སུ་གཏོང་བ་<span class='delete'>དང་། །</span><span class='add'>  དང་།   </span>རྣམ་པ་གསུམ་ལེགས་པར་བསྡམ་པར་ཡང་བྱའོ། །དེས་ན་དེའི་ལས་ཀྱི་<span class='delete'>སྒྲིབ་</span><span class='add'>  སྒྲིབ་པ་  </span><br><span class='delete'>པ་</span><span class='add'>    </span>དེ་རྣམ་པར་དག་པར་འགྱུར་ཞིང་བྱང་ཆུབ་ཏུ་ངེས་པར་འབྱུང་བར་ཡང་འགྱུར་རོ། །གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་གམ་ཡོའི་ལོ་ཏོག་ཕུན་སུམ་ཚོགས་པར་མཐོང་ན་དེ་ནི་ས་གསུམ་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>གྲོང་<br>གི་ལོ་ཏོག་ཕུན་སུམ་ཚོགས་པར་མཐོང་ན་ས་བཞི་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>ལྗོངས་ཀྱི་ལོ་ཏོག་ཕུན་སུམ་ཚོགས་པར་མཐོང་ན་ས་ལྔ་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>འཛམ་བུའི་གླིང་གི་ལོ་ཏོག་ཕུན་སུམ་ཚོགས་པར་མཐོང་ན་ས་དྲུག་<br>པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>གླིང་བཞི་བའི་ལོ་ཏོག་ཕུན་སུམ་ཚོགས་པར་མཐོང་ན་ས་བདུན་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>སྟོང་གསུམ་པའི་ལོ་ཏོག་ཕུན་སུམ་ཚོགས་པར་མཐོང་ན་ས་བརྒྱད་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>ལོ་ཏོག་ཡོངས་སུ་སྨིན་པ་ཕུན་<br>སུམ་ཚོགས་པར་མཐོང་ན་ས་དགུ་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>དེ་འཇུག་པར་བྱེད་ན་ས་བཅུ་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་བདག་སེམས་ཅན་ནད་པ་རྣམས་གསོ་བར་<br>ཀུན་དུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་བརྒྱད་པོ་དག་ལས་ས་གང་ཡང་རུང་བར་བལྟ་<span class='delete'>སྟེ། །</span><span class='add'>  སྟེ།   </span>དེ་ལ་ལས་ཀྱི་སྒྲིབ་པ་ཆུང་ལ་བདུད་ཀྱི་ལས་ཤས་ཆེ་བས་དེ་སྙིང་རྗེ་ཆེན་པོས་<br>ཡོངས་སུ་སྦྱང་བར་བྱ་ཞིང་གཞན་ལ་ཕན་<span class='delete'>བ་</span><span class='add'>  པ་  </span>ལ་བརྩོན་པ་དང་ཕྱིར་རེ་བ་མེད་པར་ཡང་བྱའོ། །དེས་ན་དེའི་ལས་ཀྱི་སྒྲིབ་པ་དེ་རྣམ་པར་དག་པར་འགྱུར་ཞིང་བྱང་ཆུབ་ཏུ་ངེས་པར་འབྱུང་བར་ཡང་འགྱུར་རོ། །<br>གང་ཁྱེའུ་གསོ་བར་བྱེད་ན་དེ་ནི་ས་དང་པོར་རོ། །གང་བུད་མེ་དག་གསོ་བར་བྱེད་ན་དེ་ནི་ས་གཉིས་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>གང་མི་ཆེན་པོ་གསོ་བར་བྱེད་ན་དེ་ནི་ས་གསུམ་པར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>གང་རིམས་ཀྱིས་བཏབ་པ་གསོ་བར་བྱེད་"
 ],
 [
  "78.274a",
  "བཀའ་སྩལ་ཏོ། །གང་ལ་མཚན་མ་དེ་དག་ཡོད་གྱུར་<span class='delete'>པ། </span><span class='add'>  པ། །  </span>དེ་ནི་བདག་ཉིད་ཆེ་བར་ཐེ་ཙོམ་<span class='delete'>མེད། </span><span class='add'>  མེད། །  </span>སྤྱོད་པ་ཅུང་ཟད་ཙམ་ཞིག་རྟོགས་གྱུར་<span class='delete'>ཀྱང་། </span><span class='add'>  ཀྱང་། །  </span>ཡོན་ཏན་ཤེས་<span class='delete'>པས་</span><span class='add'>  པས་  </span>ཉེས་པ་མ་སྐྱེད་<span class='delete'>ཅིག་</span><span class='add'>  ཅིག །  </span><br>རྒྱ་མཚོ་ཆེན་པོ་ལས་ནི་མེ་འབར་<span class='delete'>ཅིང་། </span><span class='add'>  ཅིང་། །  </span>མེ་ཡི་དབུས་ནས་ཆུ་ནི་བྱུང་གྱུར་<span class='delete'>ཀྱང་། </span><span class='add'>  ཀྱང་། །  </span>གང་ལ་མཚན་མ་གཅིག་ཙམ་ཡོད་གྱུར་<span class='delete'>པ། </span><span class='add'>  པ། །  </span>དེ་ནི་བྱང་ཆུབ་ཕྱིར་ལྡོག་ངས་མ་<span class='delete'>མཐོང་། </span><span class='add'>  མཐོང་། །  </span>སྡིག་སྤྲུལ་སོས་ནི་ལྷུན་པོ་བཟུང་<br>གྱུར་<span class='delete'>ཅིང་། </span><span class='add'>  ཅིང་། །  </span>གང་གཱའི་བྱེ་སྙེད་ཞིང་དུ་འགྲོ་གྱུར་<span class='delete'>ཀྱང་། </span><span class='add'>  ཀྱང་། །  </span>དེ་འདྲའི་བྱེད་རྒྱུ་དེ་དག་ཡོད་པར་<span class='delete'>ནི་། </span><span class='add'>  ནི། །  </span>བྱང་ཆུབ་སེམས་ལས་ཕྱིར་ལྡོག་ཡོད་པ་<span class='delete'>མིན། </span><span class='add'>  མིན། །  </span>སྤྱོད་པས་ས་ལས་ལོག་པར་སྣང་གྱུར་<span class='delete'>ཀྱང་། </span><span class='add'>  ཀྱང་། །  </span>འདི་ལ་<br>བྱང་ཆུབ་ཕྱིར་ལྡོག་འགའ་ཡང་<span class='delete'>མེད། </span><span class='add'>  མེད། །  </span>གང་ཟག་ཇི་ཙམ་<span class='delete'>ཡོད་</span><span class='add'>  ཡོན་  </span>ཏན་ཆུང་བས་<span class='delete'>ཀྱང་། </span><span class='add'>  ཀྱང་། །  </span>ལྷག་པའི་བསམ་<span class='delete'>བས་</span><span class='add'>  པས་  </span>བསྐྱོད་ན་བྱང་ཆུབ་<span class='delete'>འཐོབ་། </span><span class='add'>  འཐོབ། །  </span>ནམ་མཁའི་ཁམས་དང་དེ་བཞིན་སེམས་ཅན་<br><span class='delete'>ཁམས་། </span><span class='add'>  ཁམས། །  </span>སངས་རྒྱས་ཡེ་ཤེས་དེ་བཞིན་བྱང་ཆུབ་<span class='delete'>སེམས། </span><span class='add'>  སེམས། །  </span>ཆོས་བཞི་གང་ཡིན་དེ་དག་ཚད་མེད་<span class='delete'>དེ། </span><span class='add'>  དེ། །  </span>དེ་དག་འཇིག་རྟེན་ཀུན་གྱིས་རྟོགས་མི་<span class='delete'>ནུས། </span><span class='add'>  ནུས། །  </span>གང་དག་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་རྟོག་<span class='delete'>པ་། </span><span class='add'>  པ། །  </span><br>དེ་དག་སྨོན་པ་ཡིན་<span class='delete'>བར་</span><span class='add'>  པར་  </span>ཤེས་པར་<span class='delete'>བྱ། </span><span class='add'>  བྱ། །  </span>སེམས་ཅན་སྤྱོད་པ་བསམ་ཡས་སེམས་བྱེད་<span class='delete'>པ། </span><span class='add'>  པ། །  </span>གང་ཞིག་རྩྭ་ཡིས་རྒྱ་མཚོ་གཏིང་དཔོག་<span class='delete'>བཞིན། </span><span class='add'>  བཞིན། །  </span>གང་ཟག་འཚོ་བར་འདོད་པས་ལྕགས་བཞུན་<span class='delete'>གྱི། </span><span class='add'>  གྱི། །  </span>རྒྱ་མཚོ་<br>ཆེན་པོ་འཐུང་བར་བྱེད་སླ་<span class='delete'>ཡི། </span><span class='add'>  ཡི། །  </span>བྱང་ཆུབ་སེམས་དཔའ་ཐ་བ་མི་སྐྱེད་<span class='delete'>དེ། </span><span class='add'>  དེ། །  </span>དེ་ཡི་སྡུག་བསྔལ་དེ་ལ་གྲངས་ཀྱང་<span class='delete'>མེད། </span><span class='add'>  མེད། །  </span>འགའ་ཞིག་ལས་ཀྱིས་བསྒྲིབས་པར་འགྱུར་<span class='delete'>པའམ། </span><span class='add'>  པ་འམ། །  </span>ཡང་ན་བདུད་ཀྱིས་ཀུན་དུ་དཀྲུགས་<br>གྱུར་<span class='delete'>པ། </span><span class='add'>  པ། །  </span>དེ་ལ་གང་ཟག་ཕལ་<span class='delete'>བ་</span><span class='add'>  པ་  </span>བདེ་འདོད་<span class='delete'>པ། </span><span class='add'>  པ། །  </span>སུས་ཀྱང་ཁོང་ནི་ཁྲོ་བར་མི་བྱའོ། །མདོག་ངན་གླེན་ནམ་ཡང་ན་རྙེད་མེད་<span class='delete'>དམ། </span><span class='add'>  དམ། །  </span>བརྙེས་ཤིང་སྨད་པར་བྱ་བ་ཡིན་ན་<span class='delete'>ཡང། </span><span class='add'>  ཡང་། །  </span>མིའི་ཁམས་དང་སྤྱོད་"
 ],
 [
  "78.274b",
  "པ་ཤེས་དཀའ་<span class='delete'>བས། </span><span class='add'>  བས། །  </span>དེ་ལ་གྱ་ཚོམ་སྐྱོན་ནི་གདགས་མི་<span class='delete'>བྱ། </span><span class='add'>  བྱ། །  </span>ཤཱ་རིའི་བུ་དབེན་འདུག་སྟེ་སྒོམ་པ་<span class='delete'>ན། </span><span class='add'>  ན། །  </span>དེས་ནི་སེམས་ཀྱི་སྐད་ཅིག་ལྔ་བཅུ་<span class='delete'>རྟོགས་། </span><span class='add'>  རྟོགས། །  </span>སྟོན་པས་སྐད་ཅིག་གཅིག་ལ་ཚད་མེད་<span class='delete'>སེམས། </span><span class='add'>  སེམས། །  </span>མཁྱེན་<br>པས་དེ་ལ་སོམ་ཉི་མ་བྱེད་<span class='delete'>གསུངས། </span><span class='add'>  གསུངས། །  </span>དགྲ་བཅོམ་ཀུན་གྱིས་རང་ཁམས་མི་ཤེས་<span class='delete'>ན། </span><span class='add'>  ན། །  </span>སེམས་ཅན་སྤྱོད་པ་ཤེས་པ་སྨོས་ཅི་<span class='delete'>དགོས། </span><span class='add'>  དགོས། །  </span>ངས་ནི་སྐད་ཅིག་ཙམ་གྱིས་གཞན་ཤེས་<span class='delete'>པས། </span><span class='add'>  པས། །  </span>གང་ཟག་དེ་ལ་<br>བརྙས་པར་མ་བྱེད་<span class='delete'>ཅིག །</span><span class='add'>  ཅིག །  </span>འདོད་ཆགས་བྲལ་བས་གོས་དམར་བླངས་ནས་<span class='delete'>ནི། </span><span class='add'>  ནི། །  </span>གྱོན་པར་བྱེད་ཅིང་དེ་བཞིན་མྱུར་དུ་<span class='delete'>ནི། </span><span class='add'>  ནི། །  </span>སྐད་ཅིག་འཇིག་པར་འགྱུར་བས་ངས་མཐོང་<span class='delete'>བས། </span><span class='add'>  བས། །  </span>སུ་ཞིག་ཉེས་བ་དེ་ན་འགའ་<br>ཞིག་སྨྲ་བར་<span class='delete'>བྱེད། </span><span class='add'>  བྱེད། །  </span>མ་སྐྱེས་དགྲ་ཡིས་ཕ་ནི་བསད་གྱུར་<span class='delete'>ཅིང་། </span><span class='add'>  ཅིང་། །  </span>དེ་བཞིན་གཤེགས་པ་བགྲོངས་པར་སྦྱར་བྱས་<span class='delete'>ཀྱང་། </span><span class='add'>  ཀྱང་། །  </span>དེ་སེམས་གཅིག་གིས་ངན་འགྲོ་རྣམ་གྲོལ་<span class='delete'>ན། </span><span class='add'>  ན། །  </span>གང་ཟག་དམ་པ་གང་ཡིན་<br>སྨོས་ཅི་<span class='delete'>དགོས། </span><span class='add'>  དགོས། །  </span>སེམས་ཀྱིས་འཆིང་བར་བྱེད་ཅིང་གྲོལ་བྱེད་<span class='delete'>པས། </span><span class='add'>  པས། །  </span>ལུས་བེམས་འདི་ལ་ཉེས་པ་ཅི་ཡང་<span class='delete'>མེད། </span><span class='add'>  མེད། །  </span>ལུས་ཀྱི་འདུ་འཛི་མཐོང་ནས་གཤེ་མ་<span class='delete'>བྱེད། </span><span class='add'>  བྱེད། །  </span>ཕ་རོལ་རྒོལ་བར་མ་བྱེད་ལུས་<span class='delete'>སྤོངས་</span><span class='add'>  སྦྱོངས་  </span><br><span class='delete'>ཤིག །</span><span class='add'>  ཤིག །  </span>གསེར་ནི་མི་གཙང་ནང་དུ་བཅུག་གྱུར་<span class='delete'>ཀྱང་། </span><span class='add'>  ཀྱང་། །  </span>འཔར་བའི་རང་བཞིན་ནམ་ཡང་མི་འབྲི་<span class='delete'>ལྟར། </span><span class='add'>  ལྟར། །  </span>དེས་པ་གང་ཞིག་འཇིག་རྟེན་ཆོས་སྤྱོད་<span class='delete'>ཀྱང་། </span><span class='add'>  ཀྱང་། །  </span>ནམ་ཡང་བསམ་པའི་རང་བཞིན་ཡོང་མི་<br><span class='delete'>སྤོང་། </span><span class='add'>  སྤོང་། །  </span>རྒྱལ་བུ་ཚོང་དཔོན་བུ་དད་ལྷན་ཅིག་<span class='delete'>ཏུ། </span><span class='add'>  ཏུ། །  </span>དགའ་བར་བདག་ཉིད་ཆེན་པོ་རྩེ་བ་<span class='delete'>ལྟར། </span><span class='add'>  ལྟར། །  </span>དེ་བཞིན་སེམས་ཅན་སྤྱོད་པའི་དབུས་ན་<span class='delete'>ཡང་། </span><span class='add'>  ཡང་། །  </span>དེ་ཡང་གཞན་ལ་<span class='delete'>ལྷག་</span><span class='add'>  ལྷར་  </span>བཅས་འགྲོ་བ་འང་<span class='delete'>གཞན། </span><span class='add'>  གཞན། །  </span><br>ལ་ལས་དུག་ཟོས་འཆི་བར་མི་འགྱུར་<span class='delete'>ལ། </span><span class='add'>  ལ། །  </span>མེ་དག་བཟུང་ཡང་འཚིག་པར་མི་འགྱུར་<span class='delete'>ན། </span><span class='add'>  ན། །  </span>གང་དག་ཡེ་ཤེས་སྤྱོད་ལ་བསླབས་དེ་<span class='delete'>དག །</span><span class='add'>  དག །  </span>བྱིས་པའི་སྤྱོད་པས་མི་འཕྲོགས་སྨོས་ཅི་<span class='delete'>དགོས། </span><span class='add'>  དགོས། །  </span>བྱང་ཆུབ་"
 ],
 [
  "78.275a",
  "སེམས་དཔའ་དག་ལ་ཡོན་ཕུལ་<span class='delete'>ལྟར། </span><span class='add'>  ལྟར། །  </span>རང་སངས་རྒྱས་དང་དེ་བཞིན་དགྲ་བཅོམ་<span class='delete'>གྱིས། </span><span class='add'>  གྱིས། །  </span>སྟོང་<span class='delete'>གསུམ་</span><span class='add'>  གསུམ་ས་  </span>འདི་ཐམས་ཅད་གང་གྱུར་<span class='delete'>པ། </span><span class='add'>  པ། །  </span>དེ་དག་མཆོད་བྱས་རྣམ་སྨིན་<br>དཔག་མེད་<span class='delete'>མིན། </span><span class='add'>  མིན། །  </span>སེམས་དག་གྱུར་ན་སྦྱིན་པའི་གནས་འགྱུར་<span class='delete'>ཞིང་། </span><span class='add'>  ཞིང་། །  </span>སེམས་དག་གྱུར་བ་རྒྱལ་བ་རྣམས་དང་<span class='delete'>འདྲ། </span><span class='add'>  འདྲ། །  </span>གང་དག་རྒྱལ་འདྲའི་བྱང་ཆུབ་སེམས་དཔའ་<span class='delete'>དེའི། </span><span class='add'>  དེའི། །  </span>བྱང་ཆུབ་གཞོལ་བའི་ལྷག་<br>པའི་བསམ་ལ་<span class='delete'>ལྟོས། </span><span class='add'>  ལྟོས། །  </span>གང་དག་གང་གཱའི་བྱེ་སྙེད་སངས་རྒྱས་<span class='delete'>ཞིང་། </span><span class='add'>  ཞིང་། །  </span>འགྲོན་བུས་བཀང་སྟེ་རྒྱལ་ལ་ཕུལ་བས་<span class='delete'>ནི། </span><span class='add'>  ནི། །  </span>གང་གིས་མདོ་འདི་བྲིས་ཏེ་འཆང་བ་<span class='delete'>ཡི། </span><span class='add'>  ཡི། །  </span>དེ་ཡི་བསོད་ནམས་དཔེ་དང་ཆར་མི་<span class='delete'>ཕོད། </span><span class='add'>  ཕོད། །  </span><span class='delete'><br></span><span class='add'>  <br>  </span><span class='delete'>གང་</span><span class='add'>  གང་  </span>དག་<span class='delete'>བྱ་</span><span class='add'>  བྱང་  </span><span class='delete'>བ་</span><span class='add'>    </span>ཆུབ་སེམས་ནི་མ་བརྗེད་<span class='delete'>པ། </span><span class='add'>  པ། །  </span>དེ་དག་རྙེད་<span class='delete'>པ་</span><span class='add'>  པ་  </span>རབ་རྙེད་ལེགས་འཚོ་<span class='delete'>བ། </span><span class='add'>  བ། །  </span>ནོར་འདོད་པ་དག་རྒྱ་མཚོ་ཆེན་པོ་<span class='delete'>ལྟར། </span><span class='add'>  ལྟར། །  </span>དེ་བཞིན་དེ་དག་རྙེད་པ་ཕུན་སུམ་<span class='delete'>ཚོགས། </span><span class='add'>  ཚོགས། །  </span>གང་གིས་སྐྱེ་མང་དོན་དུ་མདོ་<br>སྡེ་<span class='delete'>ཀུན། </span><span class='add'>  ཀུན། །  </span>ཀུན་དུ་ཆུབ་བྱས་འཆང་ཞིང་ཀློག་པ་<span class='delete'>བས། </span><span class='add'>  བས། །  </span>མི་གང་མདོ་སྡེ་འདི་ལ་མཁས་གྱུར་<span class='delete'>པས། </span><span class='add'>  པས། །  </span>སེམས་ཅན་སྤྱོད་པ་མ་རྟོགས་བཅོམ་བ་<span class='delete'>ཡིན། </span><span class='add'>  ཡིན། །  </span>གལ་ཏེ་བྱང་ཆུབ་མཆོག་ལ་རེག་འདོད་<span class='delete'>ན། </span><span class='add'>  ན། །  </span>དེ་ཕྱིར་<br>བསྟན་བཞིན་འདི་ལ་བརྩོན་གྱིས་<span class='delete'>ལ། </span><span class='add'>  ལ། །  </span>བདག་བསྟོད་གཞན་ལ་སྨད་པར་མ་བྱེད་<span class='delete'>པར། </span><span class='add'>  པར། །  </span>ལྷག་པའི་བསམ་བས་སྤྱོད་པ་རྣམ་<span class='delete'>པར་</span><span class='add'>  པར་  </span><span class='delete'>སྦྱོངས། </span><span class='add'>  སྦྱོངས། །  </span>དགོན་པར་དགའ་ཞིང་རྟག་ཏུ་དབང་བསྡམས་<span class='delete'>ལ། </span><span class='add'>  ལ། །  </span>བརྩོན་<br>འགྲུས་བརྩམས་ཤིང་<span class='delete'>ཉིད་</span><span class='add'>  ཉི་  </span>དུ་ཐག་བསྲིངས་<span class='delete'>ལ། </span><span class='add'>  ལ། །  </span>བྱམས་ལ་གནས་ཤིང་དོན་དམ་མཁས་གྱུར་<span class='delete'>པ། </span><span class='add'>  པ། །  </span>དེས་ནི་དེ་འདྲའི་བྱང་ཆུབ་ཐོབ་པར་<span class='delete'>འགྱུར། </span><span class='add'>  འགྱུར། །  </span>བཅོམ་ལྡན་འདས་ཀྱིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བཤད་<br>པ་ན་ལྷ་དང་མིའི་སྐྱེ་དགུ་དྲུག་ཁྲི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་གྱུར་ཏོ། །ལྷ་དང་མིའི་སྐྱེ་དགུ་སྔོན་སེམས་མ་བསྐྱེད་པ་ཁྲག་ཁྲིག་ཕྲག་<span class='delete'>བཅྭ་</span><span class='add'>  བཅྭ་  </span>བརྒྱད་ཀྱིས་ནི་བྱང་ཆུབ་"
 ],
 [
  "78.275b",
  "ཏུ་སེམས་བསྐྱེད་<span class='delete'>དེ། </span><span class='add'>  དེ།   </span>དེ་དག་གིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཐོས་མ་ཐག་ཏུ་བསྐལ་པ་བརྒྱད་བཅུར་འཁོར་བ་ཕྱིར་བསྙིལ་བར་གྱུར་ཏོ། །དེ་ལྟ་བས་ན་གལ་ཏེ་བྱང་ཆུབ་ཡོངས་སུ་མི་གཏོང་ན་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་<br>གཟུང་བར་བྱ། <span class='delete'>བཅད་</span><span class='add'>  བཅང་  </span>བར་བྱ། བཀླག་པར་བྱ། ཀུན་ཆུབ་<span class='delete'>བར་</span><span class='add'>  པར་  </span>བྱ་ཞིང་འདུན་པ་དྲག་པོ་དང་། འབད་པ་དང་། སྤྲོ་བ་དང་། རབ་ཏུ་སྤྲོ་བ་དང་། མངོན་<span class='delete'>བར་</span><span class='add'>  པར་  </span>བརྩོན་པར་བྱའོ། །དེ་ནས་འཁོར་དེ་གང་དག་བྱང་<br>ཆུབ་ལས་ཕྱིར་ལྡོག་པར་འདོད་པ། སྐྲག་པ། སྒྱིད་ལུག་པ། སོམ་ཉི་དང་བཅས་པ། ཐེ་ཙོམ་དང་བཅས་པ། ཁྱིམ་གྱི་གནས་སུ་འགྲོ་འདོད་པ། བདུད་ཀྱི་ལས་དང་ལས་ཀྱི་སྒྲིབ་པ་མི་ཤེས་པའི་བྱང་<br>ཆུབ་སེམས་དཔའ་ཁྲིས་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔ་ནས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཐོས་ནས་སྐྱོན་ཡོངས་སུ་སྤངས་ཤིང་། ལྷག་པའི་བསམ་པ་རྣམ་པར་སྦྱངས་ཏེ། དེ་དག་འཇིག་རྟེན་གྱི་ཁམས་<br>གཞན་དུ་སྐྱེ་བར་འགྱུར་ཞིང་དེ་དག་ཐམས་ཅད་བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པ་དང་ལྷན་ཅིག་ཏུ་མངོན་བར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་ཏེ། དེ་དག་གིས་ནི་བསྐལ་པ་ཉི་ཤུར་བདུད་ཀྱི་<br>ལས་རྣམ་པར་སྦྱོང་བར་འགྱུར་<span class='delete'>རོ། །</span><span class='add'>  རོ། །  </span>གང་དག་འཇིག་རྟེན་གྱི་ཁམས་གཞན་དུ་སྐྱེ་བ་གཅིག་གིས་ཐོགས་པ་ལ་གནས་<span class='delete'>བ་</span><span class='add'>  པ་  </span>སྟན་ལ་འཁོད་པ་དེ་དག་ཐམས་ཅད་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པ་དང་<br>ལྷན་ཅིག་ཏུ་བྱང་ཆུབ་ཏུ་མངོན་<span class='delete'>པར་</span><span class='add'>  པར་རྫོགས་པར་  </span><span class='delete'>འཆང་</span><span class='add'>  འཚང་  </span>རྒྱ་བར་འགྱུར་ཏེ། དེ་དག་གིས་ནི་བསྐལ་པ་ཉི་ཤུར་བདུད་ཀྱི་ལས་དང་། ལས་ཀྱི་སྒྲིབ་པ་རྣམ་པར་སྦྱངས་<span class='delete'>སོ། </span><span class='add'>  སོ། །  </span>དེ་ལྟར་ན་ཆོས་ཀྱི་རྣམ་གྲངས་<br>འདི་ཐོས་པ་ཡང་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱིས་གཅེས་སྤྲས་བྱེད་པ་ཡིན་ན། འཛིན་པ་དང་། སྟོན་པ་ལྟ་མོས་ཀྱང་ཅི་དགོས། བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས། བྱང་ཆུབ་"
 ]
]