[
 [
  "79.310b",
  "མ་ཡིན་པ་ཡིད་ལ་བྱེད་པ་གདགས་པར་མི་འགྱུར་ཏེ། ཚུལ་བཞིན་མ་ཡིན་པ་ཡིད་ལ་བྱེད་པ་ཡོད་ན། མ་རིག་པ་གདགས་པར་འགྱུར་གྱི། ཚུལ་བཞིན་མ་ཡིན་པ་ཡིད་ལ་བྱེད་པ་མེད་ན། མ་རིག་པར་གདགས་པར་མི་འགྱུར་\n<span class='delete'>རོ། </span><span class='add'>རོ། །</span>མ་རིག་པ་ཡོད་ན་འདུ་བྱེད་རྣམས་གདགས་པར་འགྱུར་གྱི། མ་<span class='delete'>རིག་</span><span class='add'>རིག་པ་</span>མེད་ན་འདུ་བྱེད་རྣམས་སུ་གདགས་པར་མི་འགྱུར་བ་ནས། སྐྱེ་བ་ཡོད་ན་རྒ་ཤི་གདགས་པར་འགྱུར་གྱི། སྐྱེ་བ་མེད་ན་རྒ་ཤི་གདགས་པར་\nམི་འགྱུར་བའི་བར་དུ་གོང་མ་བཞིན་དུ་སྦྱར་རོ། །བམ་པོ་གཉིས་པ། དེ་ལྟར་ན་ཁྱིམ་བདག་རྣམས་ཆོས་ཐམས་ཅད་ནི་ཡང་དག་པ་མ་ཡིན་པ་ཀུན་དུ་རྟོག་པ་ལས་བྱུང་བ། རྐྱེན་ལ་རག་ལས་པ། སྟོབས་མེད་པ། \nརྐྱེན་རྣམས་ལས་བྱུང་བ་ཡིན་ཏེ། རྐྱེན་མེད་ན་ཆོས་རྣམས་གདགས་པར་མི་འགྱུར་<span class='delete'>རོ། </span><span class='add'>རོ། །</span>ཁྱིམ་བདག་རྣམས་ཆོས་ཐམས་ཅད་ནི་བཏགས་པ་ཙམ་སྟེ། འདི་ལ་ལམ་ཆད་པ་མྱ་ངན་ལས་འདས་པ་མ་གཏོགས་པར་སྐྱེ་<span class='delete'>བའམ། </span><span class='add'>བ་འམ། </span>\nརྒ་<span class='delete'>བའམ། </span><span class='add'>བ་འམ། </span>འཆི་<span class='delete'>བའམ། </span><span class='add'>བ་འམ། </span>འཕོ་བ་འམ། འབྱུང་བ་གང་ཡང་མེད་དོ། །ཁྱིམ་བདག་རྣམས་འདི་ལྟ་སྟེ་དཔེར་ན་ཆུའི་མཚོ་ཆེན་པོ་ལ་ཉ་གནས་པར་གྱུར་པ་ཁྱིམ་བདག་རྣམས་དེ་ཅི་སྙམ་དུ་སེམས། ཉ་དེ་དག་ཅི་ཞིག་\nགི་མཐུ། དེ་དག་གིས་གསོལ་པ། བཅོམ་ལྡན་འདས་ཆབ་ཀྱི་<span class='delete'>མཐུ་</span><span class='add'>མཐུ</span>འོ། །བདེ་བར་གཤེགས་པ་ཆབ་ཀྱི་<span class='delete'>མཐུ་</span><span class='add'>མཐུ</span>འོ། །དེ་ལ་ཁྱིམ་བདག་རྣམས་ཅི་ཆུ་དེ་སེམས་སམ། དེ་དག་གིས་གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་ལྟ་མ་ལགས་སོ། །\nབདེ་བར་གཤེགས་པ་དེ་ལྟ་མ་ལགས་སོ། །བཀའ་སྩལ་པ། ཁྱིམ་བདག་རྣམས་དེ་ལྟར་ཆུ་སེམས་པ་མེད་པ་ལ་ཅིའི་སྟོབས་ཤིག་<span class='delete'>ཡོད། །</span><span class='add'>ཡོད། </span>བཅོམ་ལྡན་འདས་སྟོབས་མ་མཆིས་སོ། །བདེ་བར་གཤེགས་པ་སྟོབས་ཆུང་ངོ་། །\nབཀའ་སྩལ་པ། ཁྱིམ་བདག་རྣམས་དེ་བཞིན་དུ་ཆོས་ཐམས་ཅད་ནི་ཡང་དག་པ་མ་ཡིན་པ། ཀུན་རྟོག་པ་ལས་བྱུང་བ། སྟོབས་མེད་པ། ཉམ་ཆུང་བ། རྐྱེན་<span class='delete'>རྣ་</span><span class='add'>རྣམས་</span>ལས་འབྱུང་བ་སྟེ། རྐྱེན་རྣམས་<span class='delete'>ཡ</span><span class='add'>ཡ</span>ོད་"
 ],
 [
  "79.312a",
  "པོ་བཞི་ལས་གྱུར་པ། མི་རྟག་པ། མི་བརྟན་པ། ཐེར་ཟུག་མ་ཡིན་པ། ཡིད་བརྟན་དུ་མི་རུང་བ། སྙིང་པོ་མེད་པ། ཞིགས་པ། ནད་ཅན། སྡུག་བསྔལ་བ། ནད་མང་བ། གཙེ་བ་མང་བ་ཡིན་ཏེ། ཁྱིམ་\nབདག་ཁྱེད་རྣམས་ཀྱིས་ཡིད་དེ་ལ་གནས་པར་མི་བྱའོ། །ཡང་ཁྱིམ་བདག་རྣམས་འདི་ལྟར་བསླབ་པར་བྱ་སྟེ། མིག་འདི་ནི་མཉེར་མི་བཟོད་དེ་དབུ་བ་རྡོས་པ་ལྟ་བུའོ། །མིག་འདི་ནི་རིང་དུ་མི་གནས་ཏེ་ཆུའི་ཆུ་བུར་ལྟ་<span class='delete'>བུའོ། །</span><span class='add'>བུའོ། །</span>\nམིག་འདི་ནི་ལས་དང་ཉོན་མོངས་པ་དང་། སྲེད་པ་ལས་བྱུང་བ་སྟེ་སྨིག་རྒྱུ་ལྟ་བུའོ། །མིག་འདི་ནི་རང་བཞིན་གྱིས་སྙིང་པོ་མེད་དེ་ཆུ་ཤིང་ལྟ་བུའོ། །མིག་འདི་ནི་ཕྱིན་ཅི་ལོག་ལས་བྱུང་བ་སྟེ། སྒྱུ་མ་ལྟ་བུའོ། །\nམིག་འདི་ནི་ལོག་པ་དང་། ཡང་དག་པ་མ་ཡིན་པ་མཐོང་བ་སྟེ་རྨི་ལམ་ལྟ་བུའོ། །མིག་འདི་ནི་རྐྱེན་ལ་རག་ལས་པ་སྟེ་བྲག་ཆ་ལྟ་བུའོ། །མིག་འདི་ནི་ལས་ཀྱི་མིག་གཡོར་གྱིས་ཀུན་དུ་སྣང་བ་སྟེ་མིག་གཡོར་ལྟ་བུའོ། །\nམིག་འདི་ནི་སེམས་འཁྲུག་པ་མེད་པར་འགྱུར་བའི་མཚན་ཉིད་དེ་སྤྲིན་ལྟ་བུའོ། །མིག་འདི་ནི་སྐད་ཅིག་ཏུ་འཇིག་པ་དང་ལྡན་པ་སྟེ། གློག་ལྟ་བུའོ། །མིག་འདི་ནི་བདག་པོ་མེད་དེ། ས་དང་མཚུངས་སོ། །མིག་འདི་ནི་\nབདག་མེད་དེ་ཆུ་དང་མཚུངས་སོ། །མིག་འདི་ནི་སེམས་ཅན་མེད་དེ་མེ་དང་མཚུངས་སོ། །མིག་འདི་ནི་སྲོག་མེད་དེ་རླུང་དང་མཚུངས་སོ། །མིག་འདི་ནི་གང་ཟག་མེད་དེ་ནམ་མཁའ་དང་མཚུངས་སོ། །མིག་འདི་ནི་འབྱུང་\nཔ་ཆེན་པོའི་ཀུན་བཞི་སྟེ་ཡང་དག་པ་མ་ཡིན་པའོ། །མིག་འདི་ནི་བདག་དང་བདག་གི་དང་བྲལ་བ་སྟེ་སྟོང་པའོ། །མིག་འདི་ནི་རྩྭ་དང་བརྩིག་པ་དང་། ཤིང་དང་རྡོ་དང་། མིག་ཡོར་ལྟ་བུ་སྟེ་བེམས་<span class='delete'>པོའོ། </span><span class='add'>པོའོ། །</span>མིག་འདི་ནི་རླུང་གི་འཁྲུལ་\nའཁོར་དང་ལྡན་པར་འབྱུང་སྟེ། བྱེད་པ་མེད་<span class='delete'>པའོ། </span><span class='add'>པའོ། །</span>མིག་འདི་ནི་གསོག་སྟེ་མི་གཙང་བ་དང་། རྣག་བསགས་པའོ། །མིག་འདི་ནི་གསོབ་སྟེ་གཡོག་པ་ཀུན་དུ་མཉེ་བ་གཞིག་པ་རྣམ་པར་འཐོར་འཇིག་པའི་ཆོས་ཅན་<span class='delete'>ནོ།</span><span class='add'>ནོ། །</span>"
 ],
 [
  "79.312b",
  "མིག་འདི་ནི་རྟག་ཏུ་རྒ་བའི་ཟིལ་གྱིས་ནོན་པ་སྟེ་ཁྲོན་པ་<span class='delete'>རྙིང་</span><span class='add'>རྙིང་</span>པ་དང་མཚུངས་སོ། །མིག་འདི་ནི་མཐར་འཆི་བ་སྟེ་མཐར་མི་གནས་པའོ། །ཁྱིམ་བདག་རྣམས་མིག་ཇི་ལྟ་བ་དེ་བཞིན་དུ་རྣ་བ་དང་སྣ་དང་ལྕེ་དང་ལུས་དང་\nཡིད་ཀྱང་རིག་པར་བྱའོ། །གོང་མ་བཞིན་དུ་སྦྱར་ཏེ་ཆོས་ཐམས་ཅད་ཀྱི་བར་དུ་རིག་པར་བྱའོ། །ཁྱིམ་བདག་རྣམས་གཞན་ཡང་འདི་ལྟ་སྟེ། མིག་འདི་དང་འདི་ལྟ་སྟེ། རྣ་བ་དང་སྣ་དང་ལྕེ་དང་ལུས་འདི་ནི་བྱིས་པ་\nསོ་སོ་སྐྱེ་བོ་ཐམས་ཅད་ཀྱི་འདོད་པ་ཙམ་<span class='delete'>མོ། </span><span class='add'>མོ། །</span>འདི་ལྟ་སྟེ། ཡིད་འདི་ནི་བྱིས་པ་སོ་སོ་སྐྱེ་བོ་ཐམས་ཅད་ཀྱི་འདོད་པ་ཙམ་མོ། །འདི་ལྟ་སྟེ། གཟུགས་འདི་<span class='delete'>དང་</span><span class='add'>དང་འདི་</span>ལྟ་སྟེ། སྒྲ་དང་དྲི་དང་རོ་དང་རེག་བྱ་དང་། ཆོས་\nའདི་ནི་བྱིས་པ་སོ་སོ་སྐྱེ་བོ་ཐམས་ཅད་ཀྱི་འདོད་པ་ཙམ་མོ། །འདི་ལྟ་སྟེ། ཁྱིམ་བདག་རྣམས་གཟུགས་ཀྱི་ཕུང་པོ་འདི་ནི་བྱིས་པ་སོ་སོ་སྐྱེ་བོ་ཐམས་ཅད་ཀྱི་འདོད་པ་ཙམ་མོ། །འདི་ལྟ་སྟེ། ཁྱིམ་བདག་རྣམས་\nཚོར་བའི་ཕུང་པོ་འདི་ནི་བྱིས་པ་སོ་སོ་སྐྱེ་བོ་ཐམས་ཅད་ཀྱི་འདོད་པ་ཙམ་མོ། །འདི་ལྟ་སྟེ། ཁྱིམ་བདག་རྣམས་འདུ་ཤེས་ཀྱི་ཕུང་པོ་འདི་ནི་བྱིས་པ་སོ་སོ་སྐྱེ་བོ་ཐམས་ཅད་ཀྱི་འདོད་པ་ཙམ་མོ། །འདི་ལྟ་སྟེ། ཁྱིམ་བདག་\nརྣམས་འདུ་བྱེད་ཀྱི་ཕུང་པོ་འདི་ནི་བྱིས་པ་སོ་སོ་སྐྱེ་བོ་ཐམས་ཅད་ཀྱི་འདོད་པ་ཙམ་མོ། །འདི་ལྟ་སྟེ། ཁྱིམ་བདག་རྣམས་རྣམ་པར་ཤེས་པའི་ཕུང་པོ་འདི་ནི་བྱིས་པ་སོ་སོ་སྐྱེ་བོ་ཐམས་ཅད་ཀྱི་འདོད་པ་ཙམ་\nམོ། །འདི་ལྟ་སྟེ། ཁྱིམ་བདག་རྣམས་སའི་ཁམས་འདི་ནི་བྱིས་པ་སོ་སོ་སྐྱེ་བོ་ཐམས་ཅད་ཀྱི་འདོད་པ་ཙམ་<span class='delete'>མོ། </span><span class='add'>མོ། །</span>འདི་ལྟ་སྟེ། ཁྱིམ་བདག་རྣམས་ཆུའི་ཁམས་དང་། མེའི་ཁམས་དང་རླུང་གི་ཁམས་འདི་ནི་\nབྱིས་པ་སོ་སོ་སྐྱེ་བོ་ཐམས་ཅད་ཀྱི་འདོད་པ་ཙམ་མོ། །འདི་ལྟ་སྟེ། ཁྱིམ་བདག་རྣམས་འདུས་བྱས་དང་། འདུས་མ་བྱས་ཀྱི་ཁམས་ཤེས་བྱ་བའི་ཆོས་འདི་ནི་བྱིས་པ་སོ་སོ་སྐྱེ་བོ་ཐམས་ཅད་ཀྱི་འདོད་པ་ཙམ་མོ། །"
 ],
 [
  "79.311b",
  "ཆོས་ཐམས་ཅད་ནི་སྟོང་པ་ཉིད་ལ་ཡང་དག་པར་གནས་<span class='delete'>པའོ། </span><span class='add'>པའོ། །</span>ཁྱིམ་བདག་རྣམས་གནས་པ་མེད་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་མ་གཡོས་པའོ། །ཁྱིམ་བདག་རྣམས་མི་གནས་ཤིང་གཡོ་བ་མེད་པ་དང་ལྡན་པའི་ཕྱིར་\nཆོས་ཐམས་ཅད་ནི་ཡང་དག་པའི་མཐའ་ལ་གནས་<span class='delete'>པའོ། </span><span class='add'>པའོ། །</span>ཁྱིམ་བདག་རྣམས་རྦ་ཀློང་དང་བྲལ་བའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་བརྗོད་དུ་མེད་<span class='delete'>པའོ། </span><span class='add'>པའོ། །</span>ཁྱིམ་བདག་རྣམས་མཚན་མ་མེད་དབྱིབས་མེད་པ་ལ་སྣང་བ་\nརྒྱུ་བ་དང་བྲལ་བའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་ཁ་དོག་མེད་<span class='delete'>པའོ། </span><span class='add'>པའོ། །</span>ཁྱིམ་བདག་རྣམས་ང་ཡིར་འཛིན་པ་དང་བྲལ་བའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་<span class='delete'>ངའི་</span><span class='add'>ངའི་བ་</span><span class='delete'>མེད་</span><span class='add'>མེད་</span>པའོ། །ཁྱིམ་བདག་རྣམས་སེམས་དང་ཡིད་དང་རྣམ་\nཔར་ཤེས་པ་དང་བྲལ་བའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་ཤེས་པར་བྱ་བ་མ་ཡིན་<span class='delete'>པའོ། </span><span class='add'>པའོ། །</span>ཁྱིམ་བདག་རྣམས་མིག་གི་ལམ་ལས་ཤིན་དུ་འདས་པ་དང་། རྣ་བ་དང་སྣ་དང་ལྕེ་དང་ལུས་དང་། ཡིད་ཀྱི་ལམ་ལས་ཤིན་དུ་\nའདས་པའི་ཕྱིར། ཆོས་ཐམས་ཅད་ནི་ཀུན་གཞི་མེད་<span class='delete'>པའོ། </span><span class='add'>པའོ། །</span>ཁྱིམ་བདག་རྣམས་སྐྱེ་བ་དང་། འཇིག་པ་དང་གནས་པ་དང་བྲལ་བའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་དོར་བ་མེད་ཅིང་བསྣན་པ་མེད་པའོ། །ཁྱིམ་\nབདག་རྣམས་སེམས་དང་ཡིད་དང་རྣམ་པར་ཤེས་པ་དང་བྲལ་བའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་བྱེད་པ་མེད་པ་གཡོ་བ་མེད་<span class='delete'>པའོ། </span><span class='add'>པའོ། །</span>ཁྱིམ་བདག་རྣམས་རང་བཞིན་གྱིས་ཉམས་ཆུང་བའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་རྐྱེན་\nལ་རག་ལས་པའོ། །ཁྱིམ་བདག་རྣམས་མིག་ནི་འབྱུང་བ་ཆེན་པོ་བཞི་ལས་གྱུར་པ། མི་རྟག་པ། མི་བརྟན་པ། ཐེར་ཟུག་མ་ཡིན་པ། སྙིང་པོ་མེད་པ། ཉམ་ཆུང་བ། ཞིགས་པ། ཡུན་ཐུང་བ། ཡིད་བརྟན་དུ་མི་\nརུང་བ། སྡུག་བསྔལ་བ། ནད་མང་བ། གཙེ་བ་མང་བ་ཡིན་ཏེ། ཁྱིམ་བདག་ཁྱེད་རྣམས་ཀྱིས་མིག་དེ་ལ་གནས་པར་མི་<span class='delete'>བྱའོ། </span><span class='add'>བྱའོ། །</span>ཁྱིམ་བདག་རྣམས་རྣ་བ་དང་། སྣ་དང་ལྕེ་དང་ལུས་དང་ཡིད་ནི་འབྱུང་བ་ཆེན་"
 ],
 [
  "79.311a",
  "ན་ཆོས་རྣམས་གདགས་པར་འགྱུར་<span class='delete'>རོ། </span><span class='add'>རོ། །</span>ཁྱིམ་བདག་རྣམས་ཆོས་ཐམས་ཅད་ནི་བཏགས་པ་ཙམ་སྟེ། འདི་ལ་ལམ་ཆད་པ་མྱ་ངན་ལས་འདས་པ་མ་གཏོགས་པར་སྐྱེ་<span class='delete'>བའམ། </span><span class='add'>བ་འམ། </span>རྒ་<span class='delete'>བའམ། </span><span class='add'>བ་འམ། </span>འཆི་<span class='delete'>བའམ། </span><span class='add'>བ་འམ། </span>\nའཕོ་<span class='delete'>བའམ། </span><span class='add'>བ་འམ། </span>འབྱུང་བ་གང་ཡང་མེད་དོ། །ཁྱིམ་བདག་ཁྱེད་རྣམས་དེ་བས་ན་རྐྱེན་དེ་དག་ལ་ཚུལ་བཞིན་སོ་སོར་རྟོགས་ལ་དེའི་ཚེ་ཡིད་བརྟན་དུ་མི་རུང་བ་དང་། ཡིད་བརྟན་པ་མ་ཡིན་པས་སྐྲག་པར་གྱིས་<span class='delete'>ཤིག </span><span class='add'>ཤིག །</span>སྐྲག་\nཔར་གྱུར་པ་དེ་ན་འབྲོས་པར་གྱིས་<span class='delete'>ཤིག། </span><span class='add'>ཤིག །</span>ཆོས་གང་ལས་འབྲོས་<span class='delete'>པའི་</span><span class='add'>པའི་</span>ཆོས་དེ་གང་ཞེས་ཚུལ་བཞིན་དུ་སོ་སོར་རྟོགས་ཤིག །ཚུལ་བཞིན་སོ་སོར་རྟོག་པ་དེ་ན་ཆོས་གང་ཆོས་དེ་ལས་འབྲོས་<span class='delete'>པའི་</span><span class='add'>པའི་</span>ཆོས་དེ་རྟོགས་པར་\nགྱིས་<span class='delete'>ཤིག </span><span class='add'>ཤིག །</span>དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཁྱིམ་བདག་རྣམས་རྣམ་པ་ཐམས་ཅད་ཏུ་མི་དམིགས་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་དམིགས་སུ་མེད་<span class='delete'>པའོ། </span><span class='add'>པའོ། །</span>ཁྱིམ་བདག་རྣམས་རྡུལ་དང་བྲལ་བའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་བདག་མེད་\n<span class='delete'>པའོ། </span><span class='add'>པའོ། །</span>ཁྱིམ་བདག་རྣམས་བདག་དང་བྲལ་བའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་སེམས་ཅན་མེད་པའོ། །ཁྱིམ་བདག་རྣམས་སྐྱེ་བ་དང་། རྒ་བ་དང་། ན་བ་དང་། འཆི་བ་དང་མྱ་ངན་དང་སྨྲེ་སྔགས་འདོན་པ་དང་སྡུག་བསྔལ་བ་དང་། \nཡིད་མི་བདེ་བ་དང་འཁྲུག་པ་ལས་ཤིན་དུ་འདས་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་སྲོག་མེད་པའོ། །ཁྱིམ་བདག་རྣམས་དུས་གསུམ་ཡང་དག་པར་ཆད་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་གང་ཟག་མེད་<span class='delete'>པའོ། </span><span class='add'>པའོ། །</span>ཁྱིམ་བདག་\nརྣམས་སྒྲ་དང་། སྐད་དང་དབྱངས་དང་། ཚིག་གི་ལམ་ནས་བརྗོད་དུ་མེད་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་ཡི་གེ་མེད་<span class='delete'>པའོ། </span><span class='add'>པའོ། །</span>ཁྱིམ་བདག་རྣམས་དམིགས་པ་མེད་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་ཆགས་པ་མེད་<span class='delete'>པའོ། </span><span class='add'>པའོ། །</span>ཁྱིམ་བདག་རྣམས་\nཉེ་བར་ཞི་བའི་མཚན་ཉིད་ཀྱི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་ཞི་བའོ། །ཁྱིམ་བདག་རྣམས་ནམ་མཁའི་རང་བཞིན་གྱི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་ཀུན་དུ་སོང་<span class='delete'>བའོ། </span><span class='add'>བའོ། །</span>ཁྱིམ་བདག་རྣམས་ངེས་པར་འབྱུང་བ་མ་ཡིན་པའི་ཕྱིར་"
 ],
 [
  "79.313a",
  "དེ་བས་ན་ཁྱིམ་བདག་ཁྱེད་རྣམས་མི་འདོད་པར་<span class='delete'>གྱིས་</span><span class='add'>གྱིས་ཤིག །</span><span class='delete'></span><span class='add'></span>ཤིག མི་འདོད་པར་གྱུར་ནས་བུ་དང་ཆུང་མ་རྣམས་ཉེ་བར་མ་ལེན་ཅིག །ནོར་རྣམས་མ་ལེན་ཅིག །དེ་དག་མི་ལེན་པར་གྱུར་ནས་དད་པས་ཁྱིམ་\nནས་ཁྱིམ་མེད་པར་རབ་ཏུ་འབྱུང་བར་གྱིས་ཤིག །དད་པས་ཁྱིམ་ནས་ཁྱིམ་མེད་པར་རབ་ཏུ་བྱུང་ནས་མི་འདོད་པར་གྱིས་ཤིག །ཁྱིམ་བདག་རྣམས་རབ་ཏུ་བྱུང་བའི་མི་འདོད་པ་གང་ཞེ་ན། གང་སོ་སོར་ཐར་<span class='delete'>བའི་</span><span class='add'>པའི་</span>\nསྡོམ་པས་བསྡམས་ཤིང་ཆོ་ག་དང་། སྤྱོད་ཡུལ་ཕུན་ཚོགས་པ། ཁ་ན་མ་ཐོ་བ་རྡུལ་ཙམ་ལ་ཡང་འཇིགས་པར་ལྟ་ཞིང་བསླབ་པའི་གཞི་ཡང་དག་པར་བཟུང་ནས་སློབ་སྟེ། ཚུལ་ཁྲིམས་དང་ལྡན་པར་གནས་\nཔའོ། །ཚུལ་ཁྲིམས་ཀྱི་ཕུང་པོ་དང་ལྡན་པ་ནི་མིག་མི་ལེན། རྣ་བ་དང་སྣ་དང་། ལྕེ་དང་ལུས་དང་ཡིད་མི་ལེན། གཟུགས་མི་ལེན། སྒྲ་དང་དྲི་དང་རོ་དང་། རེག་བྱ་དང་ཆོས་མི་ལེན། གཟུགས་དང་། ཚོར་བ་དང་འདུ་ཤེས་དང་། \nའདུ་བྱེད་དང་རྣམ་པར་ཤེས་པའི་ཕུང་པོ་མི་ལེན། སའི་ཁམས་མི་ལེན་ཆུའི་ཁམས་མི་ལེན། མེའི་ཁམས་དང་། རླུང་གི་ཁམས་དང་ནམ་མཁའི་ཁམས་དང་། རྣམ་པར་ཤེས་པའི་ཁམས་མི་ལེན་ཏེ། ཁྱིམ་\nབདག་རྣམས་འདི་ནི་རབ་ཏུ་བྱུང་བའི་མི་འདོད་པའོ། །མི་འདོད་ནས་མིག་གི་ཁམས་མི་ལེན་ཏོ། །གོང་མ་བཞིན་དུ་སྦྱར་ཏེ། ཡིད་ཀྱི་ཁམས་ཀྱི་བར་དུ་མི་ལེན་ཏེ། གོང་མ་བཞིན་དུ་སྦྱར་ཏེ། གང་མི་ལེན་པ་དེ་\nཡོངས་སུ་མི་སྤོང་<span class='delete'>ངོ། </span><span class='add'>ངོ་། །</span>ཅི་ཡོངས་སུ་མི་སྤོང་ཞེ་ན། མིག་ཡོངས་སུ་མི་སྤོང་། རྣ་བ་དང་སྣ་དང་ལྕེ་དང་། ལུས་དང་ཡིད་ཡོངས་སུ་མི་སྤོང་། གཟུགས་ཡོངས་སུ་མི་སྤོང་། སྒྲ་དང་དྲི་དང་རོ་དང་རེག་བྱ་དང་། ཆོས་\nཡོངས་སུ་མི་སྤོང་། གཟུགས་ཀྱི་ཕུང་པོ་ཡོངས་སུ་མི་སྤོང་། ཚོར་བའི་ཕུང་པོ་ཡོངས་སུ་མི་སྤོང་། འདུ་ཤེས་ཀྱི་ཕུང་པོ་ཡོངས་སུ་མི་སྤོང་། འདུ་བྱེད་ཀྱི་ཕུང་པོ་ཡོངས་སུ་མི་སྤོང་། རྣམ་པར་<span class='delete'>ཤ</span><span class='add'>ཤ</span>ེས་"
 ],
 [
  "79.313b",
  "<span class='delete'>པི་</span><span class='add'>པའི་</span>ཕུང་པོ་ཡོངས་སུ་མི་སྤོང་། སའི་ཁམས་ཡོངས་སུ་མི་སྤོང་། ཆུའི་ཁམས་ཡོངས་སུ་མི་སྤོང་། མེའི་ཁམས་དང་། རླུང་གི་ཁམས་དང་། ནམ་མཁའི་ཁམས་དང་། རྣམ་པར་ཤེས་པའི་ཁམས་ཀྱི་བར་དུ་ཡོངས་\nསུ་མི་སྤང་<span class='delete'>ངོ་། </span><span class='add'>ངོ་། །</span>དེ་<span class='delete'>ནས་</span><span class='add'>ནམ་</span>མི་སྤོང་བ་དེ་ན་དེ་ཀུན་ནས་ཉོན་མོངས་པར་མི་འགྱུར། ཀུན་ནས་ཉོན་མོངས་པ་མེད་ན་ཡང་བར་འགྱུར་རོ། །དེ་ནམ་ཡང་བར་གྱུར་པ་དེ་དེ་མི་སྣང་བར་འགྱུར་རོ། །དེ་ནམ་མི་<span class='delete'>མང་</span><span class='add'>སྣང་</span>བ་དེ་ན་གང་ལ་ཡང་\nཁོང་ཁྲོ་བར་མི་བྱེད་དོ། །དེ་ནམ་ཁོང་ཁྲོ་བར་མི་བྱེད་པ་དེ་ན་བདག་ལ་གནོད་པར་མི་སེམས། གཞན་ལ་གནོད་པར་མི་སེམས། གཉིས་<span class='delete'>ག་</span><span class='add'>ག་</span>ལ་གནོད་པར་མི་སེམས་ཏེ། དེ་གནོད་པར་མི་སེམས་པས་ཕུང་པོའི་ལྷག་མ་\nམེད་པའི་མྱ་ངན་ལས་འདས་པའི་དབྱིངས་སུ་ཡོངས་སུ་མྱ་ངན་ལས་འདའོ། །ཁྱིམ་བདག་རྣམས་དེ་ལ་གང་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་ཞེ་ན། དེ་ལ་མིག་ཡོངས་སུ་མྱ་ངན་ལས་མི་འདའ། རྣ་བ་དང་སྣ་དང་\nལྕེ་དང་ལུས་དང་། ཡིད་ཡོངས་སུ་མྱ་ངན་ལས་མི་འདའ་མོད་ཀྱི། ཁྱིམ་བདག་རྣམས་གང་མིག་ལ་བརྟེན་ནས་ང་ཞེ་འམ། ངའི་ཞེས་ཡང་དག་པ་མ་ཡིན་པ་འཛིན་པ་དེ་དང་བྲལ་བ་ནི་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་<span class='delete'>བའོ། </span><span class='add'>བའོ། །</span>\nགང་དང་བྲལ་བ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་ཡིན་ཞེ་ན། འདོད་ཆགས་དང་བྲལ་བ་ནི་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའོ། །ཞེ་སྡང་དང་བྲལ་བ་ནི་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའོ། །གཏི་མུག་དང་བྲལ་བ་ནི་ཡོངས་\nསུ་མྱ་ངན་ལས་འདས་པའོ། །མི་ཤེས་པ་དང་བྲལ་བ་ནི་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་སྟེ། ཡང་ཁྱིམ་བདག་རྣམས་མི་ཤེས་པ་ནི་འདས་པ་ལ་མེད་པར་མ་གྱུར། ད་ལྟར་བྱུང་བ་དང་མ་འོངས་པ་ལ་མེད་པར་\nམ་གྱུར་མོད་ཀྱི། མི་ཤེས་པ་དང་བྲལ་ནས་ཤེས་པ་སྐྱེས་སོ། །ཁྱིམ་བདག་རྣམས་དེ་ལ་ཤེས་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ཟད་པ་ཤེས་པའོ། །དེ་ལ་ཟད་པ་ཤེས་པ་གང་ཞེ་ན། ཟད་པ་ཤེས་པ་ནི་འདས་པ་མ་<span class='delete'>ཡ</span><span class='add'>ཡིན། </span>ིན། །"
 ],
 [
  "79.314a",
  "ཟད་པ་ཤེས་པ་ནི་མ་འོངས་པ་མ་ཡིན། ཟད་པ་ཤེས་པ་ནི་ད་ལྟར་བྱུང་བ་མ་ཡིན་མོད་ཀྱི། ཁྱིམ་བདག་རྣམས་གང་ལ་བརྟེན་ཏེ་མི་ཤེས་པ་དང་བྲལ་ནས་ཤེས་པ་སྐྱེས་<span class='delete'>པར་</span><span class='add'>བར་</span>གྱུར་པ་དེ་ནི་མི་ཤེས་པ་དང་\nབྲལ་བའི་ཤེས་པའོ། །མིག་ལ་བརྟེན་ནས་མི་ཤེས་པ་དང་བྲལ་ཞིང་ཤེས་པ་སྐྱེས་ཀྱང་མིག་ནི་ངའི་བ་མ་ཡིན་<span class='delete'>ནོ། </span><span class='add'>ནོ། །</span>གང་ངའི་བ་མ་ཡིན་པ་དེ་ཡོངས་སུ་མ་བཟུང་<span class='delete'>བའོ། </span><span class='add'>བའོ། །</span>གང་ཡོངས་སུ་མ་བཟུང་བ་དེ་སྤངས་<span class='delete'>པའོ། </span><span class='add'>པའོ། །</span>\nགང་སྤངས་པ་དེ་གྲོལ་<span class='delete'>བའོ། </span><span class='add'>བའོ། །</span>གང་ལས་གྲོལ་ཞེ་ན། བདག་ཏུ་འཛིན་པ་ལས་གྲོལ། སེམས་ཅན་དུ་འཛིན་པ་ལས་གྲོལ། སྲོག་ཏུ་འཛིན་པ་དང་། གང་ཟག་ཏུ་འཛིན་པ་དང་། ཆད་པར་འཛིན་པ་དང་། རྟག་པར་འཛིན་པ་ལས་\nགྲོལ། འཛིན་པ་ཐམས་ཅད་ལས་གྲོལ། ཡོངས་སུ་རྟོག་པ་ལས་གྲོལ་ཏེ། དེ་ཡོངས་སུ་མི་རྟོག་གོ །ཡོངས་སུ་མི་རྟོག་པས་མི་རྟོག་རྣམ་པར་མི་རྟོག་གོ །ཅི་ལ་མི་རྟོག་ཅེ་ན། ང་དང་ངའི་ཞེས་མི་རྟོག་སྟེ། དེ་མི་\nསོགས་ཤིང་སོགས་པར་མི་བྱེད་ལ་སྤོང་ཞིང་མི་ལེན་ཏོ། །སྤངས་པས་ཡོངས་སུ་མྱ་ངན་ལས་འདས་སོ། །གྲོལ་ལོ་བྱུང་ངོ་། །རབ་ཏུ་རྣམ་པར་གྲོལ་ལོ། །བྲལ་ལོ་གང་ལས་བྱུང་ཞེ་ན། སྡུག་བསྔལ་ཐམས་ཅད་\nལས་བྱུང་ངོ་། །ཁྱིམ་བདག་ཁྱེད་རྣམས་འབྱུང་བར་འདོད་ན། ཆོས་གང་ཡང་བླང་བར་མི་བྱའོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཁྱིམ་བདག་རྣམས་ལེན་པས་ནི་སྲིད་པར་འགྱུར་རོ། །མི་ལེན་པས་ནི་སྲིད་པ་མེད་དོ། །དེ་ལ་ཁྱིམ་བདག་\nརྣམས་མིག་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་མ་ཡིན་ནོ། །གོང་མ་བཞིན་དུ་སྦྱར་ཏེ། རྣ་བ་དང་སྣ་དང་ལྕེ་དང་ལུས་དང་ཡིད་ཀྱི་བར་དུ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་མ་ཡིན་པ་ནས། རྣམ་པར་ཤེས་པའི་ཁམས་\nཀྱི་བར་དུ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་མ་ཡིན་མོད་ཀྱི། ཁྱིམ་བདག་རྣམས་གང་རྣམ་པར་ཤེས་པ་ལ་བརྟེན་ཏེ། ང་དང་ངའི་ཞེས་ཡང་དག་པ་མ་ཡིན་པར་འཛིན་པ་དེ་དང་བྲལ་བ་དེ་ནི་ཡོངས་སུ་མྱ་ངན་"
 ],
 [
  "79.314b",
  "ལས་འདས་<span class='delete'>པའོ། </span><span class='add'>པའོ། །</span>གང་དང་བྲལ་ན་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་ཡིན་ཞེ་ན། འདོད་ཆགས་དང་བྲལ་བ་ནི་ཡོངས་སུ་མྱ་ངན་ལས་འདས་<span class='delete'>པའོ། </span><span class='add'>པའོ། །</span>ཞེ་སྡང་དང་བྲལ་བ་ནི་ཡོངས་སུ་མྱ་ངན་ལས་འདས་<span class='delete'>པའོ། །</span><span class='add'>པའོ། །</span>\nགཏི་མུག་དང་བྲལ་བ་ནི་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའོ། །མི་ཤེས་པ་དང་བྲལ་བ་ནི་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་སྟེ། ཡང་ཁྱིམ་བདག་རྣམས་མི་ཤེས་པ་ནི་འདས་པ་དང་། ད་ལྟར་དང་། མ་འོངས་པ་\nལ་མེད་པར་གྱུར་པ་མ་ཡིན་མོད་ཀྱི། མི་ཤེས་པ་དང་བྲལ་ནས་ཤེས་པ་སྐྱེས་སོ། །ཁྱིམ་བདག་རྣམས་དེ་ལ་ཤེས་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ཟད་པ་ཤེས་པའོ། །དེ་ལ་ཟད་པ་ཤེས་པ་གང་ཞེ་ན། ཟད་པ་\nཤེས་པ་ནི་འདས་པ་མ་ཡིན། ཟད་པ་ཤེས་པ་ནི་མ་འོངས་པ་མ་ཡིན། ཟད་པ་ཤེས་པ་ནི་ད་ལྟར་བྱུང་བ་མ་ཡིན་མོད་ཀྱི། ཁྱིམ་བདག་རྣམས་མིག་ལ་བརྟེན་ཏེ། མི་ཤེས་པ་དང་བྲལ་ནས་ཤེས་པ་སྐྱེས་\n<span class='delete'>པར་</span><span class='add'>བར་</span>གྱུར་པ་དེ་ནི་མི་ཤེས་པ་དང་བྲལ་བའི་ཤེས་<span class='delete'>པའོ། </span><span class='add'>པའོ། །</span>མིག་ལ་བརྟེན་ཏེ་མི་ཤེས་པ་དང་བྲལ་ནས་ཤེས་པ་སྐྱེས་ཀྱང་ཤེས་པའི་དབྱིངས་ནི་ངའི་བ་མ་ཡིན་ནོ། །གང་ངའི་བ་མ་ཡིན་པ་དེ་ཡོངས་སུ་མ་བཟུང་བའོ། །\nགང་ཡོངས་སུ་མ་བཟུང་བ་དེ་སྤངས་པའོ། །གང་སྤངས་པ་དེ་གྲོལ་བའོ། །གང་ལས་གྲོལ་ཞེ་ན། བདག་ཏུ་འཛིན་པ་ལས་གྲོལ། སེམས་ཅན་དུ་འཛིན་པ་དང་། སྲོག་ཏུ་འཛིན་པ་དང་། གང་ཟག་ཏུ་འཛིན་པ་<span class='delete'>དང་། </span><span class='add'>དང་། </span>\nཆད་<span class='delete'>པ་</span><span class='add'>པར་</span>འཛིན་པ་དང་། རྟག་པར་འཛིན་པ་ལས་གྲོལ། ཡོངས་སུ་རྟོག་པ་ལས་གྲོལ་ཏེ། དེ་ཡོངས་སུ་མི་རྟོག་<span class='delete'>གོ </span><span class='add'>གོ །</span>ཡོངས་སུ་མི་རྟོག་པས་མི་རྟོག་རྣམ་པར་མི་རྟོག་<span class='delete'>ག།</span><span class='add'>གོ །</span><span class='delete'>ོ </span><span class='add'></span>ཅི་ལ་མི་རྟོག་ཅེ་ན། ང་ཞེས་<span class='delete'>མི་</span><span class='add'></span><span class='delete'>རྟོག །</span><span class='add'></span><span class='delete'>ངའི་</span><span class='add'></span><span class='delete'>ཞེས་</span><span class='add'></span>\n<span class='delete'>མི་</span><span class='add'>མི་རྟོག  །ངའི་ཞེས་མི་</span>རྟོག་སྟེ། དེ་མི་སོགས་ཤིང་སོགས་པ་མེད་དེ། ལེན་པ་མེད་ཅིང་སྤངས་པས་ཡོངས་སུ་མྱ་ངན་ལས་འདས་སོ། །གྲོལ་ལོ། །བྱུང་ངོ་། །རབ་ཏུ་རྣམ་པར་གྲོལ་ལོ། །བྲལ་ལོ། །གང་"
 ],
 [
  "79.315a",
  "ལས་བྱུང་ཞེ་ན། སྡུག་བསྔལ་ཐམས་ཅད་ལས་བྱུང་ངོ་། །ཁྱིམ་བདག་ཁྱེད་རྣམས་འབྱུང་བར་འདོད་ན་ཆོས་གང་ཡང་བླང་བར་མི་བྱའོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཁྱིམ་བདག་རྣམས་ལེན་པས་ནི་\nསྲིད་པར་འགྱུར་གྱི། མི་ལེན་པས་ནི་མ་ཡིན་ནོ། །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱི་དོན་འདི་ཉིད་རྒྱ་ཆེར་བསྟན་པའི་ཕྱིར་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་གསུངས་སོ། །ལེན་པ་ལས་ནི་འཇིགས་སྐྱེ་<span class='delete'>སྟེ། </span><span class='add'>སྟེ། །</span>\nདེ་ཕྱིར་ངན་འགྲོར་འགྲོ་བར་འགྱུར། །འཇིགས་བཅས་གནས་ནི་འདི་མཐོང་ནས། <span class='delete'>མཁས་</span><span class='add'>།མཁས་</span>པས་དེ་ནི་མི་ལེན་ཏོ། །ལམ་གང་ཉིད་ལ་བསྒོམ་བྱ་བ། །ཤེས་རབ་ཀྱིས་ནི་དེ་བལྟ་སྟེ། །ཤེས་རབ་ཀྱིས་ནི་མཐོང་འགྱུར་བས། །\nརྣམ་པ་གཞན་དུ་མི་འགྱུར་རོ། །སྐྱེ་མཆེད་ཐམས་ཅད་སྟོང་པ་སྟེ། །སྙིང་པོ་མེད་པ་གཡོ་ཞིང་གསོག །སྐྱེ་དགུ་རྣམས་ནི་སྲེད་པས་བསླུས། །དེ་ལ་ཆགས་པར་མི་བྱའོ། །ཆོས་རྣམས་སྟོང་པར་ངས་\nམཁྱེན་ཏེ། །ཆོས་རྣམས་སྙིང་པོ་མེད་པར་<span class='delete'>མཁྱེན། </span><span class='add'>མཁྱེན། །</span>བདེ་བརྙེས་མྱ་ངན་མི་མཛད་དེ། །ངས་ནི་མི་གཡོ་བདེ་བ་བརྙེས། །གང་གིས་འདི་ལྟར་ཆོས་རྣམས་ཀུན། །སྟོང་པ་ཉིད་དུ་ཤེས་པ་དེ། །སྡུག་བསྔལ་དག་ནི་ཀུན་ལས་\nཐར། །དེ་ལ་བརྩོད་པ་མེད་པ་ཡིན། །འདོད་པ་འདི་ནི་ཡོངས་སུ་འཛིན་ཀུན་<span class='delete'>དང་། </span><span class='add'>དང་། །</span>གཙེ་བ་ཐམས་ཅད་ཀྱི་ཡང་<span class='delete'>སྐྱེ་</span><span class='add'>སྐྱེད་</span><span class='delete'>བ་</span><span class='add'>པ་</span>ཡིན། །ཡོངས་སུ་འཛིན་པ་དག་ལས་ལེན་པར་<span class='delete'>གསུངས། </span><span class='add'>གསུངས། །</span><span class='delete'>ལེན་</span><span class='add'>ལེན་</span>པ་དག་ལས་སྲིད་པ་འབྱུང་བར་\nའགྱུར། །སྲིད་པ་ལས་ནི་རྫོགས་སྐྱེ་སྐྱེ་བ་སྟེ། །དེ་ནི་འཇུག་པ་དག་དང་འགྲུབ་པར་འགྱུར། །སྐྱེས་ནས་ནད་དང་རྒ་དང་འཆི་བ་དང་། །མི་འདོད་སྡུག་བསྔལ་ཆེན་པོ་གཞན་དག་<span class='delete'>གནོད། </span><span class='add'>གནོད། །</span>འདོད་པ་མེད་ན་ལེན་པ་ཡོད་\nམ་ཡིན། །ལེན་པ་མེད་ན་སྲིད་པར་མི་འགྱུར་ཏེ། །སྲིད་པ་མངོན་<span class='delete'>པར་</span><span class='add'>པར་</span>འགྲུབ་<span class='delete'>པ་</span><span class='add'></span>ལས་འདས་པ་ནི། །སྐྱེ་རྒ་ན་དང་འཆི་བར་མི་འགྱུར་རོ། །དེ་ཕྱིར་ཁྱེད་ཀུན་གཅིག་ཏུ་འདུས་གྱུར་ནས། །ཡོངས་སུ་འཛིན་པ་རྣམ་པར་"
 ],
 [
  "79.316b",
  "དེ་ལས་བཅོམ་ལྡན་འདས་ཀྱི་གཏམ་ནི་འདི་ཡིན་ཏེ། ཁྱིམ་བདག་རྣམས་མིག་ཀུན་དུ་འབར་ཏེ། ཅིས་ཀུན་དུ་འབར་ཞེ་ན། འདོད་ཆགས་ཀྱི་མེ་དང་ཞེས་སྡང་གི་མེ་དང་། གཏི་མུག་གི་མེས་ཀུན་དུ་འབར་རོ། །སྐྱེ་བ་དང་། \nརྒ་བ་དང་། ན་བ་དང་། འཆི་བ་དང་མྱ་ངན་དང་སྨྲེ་སྔགས་འདོན་པ་དང་། སྡུག་བསྔལ་བ་དང་། ཡིད་མི་བདེ་བ་དང་། འཁྲུག་པས་ཀུན་དུ་འབར་ཏེ། བདག་གིར་བྱ་བ་སྡུག་བསྔལ་ལོ་ཞེས་བཤད་དོ། །ཁྱིམ་བདག་རྣམས་རྣ་བ་\nདང་སྣ་དང་ལྕེ་དང་ལུས་དང་། ཡིད་ཀྱི་བར་དུ་ཀུན་དུ་འབར་ཏེ། ཅིས་ཀུན་དུ་འབར་ཞེ་ན། འདོད་ཆགས་ཀྱི་མེ་དང་། ཞེ་སྡང་གི་མེ་དང་། གཏི་མུག་གི་མེ་དང་། སྐྱེ་བ་དང་རྒ་བ་དང་ན་བ་དང་འཆི་བ་དང་། མྱ་ངན་དང་སྨྲེ་སྔགས་འདོན་\nཔ་དང་། སྡུག་བསྔལ་བ་དང་། ཡིད་མི་བདེ་བ་དང་། འཁྲུག་པས་ཀུན་དུ་འབར་ཏེ། བདག་གིར་བྱ་བ་སྡུག་བསྔལ་ལོ་ཞེས་བཤད་དོ། །ཁྱིམ་བདག་རྣམས་གཟུགས་ཀུན་དུ་འབར་ཏེ། ཅིས་ཀུན་དུ་འབར་ཞེ་ན། འདོད་ཆགས་ཀྱི་མེ་\nདང་། ཞེ་སྡང་གི་མེ་དང་། གཏི་མུག་གི་མེས་ཀུན་དུ་འབར་རོ། །དེ་ལྟར་སྒྲ་དང་དྲི་དང་རོ་དང་རེག་བྱ་དང། ཆོས་རྣམས་ཀྱང་གོང་མ་བཞིན་དུ་སྦྱར་<span class='delete'>རོ། </span><span class='add'>རོ། །</span>ཁྱིམ་བདག་རྣམས་གཟུགས་ཀྱི་ཕུང་པོ་ཀུན་དུ་འབར་ཏེ། ཅིས་ཀུན་དུ་འབར་\nཞེ་ན། འདོད་ཆགས་ཀྱི་མེ་<span class='delete'>དང། </span><span class='add'>དང་། </span>ཞེ་སྡང་གི་མེ་<span class='delete'>དང། </span><span class='add'>དང་། </span>གཏི་མུག་གི་མེས་ཀུན་དུ་འབར་རོ། །ཚོར་བའི་ཕུང་པོ་དང་། འདུ་ཤེས་ཀྱི་ཕུང་པོ་དང་། འདུ་བྱེད་ཀྱི་ཕུང་པོ་དང་། རྣམ་པར་ཤེས་པའི་ཕུང་པོ་ཡང་དེ་བཞིན་<span class='delete'>ནོ། </span><span class='add'>ནོ། །</span>ཁྱིམ་བདག་རྣམས་\nསའི་ཁམས་ཀུན་དུ་འབར་ཏེ། ཅིས་ཀུན་དུ་འབར་ཞེ་ན། འདོད་ཆགས་ཀྱི་མེ་དང་། ཞེ་སྡང་གི་མེ་དང་། གཏི་མུག་གི་མེས་ཀུན་དུ་འབར་རོ། །ཁྱིམ་བདག་རྣམས་ཆུའི་ཁམས་དང་། མེའི་ཁམས་དང་རླུང་གི་ཁམས་དང་ནམ་མཁའི་\nཁམས་ཀུན་དུ་འབར་ཏེ། ཅིས་ཀུན་དུ་འབར་ཞེ་ན། འདོད་ཆགས་ཀྱི་མེ་དང་། ཞེ་སྡང་གི་མེ་དང་། གཏི་མུག་གི་མེས་ཀུན་དུ་འབར་རོ། །སྐྱེ་བ་དང་རྒ་བ་དང་ན་བ་དང་འཆི་བ་དང་མྱ་ངན་དང་། སྨྲེ་སྔགས་འདོན་དང་། སྡུག་བསྔལ་བ་དང་། ཡིད་"
 ],
 [
  "79.316a",
  "འབྱུང་བར་འགྱུར། །བྱེད་པ་པོ་དག་ཚོར་བ་མི་དམིགས་ཏེ། །བྱ་བ་དག་ནི་སྒྱུ་མ་ལྟ་བུར་སྣང་། །<span class='delete'>དས་</span><span class='add'>ངས་</span>ནི་ནང་དང་ཕྱི་རོལ་ཆོས་རྣམས་ཀུན། །སྟོང་པ་ཉིད་དེ་སྒྱུ་མ་འདྲ་བར་མཁྱེན། །བྱིས་པ་མི་ཤེས་ལོག་པར་\nའཛིན་པ་དག །ང་དང་ང་ཡི་ཞེས་ཀྱང་རྣམ་པར་རྟོག །མིག་ནི་ནང་ན་ཅུང་ཟད་ཡོད་མ་ཡིན། །ཕྱི་རོལ་གང་<span class='delete'>དུའང་</span><span class='add'>དུ་འང་</span>སེམས་ཅན་མི་དམིགས་ཏེ། །མིག་ནི་བདག་མེད་བྱེད་མེད་སྲོག་མེད་དེ། །ཆོས་རྣམས་ཀུན་ཀྱང་དེ་ལྟར་\nཤེས་པར་བྱོས། །མིག་ནི་སེམས་ཤིང་གྲོལ་བར་འདོད་མ་ཡིན། །དེ་བཞིན་རྣ་བ་དང་ནི་སྣ་དང་ལྕེ། །ལུས་དང་ཡིད་དང་གཟུགས་ཀྱང་བྱེད་<span class='delete'>མེད་</span><span class='add'>མེད་</span><span class='delete'>དེ། །</span><span class='add'>དེ། །</span>ཆོས་རྣམས་ཐམས་ཅད་དེ་དང་འདྲ་བར་ལྟོས། །ཇི་ལྟར་རྒྱ་མཚོ་དག་གི་\n<span class='delete'>ཚུ་</span><span class='add'>ཆུ་</span>ལས་ནི། །དབུ་བ་<span class='delete'>རྔོས་</span><span class='add'>རྡོས་</span>པ་ཆེན་པོ་མང་བྱུང་བ། །དེ་ལ་མིག་ལྡན་ཚུལ་བཞིན་དེས་བརྟགས་ན། །དབུ་བ་<span class='delete'>རྔོས་</span><span class='add'>རྡོས་</span>པ་ཉམ་ཆུང་སྙིང་པོ་མེད། །དེ་བཞིན་ཕུང་པོ་ལྔ་ཡི་ངོ་བོ་ཉིད། །དབུ་བ་ལྟ་བུར་ཉམ་ཆུང་གང་ཤེས་པ། །གཙེ་\nབ་ཐམས་ཅད་དག་ནི་སྐྱེ་བ་དང་། །རྒ་དང་མྱ་ངན་གཙེ་ལས་གྲོལ་བར་འགྱུར། །གང་དང་ང་ཡི་བསྟན་ལ་རབ་བྱུང་ནས། །ཆོས་ཀུན་སྒྱུ་མ་ལྟ་བུར་ཤེས་པ་དེ། །ཡུལ་གྱི་བསོད་སྙོམས་འབྲས་བུ་ཡོད་པར་ཟ། །དེ་ནི་ཕྱོགས་\nབཅུའི་སངས་རྒྱས་མཆོད་པར་<span class='delete'>བྱེད། </span><span class='add'>བྱེད། །</span>དེ་ནས་ཁྱིམ་བདག་ལྔ་བརྒྱ་ཙམ་པོ་ས་ཕྱོགས་དེ་ཉིད་ན་གནས་པ་དེ་དག་ཆོས་རྣམས་ལ་ཆོས་ཀྱི་མིག་རྡུལ་མེད་ཅིང་དྲི་མ་དང་བྲལ་བ་རྣམ་པར་དག་གོ །འདི་ལྟ་སྟེ་དཔེར་ན། \nགོས་དག་པ་ནག་པོ་དང་བྲལ་བ་ཚོན་དུ་བཅུག་ན་མྱུར་དུ་ཚོན་འཛིན་པ་དེ་བཞིན་དུ་ཁྱིམ་བདག་ལྔ་བརྒྱ་ཙམ་པོ་ས་ཕྱོགས་དེ་ཉིད་ན་གནས་པ་དེ་དག་ཆོས་རྣམས་ལ་ཆོས་ཀྱི་མིག་རྡུལ་མེད་ཅིང་དྲི་མ་དང་བྲལ་བ་\nརྣམ་པར་དག་<span class='delete'>གོ །</span><span class='add'>གོ །</span>དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཁྱིམ་བདག་ལྔ་བརྒྱ་ཙམ་པོ་དེ་དག་ལ་ཆོས་ཀྱི་གཏམ་གྱིས་ཡང་དག་པར་བསྟན། ཡང་དག་པར་<span class='delete'>གཟེད་</span><span class='add'>གཟེང་</span><span class='delete'>སྟོང་། </span><span class='add'>སྟོད། </span>ཡང་དག་པར་རབ་ཏུ་དགའ་བར་བྱས་སོ། །"
 ],
 [
  "79.315b",
  "སྤང་བྱོས་ལ། །བུ་དང་ཆུང་མ་དག་ལ་དགའ་སྤོངས་ཏེ། །དགེ་སློང་ཚུལ་འདི་མྱུར་དུ་བླང་བར་བྱོས། །ཤེས་ཀྱི་ཁེ་འདོད་རྙེད་པ་འདོད་མ་བྱེད། །ངན་<span class='delete'>དོན་</span><span class='add'>ངོན་</span>ཙམ་དག་གིས་ནི་ཆོག་བྱོས་ལ། །གདོལ་པ་དག་དང་འདྲ་བའི་\nདམའ་སེམས་ཀྱིས། །གཞན་གྱི་གྲོང་དུ་ཉེ་བར་འགྲོ་བར་བྱ། །ང་ནི་ཚུལ་ཁྲིམས་ལྡན་ཞེས་བདག་གམ་སྙེམས། །འདི་ནི་ཚུལ་ཁྲིམས་ངན་ཞེས་གཞན་མ་བརྙས། །ཚུལ་ཁྲིམས་ཙམ་གྱིས་གཞན་ལ་གང་བརྙས་\nཔ། །སྙེམས་ཕྱིར་དེ་ནི་ཚུལ་ཁྲིམས་འཆལ་ཅེས་བྱ། །ཇི་ལྟར་རི་དགས་དག་ནི་རྒྱས་ཟིན་པ། །དེ་དག་ཉིད་དུ་དེ་ཟིན་གསོད་པ་ལྟར། །དེ་བཞིན་བདུད་ཀྱི་ཞགས་པས་ཟིན་པ་དེ། །སྙེམས་པ་དེ་ཉིད་ཀྱིས་ནི་དེ་\nབཅོམ་མོ། །འཕྱ་བའི་བསམ་པ་ཅན་གྱི་གང་ཟག་དག །གཞན་ལ་བརྙས་པས་བདག་ཉིད་ཉམས་པར་བྱེད། །དེ་བས་ཚུལ་ཁྲིམས་འཆལ་<span class='delete'>ལའང་</span><span class='add'>ལ་འང་</span>མི་བརྙས་ན། །ཁྲིམས་ལྡན་ཚངས་པར་སྤྱོད་ལ་སྨོས་\nཅིང་གོས། །དྲང་<span class='delete'>སྲོད་</span><span class='add'>སྲོང་</span>ངེས་པའི་རྗེས་སུ་སློབ་པ་དག །རྣམ་པར་གྲོལ་བ་ཞི་བ་འདི་ཚོལ་ཞིང་། །ལུས་དང་སྲོག་རྣམས་ལ་ཡང་མི་ལྟ་བར། །རྟག་ཏུ་དབེན་པ་དགོན་པར་གནས་པར་བྱ། །གནོད་པའི་རྩ་བ་གཅིར་\nབུའི་གསུང་ཚིག་དང་། །འཇིག་རྟེན་རྒྱང་པན་གསང་ཚིག་རྣམས་སྤོངས་ལ། །སྟོང་པ་ཉིད་དང་ལྡན་པར་གང་གསུངས་པ། །ཟབ་མོའི་ཆོས་ལ་དགའ་བ་བསྐྱེད་པར་བྱོས། །ནང་དང་ཕྱི་རོལ་དག་གི་སྐྱེ་མཆེད་ནི། །\nབཅུ་<span class='delete'>གཉིད་</span><span class='add'>གཉིས་</span>པོ་སྟེ་སེམས་ཀྱི་རྩ་བར་བཤད། །དེ་དག་ཀུན་ཀྱང་ལས་ཀྱི་རྒྱུ་ལས་བྱུང་<span class='delete'>ངོ་། །</span><span class='add'>། །</span>ལས་ཀྱང་ཡུན་རིང་སེམས་པས་བཞག་<span class='delete'>པའོ། །</span><span class='add'>པའོ། །</span>མིག་དང་གཟུགས་གཉིས་ལ་ནི་བརྟེན་བྱས་ནས། །རྐྱེན་\nརྣམས་ལས་ཀྱང་རྣམ་པར་ཤེས་པ་སྐྱེ། །འདུ་བ་མ་ཚང་བས་ནི་ནུབ་གྱུར་ཏེ། །ཇི་ལྟར་ཤིང་མེད་མེ་ནི་མི་འབར་བཞིན། །དེ་ལྟར་ཆོས་འདི་ཐམས་ཅད་རབ་སྐྱེས་པ། །ཕུན་ཚུན་འདུས་པ་ལས་ནི་"
 ],
 [
  "79.317a",
  "མི་བདེ་བ་དང་འཁྲུག་པས་ཀུན་དུ་འབར་ཏེ། བདག་གིར་བྱ་བ་སྡུག་བསྔལ་ལོ་ཞེས་བཤད་<span class='delete'>དོ། </span><span class='add'>དོ། །</span>དེ་བས་ན་ཁྱིམ་བདག་རྣམས་མིག་བླང་བར་མི་བྱའོ་ཞེས་ཁྱིམ་བདག་<span class='delete'>རྣམས་</span><span class='add'></span><span class='delete'>རྣམས་</span><span class='add'>རྣམས་</span>དེ་ལྟར་བསླབས་པར་བྱའོ། །དེ་བཞིན་དུ་\nཁྱིམ་བདག་རྣམས་རྣ་བ་དང་སྣ་དང་ལྕེ་དང་ལུས་དང་ཡིད་བླང་བར་མི་བྱའོ་ཞེས་དེ་ལྟར་བསླབ་པར་བྱའོ། །དེ་བས་ན་ཁྱིམ་བདག་རྣམས་གཟུགས་བླང་བར་<span class='delete'>མ་</span><span class='add'>མི་</span>བྱ། སྒྲ་དང་དྲི་དང་རོ་དང་རེག་བྱ་དང་། ཆོས་བླང་བར་མི་བྱའོ་\nཞེས་དེ་ལྟར་བསླབ་པར་བྱའོ། །ཁྱིམ་བདག་རྣམས་གཟུགས་ཀྱི་ཕུང་པོ་བླང་བར་མི་བྱ། ཚོར་བའི་ཕུང་པོ་དང་། འདུ་ཤེས་ཀྱི་ཕུང་པོ་དང་། འདུ་བྱེད་ཀྱི་ཕུང་པོ་དང་། རྣམ་པར་ཤེས་པའི་ཕུང་པོ་བླང་བར་མི་བྱའོ་ཞེས་\nདེ་ལྟར་བསླབ་པར་བྱའོ། །དེ་བས་ན་ཁྱིམ་བདག་རྣམས་སའི་ཁམས་བླང་བར་མི་བྱ། ཆུའི་ཁམས་དང་། མེའི་ཁམས་དང་། རླུང་གི་ཁམས་དང་། ནམ་མཁའི་ཁམས་བླང་བར་མི་བྱའོ་ཞེས་དེ་ལྟར་བསླབ་པར་བྱའོ། །དེ་བས་ན་ཁྱིམ་བདག་\nརྣམས་རྣམ་པར་ཤེས་པའི་ཁམས་བླང་བར་མི་བྱའོ་ཞེས་དེ་ལྟར་བསླབ་པར་བྱའོ། །དེ་བས་ན་ཁྱིམ་བདག་རྣམས་འཇིག་རྟེན་འདི་བླང་བར་མི་བྱ། འཇིག་རྟེན་ཕ་རོལ་བླང་བར་མི་བྱའོ་ཞེས་ཁྱིམ་བདག་རྣམས་དེ་ལྟར་བསླབ་པར་\nབྱའོ། །ཁྱིམ་བདག་ཁྱེད་རྣམས་ནམ་མིག་མི་ལེན་ཅིང་། རྣ་བ་དང་སྣ་དང་ལྕེ་དང་ལུས་དང་ཡིད་མི་ལེན་པ་དེ་ན་ཁྱེད་རྣམས་མི་གནས་ཡིད་ཀྱི་བར་ལ་མི་གནས་པར་འགྱུར་རོ། །ཁྱིམ་བདག་ཁྱེད་རྣམས་ནམ་གཟུགས་མི་ལེན་ཅིང་། \nསྒྲ་དང་དྲི་དང་རོ་དང་རེག་བྱ་དང་། ཆོས་རྣམས་མི་ལེན་པ་དེ་ན་ཁྱེད་རྣམས་ཆོས་ཐམས་ཅད་ལ་མི་གནས་པར་འགྱུར་<span class='delete'>རོ། </span><span class='add'>རོ། །</span>ཁྱིམ་བདག་ཁྱེད་རྣམས་ནམ་གཟུགས་ཀྱི་ཕུང་པོ་མི་ལེན་ཅིང་ཚོར་བའི་ཕུང་པོ་དང་འདུ་ཤེས་ཀྱི་ཕུང་པོ་དང་། འདུ་བྱེད་ཀྱི་\nཕུང་པོ་མི་ལེན་པ་དེ་ན་ཁྱེད་རྣམས་ཕུང་པོ་རྣམས་ལ་མི་གནས་པར་འགྱུར་<span class='delete'>རོ། །</span><span class='add'>རོ། །</span>ཁྱིམ་བདག་ཁྱེད་རྣམས་རྣམ་པར་ཤེས་པའི་ཕུང་པོ་མི་ལེན་པ་དེ་ན་ཁྱེད་རྣམས་རྣམ་པར་ཤེས་པའི་ཕུང་པོ་ལ་མི་གནས་པར་འགྱུར་<span class='delete'>རོ། </span><span class='add'>རོ། །</span>ཁྱིམ་བདག་ཁྱེད་"
 ],
 [
  "79.317b",
  "རྣམས་ནམ་སའི་ཁམས་མི་ལེན་ཅིང་ཆུའི་ཁམས་དང་། མེའི་ཁམས་དང་། རླུང་གི་ཁམས་དང་། ནམ་མཁའི་ཁམས་མི་ལེན་པ་དེ་ན་ཁྱེད་རྣམས་ཁམས་རྣམས་ལ་མི་གནས་པར་འགྱུར་<span class='delete'>རོ། </span><span class='add'>རོ། །</span>ཁྱིམ་བདག་ཁྱེད་རྣམས་ནམ་རྣམ་པར་ཤེས་པའི་ཁམས་\nམི་ལེན་པ་དེ་ན་ཁྱེད་རྣམས་རྣམ་པར་ཤེས་པའི་ཁམས་ལ་མི་གནས་པར་འགྱུར་<span class='delete'>རོ། </span><span class='add'>རོ། །</span>ཁྱིམ་བདག་ཁྱེད་རྣམས་ནམ་འཇིག་རྟེན་འདི་<span class='delete'>ལི་</span><span class='add'>མི་</span>ལེན་ཅིང་འཇིག་རྟེན་ཕ་རོལ་མི་ལེན་པ་དེ་ན་ཁྱེད་རྣམས་འཇིག་རྟེན་ཐམས་ཅད་ལ་མི་གནས་པར་འགྱུར་<span class='delete'>རོ། </span><span class='add'>རོ། །</span>ཁྱིམ་བདག་\nཁྱེད་རྣམས་ནམ་ཆོས་ཐམས་ཅད་མི་ལེན་པ་དེ་ན་ཁྱེད་རྣམས་ཆོས་ཐམས་ཅད་ལ་མི་གནས་པར་འགྱུར་<span class='delete'>རོ། </span><span class='add'>རོ། །</span>ཁྱིམ་བདག་ཁྱེད་རྣམས་ནམ་ཆོས་ཐམས་ཅད་ལ་མི་གནས་པ་དེ་ན་ཁྱེད་རྣམས་མི་འབྱུང་མི་འཇིག་<span class='delete'>ག།</span><span class='add'>གོ།   </span><span class='delete'>ོ </span><span class='add'></span>ཁྱེད་རྣམས་ནམ་མི་འབྱུང་མི་འཇིག་\nཔ་དེ་ན་ཁྱེད་རྣམས་སྐྱེ་བ་དང་རྒ་བ་དང་ན་བ་དང་འཆི་བ་དང་མྱ་ངན་དང་། སྨྲེ་སྔགས་འདོན་པ་དང་། སྡུག་བསྔལ་བ་དང་། ཡིད་མི་བདེ་བ་དང་། འཁྲུག་པ་རྣམས་ལས་ཡོངས་སུ་ཐར་པར་འགྱུར་ཏེ། སྡུག་བསྔལ་ལས་ཡོངས་སུ་ཐར་<span class='delete'>པར་</span><span class='add'>བར་</span>འགྱུར་རོ། །ཞེས་བཤད་དོ། །\nདེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དོན་དེ་ཉིད་རྒྱ་ཆེར་བསྟན་པའི་ཕྱིར་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་གསུངས་སོ། །སྐྱེ་བ་དང་ནི་འཆི་བ་ཡིས། །འཇིག་རྟེན་འདི་ཀུན་ཀུན་ནས་འབར། །བྱིས་པ་སྐྱབས་མེད་གཙེ་བ་སྟེ། །དེ་དག་འཕགས་པའི་\nལམ་ལས་ཉམས། །བརྒྱ་ལམ་འཇིག་རྟེན་སྣང་མཛད་<span class='delete'>དང་། །</span><span class='add'>པ། །</span>དེ་བཞིན་གཤེགས་པ་འབྱུང་བར་འགྱུར། །<span class='delete'>དལ་</span><span class='add'>ངལ་</span>བ་<span class='delete'>ཆུང་</span><span class='add'>ཆུད་</span>ཟོས་མ་བྱེད་<span class='delete'>བར། །</span><span class='add'>པར། །</span>བརྩོན་འགྲུས་བརྟན་པ་རྩོམ་བྱོས་ཤིག །གང་ལ་གནས་ཏེ་རྣམ་སྒོམ་པ། །ཤེས་རབ་ཀྱིས་ནི་དེ་ཡང་<span class='delete'>ལྟོས། </span><span class='add'>ལྟོས། །</span>\nཤེས་རབ་ཀྱིས་ནི་དེ་མཐོང་སྟེ། །རྣམ་པར་གཞན་དུ་མི་འགྱུར་རོ། །གང་ལ་གནས་ཏེ་སེམས་སྒོམ་པ། །ཐམས་ཅད་སྟོང་པར་ཤེས་པར་བྱ། །ཆོས་རྣམས་སྟོང་པར་རིག་ནས་ནི། །བྱང་ཆུབ་ཉིད་ཀྱང་སྟོང་པ་ཡིན། །འདོད་ཆགས་ཞེ་སྡང་དེ་བཞིན་གཏི་མུག་དང་། །\nམེ་གསུམ་དེ་དག་ཤིན་དུ་མི་བཟད་པ། །དེས་ནི་འཇིག་རྟེན་འདི་ཀུན་རབ་འབར་ཡང་། །བྱིས་པ་རིང་ནས་གཉིད་ལོག་ཁོང་མི་ཆུད། སྐྱེ་དང་རྒ་དང་ན་དང་འཆི་བ་དང་། །སྨྲེ་སྔགས་འདོན་དང་སྡུག་བསྔལ་ཡིད་མི་བདེས། །འཇིག་རྟེན་འདི་དག་གཙེས་པར་"
 ],
 [
  "79.318a",
  "རིག་ནས་ནི། །ཆོས་རྣམས་ཀུན་ལ་གནས་པར་མ་བྱེད་ཅིག །དེ་ནས་བཅོམ་ལྡན་འདས་ཁྱིམ་བདག་ལྔ་བརྒྱ་ཙམ་པོ་དེ་དག་གིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བདག་ཅག་རྣམས་ཀྱིས་བཅོམ་ལྡན་འདས་ལས་རབ་ཏུ་བྱུང་བ་རྙེད་པར་\nགྱུར་ཅིག་བདག་ཅག་རྣམས་ཀྱིས་བདེ་བར་གཤེགས་པ་ལས་བསྙེན་པར་རྫོགས་པ་དགེ་སློང་གི་དངོས་པོ་རྙེད་པར་གྱུར་ཅིག །བཅོམ་ལྡན་འདས་ཀྱིས་དགེ་<span class='delete'>སྲོང་</span><span class='add'>སློང་</span>དག་ཚུར་ཤོག་ཅེས་གསུངས་པ་དང་། དེ་ཉིད་ཀྱིས་ཚེ་དང་ལྡན་པ་དེ་དག་རབ་ཏུ་བྱུང་བར་གྱུར་ཏེ། དེ་ཉིད་ཀྱིས་བསྙེན་པར་\nརྫོགས་པ་དང་། དེ་ཉིད་ཀྱིས་དགེ་སློང་གི་དངོས་པོར་གྱུར་ཏོ། །འདི་ལ་ཆོས་ཉིད་ནི་འདི་ཡིན་ཏེ། དེ་ལ་སྐད་ཅེས་བྱའོ། །དེ་དག་གིས་ནི་ངུར་སྨྲིག་བགོས། <span class='delete'>དེ་</span><span class='add'>།དེ་</span>དག་གིས་ནི་སྐྲ་ཡང་བྲེགས། །ཀུན་ཀྱང་ལྷུང་བཟེད་ཐོགས་གྱུར་ནས། །དེ་ཉིད་ཏུ་ནི་དགྲ་བཅོམ་གྱུར། །སྟོན་པས་དགྲ་བཅོམ་རབ་\nམཁྱེན་ནས། །དགེ་སློང་གི་ནི་དགེ་འདུན་དང་། །ལྷ་རྣམས་མདུན་དུ་མངོན་སུམ་དུ། །ཆེད་དུ་རྗོད་པ་ཆེད་ཏུ་བརྗོད། །འཇིག་རྟེན་གྱི་ནི་མགོན་པོ་ལ། །སྔོན་<span class='delete'>ཆང་</span><span class='add'>ཆད་</span>སྦྱིན་པ་བྱིན་པས་ན། །གང་ན་བདེ་བ་མང་བ་དེར། །ཤིན་དུ་དགའ་ཞིང་འོངས་<span class='delete'>པར་</span><span class='add'>བར་</span>གྱུར། །དེ་དག་གིས་ནི་ང་མཐོང་ནས། །དད་\nཔས་རབ་ཏུ་སྐྱེད་པར་གྱུར། །དེ་དག་སེམས་ནི་དད་པ་ལ། །ཆོས་རྣམས་ཀྱི་ནི་མཆོག་བསྟན་ཏོ། །དགྲ་བཅོམ་གྱི་ནི་གསུངས་ཐོས་ན། །བདག་ཏུ་ལྟ་བ་རྣམ་པར་<span class='delete'>ཤིག །</span><span class='add'>བཤིག །</span>སྟོང་ཉིད་མངོན་དུ་བྱས་ནས་ནི། །དེ་དག་སྐྱེ་བ་ཀུན་ལས་གྲོལ། །ཁྱིམ་བདག་གི་ལེའུ་ཞེས་བྱ་སྟེ། །\nདང་པོའོ། །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ལམ་གྱི་བར་དུ་ཁྱིམ་བདག་ལྔ་བརྒྱ་པོ་མི་གཡོ་བའི་གནས་ལ་བཀོད་ནས་ཀུན་ནས་<span class='delete'>མཛས་</span><span class='add'>མཛེས་</span>པས་རྒྱལ་པོའི་ཁབ་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོར་གཤེགས་<span class='delete'>སོ། </span><span class='add'>སོ། །</span>དེ་ནས་རྒྱལ་པོའི་ཁབ་ཀྱི་གྲོང་ཁྱེར་གྱི་ལྷ་རྣམས་དང་། \nགནོད་སྦྱིན་ཅི་འཇིགས་འདི་སྙམ་དུ་སེམས་ཏེ། བདག་ཅག་གིས་འདི་ལྟ་བུ་སྦྱིན་གནས་འཇིག་རྟེན་ཤིན་དུ་དཀོན་པའི་བཅོམ་ལྡན་འདས་ལ་བསོད་སྙོམས་དབུལ་ལོ་སྙམ་མོ། །དེ་ནས་གནོད་སྦྱིན་ཅི་འཇིགས་ཀྱིས་བསོད་སྙོམས་ཁ་དོག་ཕུན་སུམ་ཚོགས་\nཔ། དྲི་ཕུན་སུམ་ཚོགས་པ། རོ་ཕུན་སུམ་ཚོགས་པ། རེག་ཕུན་སུམ་ཚོགས་པ། བཅོམ་ལྡན་འདས་ལ་ཕུལ་ནས་གནོད་སྦྱིན་ཅི་འཇིགས་ལ་ཐུགས་བརྩེ་བའི་སླད་ཏུ་བཅོམ་ལྡན་འདས་ཀྱིས་བསོད་སྙོམས་དེ་བཞེས་སོ། །བཅོམ་ལྡན་"
 ],
 [
  "79.318b",
  "འདས་ལ་གནོད་སྦྱིན་ཅི་འཇིགས་ཀྱི་བསོད་སྙོམས་ཕུལ་མ་ཐག་ཏུ་དེ་ནས་དེའི་ཚེ་སྟེང་གི་བར་སྣང་ལས་ཅི་འཇིགས་ཀྱི་འཁོར་མང་པོ་གནོད་སྦྱིན་དྲུག་ཁྲི་བརྒྱད་སྟོང་གིས་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ཏེ། རྗེས་སུ་ཡི་རང་བའི་སྒྲ་ཕྱུང་<span class='delete'>ངོ། །</span><span class='add'>ངོ་། །</span>དེ་ནས་དེའི་ཕྱིར་གནོད་སྦྱིན་\nཅི་འཇིགས་ཀྱིས་རང་གི་འཁོར་རྣམས་ལ་བོས་ཏེ། བདག་གིས་<span class='delete'>ནི་</span><span class='add'>ནི་ད་</span>བཟོད་དེ་བཞིན་གཤེགས་པ་ལ་བསོད་སྙོམས་ཕུལ་གྱིས། །ཁྱེད་ཀྱིས་ནི་དགེ་སློང་གི་དགེ་འདུན་རྣམས་ལ་ཕུལ་<span class='delete'>ཅིག། </span><span class='add'>ཅིག །</span>དེ་ནི་<span class='delete'>ཁྱེར་</span><span class='add'>ཁྱེད་</span>རྣམས་ཀྱི་ཡུན་རིང་པོའི་དོན་དང་། ཕན་པ་དང་བདེ་\nབར་འགྱུར་རོ། །གནོད་སྦྱིན་རྣམས་ཀྱིས་དགེ་སློང་གི་དགེ་འདུན་ལ་བསོད་སྙོམས་ཕུལ་ནས་གནོད་སྦྱིན་དེ་དག་ལ་སྙིང་བརྩེ་བའི་ཕྱིར་དགེ་སློང་གི་དགེ་འདུན་གྱིས་ཀྱང་བསོད་སྙོམས་བླངས་སོ། །དེ་ནས་བཅོམ་ལྡན་འདས་རྒྱལ་པོའི་ཁབ་ཀྱི་གྲོང་\nཁྱེར་ཆེན་པོར་གཤེགས་པ་ལས་དེས་བསོད་སྙོམས་བླངས་པར་མཁྱེན་ནས་ཕྱོགས་དེ་ནས་སླར་ལོག་གོ། །དེ་ལྟར་དེའི་ཚེ་ལྷ་སྟོང་ཕྲག་དུ་<span class='delete'>མང་</span><span class='add'>མ་དང་།  </span><span class='delete'>བ་</span><span class='add'></span>ཀླུ་སྟོང་ཕྲག་དུ་མ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་\nདང་། <span class='delete'>མིའམ་</span><span class='add'>མི་འམ་</span>ཅི་དང་། ལྟོ་<span class='delete'>ཕྱེ་</span><span class='add'>འཕྱེ་</span>ཆེན་པོ་སྟོང་ཕྲག་དུ་མ་དང་། མི་དང་མི་མ་ཡིན་པ་སྟོང་ཕྲག་དུ་མ་དང་། སྲོག་ཆགས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དུ་མ་རྣམས་བཅོམ་ལྡན་འདས་གཤེགས་པའི་ཞབས་འབྲིང་དུ་དོད་དོ། །དེ་ནས་བཅོམ་\nལྡན་འདས་ས་ཕྱོགས་ཡངས་ཤིང་རྒྱ་ཆེ་བ་ཞིག་ཏུ་གཤེགས་ཏེ། བྱོན་ནས་གང་ན་བཤམས་པ་ལ་བཞུགས་སོ། །དེ་ནས་གནོད་སྦྱིན་ཅི་འཇིགས་འཁོར་དང་བཅས་པས་ལྷའི་མེ་ཏོག་མན་དཱ་ར་དང་། ཨུད་པ་ལ་དང་། པད་མ་དང་། ཀུ་མུ་ད་དང་། པད་\nམ་དཀར་པོ་དང་། ལྷའི་ཙན་དན་གྱི་ཕྱེ་མ་བླངས་ཏེ། བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་བྱ་བའི་ཕྱིར། བཅོམ་ལྡན་འདས་ལ་གཏོར་མངོན་<span class='delete'>པར་</span><span class='add'>པར་</span>གཏོར། མངོན་<span class='delete'>པར་</span><span class='add'>པར་</span>རབ་ཏུ་གཏོར་ཏོ། །གཏོར་མངོན་<span class='delete'>པར་</span><span class='add'>པར་</span>གཏོར། །མངོན་<span class='delete'>པར་</span><span class='add'>པར་</span>རབ་ཏུ་གཏོར་ནས་ཐལ་མོ་སྦྱར་ཏེ་<span class='delete'>ཕྱག་</span><span class='add'>ཕྱག་</span>\nའཚལ་ནས་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འདུག་གོ། །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་གནོད་སྦྱིན་ཅི་འཇིགས་ཀྱི་བསམ་པ་ཡང་མཁྱེན། དེའི་འཁོར་གནོད་སྦྱིན་མང་པོའི་བསམ་པ་ཡང་མཁྱེན་ནས་<span class='delete'>འཇུམ་</span><span class='add'>འཛུམ་</span>པ་མཛད་དོ། །ཆོས་"
 ],
 [
  "79.319a",
  "ཉིད་ནི་འདི་ཡིན་ཏེ། ནམ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་འཛུམ་པ་མཛད་པ་དེ་ན་ཞལ་གྱི་སྒོ་ནས་འོད་ཟེར་ཁ་དོག་དུ་མ་ཁ་དོག་སྣ་ཚོགས་འདི་ལྟ་སྟེ། སྔོན་པོ་དང་། སེར་པོ་དང་། \nདམར་པོ་དང་། དཀར་པོ་དང་། <span class='delete'>ལེ་</span><span class='add'>ལེ</span><span class='delete'>བ་</span><span class='add'>བ</span>རྒན་དང་། ཤེལ་དང་། དངུལ་གྱི་ཁ་དོག་ལྟ་བུར་བྱུང་སྟེ། དེས་འཇིག་རྟེན་གྱི་ཁམས་མཐའ་ཡས་མུ་མེད་པ་སྣང་བས་ཁྱབ་པར་བྱས་ནས་ཉི་མ་དང་ཟླ་བའི་\nགཟི་བརྗིད་མེད་པར་བྱས་ཏེ། སེམས་ཅན་དམྱལ་བ་པའི་སེམས་ཅན་ནས་ཚངས་པའི་འཇིག་རྟེན་གྱི་བར་དུ་མངོན་པར་འཕགས་ཏེ། སླར་ལོག་ནས་བཅོམ་ལྡན་འདས་ལ་ལན་བདུན་བསྐོར་བ་\nབྱས་ཏེ། ཁ་ཅིག་ནི་བཅོམ་ལྡན་འདས་<span class='delete'>གྱིས་</span><span class='add'>ཀྱིས་</span>དབུའི་གཙུག་ཏུ་ནུབ་པོ། །ཁ་ཅིག་ནི་ཕྲག་པར་ནུབ་པོ། །ཁ་ཅིག་ནི་པུས་མོར་ནུབ་པོ། །ཆོས་ཉིད་ནི་འདི་ཡིན་ཏེ། ནམ་སངས་རྒྱས་བཅོམ་ལྡན་\nའདས་རྣམས་སེམས་ཅན་དམྱལ་བ་པའི་སེམས་ཅན་རྣམས་ལ་ལུང་སྟོན་པ་དེ་ན་འོད་ཟེར་ཞབས་གཉིས་ཀྱི་འོག་ཏུ་ནུབ་པར་འགྱུར་རོ། །ནམ་དུད་འགྲོའི་སྐྱེ་གནས་པའི་སེམས་ཅན་རྣམས་ལ་ལུང་\nསྟོན་པ་དེ་ན་འོད་ཟེར་སྣམ་ལོགས་སུ་ནུབ་པར་འགྱུར་<span class='delete'>རོ། </span><span class='add'>རོ། །</span>ནམ་གཤིན་རྗེའི་འཇིག་རྟེན་པའི་སེམས་ཅན་རྣམས་ལ་ལུང་སྟོན་པ་དེ་ན་འོད་ཟེར་མདུན་དུ་ནུབ་པར་འགྱུར་རོ། །ནམ་མི་རྣམས་ལ་ལུང་\nསྟོན་པ་དེ་ན་འོད་ཟེར་གཡོན་དུ་ནུབ་པར་འགྱུར་<span class='delete'>རོ། །</span><span class='add'>རོ། །</span>ནམ་ལྷ་རྣམས་ལ་ལུང་སྟོན་པ་དེ་ན་འོད་ཟེར་གཡས་སུ་ནུབ་པར་འགྱུར་རོ། །ནམ་ཉན་ཐོས་རྣམས་ལ་ལུང་སྟོན་པ་དེ་ན་འོད་ཟེར་པུས་མོར་\nནུབ་པར་འགྱུར་<span class='delete'>རོ། །</span><span class='add'>རོ། །</span>ནམ་རང་སངས་རྒྱས་རྣམས་ལ་ལུང་སྟོན་པ་དེ་ན་འོད་ཟེར་ཕྲག་པ་ནུབ་པར་འགྱུར་རོ། །ནམ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་བླ་ན་མེད་པ་ཡང་དག་"
 ],
 [
  "79.320a",
  "འགྱུར། །བསྐལ་པ་བྱེ་བ་ཉི་ཤུར་ནི། །རྟག་ཏུ་སྟི་སྟང་བྱས་པར་འགྱུར། །ལྷ་ཡི་ནང་དང་མི་ནང་དུ། །ཡང་དང་ཡང་ནི་ཀུན་ཏུ་འགྲོ། །ཕྱིས་དེ་རྒྱལ་སྲིད་བོར་ནས་ནི། །ཁྱིམ་མེད་\nཔར་ཡང་རབ་ཏུ་འབྱུང་། །རྐྱེན་གྱིས་བྱང་ཆུབ་ཐོབ་འགྱུར་ཏེ། །དེར་ནི་མཐའ་ཡང་ཐུག་པར་འགྱུར། །གནོད་སྦྱིན་དག་ནི་སུམ་ཁྲི་རྣམས། །གནོད་སྦྱིན་སྐྱེ་གནས་འཕོས་གྱུར་ནས། །སུམ་བཅུ་རྩ་\nགསུམ་སྐྱེ་བར་འགྱུར། །སངས་རྒྱས་ལ་ནི་གུས་བྱས་ནས། །སངས་རྒྱས་བྱམས་པ་མཐོང་གྱུར་ཅིང་། །དེ་ན་མཐར་ནི་ཐུག་འགྱུར་ཏེ། །དགྲ་བཅོམ་པ་ཡང་ཐོབ་འགྱུར་ན། །སྟོན་པ་ལ་ནི་སུ་མི་\nམཆོད། །གནོད་སྦྱིན་སྟོང་དུ་ཚངས་པ་རྣམས། །བྱང་ཆུབ་མཆོག་ལ་རབ་ཞུགས་པས། །དེ་དག་དགེ་བའི་རྩ་བ་དེས། །ནམ་དུའང་ངན་འགྲོར་འགྲོ་མི་འགྱུར། །ཁ་ཅིག་སྲོག་ཆགས་ཀུན་ཕན་ཕྱིར། །བྱང་\nཆུབ་དམ་པ་རབ་<span class='delete'>ཆོལ་</span><span class='add'>ཚོལ་</span>ཞིང་། །སངས་རྒྱས་འདྲེན་པ་སྟོང་རྣམས་ལ། །བཀུར་སྟི་དག་ནི་བྱེད་པར་འགྱུར། །ཁ་ཅིག་སངས་རྒྱས་བྱང་ཆུབ་ཕྱིར། །སྟོང་ཕྲག་གཉིས་དང་གསུམ་དག་ཀྱང་། །མེ་ཏོག་ཕྲེང་བ་དྲི་རྣམས་<span class='delete'>ཀྱིས། །</span><span class='add'>ཀྱིས། །</span>\nམཆོད་པ་དག་ནི་བྱེད་པར་<span class='delete'>འགྱུར། </span><span class='add'>འགྱུར། །</span>དག་པ་བསྒོམས་པའི་བདག་ཉིད་ཅན། །འདྲེན་པ་བྱེ་བ་ཕྲག་སྟོང་ལ། །ཁ་ཅིག་བཀུར་སྟི་བྱེད་འགྱུར་ཏེ། །འདི་དག་ཕྱིས་ནི་བྱང་ཆུབ་<span class='delete'>རེག །</span><span class='add'>རེག །</span>དེ་ན་ཅི་འཇིག་དེ་ཡི་བུ། །རི་བོ་ཞེས་བྱ་\nརྫུ་འཕྲུལ་ཆེ། །འཇིག་རྟེན་སངས་རྒྱས་བདག་འགྱུར་<span class='delete'>ཅེས། </span><span class='add'>ཅེས། །</span>དེས་ཀྱང་སེམས་ནི་བསྐྱེད་པར་<span class='delete'>འགྱུར། །</span><span class='add'>གྱུར། །</span>དེས་ནི་སངས་རྒྱས་སྟི་སྟང་བྱས། །ཐམས་ཅད་དུ་ཡང་སྨོན་ལམ་བཏབ། །ང་མཐོང་ནས་ནི་མཆོད་བྱས་\nཏེ། །བྱང་ཆུབ་ཕྱིར་ནི་སེམས་བཏུད་དོ། །དེ་ནི་དགེ་བའི་རྩ་བ་དེས། །ངན་འགྲོ་ཐམས་ཅད་སྤངས་གྱུར་ནས། །སངས་རྒྱས་བྱམས་པ་མཐོང་ནས་ནི། །གདུགས་རྣམས་བྱེ་བ་འབུལ་བར་འགྱུར། །གདུགས་རྣམས་"
 ],
 [
  "79.319b",
  "པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་སྟོན་པ་དེ་ན་འོད་ཟེར་སྟེང་གི་དབུའི་གཙུག་གི་མཚམས་སུ་ནུབ་པར་འགྱུར་རོ། །ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་བཅོམ་ལྡན་འདས་<span class='delete'>འཇུམ་</span><span class='add'>འཛུམ་</span>པ་མཛད་པ་མཐོང་སྟེ། མཐོང་ནས་\nཆོས་གོས་ཕྲག་པ་གཅིག་ཏུ་བགོས་ཏེ་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ནས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས་བཅོམ་ལྡན་འདས་ལ་ཚིགས་སུ་བཅད་པ་འདི་དག་གསོལ་\nཏོ། །ཅི་རྒྱུས་འཇིག་རྟེན་སྣང་མཛད་པ། །འཇིག་རྟེན་ཀུན་ལ་སྨན་པའི་སླད། །འཇིག་རྟེན་མགོན་པོ་འོད་མཛད་པ། །ཅི་ཞིག་སླད་དུ་འཛུམ་པ་བསྟན། །སངས་རྒྱས་ཀྱི་ནི་བྱང་ཆུབ་ཕྱིར། །\nདེ་རིང་སུ་ཡིས་ས་བོན་བཏབ། །དེ་རིང་སུ་ལ་ལུང་ཡང་སྟོན། །གང་ཞིག་ཐར་ཕྱིར་རབ་ཏུ་ཞུགས། །དཔའ་བོ་རྣམ་པར་འདྲེན་པ་རྣམས། །རྒྱུ་མ་མཆིས་པར་འཛུམ་མི་མཛད། །ཐུབ་པ་ཅི་\nསླད་འཛུམ་པ་བསྟན། །འོད་ཟེར་དོན་ནི་བཤད་དུ་གསོལ། །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་ཚིགས་སུ་བཅད་པ་འདི་དག་གིས་སླར་གསུངས་<span class='delete'>པ། །</span><span class='add'>པ། </span>འཇིག་རྟེན་\nམགོན་པོ་སྐྱོབ་པ་ལ། །ཅི་འཇིགས་རབ་ཏུ་དང་སེམས་ཀྱིས། །བསོད་སྙོམས་དག་ནི་ཕུལ་བས་ན། །དེ་ལྟར་དེ་ཕྱིར་འཛུམ་པ་མཛད། །གནོད་སྦྱིན་འདི་ནས་ཤི་འཕོས་ནས། །སུམ་བཅུ་རྩ་\nགསུམ་འགྲོ་བར་འགྱུར། །སུམ་བཅུ་གསུམ་ནས་ཤི་འཕོས་ནས། །འཐབ་བྲལ་དུ་ཡང་འགྲོ་བར་འགྱུར། །འཐབ་བྲལ་ནས་ནི་དགའ་ལྡན་འགྲོ། །འདོད་ལ་འདོད་པས་དགར་བྱས་ནས། །མི་ཡི་ནང་\nདུ་སྐྱེ་འགྱུར་ཏེ། །རྒྱལ་པོ་རྫུ་འཕྲུལ་ལྡན་པར་འགྱུར། །འཁོར་ལོས་སྒྱུར་བ་མི་ཡི་དབང་། །གླིང་བཞི་དག་གི་དབང་པོ་<span class='delete'>སྟེ། </span><span class='add'>སྟེ། །</span>མི་ཡི་འཇིག་རྟེན་ཤི་འཕོས་ནས། །ཚངས་པའི་འཇིག་རྟེན་འགྲོ་བར་"
 ],
 [
  "79.320b",
  "བྱེ་བ་ཕུལ་ནས་ནི། །ན་བཟའ་བྱེ་བ་འབུལ་བར་འགྱུར། །ན་བཟའ་བྱེ་བ་ཕུལ་ནས་ནི། །དེ་ཉིད་ཏུ་ཡང་རབ་ཏུ་འབྱུང་། །སྲོག་ཆགས་ཀུན་<span class='delete'>པ་</span><span class='add'>ལ་</span>ཕན་པའི་ཕྱིར། །བྱང་ཆུབ་དམ་པ་རབ་ཚོལ་ཞིང་། །ལོ་ཡང་ལྔ་\nབརྒྱ་ཚང་བར་ནི། །ཚངས་པར་སྤྱད་པ་སྤྱོད་པར་<span class='delete'>འགྱུར། </span><span class='add'>འགྱུར། །</span>འདི་ལྟ་བུ་ཡི་རྣམ་གྲངས་<span class='delete'>ཀྱིས། །</span><span class='add'>ཀྱིས། །</span>སྦྱིན་དང་ཚུལ་ཁྲིམས་ཡང་དག་སྤྱོད། །གང་གཱའི་བྱེ་མ་ཇི་སྙེད་པ། །དེ་སྙེད་བསྐལ་པར་སྤྱོད་པར་འགྱུར། །དཔེར་\nགསུངས་པ་ནི་དེ་སྙེད་དུ། །དེ་དག་ཁྱེད་ཀྱིས་ཤེས་པར་གྱིས། །དེ་དག་དཔེར་ཡང་ཤེས་ནས་ནི། །དེ་བས་ལྷག་པར་སྤྱད་པར་གྱིས། །སྡར་ནི་དཔེ་རྣམས་གང་བརྗོད་<span class='delete'>པ། </span><span class='add'>པ། །</span>གང་གཱ་ཡེ་ནི་བྱེ་སྙེད་ཀྱི། །དེ་སྙེད་སངས་\nརྒྱས་མཐོང་གྱུར་ནས། །དེ་དག་ཀུན་ལ་སྟི་སྟང་བྱེད། །ཨེ་མའོ་ཡེ་ཤེས་ཨེ་མ་ཤེས། །ཨེ་མའོ་བླ་ན་མེད་པའི་སེམས། །སེམས་ཅན་ཀུན་གྱི་འདྲེན་པ་ནི། །དེ་ལྟར་ཞུམ་པར་མི་འགྱུར་རོ། །དེ་ཕྱིས་སེམས་\nཅན་ཀུན་གྱི་མཆོག །སངས་རྒྱས་སུ་ཡང་དེ་འགྱུར་ཏེ། །དེ་<span class='delete'>ནི་</span><span class='add'>ན་</span>དེ་ཡི་མཚན་བཏགས་པ། །སྨན་པའི་རྒྱལ་པོར་རྣམ་པར་གྲགས། །ལོ་ནི་བྱེ་བ་བདུན་བཅུར་ཡང་། །སྲོག་ཆགས་རྣམས་ལ་ཆོས་བསྟན་ཏེ། །ཕྱིས་\nགདོད་རྐང་གཉིས་གཙོ་བོ་ནི། །དེ་ན་མྱ་ངན་འདས་པར་འགྱུར། །རབ་ཏུ་དུལ་བའི་སེམས་རྣམས་ཀྱི། །འདུས་པ་དག་ནི་ཉི་ཤུར་འགྱུར། །དེ་ལ་ཐ་མ་གཅིག་པོ་ནི། །དགེ་སློང་བྱེ་བ་ཉི་ཤུར་འགྱུར། །འདུས་པ་རྣམས་\nནི་གང་བརྗོད་པའི། །ཉན་ཐོས་དཔག་ཏུ་མེད་པ་སྟེ། །དེ་ཡི་ཉན་ཐོས་ཇི་སྙེད་པ། །བྱང་ཆུབ་ཞུགས་<span class='delete'>པའང་</span><span class='add'>པ་འང་</span>དེ་སྙེད་དོ། །སེམས་ཅན་རྣམས་ཀྱི་དོན་མཛད་ནས། །དེ་བཞིན་གཤེགས་པ་མྱ་ངན་འདས། །ལོ་ནི་བརྒྱ་\nཕྲག་སྟོང་དག་དུ། །དེ་ཡི་དམ་ཆོས་གནས་པར་འགྱུར། །བསྐལ་པ་ལྔ་བརྒྱ་<span class='delete'>ཆད་</span><span class='add'>ཚང་</span><span class='delete'>པ་</span><span class='add'>བར་</span>ནི། །སངས་རྒྱས་མང་པོར་འབྱུང་བར་འགྱུར། །བསྐལ་པ་ཅིག་<span class='delete'>ལའང་</span><span class='add'>ལ་འང་</span>འབྱུང་བ་ནི། །དེ་ན་སྟོང་རྣམས་འབྱུང་བར་འགྱུར། །མི་"
 ],
 [
  "79.322a",
  "ཀྱི་སྣོད་ཏུ་གྱུར་པའི་སེམས་དང་། སྙིང་པོའི་སེམས་དང་། བརྟན་པའི་སེམས་དང་། མི་ཕྱེད་པའི་སེམས་དང་། མ་ཞིགས་པའི་སེམས་དང་། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་སར་མི་\nལྟུང་བའི་སེམས་དང་། བྱང་ཆུབ་སེམས་དཔའི་ས་ཐམས་ཅད་བསྒྲུབ་པའི་སེམས་ཀྱིས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་\nཏེ། བཅོམ་ལྡན་འདས་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་ནས་ཕྱོགས་གཅིག་ཏུ་འདུག་གོ །ཕྱོགས་གཅིག་ཏུ་འདུག་ནས་གནོད་སྦྱིན་ཅི་འཇིགས་ཀྱི་བུ་རི་བོས་ཐལ་མོ་སྦྱར་ཏེ། བཅོམ་ལྡན་འདས་ལ་\nཚིགས་སུ་བཅད་པ་འདི་དག་གསོལ་ཏོ། །སངས་རྒྱས་འཇིག་རྟེན་རྣམས་ཀྱི་མཆོག །ཆོས་རྣམས་ཀྱི་ནི་དམ་པ་སྟོན། །འཇིག་རྟེན་མགོན་ལ་བདག་གིས་ནི། །བླ་ན་མ་མཆིས་མཆོད་པ་བགྱིས། །\nའདྲེན་པ་ཇི་ལྟར་མཛད་པ་བཞིན། །སྟོབས་བཅུ་དང་ནི་རབ་ལྡན་ཏེ། །མི་འཇིགས་པ་ལ་<span class='delete'>བར་</span><span class='add'>རབ་</span>གནས་ནས། །སེམས་ཅན་དོན་རྣམས་བགྱིད་པར་<span class='delete'>ཤོག །</span><span class='add'>ཤོག །</span>སུམ་བཅུ་རྩ་གཉིས་མཚན་རྣམས་དང་། །དཔེ་\nབྱད་བཟང་པོ་བརྒྱད་བཅུར་ལྡན། །འཇིག་རྟེན་མགོན་པོ་འོད་བྱེད་པ། །འཇིག་རྟེན་སྣང་བར་བྱེད་པར་ཤོག །སྲོག་ཆགས་ཀུན་ལ་ཕན་པའི་ཕྱིར། །སྙན་པའི་ཆོས་ནི་རབ་སྟོན་ཅིང་། །རྣམ་པ་བཅུ་<span class='delete'>དང་</span><span class='add'></span>གཉིས་\nདམ་པ་ཡི། །ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་<span class='delete'>པར་</span><span class='add'>བར་</span>ཤོག །རྒྱལ་<span class='delete'>པ་</span><span class='add'>བ་</span>ཇི་ལྟར་དེ་བཞིན་དུ། །ཆོས་འཕྲུལ་རྣམས་ནི་རབ་སྟོན་ཅིང་། །སྲོག་ཆགས་བྱེ་བ་དུ་མ་ཡི། །སེམས་ཅན་རྣམས་ཀྱི་དོན་བགྱིད་ཤོག །དཔའ་ཆེན་གང་\nརྣམས་མ་བྱོན་པ། །འཇིག་རྟེན་མགོན་པོ་འོད་མཛད་ལྟར། །བྱང་ཆུབ་དམ་པ་<span class='delete'>རྟོགས་</span><span class='add'>རབ་རྟོགས་</span>ནས། །ལམ་དེ་རབ་ཏུ་སྟོན་པར་<span class='delete'>ཤོག །</span><span class='add'>ཤོག །</span>སེམས་ཅན་ལྡོངས་པ་ཀུན་གྱི་ཕྱིར། །མིག་དང་ལྡན་པ་ཉིད་གྱུར་ཏེ། །གནས་"
 ],
 [
  "79.321b",
  "པར་བྱས་<span class='delete'>སོ། </span><span class='add'>སོ། །</span>ལམ་དེ་དག་ཐམས་ཅད་བསལ་ནས་སྤོས་ཀྱི་ཆུས་ཀུན་དུ་ཆག་ཆག་བཏབ་<span class='delete'>པོ། </span><span class='add'>བོ། །</span>ལམ་དེར་གོས་ནི་མཚམས་མེད་པར་བཏིང་<span class='delete'>ངོ་། </span><span class='add'>ངོ་། །</span>ལམ་དེར་མི་གང་ཙམ་དུ་མེ་ཏོག་གིས་ཆལ་པར་བཀྲམ་\n<span class='delete'>མོ། </span><span class='add'>མོ། །</span>ལམ་དེ་དག་གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་གྱིས་ཤིན་དུ་བརྒྱན་<span class='delete'>ཏོ། </span><span class='add'>ཏོ། །</span>ལམ་དེ་བདུག་སྤོས་དམ་པའི་སྙིང་པོ་རབ་ཀྱི་སྣོད་ནས་བདུགས་<span class='delete'>སོ། </span><span class='add'>སོ། །</span>སྟེང་གི་བར་སྣང་ལས་དར་གྱི་<span class='delete'>ལྔ་</span><span class='add'>ལྡ་</span>ལྡིར་\n<span class='delete'>སྦྱངས་</span><span class='add'>སྤྱངས་</span>ཏེ། ཤིན་ཏུ་བརྒྱན་<span class='delete'>ཏོ། </span><span class='add'>ཏོ། </span>ལམ་དེར་སིལ་སྙན་སྣ་ཚོགས་ཀྱི་སྒྲ་འཁྲོལ་བར་བྱས་<span class='delete'>སོ། </span><span class='add'>སོ། །</span>ལམ་དེ་ནས་མདའ་རྒྱང་གང་ཚུན་ཆད་ཙམ་མེ་ཏོག་ཨུད་པ་ལ་དང་། ཀུ་མུ་ཏ་དང་། པད་མ་དཀར་པོས་ཁེབས་\nཤིང་དུར་པ་སྒྲ་འབྱིན་པར་བྱས་<span class='delete'>སོ། </span><span class='add'>སོ། །</span>ལམ་དེ་གསེར་གླེབས་པས་རབ་ཏུ་གཡོགས་<span class='delete'>སོ། </span><span class='add'>སོ། །</span>ལམ་དེ་གསེར་གྱི་དྲ་བ་དང་། རིན་པོ་ཆེ་སྣ་བདུན་གྱི་དྲ་བས་རབ་ཏུ་གཡོགས་<span class='delete'>སོ། </span><span class='add'>སོ། །</span>དེ་ནས་གནོད་སྦྱིན་ཅི་འཇིགས་ཀྱི་\nབུ་དེ་ལྟ་བུའི་བཀོད་པ་བྱས་ནས་ལུས་ཆེན་པོ་མངོན་པར་སྤྲུལ་ཏེ། འཁོར་དང་བཅས་པ་དགའ་མགུ་རངས་རབ་ཏུ་དགའ་སྟེ། མོས་ཤིང་ཡིད་བདེ་བ་སྐྱེས་<span class='delete'>ནས། །</span><span class='add'>ནས། </span>དགའ་བའི་སེམས་དང་། བདེ་བའི་སེམས་\nདང་། མཉེན་པའི་སེམས་དང་། རྣམ་པར་དང་བའི་སེམས་དང་། སྒྲིབ་པ་མེད་པའི་སེམས་དང་། རབ་ཏུ་སིམ་པའི་སེམས་དང་། སངས་རྒྱས་ལ་གཞོལ་བའི་སེམས་དང་། ཆོས་ལ་གཞོལ་བའི་སེམས་\nདང་། དགེ་འདུན་ལ་གཞོལ་བའི་སེམས་<span class='delete'>དང་། །</span><span class='add'>དང་། </span>བྱང་ཆུབ་ལས་མི་གཡོ་བའི་སེམས་དང་། མི་བསྐྱོད་<span class='delete'>བའི་</span><span class='add'>པའི་</span>སེམས་དང་། མི་མཉམ་པ་དང་མཉམ་པའི་སེམས་དང་། འཇིག་རྟེན་གསུམ་པོ་ཐམས་ཅད་ལས་\nཁྱད་པར་དུ་འཕགས་པའི་སེམས་དང་། སེམས་ཅན་ཐམས་ཅད་ལ་བྱམས་པའི་སེམས་དང་། སྙིང་རྗེའི་སེམས་དང་། དགའ་བའི་སེམས་དང་། བཏང་སྙོམས་ཀྱི་སེམས་དང་། སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་"
 ],
 [
  "79.321a",
  "རྣམས་མཁས་པ་གང་དག་ནི། །སངས་རྒྱས་ཆོས་རྣམས་བསྙེན་འདོད་པ། །ཚུལ་བཞིན་མང་དུ་ཐོས་པ་དང་། །རབ་ཏུ་འདུན་པ་ཉིད་དུ་བྱ། །ཚུལ་བཞིན་མ་ཡིན་རྣམ་པར་སྤོངས། །ཚུལ་\nབཞིན་ལ་ནི་རྟག་ཏུ་སྒོམས། །མང་དུ་ཐོས་པ་རབ་ཏུ་བྱ། །དེས་ནི་ཤེས་རབ་རྣམ་པར་<span class='delete'>འཕེལ། །</span><span class='add'>འཕེལ། །</span>བྱང་ཆུབ་སེམས་དཔའ་སྐྱོབ་པ་ཡི། །རྩ་བའི་དོན་ནི་ཆོས་བཞི་སྟེ། །སྦྱིན་དང་ཚུལ་ཁྲིམས་ཐོས་དང་<span class='delete'>གཏོད། །</span><span class='add'>གཏོང་། །</span>\nབྱང་ཆུབ་ཀྱི་ནི་ལམ་ལ་བཟང་། །བླ་ན་མེད་པའི་ཐེག་པ་མཆོག །བྱང་ཆུབ་ཀྱི་ནི་ལམ་ཡང་བསྟན། །ཐེ་ཚོམ་གཅོད་པ་བཟང་པོ་<span class='delete'>ཡིས། </span><span class='add'>ཡིས། །</span>ཉན་ཐོས་ཀྱིས་ནི་ལམ་བསྟན་ཏོ། །སེམས་ཅན་གང་\nདག་འདི་འདོད་པ། །དེ་ལ་ངས་ནི་སྐབས་<span class='delete'>དབྱེ་</span><span class='add'>དབྱེ</span>འོ། །ཆོས་རྣམས་ཀྱི་ནི་མཆོག་སྟོན་པ། །འཇིག་རྟེན་སྣང་མཛད་རྙེད་པར་དཀའ། །དེ་ནས་གནོད་སྦྱིན་<span class='delete'>ཅིང་</span><span class='add'>ཅི་</span>འཇིགས་ཀྱི་བུ་རི་བོ་འདི་སྙམ་དུ་སེམས་པར་གྱུར་<span class='delete'>ཏེ། །</span><span class='add'>ཏེ། </span>བཅོམ་\nལྡན་འདས་འདི་ནས་རིའི་རྒྱལ་པོ་བྱ་རྒོད་ཀྱི་ཕུང་པོའི་རི་ལ་གཤེགས་ཤེས་གྲག་གིས། བདག་གིས་བཅོམ་ལྡན་འདས་ལ་དགེ་བའི་རྩ་བ་རྒྱ་ཆེན་པོ་ཞིག་བསྐྱེད་དོ་སྙམ་<span class='delete'>མོ། །</span><span class='add'>མོ། །</span>དེ་ནས་གནོད་སྦྱིན་ཅི་འཇིགས་\nཀྱི་བུ་རི་བོས་རང་གི་འཁོར་ལ་སྨྲས་<span class='delete'>པ། །</span><span class='add'>པ། </span>གྲོགས་པོ་དག་ཤེས་པར་གྱིས་ཤིག །བཅོམ་ལྡན་འདས་རྒྱལ་པོའི་ཁབ་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོ་ནས་རིའི་རྒྱལ་པོ་བྱ་རྒོད་ཀྱི་ཕུང་པོའི་རི་ལ་གཤེགས་ཀྱིས། དེ་ལ་\nགྲོགས་པོ་དག་མཐུ་ཅི་ཡོད་པ་དང་། ཅི་ནུས་ཀྱིས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པའི་ལས་ལ་སྤྲོ་བ་སྐྱེད་ཅིག །དེ་ནས་གནོད་སྦྱིན་ཅི་འཇིགས་ཀྱི་བུ་རི་བོ་གཡོགས་དང་བཅས་པས་རྒྱལ་པོའི་ཁབ་ཀྱི་\nགྲོང་ཁྱེར་<span class='delete'>ཆོན་</span><span class='add'>ཆེན་</span>པོ་ནས་གཟུང་སྟེ། རིའི་རྒྱལ་པོ་བྱ་རྒོད་ཀྱི་ཕུང་པོའི་བར་གྱི་ལམ་དེ་ཐམས་ཅད་གསེག་མ་དང་། གྱོ་མོ་དང་། སྡོང་དུམ་དང་། ཚེར་མ་རྣམས་མེད་པར་བྱས་སོ། །མེ་<span class='delete'>ལོག་</span><span class='add'>ལོང་</span>གི་དཀྱིལ་འཁོར་ལྟར་དག་"
 ],
 [
  "79.322b",
  "དང་རྟེན་དང་སྐྱབས་དག་དང་། །དེ་བཞིན་དཔུང་གཉེན་འགྱུར་བར་<span class='delete'>ཤོག །</span><span class='add'>ཤོག །</span>ཇི་ལྟར་<span class='delete'>འདྲེན་</span><span class='add'>འདྲེན་</span>པ་གྲོལ་མཛད་བཞིན། །འགྲོ་བ་<span class='delete'>ལྔར་</span><span class='add'>ལྔར་</span>ནི་སྐྱེས་པ་ཡི། །སྲོག་ཆགས་རྣམས་ཀྱི་མགོན་དུ་<span class='delete'>ཤོག །</span><span class='add'>ཤོག །</span>བདག་གིས་སྡུག་\nབསྔལ་ཀུན་ལས་དགྲོལ། །འཇིག་རྟེན་ན་ནི་མཚུངས་པ་ཡོད་མེད་པ། །ལྷ་དབང་ལྷ་མ་ཡིན་དང་ཀླུས་མཆོད་པ། །གཟི་བརྗིད་དག་<span class='delete'>ནི་</span><span class='add'>ནི་</span>མཐའ་ཡས་འོད་མཛད་པ། །རྐང་གཉིས་མཆོག་ལ་བདག་གིས་མཆོད་\nཔ་བགྱིས། །བདག་ནི་ལས་མཆོག་དམ་པ་འདི་དག་གིས། །མི་དབང་ས་སྟེང་མཆོག་ཏུ་གྱུར་པ་བཞིན། །བསོད་ནམས་རབ་མཆོག་སུམ་བཅུ་གཉིས་མཚན་ལྡན། །ཆོས་ཀྱི་བདག་པོ་དེ་དང་འདྲ་བར་ཤོག །\nདེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་གནོད་སྦྱིན་ཅི་འཇིགས་ཀྱི་བུ་རི་བོ་ལ་ཚིགས་སུ་བཅད་པ་དག་གིས་གསུངས་<span class='delete'>པ། །</span><span class='add'>པ། </span>ཆོས་ཀྱི་དམ་པ་རྣམས་ཀྱི་ཕྱིར། །སྟོན་པའི་རིམ་གྲོ་གང་བྱེད་པ། སེམས་ཅན་རྣམས་\nཀྱི་མཆོག་ཡིན་ཏེ། །དེ་དག་བྱང་ཆུབ་རྙེད་མི་དཀའ། །འཇིག་རྟེན་མགོན་པོ་འོད་མཛད་པ། །འཇིག་རྟེན་སྣང་མཛད་མཆོག་ལ་ནི། །ལྷ་དང་ཀླུ་དང་མི་རྣམས་ཀྱིས། །མཆོད་པར་བྱ་བར་འོས་པར་<span class='delete'>འགྱུར། །</span><span class='add'>འགྱུར། །</span>བྱང་\nཆུབ་མཆོག་ཏུ་སངས་རྒྱས་ནས། །ཤིང་མཆོག་དྲུང་དུ་རབ་འདུག་སྟེ། །སྡིག་ཅན་<span class='delete'>འདུད་</span><span class='add'>བདུད་</span>ལས་རྒྱལ་ནས་སུ། །སྲོག་ཆགས་རྣམས་ལ་ཆོས་སྟོན་ཏོ། །དེ་ནས་བཅོམ་ལྡན་འདས་ལྷ་སྟོང་ཕྲག་དུ་མ་དང་། གནོད་\nསྦྱིན་དང་། སྲིན་པོ་སྟོང་ཕྲག་དུ་མ་དང་། དྲི་ཟ་དང་། <span class='delete'>མིའམ་</span><span class='add'>མི་འམ་</span>ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་སྟོང་ཕྲག་དུ་མ་<span class='delete'>དང་། །</span><span class='add'>དང་། </span>མི་དང་མི་མ་ཡིན་པ་སྟོང་ཕྲག་དུ་མ་དང་། སྲོག་ཆགས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དུ་མས་བསྐོར་ཅིང་མདུན་\nདུ་བདར་ནས་སངས་རྒྱས་ཀྱི་མཐུ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་རྫུ་འཕྲུལ་ཆེན་པོ་<span class='delete'>དང་། །</span><span class='add'>དང་། </span>སངས་རྒྱས་ཀྱི་<span class='delete'>ཆོས་</span><span class='add'>ཆོ་</span>འཕྲུལ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་རྣམ་པར་འཕྲུལ་བ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་གཟི་བརྗིད་ཆེན་"
 ],
 [
  "79.323a",
  "པོས། འོད་ཟེར་ནི་རབ་ཏུ་འགྱེ། ཞིང་ནི་རབ་ཏུ་གཡོ་བར་བྱས། མེ་ཏོག་གི་ཆར་ནི་རབ་ཏུ་འབེབས། སིལ་སྙན་བྱེ་བ་ཁྲག་ཁྲིག་ནི་རབ་ཏུ་འཁྲོལ་བར་བྱས་ཏེ། གནོད་སྦྱིན་ཅི་\nའཇིགས་ཀྱི་བུ་རི་བོས་ལམ་དུ་བཀོད་པ་ཇི་ལྟར་མངོན་པར་བྱས་པ་བཞིན་དུ་ཤིང་<span class='delete'>རཏའི་</span><span class='add'>རྟའི་</span>འཕང་ལོ་ཙམ་གྱི་པད་མ་ལ་ཞབས་བཞག་སྟེ། རིའི་རྒྱལ་པོ་བྱ་རྒོད་ཀྱི་ཕུང་པོ་ག་ལ་བ་དེར་གཤེགས་ཏེ་བྱོན་ནས། ཚེ་\nདང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་ཀུན་དགའ་བོ་ཁྱོད་ཀྱིས་དེ་བཞིན་གཤེགས་པའི་གདན་མཆོག་ཆོས་ཀྱི་གདན། གདན་དམ་པ། གདན་བཟང་པོ། འཇིག་རྟེན་གསུམ་པོ་ཀུན་ལས་ཁྱད་པར་དུ་འཕགས་\nཔའི་གདན། སངས་རྒྱས་ཀྱི་གདན་ཤོམས་ཤིག །དེ་བཞིན་གཤེགས་པ་གདན་དེ་ལ་བཞུགས་ཏེ། སྐྱེ་བོ་མང་པོ་ལ་ཕན་པ་དང་། སྐྱེ་བོ་མང་པོ་ལ་བདེ་བ་དང་། འཇིག་རྟེན་རྣམས་ལ་སྙིང་བརྩེ་བ་དང་། \nལྷ་དང་མི་རྣམས་ཀྱི་དོན་དང་། ཕན་པའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཅེས་བྱ་བའི་མདོ་སྡེ་སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པར་རབ་ཏུ་བསྔགས་པ། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའི་རྒྱུ་འཐུན་པ་འཆད་པར་\nའགྱུར་ཏེ། དེ་ཡང་སེམས་ཅན་ཐམས་ཅད་ཐེ་ཚོམ་དུ་གྱུར་པ་ལ་རབ་ཏུ་སྟོན་<span class='delete'>པ། །</span><span class='add'>པ། </span>སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཐེ་ཚོམ་གཅོད་པ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཐེ་ཚོམ་སྐྱེ་བ་གཅོད་པ། དེ་བཞིན་གཤེགས་\nཔའི་མདོ་སྡེ་འདི་འཆད་པར་འགྱུར་རོ། །ཞེས་བཀའ་སྩལ་པ་དང་། ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་བཅོམ་ལྡན་འདས་ཀྱི་གདན་བཤམས་ཏེ། དེ་ན་ལྷ་བྱེ་བ་དྲུག་བཅུ་རྩ་<span class='delete'>བརྒྱར་</span><span class='add'>བརྒྱད་</span>ཀྱིས་རས་བཅོས་མ་རེ་རེ་དེ་བཞིན་གཤེགས་པ་\nལ་ཕུལ་ཏེ། དེ་དག་ཀྱང་དེར་གདན་དུ་བཏིང་བར་གྱུར་ནས་བཅོམ་ལྡན་འདས་གདན་བཤམས་པ་དེ་ལ་བཞུགས་སོ། །བཞུགས་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ལྷའི་བུ་དེ་རྣམས་ལ་ཚིགས་སུ་བཅད་པ་དག་གིས་གསུངས་<span class='delete'>པ། །</span><span class='add'>པ། </span>"
 ],
 [
  "79.323b",
  "འཇིག་རྟེན་མགོན་གྱི་གདན་དུ་ནི། །ལྷ་ཡི་གོས་རབ་དམ་པ་མཆོག །ལྷ་ཡིས་རབ་ཏུ་བཏིང་བ་ལ། །དེ་ལ་རྣམ་པར་འདྲེན་པ་བཞུགས། །ཐམས་ཅད་ཆོས་ཀྱི་ཕ་རོལ་ཕྱིན། །སངས་རྒྱས་བཞུགས་པར་\nགྱུར་མ་<span class='delete'>ཐག །</span><span class='add'>ཐག །</span>འཇིག་རྟེན་རྣམ་པ་དྲུག་གཡོས་ཤིང་། །སྐྱེ་བོ་རབ་ཏུ་དགའ་བར་<span class='delete'>གྱུར། </span><span class='add'>གྱུར། །</span>སངས་རྒྱས་ཞིང་ནི་རི་དང་བཅས། །དེ་ན་རབ་ཏུ་སྣང་བར་གྱུར། །དེ་ན་ཆོས་འདོད་རྣམས་ལ་ནི། །སྐྱོབ་པ་སངས་རྒྱས་རྫུ་\nའཕྲུལ་སྟོན། །ལྷ་དང་ཀླུ་དང་མི་རྣམས་དང་། །གྲུལ་བུམ་ཡི་དགས་སྲུལ་པོ་རྣམས། །དེ་དག་གཅིག་གིས་གཅིག་མཐོང་སྟེ། །སྒྲིབ་པ་དག་ནི་མེད་པར་གྱུར། །ལྷ་རྣམས་བྱེ་བ་ཕྲག་སྟོང་དང་། ཁྲག་ཁྲིག་ཕྲག་ནི་\nབརྒྱ་རྣམས་<span class='delete'>དག །</span><span class='add'>དག །</span>རྙེད་དགའ་ཡི་ནི་ཚིག་གསུང་པ། །སངས་རྒྱས་ལ་ནི་དགའ་བས་ལྟ། །རྒྱལ་པོ་གཟུགས་ཅན་སྙིང་པོ་ཡང་། དེ་ཚེ་བློན་པོས་ཡོངས་བསྐོར་ཅིང་། །འཇིག་རྟེན་གྱི་ནི་མགོན་པོ་མཆོག །\nསངས་རྒྱས་དྲུང་དུ་འོངས་པར་གྱུར། །སྟོན་པས་ལྷ་དང་ཀླུ་རྣམས་དང་། །མི་རྣམས་འདུས་པར་མཁྱེན་པ་དང་། སྲོག་ཆགས་ཀུན་ལ་ཕན་པའི་ཕྱིར། །ཕྱོགས་བཞི་དག་ཏུ་རབ་གཟིགས་ནས། །འཇིག་རྟེན་ཐེ་\nཚོམ་གང་ཡོད་པ། །རྐང་གཉིས་མཆོག་ལ་དྲིས་ཤིག་དང་། །ཐེ་ཚོམ་དག་ནི་དྲིས་པ་རྣམས། །རྣམ་པར་འདྲེན་པ་<span class='delete'>དས་</span><span class='add'>ངས་</span>བཅད་དོ། །དེ་ལྟར་དེའི་ཚེ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་སེམས་ཅན་ཇི་\nསྙེད་འདུས་ནས། ཆོས་ཉན་པ་དེ་དག་ཐམས་ཅད་ཀྱིས་དལ་བར་ཤེས་ནས། སེམས་ཅན་ཐམས་ཅད་ཀྱིས་བསམས་ཏེ། ཕྱག་འཚལ་ནས་ཆོས་མཉན་པའི་ཕྱིར་རྣ་བ་བླགས་ཏེ་འདུག་པར་གྱུར་ཏོ། །དེ་ནས་\nབཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་མཽང་གལ་གྱི་བུ་ཆེན་པོ་ལ་བཀའ་སྩལ་<span class='delete'>པ། །</span><span class='add'>པ། </span>མཽང་གལ་གྱི་བུ་ཆེན་པོ་དགེ་སློང་མ་འདུས་པ་རྣམས་ལ་སོམས་ལ་མ་ལྷགས་པ་རྣམས་ཀྱང་ཚོལ་ཏེ། རྒྱང་རིང་པོ་ན་"
 ],
 [
  "79.324a",
  "གནས་པ་རྣམས་ཀྱང་སྡུས་<span class='delete'>ཤིག། །</span><span class='add'>ཤིག །</span>དེའི་ཚེ་ཚེ་དང་ལྡན་པ་འོད་སྲུང་ཆེན་པོ་རིའི་རྒྱལ་པོ་ཁ་བ་ཅན་གྱི་ལྷོ་ཕྱོགས་ཀྱི་<span class='delete'>དོས་</span><span class='add'>ངོས་</span>ལ་གནས་སོ། །དེ་ནས་ཚེ་དང་ལྡན་པ་མཽང་གལ་གྱི་བུ་ཆེན་པོས་\nབསམས་ཏེ། བསམས་ནས་རྫུ་འཕྲུལ་གྱི་སྟོབས་ཀྱི་ཚེ་དང་ལྡན་པ་འོད་སྲུང་ཆེན་པོ་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་<span class='delete'>ནས། </span><span class='add'>ནས། </span>ཚེ་དང་ལྡན་པ་འོད་སྲུང་ཆེན་པོ་ལ་འདི་སྐད་ཅེས་སྨྲས་<span class='delete'>སོ། །</span><span class='add'>སོ། །</span>བཙུན་པ་འོད་སྲུང་ཆེན་\nཔོ་ལོངས་<span class='delete'>ཤིག </span><span class='add'>ཤིག །</span>བཅོམ་ལྡན་འདས་འདི་ལྷར་བཅས་པའི་འཇིག་རྟེན་དང་། བདུད་ཏུ་བཅས་པ་དང་། ཚངས་པར་བཅས་པ་དང་། དགེ་སྦྱོང་དང་བྲམ་ཟེར་བཅས་པའི་སྐྱེ་དགུ་རྣམས་དང་། ལྷ་དང་མི་\nདང་ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཁོར་གྱི་མདུན་དུ་ཆོས་སྟོན་ཏེ། སྟོན་པས་བཀའ་སྩལ་<span class='delete'>གྱིས། </span><span class='add'>གྱིས། </span>བཙུན་པ་འོད་སྲུང་བདག་ཅག་གཉིས་ཀྱི་ཆོས་ཀྱི་བར་ཆད་ཏུ་འགྱུར་དུ་<span class='delete'>འོད་</span><span class='add'>འོང་</span>གིས་འདོད་དོ། །དེ་སྐད་<span class='delete'>ཅད་</span><span class='add'>ཅེས་</span>སྨྲས་\nཔ་དང་། ཚེ་དང་ལྡན་པ་འོད་སྲུང་ཆེན་པོས་ཚེ་དང་ལྡན་པ་མཽང་གལ་གྱི་བུ་ཆེན་པོ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཚེ་དང་ལྡན་པ་མཽང་གལ་གྱི་བུ་ཆེན་པོ་ཁྱོད་སོང་ཤིག་དང་། ཁོ་བོ་ཡང་ཁྱོད་སོང་བའི་རྗེས་བཞིན་\nདུ་འོང་<span class='delete'>ངོ་། </span><span class='add'>ངོ་། །</span>དེ་ནས་ཚེ་དང་ལྡན་པ་འོད་སྲུང་ཆེན་པོས་སྟན་དེ་ལ་འཕྲུལ་<span class='delete'>བ་</span><span class='add'>པ་</span>སྤྲུལ་ཏེ། རྫུ་འཕྲུལ་གྱི་སྟོབས་ཀྱིས་རྒྱལ་པོའི་ཁབ་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོར་བཞུགས་<span class='delete'>སོ། </span><span class='add'>སོ། །</span>དེ་ནས་ཚེ་དང་ལྡན་པ་འོད་སྲུང་ཆེན་པོ་འཁོར་\nབཞིས་བསྐོར་ཅིང་མདུན་དུ་བདར་ནས་རིའི་རྒྱལ་པོ་བྱ་རྒོད་གྱི་ཕུང་པོ་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འཁོར་གྱི་ནང་\nདུ་ཧ་ཅང་ཡང་མི་རིང་བ་ཞིག་ཏུ་ཕྱོགས་གཅིག་ཏུ་གདུག་གོ། །དེ་ནས་ཚེ་དང་ལྡན་པ་མཽང་གལ་གྱི་བུ་ཆེན་པོས་སྤྲུལ་པ་དེ་མཐོང་ནས་རྫུ་འཕྲུལ་གྱི་སྟོབས་ཀྱིས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་ངོ་། །ཚེ་"
 ]
]